{
  "comment_count": 25,
  "comments": [
    {
      "id": "22677",
      "author": "Emer from EverydayVegetarianRecipes",
      "author_url": "http://www.everyday-vegetarian-recipes.com/vegetable-salad-recipes.html",
      "date": "2012-04-11 09:28:29",
      "content": "Congratulations Michael. Your wife is one clever woman!!  Thanks Sarina for this thought-provoking and intelligent article.  I am a fellow mother of two girls (ages 5 and 2).  Having \"done all of the right things\", we are going through a terribly fussy stage with one girl now, making me occasionally wobble and question my approach.  Most of what you wrote, I know at the back of my mind but I needed this very articulate reminder to relax and ride the wave.  Some really excellent advice.  Thank you.",
      "parent": "0",
      "gravatar_hash": "a03b38103ebcd1cd685aa8ff9df8fa89"
    },
    {
      "id": "22683",
      "author": "Trina",
      "author_url": "http://www.yourveganmom.com",
      "date": "2012-04-11 13:09:41",
      "content": "Excellent article!  Like Emer, I needed this right now too!",
      "parent": "0",
      "gravatar_hash": "f2d73f38f1407ee4902f88753c55bfa3"
    },
    {
      "id": "22684",
      "author": "Sarina",
      "author_url": "http://www.growparenting.com",
      "date": "2012-04-11 13:12:51",
      "content": "Thanks Emer. Glad this post resonated with you!\n\nIt's so true that many of us know this info in our hearts, but have those moments when it's challenging to execute. The good news is, its not about being perfect or getting it right every time. Matter of fact, when we do make mistakes, we are just gaining an opportunity to model to our children how to recover from them with kindness to ourselves and accountability to others.\n\nOne of the great things about being a parent educator is I am constantly giving myself reminders to relax and ride the wave as well!\n\nWarm regards,\nSarina",
      "parent": "22677",
      "gravatar_hash": "9425410d21d994a6d29646519a5c9d62"
    },
    {
      "id": "22697",
      "author": "Hanna",
      "author_url": "",
      "date": "2012-04-11 18:06:23",
      "content": "Thank you for this, Sarina. While I'm not a parent, so many of the people in my life are, so I certainly became more mindful of my own actions around the little ones. Thank you for sharing your tips and encouraging what I believe everyone could use more of--positive reinforcement!",
      "parent": "0",
      "gravatar_hash": "96ee9402ee836674eab5d50b60397c09"
    },
    {
      "id": "22700",
      "author": "Sarina",
      "author_url": "http://www.growparenting.com",
      "date": "2012-04-11 19:06:57",
      "content": "Thanks Hanna!",
      "parent": "22697",
      "gravatar_hash": "9425410d21d994a6d29646519a5c9d62"
    },
    {
      "id": "22715",
      "author": "Renee",
      "author_url": "",
      "date": "2012-04-12 06:42:35",
      "content": "Thanks for this post. We are expecting our first in August, and you have given me more confidence that we will be able to tackle this issue. We see these struggles firsthand with our nephews and would like to head some of them off as much as possible in our own home.",
      "parent": "0",
      "gravatar_hash": "9eca23b634740948002e7ffea4706087"
    },
    {
      "id": "22718",
      "author": "Sarina",
      "author_url": "http://www.growparenting.com",
      "date": "2012-04-12 07:51:38",
      "content": "Renee- Congratulations on your baby to be! And good for you for thinking about this stuff from early on. Awareness is the name of the game when it comes to healthy parenting- the more we really think about our own experiences around an issue, the clearer we get. When we are clear, its easy to pass that message on to our kiddos!\n\nTake care,\nSarina",
      "parent": "22715",
      "gravatar_hash": "9425410d21d994a6d29646519a5c9d62"
    },
    {
      "id": "22788",
      "author": "Richa@HobbyandMore",
      "author_url": "http://hobbyandmore.blogspot.com/",
      "date": "2012-04-13 17:37:48",
      "content": "This is a wonderful article with such common sense solutions.. me and my sister were really fussy while growing up for some reason. Now since I cook and make my own choices I eat so much more. My sister is following up slowly since she picked up on more cooking!",
      "parent": "0",
      "gravatar_hash": "3d8b6e85d9a4b4108c468c341819b38a"
    },
    {
      "id": "22930",
      "author": "Sarina",
      "author_url": "http://www.growparenting.com",
      "date": "2012-04-17 05:54:16",
      "content": "Richa- So glad you enjoyed the post. I think it's hard for parents to accept that kids are just like them. Adults don't like to be bossed around and forced to eat things. When adults feel controlled, we often rebel or do what we are told and feel resentful. It doesn't create space for learning, trying new things, finding joy in food, etc. Kids are the same! Yes, many kids are picky eaters. They do often become more adventurous eaters when they gain the ability to choose for themselves. Sounds like finding joy in cooking has given you and your sister a chance to find more joy in food!\n\nHappy cooking,\nSarina",
      "parent": "22788",
      "gravatar_hash": "9425410d21d994a6d29646519a5c9d62"
    },
    {
      "id": "23074",
      "author": "ajira",
      "author_url": "http://www.ajiradarchphotography.com/blog",
      "date": "2012-04-20 10:02:42",
      "content": "Despite our best intentions, it's been tough to break life long habits around food. Stuff we were taught - like finishing everything on your plate... which seems reasonable, especially when you can't think of a different way to do it. I appreciated that you offered suggestions for a different way to do it and am already implementing a few. Not sure how it will change in the long term but definitely giving it a go! Thanks so much!",
      "parent": "0",
      "gravatar_hash": "8917fdb4bd268f1bc4e6409b4ccd2e5d"
    },
    {
      "id": "23098",
      "author": "Emma Shelley",
      "author_url": "http://lifelongvegetarian.com",
      "date": "2012-04-20 22:29:44",
      "content": "A very well-written and thought-provoking piece. Thank you!\n\nFood fussiness, I believe, is symptomatic of the West: mass food grown for profit, with little regard for the impact on the environment and waste, has bred this fussiness into us. \n\nIt's a new phenomenon (I've done the research... it was virtually non-existent before the mid-20th century and the availability of so much choice - do we as a society really need five different types of oreo cookies?!).\n\nWe certainly don't hear too often about poor children rejecting dinner because they don't like it!\n\nI think one of the most important things we can do for our children is to instil in them an understanding of how the Earth provides for us. Growing your own vegetables is a miraculous thing! \n\nThanks again for such an excellent piece.",
      "parent": "0",
      "gravatar_hash": "9e465065fcaee8b45297d364138e0d33"
    },
    {
      "id": "23106",
      "author": "Sarina",
      "author_url": "http://www.growparenting.com",
      "date": "2012-04-21 12:51:24",
      "content": "Glad you got some new tools that resonate with you and that you are trying them out. Be sure to give them some time. Change doesn't happen overnight for children or adults. Also, mistakes happen on all of our parts, so be easy on yourself if old habits sneak back. Its just an opportunity to recommit and try again, much the same as we want our kids to do when they make mistakes. \n\nTake care,\nSarina",
      "parent": "23074",
      "gravatar_hash": "9425410d21d994a6d29646519a5c9d62"
    },
    {
      "id": "23107",
      "author": "Sarina",
      "author_url": "http://www.growparenting.com",
      "date": "2012-04-21 12:53:38",
      "content": "Hi Emma- Sounds like you have done a lot of thinking about this and explored the research. Thanks for your feedback and for sharing your thoughts on this topic! \n\nWarm regards,\nSarina",
      "parent": "23098",
      "gravatar_hash": "9425410d21d994a6d29646519a5c9d62"
    },
    {
      "id": "23545",
      "author": "Katherine Martinelli",
      "author_url": "http://www.katherinemartinelli.com",
      "date": "2012-05-04 01:25:15",
      "content": "I don't yet have kids but a few of my close friends are pregnant and as food lovers we've spent a decent amount of time talking about raising healthy, adventurous eaters (of course all in the abstract). This article is great and I'm definitely going to share it with them!",
      "parent": "0",
      "gravatar_hash": "77cbf18926e13167a62ef95f9dc0f7cf"
    },
    {
      "id": "23555",
      "author": "Sarina",
      "author_url": "http://www.growparenting.com",
      "date": "2012-05-04 08:09:36",
      "content": "Hi Katherine-\nThanks so much for your comments. It's great to hear people thinking about this stuff ahead of time. When we, as parents, are clear on our values and have given thought to how we want to model them for our kids, it becomes much easier to convey the message to our children.\nWarm regards,\nSarina",
      "parent": "23545",
      "gravatar_hash": "9425410d21d994a6d29646519a5c9d62"
    },
    {
      "id": "40871",
      "author": "Sam",
      "author_url": "",
      "date": "2012-07-25 06:19:14",
      "content": "Thought you might be interested in this:\nhttp://www.ellynsatter.com/ellyn-satters-division-of-responsibility-in-feeding-i-80.html",
      "parent": "0",
      "gravatar_hash": "4cb6e643d678bb6e59f062fcbcd87898"
    },
    {
      "id": "40926",
      "author": "Sarina",
      "author_url": "http://www.growparenting.com",
      "date": "2012-07-25 08:58:13",
      "content": "Thanks Sam! Ellyn Satter is certainly a pioneer in new ways of thinking about helping kids create a healthy relationship with food!",
      "parent": "40871",
      "gravatar_hash": "9425410d21d994a6d29646519a5c9d62"
    },
    {
      "id": "44078",
      "author": "ellabee",
      "author_url": "",
      "date": "2012-08-06 08:52:37",
      "content": "Plus a million for the crucial advice on avoiding power struggles.  \n\nMy parents never forced me to eat anything offered, nor fixed anything else for me other than the available dinner. I was invited and encouraged to try just a bit of anything that was new, and I did more often than not (and liked it fine, more often than not).  \n\nMy get-it-myself backups were usually bread and an apple, but I didn't really resort to them often, because the food on our dinner table was just plain good.  It was cooked from scratch by my mother, who enjoyed and was interested in food and cooking. In summer and fall, most of the vegetables were grown by my father.  This gift of their work and time laid a very strong foundation for appreciating and demystifying food, for enjoying a wide range of foods, and for enjoying cooking.",
      "parent": "0",
      "gravatar_hash": "f1f95927894a8c69a57324136e79e2b0"
    },
    {
      "id": "44082",
      "author": "Sarina",
      "author_url": "http://www.growparenting.com",
      "date": "2012-08-06 09:36:50",
      "content": "Thanks so much for sharing your experiences with food growing up. Sounds like your parents put you on a great path for a healthy relationship with food!\n\nWarm regards,\nSarina",
      "parent": "44078",
      "gravatar_hash": "9425410d21d994a6d29646519a5c9d62"
    },
    {
      "id": "114422",
      "author": "Ruth Martin",
      "author_url": "http://organicgardeningtips101.com",
      "date": "2013-02-05 14:04:56",
      "content": "Your article is very well written! I think you are definitely on the right track :) Mothers who learn quickly what works and what doesn't, are wise! Things can be very different from one child to the next. Our son &amp; daughter, ages 4 &amp; 6, are as different as day and night. One eats almost anything, and the other is a very picky eater. We feel we raised them the same, so it must be their personal tastes are completely different... it is a daily challenge learning how to work with it!",
      "parent": "0",
      "gravatar_hash": "52354a7f6415d2a54de451652232e0d4"
    },
    {
      "id": "114552",
      "author": "Sarina",
      "author_url": "http://www.growparenting.com",
      "date": "2013-02-05 17:38:23",
      "content": "Hi Ruth- Thank so much for your feedback! In my experience, siblings can differ very much in their individual likes and dislikes when it comes to food...and many other things! My children have different tastes as well. It helps us find areas of agreement and opportunities for compromise when we invite the children to be involved in meal planning and cooking. Our decision to always have fruit or yogurt as an alternative has eliminated some of the challenges too! Happy eating with your family!\n\nWarm regards,\nSarina Natkin\nwww.growparenting.com",
      "parent": "114422",
      "gravatar_hash": "9425410d21d994a6d29646519a5c9d62"
    },
    {
      "id": "150480",
      "author": "Jessica",
      "author_url": "",
      "date": "2013-05-22 20:06:40",
      "content": "Thank you for a fantastic article.  I would add two quickies.  First up, I've explained to my now 5 1/2 year old son and my 3 year old daughter that their tastebuds will change as they get older.  So even if they don't like something today, they might like it another time.  It works wonders and they themselves enjoy seeing whether they still dislike certain things.  \n\nSecondly at my daughter's school a fellow mother and nutritionist suggested that instead of creating salads for children parents set out all of the ingredients separately and call it a salad bar.  Let kids decide how they want their salad.  It's brilliant!  Our kids love salads now because they are in charge of what they look and taste like  AND it has the benefit of letting us use up leftovers by calling them salad ingredients.  We just put them in individual ramekins and all of a sudden last nights asparagus becomes tonight's salad topper.\n\nHope this helps someone!",
      "parent": "0",
      "gravatar_hash": "b09823291edee6660f70576a9123e144"
    },
    {
      "id": "150491",
      "author": "Sarina",
      "author_url": "http://www.growparenting.com",
      "date": "2013-05-22 20:34:58",
      "content": "Hi Jessica- So glad you enjoyed the article. And, I love the two tips you added! Reframing does wonders for kids, and adults too!\n\nHappy family meals :)\n\nSarina",
      "parent": "150480",
      "gravatar_hash": "9425410d21d994a6d29646519a5c9d62"
    },
    {
      "id": "194891",
      "author": "Joe",
      "author_url": "http://www.eatingforenergycritic.com/",
      "date": "2013-09-08 00:11:24",
      "content": "You can't imagine how much I needed this information! Thank you so much, Sarina!",
      "parent": "0",
      "gravatar_hash": "7daa515bd8eccd94c9b56774e23ab05b"
    },
    {
      "id": "194949",
      "author": "Sarina",
      "author_url": "http://www.growparenting.com",
      "date": "2013-09-08 09:11:48",
      "content": "Thanks Joe! So glad you found it helpful!",
      "parent": "194891",
      "gravatar_hash": "9425410d21d994a6d29646519a5c9d62"
    }
  ]
}