{
  "comment_count": 15,
  "comments": [
    {
      "id": "28738",
      "author": "Jenni",
      "author_url": "http://www.pastrychefonline.com",
      "date": "2012-06-20 10:42:41",
      "content": "I am on a new crusade to let people know that streusel is a lesser-known-but-no-less-amazing Food of the Gods. Love the breadcrumb twist to yours.  My easy ratio is 1:1:1 butter/flour/sugar w/salt/spices/pinch of salt, etc. I could def see making breadcrumbs stand in for all or a portion of the flour. Happy pie party day, Michael:)",
      "parent": "0",
      "gravatar_hash": "b083e59b95eb8fe5d0bc611a0fcce438"
    },
    {
      "id": "28740",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-06-20 10:48:31",
      "content": "I sure agree with you! Clearly calling what I did above a streusel is a bit of a stretch, since it is a much higher ratio of breadcrumbs to sugar and butter than is typical, but I want to keep this one not so sweet. But sign me up for streusel of any kind :)",
      "parent": "28738",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "28748",
      "author": "Jenni",
      "author_url": "http://www.pastrychefonline.com",
      "date": "2012-06-20 11:07:08",
      "content": "Ratios are made to be stretched. As long as they don't *snap* it's all good. A streusel by any other name might not be as sweet, but it's still Food of the Gods. ;)",
      "parent": "28740",
      "gravatar_hash": "b083e59b95eb8fe5d0bc611a0fcce438"
    },
    {
      "id": "28767",
      "author": "Sabrina Modelle",
      "author_url": "http://www.thetomatotart.com",
      "date": "2012-06-20 11:52:30",
      "content": "Oh I love streusel toppings on pie, and this just looks perfect. And slab pies are one of my favoritest to bake. Consider this one pinned.",
      "parent": "0",
      "gravatar_hash": "8a2758db399a5498c2ef8cdc2e62c7f0"
    },
    {
      "id": "28770",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-06-20 11:55:26",
      "content": "Slab pie! I never knew there was a term. Winner.",
      "parent": "28767",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "28921",
      "author": "myfudo",
      "author_url": "http://www.myfudo.com",
      "date": "2012-06-21 00:13:17",
      "content": "I love how you maintained the pie flavor without all the fuss of a pie crust...You are heaven sent! Will definitely try!",
      "parent": "0",
      "gravatar_hash": "4c6195789a00889b602d8512720a84f1"
    },
    {
      "id": "29039",
      "author": "Marina@ Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-06-21 07:56:07",
      "content": "Lovely pie! Can your wife eat it (it has nutmeg, isn't she allergic to all nuts?) I hope you made her a safe version... :)",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "29042",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-06-21 08:15:27",
      "content": "Good memory! Nope, nutmeg isn't a problem, nor are any of the seeds like poppy or sesame, or coconut. It is peanuts and all of the regular tree nuts like walnuts, almonds, etc. It is an odd thing that there is a high overlap in allergies between peanuts and tree nuts because they are very far apart botanically, but true.",
      "parent": "29039",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "29056",
      "author": "Betty Ann @Mango_Queen",
      "author_url": "http://www.queensnotebook.com",
      "date": "2012-06-21 09:26:17",
      "content": "What a delicious and delightful pie! This is such a creative pie. Good to know about the nutmeg info. I often have to be mindful of nut allergies when I bake for friends. Thanks for sharing this recipe, Michael! Happy Pie Day!",
      "parent": "0",
      "gravatar_hash": "2f47cf20944759bec2f5c79ae8ee733f"
    },
    {
      "id": "29071",
      "author": "Marina@ Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-06-21 09:58:38",
      "content": "I use to have something similar for about 10 years, so I really feel for your wife, been in her \"shoes\". Allergy reaction is dreadful and takes a week (s) to recover.  I don't have that allergy anymore, and can eat almost all food (food, that I want to eat). Our body is a very strange \"mechanism\": it turns \"on\" and \"off\"  symptoms as it wishes...",
      "parent": "29042",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "29073",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-06-21 09:59:25",
      "content": "Of course check with your friends for their specific allergies... each person may be different in this regard. As an aside, did you know that large quantities of nutmeg are sometimes used a prison hallucinogen? Apparently it makes you horribly ill, but sometimes people are desperate enough to do that. I remember reading about it in Eldrige Cleaver's Soul on Ice a million years ago.",
      "parent": "29056",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "29756",
      "author": "Caralyn @ glutenfreehappytummy",
      "author_url": "http://www.glutenfreehappytummy.com",
      "date": "2012-06-23 11:28:49",
      "content": "sounds so delicious! you had me at streusel:)",
      "parent": "0",
      "gravatar_hash": "e00a33a4cdb99569e77751f01abf86c7"
    },
    {
      "id": "86134",
      "author": "Bruce Bowman",
      "author_url": "",
      "date": "2012-11-25 11:00:57",
      "content": "Hi Michael,\n\nLike you, I grew up in Louisville, KY, and have some of my fondest childhood memories of eating warm kucha/kuchen from the local German bakeries there. I'm wondering if you have those same childhood memories, and if you've ever found a recipe or tried to recreate them?\n\n\nBruce",
      "parent": "0",
      "gravatar_hash": "7619b79bc6677dd0076637ca6c0ee595"
    },
    {
      "id": "86884",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-11-26 07:45:35",
      "content": "Hey Bruce - nope, I don't have those memories... sounds like I missed out on something good! What part of town were they in? (Germantown?)",
      "parent": "86134",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "87031",
      "author": "Bruce Bowman",
      "author_url": "",
      "date": "2012-11-26 11:33:08",
      "content": "When I was a kid in the 70s, I remember my parents getting up really early to get to the bakery before the kuchen was sold out, but now there are bakeries all over Louisville that sell it.\n\nOur local bakery back then, Wholleb's, is apparently out of business, but the other bakery that I remember, Heitzman's, seems to be thriving and still selling lots of kuchen.\n\nHere are some links, for those interested:\nHistory of Butter Kuchen (according to Heitzman's): http://www.heitzmanbakery.net/kuchen.html\nRecipes: \nhttp://www.hungrybrowser.com/phaedrus/m0605M06.htm\nhttp://www.food.com/recipe/butter-kuchen-268290\n\nI got a Butter Kuchen recipe from a German friend recently, which made me dig into this topic, and I made it on Sunday. It was delicious, but not quite ready to share yet. It was not runny as the ones at Heitzman's, which seems to be an evolution since I lived there. And the topping was just butter, sugar and cream - no oil or eggs as in the newspaper recipe. I'm sure there are many many variations. If I perfect it, I'll let you know. :)",
      "parent": "0",
      "gravatar_hash": "7619b79bc6677dd0076637ca6c0ee595"
    }
  ]
}