{
  "comment_count": 12,
  "comments": [
    {
      "id": "1194",
      "author": "Dawn (KitchenTravels)",
      "author_url": "http://profile.typepad.com/kitchentravels",
      "date": "2010-04-20 17:03:13",
      "content": "I'm floored. This is simply brilliant. I love asparagus, but honestly, I never thought I would be so excited about an asparagus recipe. Hoping you are going to fill us in on some more details about your stint at Canlis. :)",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "1195",
      "author": "Ellen",
      "author_url": "http://www.chroniclesofacuriouscook.com",
      "date": "2010-04-20 22:05:32",
      "content": "This sounds good and I have all the ingredients at hand!  Just made a delicious marinade of white miso, lemon juice and honey on chicken thighs (from Breakaway Cook) and this seems like it would be good. Love finding new ways to use new ingredients and have some fantastic asparagus from the farmer's market. Btw, learned that you can store asparagus in a glass of water, like you would flowers, standing in your frig to keep them fresher.",
      "parent": "0",
      "gravatar_hash": "c33e97b228c40102c1d6767fe42d7bff"
    },
    {
      "id": "1196",
      "author": "web design",
      "author_url": "http://www.besteast.com/",
      "date": "2010-04-20 22:55:58",
      "content": "I think this food dish is very fit for spring. When i have time ,i will try to do it.",
      "parent": "0",
      "gravatar_hash": "4fe71324049c451348903a2630d0885e"
    },
    {
      "id": "1197",
      "author": "Zia Elle",
      "author_url": "http://incucinaconziaelle.blogspot.com",
      "date": "2010-04-20 23:48:44",
      "content": "Love asparagus and love your recipe!!",
      "parent": "0",
      "gravatar_hash": "c8fdbcbae79b0b83a71444b3379502f7"
    },
    {
      "id": "1198",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-04-21 08:33:37",
      "content": "Thanks Ellen! Good tip on how to store asparagus, I imagine that would work well.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1199",
      "author": "Alessandra",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2010-04-21 11:57:13",
      "content": "Great! I think asparagus are well suited for Japanese style food.",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "1200",
      "author": "Lara Alexander",
      "author_url": "http://www.food-soil-thread.com",
      "date": "2010-04-24 22:15:36",
      "content": "This looks great. I have a bunch of fat asparagus from PCC in my fridge right now that I am going to use to make (the simple version of) this recipe!\nI have been making various asparagus-orzo dishes lately. I added one of them to my blog last week.\n<a href=\"http://www.food-soil-thread.com/2010/04/orzo-primavera.html\" rel=\"nofollow\">http://www.food-soil-thread.com/2010/04/orzo-primavera.html</a>",
      "parent": "0",
      "gravatar_hash": "0ff9a64e343f14bc0a70cd80cfabbd25"
    },
    {
      "id": "1201",
      "author": "RH",
      "author_url": "",
      "date": "2010-05-05 08:24:35",
      "content": "I've already made this twice this week and this morning I bought a fresh bunch of asparagus so I can make it again tonight.  I skipped the fussy parts and roasted the asparagus instead of steaming it (I'm a sucker for roasted veggies) and holy cripes.  AMAZING.  The nori butter is what totally sends this recipe over the top.  Nirvana in my mouth.  For serious.",
      "parent": "0",
      "gravatar_hash": "08d4c003bf9833f2c1c582c1f9668a47"
    },
    {
      "id": "1202",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-05-05 08:40:30",
      "content": "Hey Rachel - I&#39;m so glad you like it! And I&#39;m glad you are making it your own. To me, that is the beauty of a recipe, to have it be a starting point for what *you* want to eat, not a rulebook.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1203",
      "author": "John - Mormon Foodie",
      "author_url": "http://mormonfoodie.blogspot.com",
      "date": "2010-05-05 21:19:03",
      "content": "Nori butter! What an amazing idea. I've done asparagus a couple of times already this year, but nothing like this. The taste buds in my brain are telling me that the miso sauce is going to just lock everything together.\n\nNow you've got me thinking back to my macrobiotic diet days. Hmmm ... arame-sesame compound butter? Or maybe wakame-white miso, instead.\n\nYou're an inspiration, Michael.",
      "parent": "0",
      "gravatar_hash": "a31679e1b2b49a1f2a8aeb0fbae3493a"
    },
    {
      "id": "1204",
      "author": "John",
      "author_url": "",
      "date": "2010-05-13 05:39:16",
      "content": "1. I made this recipe for the family last night. Universal praise. But it IS pretty fussy, and I'd probably skip some of the steps next time.\n\n2. You missed a critical opportunity: when you strain the nori butter, the remaining nori is NOT 'throw away' material...it's absolutely wonderful. Sort of like a vegetarian version of goose cracklings. My kids liked the asparagus, but they LOVED the nori-cracklings!\n\n3. For the fussy bits -- the lemon-peel squares and the dots of miso/mirin/lemon-juice -- alternative tools can be your friend: sharp scissors for the little squares, and a large hypodermic syringe for making the little dots. I'd also suggest that slightly larger squares (like 1/8\") might work better when you're serving on a white plate; the 1/16\" ones were almost too small to notice.\n\n4. This recipe makes imbalanced amounts: about 3/4 of the miso/mirin mix was left over after plating 5 dishes; about 1/2 of the lemon-peel squares, and about 1/3 of the nori-butter, even though I only used about 4T of butter. That's all fine...but if someone wanted to do 8 plates instead of 4, all they'd need to do is double the amount of asparagus and not much else. Alternatively, you can use the miso/mirin thing on your next salad, the nori butter for your scrambled eggs in the morning, etc.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "1205",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-05-14 14:20:38",
      "content": "@John - thanks for all the detailed feedback on this dish, especially the tip about the nori &quot;cracklins&quot;, I can&#39;t wait to try that. You are quite right that the recipe makes more nori butter and miso sauce than you will need for 24 spears of asparagus, it is more the sort of minimum practical amounts to make of those two items. I like your ideas of what to do with the extras :). Nori butter has that umami thing going almost like truffle butter.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}