{
  "comment_count": 20,
  "comments": [
    {
      "id": "42564",
      "author": "Stephanie, The Recipe Renovator",
      "author_url": "http://gravatar.com/reciperenovator",
      "date": "2012-07-30 06:15:59",
      "content": "Michael, thank you so much for supporting the sale. We appreciate it!",
      "parent": "0",
      "gravatar_hash": "ae4ce01b589df3c3c03cde012ebee3d0"
    },
    {
      "id": "42571",
      "author": "Betty Ann @Mango_Queen",
      "author_url": "http://www.asianinamericamag.com",
      "date": "2012-07-30 06:38:08",
      "content": "Michael, this is a favorite dessert of my family and I make it often. In fact, I go a step further and make \"Leche Flan\" with a caramelized topping. Have you ever tried making egg custard with coconut cream? It is divine ! I urge you to play around with c.c. in your custard ~ it will give your dessert an added dimension. Thanks for this recipe!",
      "parent": "0",
      "gravatar_hash": "2f47cf20944759bec2f5c79ae8ee733f"
    },
    {
      "id": "42603",
      "author": "Emma",
      "author_url": "",
      "date": "2012-07-30 08:32:37",
      "content": "LOVE the custard cups with lids!  I've been making my own kinugoshi (soft-silken) tofu from Andrea Nguyen's excellent \"Asian Tofu,\" but storage has been a pain in the butt because of the necessity of plastic wrap.  Thanks!  And in a custard recipe, no less.\n\nChecking out the online bake sale forthwith.",
      "parent": "0",
      "gravatar_hash": "d12483db2446c6e36e8d1c32e62be8cf"
    },
    {
      "id": "42607",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-30 08:38:30",
      "content": "Hey Betty Ann - I'm all for the caramelized toppings; I've eaten coconut custards but as far as I can remember, I haven't made one. Process is basically the same, right?",
      "parent": "42571",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "42608",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-30 08:39:58",
      "content": "Thanks, Emma! And yes, Andrea's tofu book is fantastic.",
      "parent": "42603",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "42637",
      "author": "Betty Ann @Mango_Queen",
      "author_url": "http://www.asianinamericamag.com",
      "date": "2012-07-30 10:25:12",
      "content": "Hi Michael, yes process will be the same. Only thing to change in your recipe will probably be instead of 4 cups whole milk, try using 3 cups whole milk + 1 cup coconut milk (canned). The bake the same way you would on your recipe. Hope that helps!",
      "parent": "0",
      "gravatar_hash": "2f47cf20944759bec2f5c79ae8ee733f"
    },
    {
      "id": "42680",
      "author": "Vance",
      "author_url": "http://www.davidsbbq.com",
      "date": "2012-07-30 12:11:21",
      "content": "Custard cups would be a perfect desert right now here in Florida.",
      "parent": "0",
      "gravatar_hash": "8ada963354439efdd13d1ce498f51fa4"
    },
    {
      "id": "42693",
      "author": "Emma",
      "author_url": "",
      "date": "2012-07-30 12:47:13",
      "content": "Michael, the combo of your book and Andrea's is dynamite!  I got them for my birthday in June and I think the only other cookbook I've used since is the one from my CSA when I got a giant share of summer squash and didn't know what to do with it.",
      "parent": "0",
      "gravatar_hash": "d12483db2446c6e36e8d1c32e62be8cf"
    },
    {
      "id": "43874",
      "author": "Chandra",
      "author_url": "",
      "date": "2012-08-05 05:33:03",
      "content": "If one wanted to make a pie rather than individual servings, would it be necessary to do anything differently?",
      "parent": "0",
      "gravatar_hash": "8374250d869c05152b3d92c99091c617"
    },
    {
      "id": "43991",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-05 20:12:54",
      "content": "Do you mean a custard pie in a crust, or just baking all of the custard in one large dish? (Like this: https://herbivoracious.com/2009/09/burnt-sugar-flan-recipe.html). If the former, I've never done it. If the latter, the main adjustment is baking time. You want to go until there it is beginning to looks set, but there is still a little jiggle.",
      "parent": "43874",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "76668",
      "author": "Dini",
      "author_url": "",
      "date": "2012-11-08 13:50:10",
      "content": "Question for Betty Ann:\n\nIn your version you say 4 cups milk and one cup canned coconut milk. Michael's recipe calls for 6 1/2 cups milk so would that actually be 5 1/2 cups milk and the one cup of coconut milk? I've never attempted a flan before so just want to make sure before I give it a try. I love coconut milk so want to try that version. Thanks.",
      "parent": "0",
      "gravatar_hash": "e7f9d5e142d785197f8691d88cfd4770"
    },
    {
      "id": "76796",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-11-08 21:00:32",
      "content": "Hey Dini -\n\nBetty Ann's recipe was meant to be an alternative to the one at the top of this post, which calls for 4 cups of milk - which she says to do with 3 cups milk and 1 cup coconut milk, so no change in volume there. (I think you may have jumped over to the flan recipe which uses 6 1/2 cups milk.)",
      "parent": "76668",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "139701",
      "author": "Vidya",
      "author_url": "http://notjustvegetarian.com/",
      "date": "2013-04-19 14:23:24",
      "content": "Hi Michael, \n\nI love reading your blog and your recipes.  Thanks for writing such a detailed article on making custard.  Do you also have a recipe for making custard without eggs?  Also, do you have any recommendations for strainers (especially the fine one?)\n\nThanks.",
      "parent": "0",
      "gravatar_hash": "c33d9c7ea5f524d3f31d7c37e3828c8f"
    },
    {
      "id": "140000",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-04-20 06:51:41",
      "content": "Hi Vidya - here are two custard-like desserts that don't use any eggs:\n\nhttps://herbivoracious.com/2012/10/caramelized-banana-and-buttermilk-panna-cotta-vegetarian-panna-cotta-recipe.html\nhttps://herbivoracious.com/2013/02/saffron-date-posset-a-dessert-you-should-know-recipe.html\n\nIf you want to spend the big bucks on a really great fine-mesh strainer, this one works very well: http://www.amazon.com/dp/B00069ZUXW/?tag=poeticlicen07-20\nOtherwise there are many fine mesh strainers on the market, but I don't have a specific brand recommendation for you. The tricky part is to find one that truly has a fine screen.",
      "parent": "139701",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "140060",
      "author": "Vidya",
      "author_url": "http://notjustvegetarian.com/",
      "date": "2013-04-20 11:33:07",
      "content": "Thanks, Michael, for the other recipes and the recommendations on the fine mesh strainer.",
      "parent": "140000",
      "gravatar_hash": "c33d9c7ea5f524d3f31d7c37e3828c8f"
    },
    {
      "id": "242210",
      "author": "Sam",
      "author_url": "",
      "date": "2013-11-21 14:57:35",
      "content": "For an easy custard pie you would pre bake the crust. Then instead of cooking the custard in the oven you cook it on the stove top constanly stiring untill thick. Coll in frig with plastic wrap over the top then spoon into baked crust. You can pour it in a raw crust and bake it but you will want to keep an eye on the crust because like pumpkin it can get over done.",
      "parent": "43991",
      "gravatar_hash": "af92becb42bb89f9ed249f15871d05c8"
    },
    {
      "id": "630228",
      "author": "Julia",
      "author_url": "",
      "date": "2014-01-23 11:58:51",
      "content": "Hi Michael, I am making this recipe as I type, I only had 4 small ramekins and  2 slightly larger ones, the timer has just gone off at 20 minutes and they were definitely not set :( so I went another 5, still not done! This is my second ever Attempt at making custard. I'm not sure what I'm doing wrong but I'm afraid ill never get it right, haha. I'm letting it go another ten minutes, then cooling on a rack as you say. Hope it works!!",
      "parent": "0",
      "gravatar_hash": "1b46de1c77b54f188dd82136c3e70886"
    },
    {
      "id": "630446",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-01-23 12:42:05",
      "content": "The egg ratio in these is pretty much bulletproof, so my best guesses are that your oven temperature is off, or you aren't trusting them to finish setting as they cool.",
      "parent": "630228",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "783558",
      "author": "Mirandamom",
      "author_url": "",
      "date": "2014-03-03 20:44:58",
      "content": "Thank you!  For the first time ever my custard set properly!  I halved the recipe and it baked perfectly in a toaster oven.  It tastes just the way my mother's did.",
      "parent": "0",
      "gravatar_hash": "e95eaaebea3a51b17b7985bc3b69782a"
    },
    {
      "id": "1314143",
      "author": "Tess Geer",
      "author_url": "http://www.eatwith.com",
      "date": "2016-04-20 13:12:45",
      "content": "I love this recipe. Very classic. When I entertain EatWith guests, I like a richer custard so I use equal parts cream and milk. It's perfect.  In season, I top it with warm, oven roasted blueberries You can add chocolate by taking semi sweet chocolate, straining the custard over it and whisking it through. YUM! I have never had to strain it more than once through a simple sifter. Also, if you make it more than once or twice a year, it's worth it to get the ramekin sets with the rack that lifts them out of the water. Not expensive and makes everything SO much easier. Thanks for a great recipe!",
      "parent": "0",
      "gravatar_hash": "0746ed784ac947fdc32c64504cc60ba5"
    }
  ]
}