{
  "comment_count": 16,
  "comments": [
    {
      "id": "4186",
      "author": "John",
      "author_url": "",
      "date": "2011-11-21 14:38:05",
      "content": "This sounds great. I'll give it a try as soon as I can. I might try mixing in some of my <a href=\"http://gardener.wikia.com/wiki/Purple_haze\" rel=\"nofollow\"> Purple Haze</a> carrots -- could be a good flavor and color fit. You forgot to mention, in the recipe itself, the nice garnish of cilantro in the picture. \n\nBTW, I like the new look of the website!",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "4220",
      "author": "Alissa",
      "author_url": "http://notjustapples.blogspot.com",
      "date": "2011-11-22 07:57:17",
      "content": "This does look rather delicious! I love beets :)",
      "parent": "0",
      "gravatar_hash": "2d1ecfb86266ff2a56952035138a9c02"
    },
    {
      "id": "4263",
      "author": "Nilam",
      "author_url": "http://khavanu.blogspot.com",
      "date": "2011-11-22 17:09:49",
      "content": "Hey Michael love the new look of your site! I keep you on my reader so I just saw this change! Looking forward to your cookbook!",
      "parent": "0",
      "gravatar_hash": "39a80437f59150fc64ae46179001398a"
    },
    {
      "id": "4290",
      "author": "Chris Remple",
      "author_url": "",
      "date": "2011-11-22 21:42:31",
      "content": "This is not a comment on the recipe (I love them all). But I think you have been hacked. I just received a spam email with nonsense letters, clearly not a Herbivoracious-style notification.",
      "parent": "0",
      "gravatar_hash": "a2cc8176a701bc0479dfd8745c37dbc1"
    },
    {
      "id": "4294",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-11-22 22:10:02",
      "content": "Hey Chris - no, just me being stupid :(. I was testing something on\nthe new site and accidentally published it, the deleted it right away.\nI was hoping it was fast enough not to go out to everyone, but I guess\nno such luck. Thanks for checking!",
      "parent": "4290",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "4442",
      "author": "Anita",
      "author_url": "http://www.slice-o-matic.net",
      "date": "2011-11-23 21:09:20",
      "content": "This sounds like a marvelous recipe to try out. Beats and curry sounds like such a great combination.",
      "parent": "0",
      "gravatar_hash": "70e264ddf8f0328d75120471122bb432"
    },
    {
      "id": "4515",
      "author": "MagicMen",
      "author_url": "http://www.magicmen1.typepad.com",
      "date": "2011-11-24 08:35:45",
      "content": "Think delicious.",
      "parent": "0",
      "gravatar_hash": "b48491f258925eba2c3341aae5352cee"
    },
    {
      "id": "5113",
      "author": "Carlene @Carlene's Figments",
      "author_url": "http://www.CarlenesFigments.wordpress.com",
      "date": "2011-11-27 12:55:17",
      "content": "Beautiful color combination! I feel like so much of the time when I make curry, despite the number of veggies, everything turns that yellow color.",
      "parent": "0",
      "gravatar_hash": "4cc0dad199d5930d10b65f35f8e72271"
    },
    {
      "id": "5394",
      "author": "John",
      "author_url": "",
      "date": "2011-11-28 09:15:09",
      "content": "I made this for dinner last night, using half the called-for cayenne, and even then I thought it could use less -- it seemed to me that the beet and tamarind and garam masala flavors were all overwhelmed by the \"hot\". Don't get me wrong -- I LIKE \"hot\", but in this case I'd rather back off and have those more delicate flavors come out a bit more. On the other hand, my wife and daughter loved it just the way it was, so tastes obviously differ. \n\nI was worried about the hassle of peeling the beets, since various online sources talk about what a pain it is.It was pretty simple. One thing that helped: I cut off the leaves, but left about 5\" of stems to use as a \"handle\" during peeling of my globe-shaped beets.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "5746",
      "author": "Lily",
      "author_url": "http://www.shortorder.com",
      "date": "2011-11-29 14:13:46",
      "content": "I'm going to try this. Beets are not my favorite but this recipe actually sounds pretty good. Thank you!",
      "parent": "0",
      "gravatar_hash": "96cd6d2f39a30132c69c3cc978ab4c65"
    },
    {
      "id": "15628",
      "author": "Korios",
      "author_url": "http://korioi.blogspot.com",
      "date": "2011-12-30 17:56:44",
      "content": "I have liked beets since I was a kid but I loved them after reading Tom Robins' Jitterbug Perfume : \"The beet is the murderer returned to the scene of the crime. The beet is what happens when the cherry finishes with the carrot. The beet is the ancient ancestor of the autumn moon, bearded, buried, all but fossilized; the dark green sails of the grounded moon-boat stitched with veins of primordial plasma; the kite string that once connected the moon to the Earth now a muddy whisker drilling desperately for rubies.\"\nHappy New Year with cool new recipes!!",
      "parent": "0",
      "gravatar_hash": "1bcb556c2bd4f43f0bcbf65687954d29"
    },
    {
      "id": "15637",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2011-12-30 19:28:57",
      "content": "That's fantastic! Nobody writes like Tom Robbins.",
      "parent": "15628",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21082",
      "author": "Mark",
      "author_url": "",
      "date": "2012-03-08 07:58:09",
      "content": "I made this for a bunch of beet-loving friends and it was a huge hit! The mustard oil was really worth seeking out, and I'm excited to try it in other recipes. I served it with brown basmati rice and chana masala, and it met all my friends' various dietary restrictions: vegan, gluten-free, no refined carbs, and nut-free! Though I did top mine with roasted cashews, which was a great textural contrast.",
      "parent": "0",
      "gravatar_hash": "fe7a4e6cee5a3f7d8fe9cea86ca72d56"
    },
    {
      "id": "45038",
      "author": "chef moda",
      "author_url": "",
      "date": "2012-08-12 15:30:43",
      "content": "Where are the nutritional values with these recipes?",
      "parent": "0",
      "gravatar_hash": "056829b22bded9f07e2cb1276799d58f"
    },
    {
      "id": "45062",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-12 18:57:49",
      "content": "Hi Chef Moda - I'm not much of a nutrition oriented person; my philosophy is to eat a wide variety of delicious foods in moderation and simply cook for taste. But there are lots of sites out there where you can paste in ingredients lists and get nutrition info if that is of interest to you.",
      "parent": "45038",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "202943",
      "author": "Emma",
      "author_url": "",
      "date": "2013-10-16 07:51:03",
      "content": "This looks amazing! I love beets! I got Madhur Jaffrey's recipe book http://www.madhur-jaffrey.com/index.php/2012 recently and have been working my way through that, but I'll pause for a bit and try yours especially as I have friends coming over in a few days and I'm sure they'd love it, thanks :)",
      "parent": "0",
      "gravatar_hash": "19d3c064cc1e2675e3e159db34f34197"
    }
  ]
}