{
  "comment_count": 45,
  "comments": [
    {
      "id": "2574",
      "author": "Barbara Stewart",
      "author_url": "http://profile.typepad.com/workingrelationshipscoach",
      "date": "2009-04-06 07:26:56",
      "content": "Guess what we're having for dinner tonight?\nThe cornbread recipe is a \"must do\" as far as I'm concerned! :)\nThanks Michael.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2575",
      "author": "Anne",
      "author_url": "",
      "date": "2009-04-06 08:42:35",
      "content": "I'm very partial to Mark Bittman's cornbread recipe ( <a href=\"http://bitten.blogs.nytimes.com/2008/09/26/recipe-of-the-day-cornbread/\" rel=\"nofollow\">http://bitten.blogs.nytimes.com/2008/09/26/recipe-of-the-day-cornbread/</a> ), but yours sounds great too. I was able to find locally grown (Vermont) cornmeal and it knocks my socks off! I'd guess that just about any cornbread recipe would be ten times better with the good stuff in it.\n\nI also haven't tried your chili recipe (my preferences are on the other side of the beans-to-veggies ratio), but thought I'd give a shout-out to the only <i>Vegetarian Times</i> recipe I've ever really loved: Chipotle Chili Non-Carne, <a href=\"http://www.vegetariantimes.com/recipes/8173\" rel=\"nofollow\">http://www.vegetariantimes.com/recipes/8173</a> .\n\nThanks, as ever, for spreading the gospel about vegetarian food for people who love <b>food</b> and don't focus on the self-righteous stuff!",
      "parent": "0",
      "gravatar_hash": "5cdecc447861b205659b26b2585302fb"
    },
    {
      "id": "2576",
      "author": "siri",
      "author_url": "http://transplantedbaker.blogspot.com/",
      "date": "2009-04-06 09:18:02",
      "content": "I made cornbread just last night! Too bad I didn't have your recipe ahead of time, otherwise they could have been a browned butter version. They look great!\n\n-Siri",
      "parent": "0",
      "gravatar_hash": "9ed286d838a2a548212c8d225a03f4cc"
    },
    {
      "id": "2577",
      "author": "Susan",
      "author_url": "",
      "date": "2009-04-06 14:39:56",
      "content": "Here's a tip from Cook's Country Magazine: Try gently baking the cornmeal to bring out a deeper corn flavor.  Just 3-4 minutes at 300 does it and take it out just before it starts browning, then cool to room temp.  Continue with your recipe.  It really does bring out the flavor.\n\nI'm with you on the corn to flour ratio.  I prefer at least 50-50, or err on the side of the cornmeal.  The big debate that I've witnessed is sugar or no sugar.  It's a southern vs northern thing, it seems, as is cakey vs course texture.\nI like it all, as long as it's not too sweet!  A couple of tablespoons sugar suits me perfectly.  I like your browned butter idea.  Next time!",
      "parent": "0",
      "gravatar_hash": "c860ce75c08321a74e6f2472a73c128f"
    },
    {
      "id": "2578",
      "author": "A&amp;N",
      "author_url": "http://reluctantchefs.blogspot.com",
      "date": "2009-04-06 16:15:50",
      "content": "It does look perfect! :) Will try it for weekend breakfast!",
      "parent": "0",
      "gravatar_hash": "50de5463f411bb5bad4710eb70af07f3"
    },
    {
      "id": "2579",
      "author": "k",
      "author_url": "http://sosayi.wordpress.com",
      "date": "2009-04-07 09:38:38",
      "content": "I'm with you on the whole \"no additions\" to cornbread.  Perfection needs no embellishment.  Interestingly enough, just tried a recipe for chocolate chip cookies with brown butter, which was a fantastic enhancement, so I am eager to try it in a different type of recipe to compare!\nThanks.",
      "parent": "0",
      "gravatar_hash": "5fc958d5a4e9d12ba18527d869e62c82"
    },
    {
      "id": "2580",
      "author": "Heidi",
      "author_url": "http://peacockmodern.blogspot.com",
      "date": "2009-04-07 09:46:17",
      "content": "that looks fantastic! I'll have to try it with brown butter. I make cornbread in a cast iron skillet, and I put the skillet and a knob of butter in the oven while it is preheating, which makes for a really nice crust. I more or less follow my southern grandma's recipe (<a href=\"http://www.flickr.com/photos/peacockmodern/2742717340/),\" rel=\"nofollow\">http://www.flickr.com/photos/peacockmodern/2742717340/),</a> which has hardly any flour. A good stone ground cornmeal is key.",
      "parent": "0",
      "gravatar_hash": "2c44b4443fe7d130357be6867d374622"
    },
    {
      "id": "2581",
      "author": "veggiebelly",
      "author_url": "http://www.veggiebelly.com",
      "date": "2009-04-07 11:04:14",
      "content": "great recipe! i also love susan's tip about baking the corn meal before using!",
      "parent": "0",
      "gravatar_hash": "c9b1259ff74b0aee40402ce029be9633"
    },
    {
      "id": "2582",
      "author": "e",
      "author_url": "http://www.erichegwer.com",
      "date": "2009-04-08 02:30:59",
      "content": "because the little blue box of cornbread has lard",
      "parent": "0",
      "gravatar_hash": "adaf13cfc4563b40b9cd42f0b886eb9c"
    },
    {
      "id": "2583",
      "author": "Barbara",
      "author_url": "http://www.synchronicitycoaching.com",
      "date": "2009-04-08 04:22:52",
      "content": "Having made this recipe Monday evening, I can attest to its greatness!\nMy hungry teenagers and a couple of friends found the cornbread before dinner and I was lamenting not making a second batch! - Mom and Dad got one small piece each - I suppose I can thank our daughters and their friends for thinking of my waistline! I would definitely have eaten more.\nThis will now be my regular cornbread recipe.\nThanks Michael.",
      "parent": "0",
      "gravatar_hash": "35a0844a632079f9c80145caa1fbbe0e"
    },
    {
      "id": "2584",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-04-08 07:32:49",
      "content": "Hey Barbara - I'm glad you liked it! And now I know the new equation\ncornbread - (4 * teenager portion) = none for the grownups :).",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2585",
      "author": "Cucinista",
      "author_url": "http://working-lunch.blogspot.com/",
      "date": "2009-04-08 12:03:49",
      "content": "Um, more cornbread, yes please!  This looks fantastic.  I have been enjoying reading all your recipes and seeing some great photography.  I probably shouldn't read before dinner since I want to make everything now...",
      "parent": "0",
      "gravatar_hash": "1d706af6919a25dfa1839822c854193b"
    },
    {
      "id": "2586",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-04-26 09:01:41",
      "content": "We just made this again today, only in muffin tins. The recipe above will make about 10 muffins and will take about 18-20 minutes to bake. Totally delicious - it is all about using a high quality stoneground cornmeal.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2587",
      "author": "Tracy",
      "author_url": "http://www.tracyfood.com",
      "date": "2009-05-05 20:59:12",
      "content": "I know that's going to be good, because it's really close to my usual cornbread recipe (the one from <a href=\"http://www.tracyfood.com/2007/08/16/moosewood-new-classics/\" rel=\"nofollow\"><i>Moosewood Restaurant New Classics</i></a>) except they use brown sugar and less butter... which means there's a fun and easy way to get the best of all possible worlds!  Yum.",
      "parent": "0",
      "gravatar_hash": "ec4ee57bf1dbee11d6fa8f212eaf2f13"
    },
    {
      "id": "2588",
      "author": "Suzanne",
      "author_url": "http://sunshinemom.blogspot.com/",
      "date": "2009-05-07 11:28:55",
      "content": "I love baking cornbread in my cast iron pan.  I'll give this a try!",
      "parent": "0",
      "gravatar_hash": "a6defc199e33a1c48de339aefac37aca"
    },
    {
      "id": "2589",
      "author": "Stephanie",
      "author_url": "http://www.figsinmybelly.blogspot.com",
      "date": "2009-08-03 23:58:11",
      "content": "I work at a summer cooking camp for 8-12 year old kids and one day we made cornbread and gazpacho. I used your cornbread recipe and really it is the BEST EVER CORNBREAD! The kids went wild over this...they loved making it and even more they loved eating it! This browned butter thing really is magical...I made browned butter blueberry muffins over the weekend and woo were they good! Check them out on my blog: www.figsinmybelly.blogspot.com!",
      "parent": "0",
      "gravatar_hash": "989273e4c17f0f850af26130066af224"
    },
    {
      "id": "2590",
      "author": "Melissa.L.Magana@gmail.com",
      "author_url": "",
      "date": "2009-08-11 09:51:09",
      "content": "Thanks for this recipe! IT'S AWESOME! I tried it with brown sugar too, which added a great flavor. (1/2 cup brown sugar instead of the 1/3 cup sugar) Served it with a native american veggie stew...mmmm, yum!",
      "parent": "0",
      "gravatar_hash": "b33cca673da40073e0a0423148136813"
    },
    {
      "id": "2591",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-08-11 10:04:59",
      "content": "Thanks Melissa! The brown sugar sounds like a great idea too.<br />\n<br />",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2592",
      "author": "Ngoc",
      "author_url": "http://professionalbakist.blogspot.com",
      "date": "2009-10-12 15:59:25",
      "content": "I used this recipe to make croutons for a panzanella, but the boyfriend's dad liked it so much as is that it may be making an appearance at Christmas. Thanks for sharing the recipe!",
      "parent": "0",
      "gravatar_hash": "3e07de4409552c649e6dd6991336bf59"
    },
    {
      "id": "2593",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-13 08:49:49",
      "content": "I&#39;m glad the corbread was a hit, and that panzanella sounds amazing!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2594",
      "author": "Tom",
      "author_url": "",
      "date": "2009-10-13 14:05:56",
      "content": "I added some red pepper flakes as the butter was browning -ala 101 Cookbooks- and some fresh-frozen sweet corn from the market.\n\nIt was incredibly delicious and I was rather surprised at the depth of the flavor browning the butter adds to the cornbread!",
      "parent": "0",
      "gravatar_hash": "85a09c3db1949a8be12cf9adfb96ab82"
    },
    {
      "id": "2595",
      "author": "Kathy",
      "author_url": "",
      "date": "2009-11-06 09:45:07",
      "content": "I made this cornbread last night and it was a HUGE hit with all the kids and my husband....  Thanks for the great recipe - I will be making it again, and again!!",
      "parent": "0",
      "gravatar_hash": "38f340605b23cdca0f784945a12e775f"
    },
    {
      "id": "2596",
      "author": "Bill",
      "author_url": "",
      "date": "2010-03-05 15:38:15",
      "content": "Thanks Michael, I tried this new recipe and it was fantastic i also use brown sugar but split it in half with regular white sugar and baked it in a cast iron corn bread pan ...Thanks again",
      "parent": "0",
      "gravatar_hash": "ac6b1254446d16544b4e484dcc29848f"
    },
    {
      "id": "2597",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-03-08 19:48:00",
      "content": "Hey Bill - Thanks for taking the time to let me know you liked it! BTW, if you haven&#39;t already, I&#39;ve got a facebook fan page up at <a href=\"http://www.facebook.com/herbivoracious\" rel=\"nofollow\">http://www.facebook.com/herbivoracious</a> - a nice way to keep connected.\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2598",
      "author": "Nfwbls",
      "author_url": "http://profile.typepad.com/nfwbls",
      "date": "2010-03-24 11:18:34",
      "content": "i just made this and it was delicious!!!! Usually I'm an utter cornbread failure (at some point my husband begged me to stop trying) but this worked like a charm. I used kefir and Bob's Red Mill corn grits instead of buttermilk and cornmeal because that's what I had on hand, and I do believe it's the best cornbread I've ever eaten. My kids agree.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2599",
      "author": "Cynthia",
      "author_url": "",
      "date": "2010-03-28 18:51:43",
      "content": "I have tried a lot of corn bread recipes and innovations of my own, this corn bread IS the best ever. Brown butter great in any kind of cookie, oatmeal esp and choc chip as someone commented.  Every recipe on this website is sooooo good, the format, every thing about it.. enjoying it so much.  It is so fun to read these blogs and websites, no matter how much we cook there is always something new to try..food is fun!",
      "parent": "0",
      "gravatar_hash": "137774b4704ed99f7a1fd2151298c9c6"
    },
    {
      "id": "2600",
      "author": "Scott",
      "author_url": "",
      "date": "2010-05-03 01:22:17",
      "content": "Sugar does NOT, now or ever, go in cornbread. Sugar in your bread is for rude Yankees, rich people and/or dessert. Cornbread is for none of the above. If you have been conditioned by corporate America to believe that everything you consume must be sugar-laden, then I'd suggest you mix some honey with your butter and spread it post-bake. And not let decent people see you do it.",
      "parent": "0",
      "gravatar_hash": "0ba9a42f4b857319f0d81c1c13b0cdb1"
    },
    {
      "id": "2601",
      "author": "Erina",
      "author_url": "http://www.shutupandcook.wordpress.com",
      "date": "2010-07-27 22:40:53",
      "content": "This looks like a great recipe! Here's another recipe I recently did and really liked.\n\nCheddar Skillet Corn Bread <a href=\"http://wp.me/puWta-5D\" rel=\"nofollow\">http://wp.me/puWta-5D</a>\n\nIt's particularly nice because you bake it right in a cast iron skillet. Try it out and let me know what you think!",
      "parent": "0",
      "gravatar_hash": "fcac387cd323a45269d6a7943d36577c"
    },
    {
      "id": "2602",
      "author": "zerrin",
      "author_url": "http://www.giverecipe.com",
      "date": "2011-01-10 10:29:35",
      "content": "This looks so tempting! I love the picture! Would be perfect with soup or I can even have it as a snack with a butter topping.",
      "parent": "0",
      "gravatar_hash": "eed46d95dbe550b06a386c72c3242ebc"
    },
    {
      "id": "2603",
      "author": "sarah",
      "author_url": "http://www.sarahmelamed.com",
      "date": "2011-01-10 10:34:25",
      "content": "just made corn muffins this week with %50 corn and no additions, great advice about the browned butter",
      "parent": "0",
      "gravatar_hash": "7e37ba6c0e30dbfce4a8c30b0ffdae44"
    },
    {
      "id": "2604",
      "author": "shar",
      "author_url": "",
      "date": "2011-02-07 06:29:40",
      "content": "Definitely missed the boat here! Taste was nice because of browned butter but having to explain the appearance and brown flecks was a big distraction and made this a disaster at chili bowl party.  OH well - so much for trying new recipes.  Will stick with Grandmas.  Thanks anyway.",
      "parent": "0",
      "gravatar_hash": "6054d45b171c9e8d937bcea9611ac912"
    },
    {
      "id": "2605",
      "author": "GreyFeather",
      "author_url": "",
      "date": "2011-05-17 14:25:31",
      "content": "Recently made this for a wedding party dinner BBQ for 50 people and it was a hit! Comments were great and several folks sought me out to say it was the best item on the serving table.\nI use Bob's Red Mill medium corn meal and use their whole wheat pastry flour also which certainly adds to the flavor and color. The point about VERY minimal stirring of the batter is important, so make sure all dry ingredients are well mixed together before adding.\n\nIf anyone is interested, I worked out the calorie content and it is about 145 calories per 2\" x 2\" piece as written (including the whole wheat flour variation).",
      "parent": "0",
      "gravatar_hash": "3978684a45ab90acd5f3f25aa5905ac7"
    },
    {
      "id": "22390",
      "author": "Mitzi",
      "author_url": "",
      "date": "2012-04-03 08:53:41",
      "content": "I made this extraordinary cornbread last night for my aspiring chef son-in-law. It was every bit as good as everyone has said and he loved it.\nThank you for a great recipe.",
      "parent": "0",
      "gravatar_hash": "3193c1b464fb5e65b2c595736433b136"
    },
    {
      "id": "66218",
      "author": "janet",
      "author_url": "",
      "date": "2012-10-21 14:27:20",
      "content": "I've made this (more or less) three times now. I use 1 2/3 cup coarse ground cornmeal, and 1/3 cup barley or whole wheat flour, plus I use yogurt instead of butter milk. Great texture. I 'm  not sure the browned butter adds anything over just butter, but I do it. \n\nI find it quite a clash to come to this site for all the interesting careful recipes, then be met by spam about bananas. It's jarring, and doesn't have to be here.",
      "parent": "0",
      "gravatar_hash": "09c54949f75fa20b5a65e31c00b9d93c"
    },
    {
      "id": "66221",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-21 14:32:41",
      "content": "Are you seeing an ad for bananas in the sidebar? If so, that's not spam, that is one of the ways I make a living that allows me to write the recipes for the site.",
      "parent": "66218",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "66259",
      "author": "janet",
      "author_url": "",
      "date": "2012-10-21 15:55:36",
      "content": "I guess we'll have to disagree about what's spam. \n\nLast visit.",
      "parent": "0",
      "gravatar_hash": "7ef085b1ee1dc7b3236b9d41d6718a06"
    },
    {
      "id": "75254",
      "author": "Dini",
      "author_url": "",
      "date": "2012-11-06 07:37:48",
      "content": "Can anyone suggest which gluten free flour would be the best substitute for the wheat flour in this cornbread recipe? One of us is a strict vegetarian and the other gluten free in our household. Can be challenging!!",
      "parent": "0",
      "gravatar_hash": "e7f9d5e142d785197f8691d88cfd4770"
    },
    {
      "id": "82968",
      "author": "Rie",
      "author_url": "http://Failed..",
      "date": "2012-11-19 19:21:48",
      "content": "Hi Michael,\nI made this yesterday AND today..but failed!\nIt was too crunchy. Maybe because I used Whole grain Cornmeal or what?\nI used \"Bob's Red Mill Coarse Grind Cornmeal Whole Grain\".\nI really want to like this recipe.\nCan anyone advise which Cornmeal would be good?",
      "parent": "0",
      "gravatar_hash": "01df72ade2a7546f13546b6bb00bf35f"
    },
    {
      "id": "82973",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-11-19 19:38:12",
      "content": "That cornmeal should be fine; it does have a coarser texture, so if you prefer a finer texture you might want to try a different one. Other thoughts: if the crunch is from the brown butter crispies, you can just strain them out, pressing hard to get all the flavor out of them. Or you may have just overbaked it (or used too high a temp - have you used an oven thermometer lately?) and dried it out a bit?",
      "parent": "82968",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "82974",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-11-19 19:39:24",
      "content": "One more thought: if you prefer a cakier style, you can adjust the ratio of all-purpose flour to cornmeal - i.e. use 1/2 cup more flour and 1/2 cup less cornmeal. It will have less cornmeal flavor and more of a cakey texture.",
      "parent": "82968",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "115864",
      "author": "KerrieAnneM",
      "author_url": "",
      "date": "2013-02-08 18:17:41",
      "content": "I know it has been quite awhile since this recipe was first posted. But, I made this for my Dad's birthday and it was the very best cornbread I have ever made and he loved it. I'm not sure I browned the butter to its fullest extent because I was nervous but it still turned out awesome.",
      "parent": "0",
      "gravatar_hash": "3ee25cc43ef119992fae32e3c63f0646"
    },
    {
      "id": "197016",
      "author": "Lili",
      "author_url": "",
      "date": "2013-09-21 13:24:12",
      "content": "Just made this (it's still in the oven!) i doubled the recipe and it's baking in a 12'' cast-iron skillet. Just a quick question about baking time -- do you recommend increasing the baking time if you double the recipe? (sort of a baker novice here..)",
      "parent": "0",
      "gravatar_hash": "31617fa007888d038cd380e32c3d1292"
    },
    {
      "id": "197018",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-09-21 13:27:06",
      "content": "I'm sure it will take a bit longer, but hard to say exactly how long. If a toothpick poked in the middle comes out dry, and it is golden brown on top, you are all set!",
      "parent": "197016",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "199251",
      "author": "Jenn Travis",
      "author_url": "",
      "date": "2013-10-06 08:15:04",
      "content": "I just made this as pancakes served with berries and warmed maple syrup. I used a finer ground polenta and raw sugar. So delicious!",
      "parent": "0",
      "gravatar_hash": "5b49435c94ecbf60caed95a7ba2d2cfa"
    },
    {
      "id": "199252",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-10-06 08:19:23",
      "content": "Well played! I love cornmeal pancakes.",
      "parent": "199251",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}