{
  "comment_count": 4,
  "comments": [
    {
      "id": "771",
      "author": "amee",
      "author_url": "http://www.rabbitfoodrocks.blogspot.com",
      "date": "2010-11-15 10:07:23",
      "content": "can i just come over and eat at your place?  my dinners seem so mundane after reading your blog!  :)",
      "parent": "0",
      "gravatar_hash": "ea1fed8e804be28ee1596700c053eef2"
    },
    {
      "id": "772",
      "author": "Alessandra",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2010-11-15 19:51:36",
      "content": "Ciao Michael,\n\nCould you do go totally savoury and make them without sugar? Or do they need a bit of sugar to 'stand'!",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "773",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-11-15 19:54:08",
      "content": "Hey Alessandra - I haven&#39;t tried them without sugar; but my guess is that since there is only 1/4 cup in there, you could probably leave it out and be ok. As always, if you try it, let me know the results!\n\n\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "774",
      "author": "John",
      "author_url": "",
      "date": "2010-11-21 07:50:51",
      "content": "My daughter and I made these this morning. I think that of all the herbivoracious recipes I've made, this is the one I'm least excited about -- but to be clear, I still think they're pretty good. They're just not something I'd make again. Then again, my son just walked in and said \"THESE are GOOD. WOW!\" So I guess there's a difference of opinion. :)\n\n+ The toasted seeds give the texture a nice variation. Corn muffins tend to be soft, and turn to mush in your mouth as you eat them; these have a little push-back because of the seeds -- a kind of crunch as you bite down.\n\n+ The overall batter structure is very nice. The muffins don't rise a lot, which means that although the muffin cups seem like they might be too full, they're not.\n\n+ The sesame flavor is very strong without being overwhelming.\n\n- The recipe should say \"Divide the batter in to the muffin tin\" rather than \"tins\"; I had this sudden worry that I was to have greased TWO tins.\n\n- The sesame flavor is too one-note for my taste. The corn flavor doesn't really balance it enough. I might be inclined to add a little ginger or something to add another note.\n\n- The 2T of sesame seeds on top seemed like too much to us. I think that 1T would have been enough (and would have ended with fewer seeds falling off the muffins at the end).",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    }
  ]
}