{
  "comment_count": 17,
  "comments": [
    {
      "id": "24412",
      "author": "esther",
      "author_url": "http://www.ambitiousdeliciousness.com",
      "date": "2012-05-23 06:32:48",
      "content": "I never thought about using dangmyeon in this dish but it's a great idea. This looks like a treat for a hot summer day! Love it! \n\nQuestion: If I substitute the noodles with soba, can I still enter the contest?",
      "parent": "0",
      "gravatar_hash": "f893dedb020516080d40854e3e601d48"
    },
    {
      "id": "26000",
      "author": "Teresa Park",
      "author_url": "",
      "date": "2012-05-23 10:30:34",
      "content": "I've been making it since I got inspired by your photo ^^/",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "24442",
      "author": "Anne Campbell",
      "author_url": "",
      "date": "2012-05-23 11:05:32",
      "content": "Darn it! I haven't finished all the recipes in your book yet, and now you've come out with another one that I have to try.  ;)\n\nHave you ever tried making your own kimchi? I'm not a kimchi connoisseur, but I've found it super-easy and quick to make (if you don't count letting it sit for a few days).",
      "parent": "0",
      "gravatar_hash": "5cdecc447861b205659b26b2585302fb"
    },
    {
      "id": "24453",
      "author": "Angie",
      "author_url": "",
      "date": "2012-05-23 12:36:40",
      "content": "Hey Michael! \nWhat a great recipe! I think the addition of radish sprouts and asparagus makes this dish a beautiful kiss of sophistication. :-)\nSo I just read up on what the difference is between Jollmyun and Nangmyun. Jollmyun was made actually by a mistake at a Nangmyun factory in Incheon back in the 70s. A factory worker set the noodle press wrong by mistake and the noodle that came out of it was much thicker than how Nangmyun is supposed to be. The factory couldn't sell it so they gave the noodle away for free to a snack bar nearby and the owner mixed it with the gochujang sauce like you have, with cucumber and whatnot. This dish became really popular since then, and it's a staple dish at every corner snack bar in Korea. \nJollmyun is very chewy, from a word \"Jollgit\". The dough is mixed with 130-150celsius heat from the beginning, and also with a lot of pressure, and this apparently gives the dough the chewiness. It's basically made with a similar process as making Ddokbokki Ddok.\nSo. I'm glad I found this out too. I never knew why the Jollmyun is so chewy. \nI think everybody who grew up in Korea has a great memory eating Jollmyun, most probably from eating after school at a snack bar. Yum! \nI\nSee ya!",
      "parent": "0",
      "gravatar_hash": "498fbe64c9925fd3a85cc5305bdc7ddc"
    },
    {
      "id": "24456",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-23 12:46:16",
      "content": "I have yet to start doing any of my own fermentation. I know it is inevitable, but somehow I've resisted so far. Soon!",
      "parent": "24442",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "24457",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-23 12:47:01",
      "content": "That's fantastic information, Angie, thank you so much! Now I know where I went wrong, I was searching for \"Joll Noodles\" like it was called on the menu, it didn't occur to me to search for jollmyun.  I really appreciate the info.",
      "parent": "24453",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "24496",
      "author": "Suzi",
      "author_url": "http://www.cookingsgood.com/",
      "date": "2012-05-23 17:22:40",
      "content": "Wow, I bought these noodles in my Asian store but never used them so I froze them.   Great recipe, thanks.  New to your site and I love what you are doing here.",
      "parent": "0",
      "gravatar_hash": "73180f84be0bac23f89ac338d1626d95"
    },
    {
      "id": "26001",
      "author": "Mary Crowe",
      "author_url": "",
      "date": "2012-05-23 18:27:18",
      "content": "Love it!!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "26002",
      "author": "Helena FitzWilliam O'Reilly",
      "author_url": "",
      "date": "2012-05-24 06:50:40",
      "content": "can't wait to make this!!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "24742",
      "author": "amee",
      "author_url": "http://www.rabbitfoodrocks.blogspot.com",
      "date": "2012-05-25 06:25:50",
      "content": "This looks so beautiful!!!  I'm going to try this soon b/c it's already 94 degrees here.  grr.  This looks refreshing and delish.  I always leave your blog a little more educated.  :)  You should do grocery store tours of these specialty stores.  I would totally pay for that...if i lived in Seattle.  :)",
      "parent": "0",
      "gravatar_hash": "22476a0ce17918636d3355926c514729"
    },
    {
      "id": "24808",
      "author": "Marina@Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-05-25 15:58:57",
      "content": "Michael, that is another super recipe. I use to work with five lovely Korean ladies back in Seattle, and they often had this salad for lunch, it was sooooo delicious! I asked them for the recipe but I guess my request was lost in the rain...:) I am glad you posted it, with limited ingredients but I can still do it. Thank you very much!",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "25435",
      "author": "Vegan",
      "author_url": "http://www.sevenpoint2.com/",
      "date": "2012-05-29 19:58:55",
      "content": "Spicy, yummy goodness! If you have some ice in the freezer, add a couple of pieces to make it even cooler. This is great for summer.",
      "parent": "0",
      "gravatar_hash": "bda7603876252c69c15f63b58a0bf6f0"
    },
    {
      "id": "26022",
      "author": "Omnivore Mike",
      "author_url": "",
      "date": "2012-06-02 10:13:28",
      "content": "this was so good AND I found a new market to shop at as well.",
      "parent": "0",
      "gravatar_hash": "d0a5e93a6c499ae7b93bb6c728217c7e"
    },
    {
      "id": "26023",
      "author": "michaelnatkin",
      "author_url": "https://herbivoracious.com/",
      "date": "2012-06-02 10:28:28",
      "content": "@Omnivore Mike Nice! Glad you liked it. Did you serve it nice and cold?",
      "parent": "26022",
      "gravatar_hash": "98c10d2d92fe38bf3eb8cdd3eeb4cc7c"
    },
    {
      "id": "26044",
      "author": "Omnivore Mike",
      "author_url": "",
      "date": "2012-06-04 04:20:39",
      "content": "@michaelnatkin  @Omnivore Mike\n If I answer no, will you come over and cook for us? :)Everything went into the ice tray, including the serving bowls.",
      "parent": "26023",
      "gravatar_hash": "d0a5e93a6c499ae7b93bb6c728217c7e"
    },
    {
      "id": "46189",
      "author": "Charis",
      "author_url": "",
      "date": "2012-08-19 23:09:59",
      "content": "Nangmyeon also goes well with pickled daikon radish strips. For the sauce I used both gochujang and gochugaru (coarse pepper powder) for extra heat and garlic instead of ginger. \nInteresting fact: Although now Nangmyeon is considered a summer dish, it started as a winter food in Josun dynasty (way before artificial refrigeration was first invented).",
      "parent": "0",
      "gravatar_hash": "7bb2130ee088a4f56fa3775bd1414594"
    },
    {
      "id": "46275",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-20 06:54:06",
      "content": "I've just been experimenting with finely ground gochugaru in a quick apple kimchi and a salad dressing. Delicious stuff. The on I bought at Uwajimaya isn't very hot, but has a lovely citric bite. Is that common or is it usually quite hot?",
      "parent": "46189",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}