{
  "comment_count": 3,
  "comments": [
    {
      "id": "4120",
      "author": "jen",
      "author_url": "",
      "date": "2007-08-11 14:29:59",
      "content": "A bit of the sumac spilled in the stroller on our way home landing in the holes of bambino's crocs.  He developed a terribly itchy rash on his foot, a low grade fever, had trouble breathing, and a bloody nose.  Do you think we should have taken him to the doctor? Ach we decided just to put him down for a nap from which he woke up not too long after he went down.  We mixed some Tom's whitening toothpaste with some ultrapasturized Organic Safeway Milk and rubbed it all over the rash (which by that time had spread up his legs). A miracle happened!  Is that how miracle whip was named? His fever went down, the rash disappeared, his breathing returned to normal, and his nose stopped bleeding.  What is that sumac stuff? Is there an over the counter antidote? I can't wait to try it in a salad.",
      "parent": "0",
      "gravatar_hash": "b6a7410d826a9e5fa1f9a77c394d0fda"
    },
    {
      "id": "4121",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2007-08-12 23:31:44",
      "content": "Hmm, that is interesting because I just rubbed some sumac under my armpits and now a rabid dog is chasing me!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "4122",
      "author": "Jen",
      "author_url": "",
      "date": "2007-08-13 10:19:10",
      "content": "QUICK find yourself some ultrapasturized organic milk and Tom's tooth whitening toothpaste.  Mix it up in a cuisinart.  Remove and add to blender.  Whip for 3 minutes or until frothy.  Put mixture in freezer safe glass container.  Freeze concoction for 10 hours.  Bring it to room temp for 30 minutes.  Add a dash of aleppo pepper.  Sprinkle with peyote.  Microwave on defrost for 3 seconds.  Find green spatula (preferably chef'n brand) and spread slowly (to ensure full penetration under armpit skin).  Invite dog to lick.  Within 5 minutes dog will be cured of rabies.",
      "parent": "0",
      "gravatar_hash": "b6a7410d826a9e5fa1f9a77c394d0fda"
    }
  ]
}