{
  "comment_count": 21,
  "comments": [
    {
      "id": "1712",
      "author": "Jennifer",
      "author_url": "http://www.sweetonveg.com",
      "date": "2009-11-12 11:41:42",
      "content": "I love black beans and yams together. This dish looks wonderful!",
      "parent": "0",
      "gravatar_hash": "16d16d709b41f1139b548c386917c1a1"
    },
    {
      "id": "1713",
      "author": "Errin",
      "author_url": "http://asharedmile.blogspot.com",
      "date": "2009-11-12 11:44:46",
      "content": "These look delicious.  Thanks for sharing your vegetarian version...I am excited to try it!",
      "parent": "0",
      "gravatar_hash": "c269e2a183f3f6fa2e04f94274dcd86d"
    },
    {
      "id": "1714",
      "author": "arugulove",
      "author_url": "http://arugulove.wordpress.com",
      "date": "2009-11-12 20:29:20",
      "content": "This looks really good.  I'm always looking for interesting vegetarian main courses.  I'll have to try this out soon.",
      "parent": "0",
      "gravatar_hash": "253d1978cdae80b623ebb342e1426589"
    },
    {
      "id": "1715",
      "author": "piile",
      "author_url": "",
      "date": "2009-11-13 09:41:59",
      "content": "mmm! reading <i>crispy exterior with creamy insides</i> made my mouth water!",
      "parent": "0",
      "gravatar_hash": "bff16c0e4def5dd7080a6e3fc696b425"
    },
    {
      "id": "1716",
      "author": "A&amp;N",
      "author_url": "http://reluctantchefs.blogspot.com",
      "date": "2009-11-13 10:17:45",
      "content": "I love how you've substituted yams!",
      "parent": "0",
      "gravatar_hash": "50de5463f411bb5bad4710eb70af07f3"
    },
    {
      "id": "1717",
      "author": "Ivy Manning",
      "author_url": "http://ivysfeast.com",
      "date": "2009-11-13 15:06:21",
      "content": "Heh Michael\nMy friend Tony, from Chihuahua makes these sans beans in the masa and calls em serapes (sandles I think?)  Is it the same thing, do you know?",
      "parent": "0",
      "gravatar_hash": "398d9a223280b1350d4db253ecccefe3"
    },
    {
      "id": "1718",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-11-13 16:35:49",
      "content": "Without the beans I&#39;ve seen them called gorditas, but I imagine serapes are similar. The beans really change the flavor and consistency a lot so I think they deserve their own name :). Both are yum!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1719",
      "author": "Bill",
      "author_url": "http://www.geektrap.com/bill",
      "date": "2009-11-16 15:37:08",
      "content": "Made these tonight.  Yum!  I used canned refried pinto beans instead of black beans, just because that's what I had.  The bocoles came out a little lighter colored than yours, but both my vegetarian house mate and my omnivore house mate loved them.  I had some mesclun mix for salad on the side, so I tore up some of that and used it to serve the bocoles on.  All of us said, at one point or another, \"Gee - I would never dreamed of serving yams with hot peppers and refried beans, but it's great.\"  Thanks for another delicious recipe!",
      "parent": "0",
      "gravatar_hash": "f12a1fdb09c8f6d7873d3d5ee6759e88"
    },
    {
      "id": "1720",
      "author": "John",
      "author_url": "",
      "date": "2009-11-17 09:32:28",
      "content": "I went ahead and made the whole meal -- the bean-and-corn cakes, the yam \"filling\", the chopped romaine on the plate, and a pipian recipe (albeit not a vegetarian one) that I grabbed from elsewhere. My whole family loved it, not only for the taste and presentation, but also from the combination and balance of flavors. Four things:\n\n1. I couldn't get the oranges you specified, so I grabbed two other kinds. Their innards were two different shades of orange, with slightly different textures and flavors -- a nice feature. If I were doing this again (in summer), I'd use my own radishes (easy for anyone to grow!), so that I could get a variety of color from deep purple to the pink-fading-to-white of some of the french varieties.\n\n2a. I never did find a cooking temp that I was really happy with; overall, the bean-cakes soaked up more oil than I would have liked, but when I made the oil hotter, they started to burn. (Even oily, they were very good).\n\n2b: I'll bet I could prepare the beancakes in much the way we make sweet-potato fries: put 'em on a teflon baking sheet with a little oil, and shove them in a quite hot oven. I've got a few leftovers that I didn't get to cooking last night...perhaps I'll give it a shot.\n\n3. I'd love to see you write a bit about how you plan a whole meal -- how you decide what goes with what -- and how you plan the preparation of a whole meal (\"I have to roast those peppers first so I can peel them for the pipian. While they're roasting I can make the whole salad -- it won't suffer from sitting out waiting while I do the rest. I have to fry some onions for the pipian, and it'll be easier to do that if I'm not also cooking beancakes at the same time ...\").",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "1721",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-11-17 13:59:43",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\nWow, the whole meal... I&#39;m glad you made it and liked it!\n\n\n\nRe your other questions:\n\n\n\n(1) I don&#39;t know what kind of oranges you got, but they sound good - and most any kind would be a fine sub in that salad. And a variety of radishes would be beautiful.\n\n\n(2a) I agree with you that finding the right temperature for frying the\nbocoles is subtle. I think mine had a slight bit of grease absorbed\ninto the outer layer, but not too much. Definitely crisp, not soggy.\n\n(2b) I think that an oven fry might work - you&#39;d still want to flip them to crisp both sides. If you try it, please let me know. Do you use silpats? If not, get one and it will make this easier.\n\n\n(3) That would be a fun series of posts! Too much to write up in a comment but you&#39;ve got my creative juices flowing.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1722",
      "author": "Michael L",
      "author_url": "",
      "date": "2009-11-20 16:54:35",
      "content": "I'm wondering how much trouble you had finding a masa mix without lard in it. I live in Chicago where I can buy masa from dozens of places nearby, but I've never been able to find a vegetarian one. Most of the varieties I find are locally produced.",
      "parent": "0",
      "gravatar_hash": "5fa3d7c0b3480e9e7081c9a49884a777"
    },
    {
      "id": "1723",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-11-20 21:18:29",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\nMasa is normally just the nixtamalized corn (ground with lime)... you would beat lard into it if you were making tradtional tamales but no fat at all if you are making tortillas. It is ground more coarsely for tamales. But in any case, I&#39;ve never heard of it being sold pre-mixed with lard. If you are talking about dry masa harina, the MaSeCa brand is safe, and I heard Bob&#39;s Red Mill makes a good one.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1724",
      "author": "Alice",
      "author_url": "http://www.cottoecrudo.com",
      "date": "2009-12-14 14:06:58",
      "content": "Beautiful and sounding so tasty. Don't think we can get yams around here, though...We do have sweet potatoes but I think yams are a different kind of vegetable...",
      "parent": "0",
      "gravatar_hash": "002c66a2c7f6a51723fe15f3410982fe"
    },
    {
      "id": "1725",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-12-15 09:15:10",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\nThey are similar and often confused. You could use sweet potatoes in this dish, just be sure to cook them until they are soft but not completely falling apart.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1726",
      "author": "Alice",
      "author_url": "http://www.cottoecrudo.com/en",
      "date": "2009-12-15 16:27:24",
      "content": "Thanks Michael, I should try at some point during the winter, in which case I'll let you know how it goes. Ciao!",
      "parent": "0",
      "gravatar_hash": "002c66a2c7f6a51723fe15f3410982fe"
    },
    {
      "id": "1727",
      "author": "Chelsea",
      "author_url": "",
      "date": "2010-05-30 19:12:39",
      "content": "Just made these last night-- stuck with the masa and black bean cakes, but topped them with chimichurri and cojita cheese instead of the yams (yes, I'm probably missing out, but the BF doesn't do yams or sweet potatoes) with a simple tomato-avocado salad. Absolutely killer. So glad there's tons of leftovers...",
      "parent": "0",
      "gravatar_hash": "b66bc8421f97286f7788000db272167b"
    },
    {
      "id": "1728",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-05-30 22:59:20",
      "content": "Your variation sounds great!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "104499",
      "author": "Shawn",
      "author_url": "",
      "date": "2013-01-05 12:13:01",
      "content": "What does the baking powder do in the bocoles?",
      "parent": "0",
      "gravatar_hash": "f7995117aa4d3209be2afab191b5f984"
    },
    {
      "id": "104809",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-01-06 22:12:29",
      "content": "It is intended to lighten them a bit, but I haven't run a side-by-side to see if it really does much.",
      "parent": "104499",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "888362",
      "author": "Chris Kimm",
      "author_url": "",
      "date": "2014-04-20 18:11:50",
      "content": "We had the bocoles and yams for supper tonight. I wound up using a mix of peppers with the yams (one serrano, one jalapeno and one chipotle) and liked the spicy/smoky effect.  We served over more romaine than pictured, with a substantial amount of mole sauce and a dollop of non-fat greek yogurt. I guess we wound up with something that approached an entree salad. Whatever it was we really liked it, and no one left hungry. We will definitely do this again. I think my Masa Harina / black bean mix was wetter than it was supposed to be, though the results were still delicious. Thanks!",
      "parent": "0",
      "gravatar_hash": "83b679a30acc6cdbdf469c7086a75dc9"
    },
    {
      "id": "889450",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-04-21 19:41:33",
      "content": "Agree, yeah, you have to get a bit of feel for how wet the dough should be. Your chili combination sounds nice!",
      "parent": "888362",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}