{
  "comment_count": 10,
  "comments": [
    {
      "id": "2971",
      "author": "Laura",
      "author_url": "http://whatlikenyc.blogspot.com",
      "date": "2009-01-19 10:40:39",
      "content": "Oh how fabulous!  I'm always on the lookout for cheesy crackers, but so many of them are just modified shortbreads.  I love that these are thin, and look to be crispy.  Trying them out tonight!",
      "parent": "0",
      "gravatar_hash": "8a04728fb44504bd9fa74188aae30036"
    },
    {
      "id": "2972",
      "author": "lisacohen",
      "author_url": "http://profile.typepad.com/lisacohen",
      "date": "2009-01-19 16:08:02",
      "content": "My husband's paternal side of the family is Sephardic... I just may have to make this one (I can't resist a cheesy cracker)! I just found your blog and am having fun looking around.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2973",
      "author": "Butterball",
      "author_url": "http://www.abutterworld.blogspot.com/",
      "date": "2009-01-19 16:27:02",
      "content": "How devine these look; I love the simplicity of them, plus I  could really use that martini!",
      "parent": "0",
      "gravatar_hash": "617fcd7ad3b911b28e882c351f48014d"
    },
    {
      "id": "2974",
      "author": "veggiebelly",
      "author_url": "http://www.veggiebelly.blogspot.com",
      "date": "2009-01-19 17:05:15",
      "content": "This recipe has everything I like! Pecorino romano is one of my favorite cheese. And who can resist crispy, cheesy things! Your boyikos sound great with a martini. If I made these, I think id break them up and put them in a salad of dark greens (dont know if your grandmother will approve!).",
      "parent": "0",
      "gravatar_hash": "c9b1259ff74b0aee40402ce029be9633"
    },
    {
      "id": "2975",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-01-20 20:14:12",
      "content": "I don't know if she'd approve either, but it sounds good to me!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2976",
      "author": "Janet Amateau",
      "author_url": "http://www.sephardicfood.wordpress.com",
      "date": "2009-01-21 10:18:48",
      "content": "Well, she'd have to approve of eating them with martinis - at the restaurant we serve my boyos de rayo with cocktails and everyone flips!  Nice job, Michael (and thanks) - Janet",
      "parent": "0",
      "gravatar_hash": "08cdfa0763b63ec2954c04fada7b527f"
    },
    {
      "id": "47757",
      "author": "Bettina at The Lunch Tray",
      "author_url": "http://www.thelunchtray.com",
      "date": "2012-08-30 10:34:04",
      "content": "Michael:  I know this is an old post but I found it today from your most recent recipe. My dad's side of the family is Sephardic, too -- from Turkey and Macedonia -- and I was excited to see this recipe for \"boyikos,\" which I ate often in my extended families' homes but for which I don't have a good recipe.  But when the picture came up I was surprised.  What we always referred to by as boyikos were something totally different - phyllo dough triangles stuffed with a sharp cheese (kashkaval, I think), egg and potato, or the cheese with egg and spinach.  I wonder if your wife can shed some light on this mystery!  :-)  Nonetheless, these look awesome . . . especially with the martini!",
      "parent": "0",
      "gravatar_hash": "56092ce0e0559a253d23526e1c99c7b4"
    },
    {
      "id": "47758",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-30 10:41:41",
      "content": "Funny, my wife and I were just talking about how these food names change as they move around... variations of the words \"sambusa\", \"boreka\", \"boyo\", \"empanada\" and so forth can mean radically different things in different countries, or sometimes even village to village.",
      "parent": "47757",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "47864",
      "author": "Bettina at The Lunch Tray",
      "author_url": "http://www.thelunchtray.com",
      "date": "2012-08-30 16:58:42",
      "content": "Interesting!  And here's also the problem of different spellings and family bastardizations of names.  For example, my family always referred to a ring-shaped, sesame-covered sweet biscuit as \"tahkies\" and only much later did I realize that was their shorthand for \"taralikus.\"  At any rate, just got a copy of Herbavoracious and, as a new vegetarian (since January), I'm enjoying it very much.  Maybe the next book should be a collaboration with your wife - a Sephardic vegetarian cookbook!  :-)",
      "parent": "47758",
      "gravatar_hash": "56092ce0e0559a253d23526e1c99c7b4"
    },
    {
      "id": "47884",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-30 17:52:05",
      "content": "Funny, we call those biscocco. It really is an impossible problem, you just have to know what they are called in your own environtment. Glad you are enjoying the book!!",
      "parent": "47864",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}