{
  "comment_count": 8,
  "comments": [
    {
      "id": "1064",
      "author": "Celeste @ Berrytravels",
      "author_url": "http://www.berrytravels.com",
      "date": "2010-06-15 19:15:39",
      "content": "thank you for sharing this! I have been at a loss on what to do with artichokes, never having grown up with it.. but still wanting to try it coz I want to try cooking everything I can at least once...\n\nIt's also fennel season here in aussie, so perfect timing!",
      "parent": "0",
      "gravatar_hash": "34bfbfaa30fa1235a4d2a826ea59f50a"
    },
    {
      "id": "1065",
      "author": "Jessica",
      "author_url": "http://www.thebitesizedblog.com",
      "date": "2010-06-15 19:15:47",
      "content": "Yum those artichokes look amazing, I love the recipe and the photos. Thanks for sharing!",
      "parent": "0",
      "gravatar_hash": "35394dffb0821a91a14e72fcdcce4a3b"
    },
    {
      "id": "1066",
      "author": "Gretchen",
      "author_url": "",
      "date": "2010-06-15 23:46:16",
      "content": "I wonder if it's possible to make artichoke stock?  They have a weird chemical in them that makes things you drink taste sweet, so I don't think they'd be a good idea in a routine stock, but it might make an interesting stock on its own.  That'd make it less painful to trim so much of them away!",
      "parent": "0",
      "gravatar_hash": "fe006711583259bbbee473673fa606f5"
    },
    {
      "id": "1067",
      "author": "siri",
      "author_url": "http://transplantedbaker.typepad.com",
      "date": "2010-06-17 23:45:04",
      "content": "If it were possible to even find baby artichokes in the markets here in Norway, I would be making this dish tonight. Looks that good!",
      "parent": "0",
      "gravatar_hash": "9ed286d838a2a548212c8d225a03f4cc"
    },
    {
      "id": "1068",
      "author": "Carla",
      "author_url": "",
      "date": "2010-06-18 09:57:10",
      "content": "Looks both elegant and as delicious as food could get.  Mmm...",
      "parent": "0",
      "gravatar_hash": "a06bca06d72337640a607ed0fd387543"
    },
    {
      "id": "1069",
      "author": "Jesse",
      "author_url": "http://www.revolutionaryfoodie.com",
      "date": "2010-07-03 17:33:38",
      "content": "Baby artichokes love love love to be fried too. I am a huge fan of fennel and would love to include some of the beautiful farmer's market baby fennel. Also, your use of vermouth reminds of working in a french brasserie.\n\nA recommendation to you: Recently, I put together a salad from the book URBAN ITALIAN; it consisted of fennel, white onions, orange zest, juice, extra virgin olive oil and mint. It was simply delicious.\n\nThanks for your posts.",
      "parent": "0",
      "gravatar_hash": "7f3b747b9db64bc45bdbe5247ad7e6f1"
    },
    {
      "id": "1070",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-07-06 15:20:55",
      "content": "That salad sounds delightful! It reminds me a little of one I make with orange segments, white onions, olives and lots of flat-leaf parsley.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1071",
      "author": "Christie",
      "author_url": "",
      "date": "2010-09-17 06:24:00",
      "content": "So incredibly delicious!!! I found and tried this recipe over a month ago and have been thinking about it since... so today I typed the ingredients in Google and found the site again! I just had it for lunch and I had to tell you just how much I enjoy it.  Thank you so much for sharing this recipe!! Delicious!",
      "parent": "0",
      "gravatar_hash": "a93d3a82e05e4c610329b859ab638b44"
    }
  ]
}