{
  "comment_count": 11,
  "comments": [
    {
      "id": "3450",
      "author": "Ben",
      "author_url": "http://yahoo.com",
      "date": "2008-06-19 07:21:23",
      "content": "Well, I may have a worthy contender for the best brownie recipe ever.  I lean towards the fudgey side of things, so I use the \"Katherine Hepburn family recipe\" from Gourmet.\n\nA question about the salt; Did you this because you left out the nuts or because the world doesn't use enough?",
      "parent": "0",
      "gravatar_hash": "8e94897d8bec178b14145d1f3d7b0d93"
    },
    {
      "id": "3451",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-06-19 07:40:40",
      "content": "Good question. It seems to me that most dessert recipes are just looking for enough salt to provide a neutral, non-flat flavor. I love the taste of good salt and chocolate or caramel, I think it really accentuates the flavor, so I find that doubling (within reason, and tasting along the way if in doubt) often works well.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3452",
      "author": "Trea",
      "author_url": "",
      "date": "2009-03-11 20:53:48",
      "content": "I've searched - but have never been satisfied until now. An amazing brownie recipe. So moist and chocolaty. Loved the way the salt flavor came through. I will definitely make this recipe again.",
      "parent": "0",
      "gravatar_hash": "a78502d3ca39f3ee4f899eab4646077f"
    },
    {
      "id": "3453",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-03-11 21:24:20",
      "content": "Thanks Trea, so glad you liked them!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3454",
      "author": "John",
      "author_url": "",
      "date": "2009-11-25 14:32:17",
      "content": "I can't believe you made the EXACT same modifications I did to the original Outrageous brownie recipe. I also used Medaglia D'Oro, vanilla and sea salt.  This formulation is one of the best!",
      "parent": "0",
      "gravatar_hash": "8d176aaa3eaef1340b757fbfe592bcef"
    },
    {
      "id": "3455",
      "author": "Ginny",
      "author_url": "",
      "date": "2010-12-27 01:38:44",
      "content": "This looks fantastic! But can I sub the egg yolks??? Thanks, I know many folk should be jolly happy to see this one! :)",
      "parent": "0",
      "gravatar_hash": "b099344df3355173420d3f09907a1054"
    },
    {
      "id": "3456",
      "author": "Jane",
      "author_url": "",
      "date": "2011-10-14 09:49:07",
      "content": "Well, for all the great ingredients, I have nothing but a cake crumb mess on my hands which I don't understand given the number of eggs and the short baking time (23 minutes).  My husband has urged me not to throw the mess away (which I can't afford to anyway), so I'm off to get some ice cream in order to sprinkle these 'spectacular' crumbs over!  Still hopeful as I love the writing/recipe ideas on this site!",
      "parent": "0",
      "gravatar_hash": "6a067a577f235bd9e947f26249ac625c"
    },
    {
      "id": "3457",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-14 09:57:04",
      "content": "Hey Jane - I&#39;m so sorry to hear you had problems with this recipe, it is one of my favorites! So when you say it is a cake crumb mess, does it seem like it is overbaked and dried out to the point where they are crumbs, or is underbaked so that it won&#39;t hold together? If the latter, is it possible that it just needs to cool a little more to set? Also, have you checked your oven temperature recently?\n\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "7991",
      "author": "Connie Bretz",
      "author_url": "http://www.slowcookingpot.com",
      "date": "2011-12-05 08:21:22",
      "content": "My familiy loves brownies and I can hardly wait to try this recipe.  It looks and sounds absolutely delicious. Thank You.",
      "parent": "0",
      "gravatar_hash": "583bcd328a95632568fb77fcbad53ca3"
    },
    {
      "id": "27528",
      "author": "Crimson Wife",
      "author_url": "",
      "date": "2012-06-16 07:47:24",
      "content": "I made a gluten- and dairy-free version of these by subbing all-purpose GF flour plus 1 tsp. of xanthan gum for the regular flour, subbing Earth Balance for the butter, and using vegan chocolate. The brownies came out significantly better than previous attempts at GF vegan brownies and got rave reviews at a potluck.",
      "parent": "0",
      "gravatar_hash": "5aa498e41c9aa4998b0ce155111efddc"
    },
    {
      "id": "27542",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-06-16 08:46:26",
      "content": "I've heard from a few folks that these adapt really well to gluten-free! Glad to hear they went over well.",
      "parent": "27528",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}