{
  "comment_count": 11,
  "comments": [
    {
      "id": "21659",
      "author": "Karen",
      "author_url": "http://www.karebou.com",
      "date": "2012-03-19 14:57:49",
      "content": "Hi Michael,\nI'm really liking your new video format. I'm not one to sit around and watch videos but I find your's are short, sweet and informative. A perfect combination!",
      "parent": "0",
      "gravatar_hash": "54dde47ff81d00baa17f418f0728a3c8"
    },
    {
      "id": "21660",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-19 15:00:48",
      "content": "Thanks, Karen! I have a pretty short attention span for videos too, so we tried to keep them as concise as possible while showing the essential moves for each dish or technique. More to come.",
      "parent": "21659",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21690",
      "author": "Jenné @ Sweet Potato Soul",
      "author_url": "http://www.sweetpotatosoul.com",
      "date": "2012-03-20 07:11:12",
      "content": "Yum, that looks good! Great video!",
      "parent": "0",
      "gravatar_hash": "ecbfd7cf05cb8055f0de5ba4cac789db"
    },
    {
      "id": "21721",
      "author": "Tim",
      "author_url": "",
      "date": "2012-03-21 10:17:20",
      "content": "Forgot how good this cornbread is. Thanks for leaving it at our house so we (I) could eat it all! Can you freeze cornbread and eat it later?",
      "parent": "0",
      "gravatar_hash": "3be665a1b71a31f3db2e0d1da71cf618"
    },
    {
      "id": "21722",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-21 10:19:30",
      "content": "Hey Tim - believe me, it pained me to leave a batch of cornbread behind :)! But I knew it was in good hands. Freezing it is... ok, not totally great. It has a tendency to suck moisture out of the bread. If you do freeze it, try to get as much air out of the bag as possible.",
      "parent": "21721",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21916",
      "author": "Joanna",
      "author_url": "",
      "date": "2012-03-23 08:13:33",
      "content": "Great video! I've made the cornbread recipe from your blog (not sure if it's the same as the book) many, many times, but I've never used the extra milk solids and you've convinced me to give it a shot!\n\nWhen I make it at home, I make a few slight modifications to your orignal recipe. First, I use sort of a shortcut for browning the butter - instead of doing this step on the stove, I put the butter in my 8x8 pan and let it sit in the preheating oven, and every few minutes I shake the pan a little. Then when it's brown enough, I pull it out and proceed with the rest of the recipe as written. It requires careful attention to get the timing right, but it's one less pan to wash, and it also serves to grease the cornbread pan! My second change is to sprinkle the top of the cornbread with a little coarse salt immediately before baking. Even my Texan friends have said it's some of the best cornbread they've ever had. With the added milk powder, it will be unbeatable!",
      "parent": "0",
      "gravatar_hash": "162fb33db8c91df1cb51af7780965c65"
    },
    {
      "id": "21918",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-23 08:21:59",
      "content": "That is a very clever trick, making the brown butter right in the oven. I'm not sure I would recommend it if you are going to do the non-fat milk solids since you need to strain them anyhow. But if you have a cast iron skillet, you could make the brown butter in it, strain it into the batter, wipe the pan a little, pour the batter back in it and bake in that. It comes out great. A double batch of the recipe fills a 12\" skillet perfectly. Nice idea about sprinkling a little coarse salt on it, too.",
      "parent": "21916",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22351",
      "author": "Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-04-01 20:01:40",
      "content": "Hi Michael, I made this bread today, but without the dry milk. Also, I used kefir instead of buttermilk. And I reduced the sugar amount to one tablespoon (husband doesn't like it too sweet) The cornbread was very good. I should have listened to your advise and made a double batch! I've made cornbread from different books and other sources,  but this one is a winner. Thank you! \nNow I have a question for you, not food related. It is a book related, I'd say. Are you planing on writing a book on blogging? Your blog is delicious in all ways: food, photography, design, layout, and most important, always working! I can always see you in my reader, the search engine is outstanding... Yes, I know you've worked for Adobe for so many years, which is a big PLUS. So, would be a great idea to share it in your next book with the bloggers and not. What do you think?",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "22353",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-01 21:22:57",
      "content": "Hey Marina - I'm glad the cornbread worked out well! As far as a book about blogging goes, I'm flattered but I doubt that is in my future! But if you have particular questions, I'm always happy to answer. I can definitely say it has been a long process of evolving each aspect, and it is always a work in progress.",
      "parent": "22351",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "23531",
      "author": "Diane",
      "author_url": "",
      "date": "2012-05-03 13:46:28",
      "content": "I love brown butter and have been wondering how to use it more. This is perfect!",
      "parent": "0",
      "gravatar_hash": "e11ad9d9294d42e5aef429da09146b29"
    },
    {
      "id": "23888",
      "author": "Sanitär Werkzeug",
      "author_url": "http://weko-sanitaershop.de/sanitaerwerkzeug",
      "date": "2012-05-14 03:47:32",
      "content": "Nice, i like the taste of brown butter and was looking for some recipies and ways to use it a bit more.\n\nThis Video  was pretty helpful!!",
      "parent": "0",
      "gravatar_hash": "4c3c03ba1bf7bb1b5d84ae1839fe2e0b"
    }
  ]
}