{
  "comment_count": 18,
  "comments": [
    {
      "id": "1506",
      "author": "Chris",
      "author_url": "http://pieofthetiger.com",
      "date": "2010-01-18 12:55:34",
      "content": "Thank you.  I was looking for something to do with the brussles sprouts that are sitting in my fridge.  I guess they'll be dinner tonight.",
      "parent": "0",
      "gravatar_hash": "069d8ba1caa3461b1f9c52f1bb6f6c45"
    },
    {
      "id": "1507",
      "author": "Ivy Manning",
      "author_url": "http://blog.ivymanning.com",
      "date": "2010-01-18 14:56:42",
      "content": "All I need is this gratin, a blanket, a remote control, and a fork and this pneumonia will be vanquished. Wait, I take that back. I don't need the fork. Could you put some of this in a padded envelope and send it to Portland? Please?",
      "parent": "0",
      "gravatar_hash": "398d9a223280b1350d4db253ecccefe3"
    },
    {
      "id": "1508",
      "author": "zoe",
      "author_url": "http://thezoeblog.blogspot.com",
      "date": "2010-01-18 15:49:27",
      "content": "I love the sound of this gratin. Brussel sprouts are amazing!",
      "parent": "0",
      "gravatar_hash": "da95b6426c43d00947a19567a7b28d12"
    },
    {
      "id": "1509",
      "author": "Marla",
      "author_url": "http://www.familyfreshcooking.com",
      "date": "2010-01-18 18:21:52",
      "content": "This is a great recipe!!  Your photo grabbed me on Tastespotting!  I love that you proudly admit to using the microwave with these babies.  I too soften my brussels sprouts up with the good old mv.  Sometimes you just gotta go there.  The crunch with these sprouts must be grand :)",
      "parent": "0",
      "gravatar_hash": "f8335a64d561f273b44ad0fb5ced3703"
    },
    {
      "id": "1510",
      "author": "Christine @ Fresh Local and Best",
      "author_url": "http://freshlocalandbest.blogspot.com",
      "date": "2010-01-18 22:14:45",
      "content": "This is an interesting technique, I'm looking forward to trying it!",
      "parent": "0",
      "gravatar_hash": "e835a029822cedf812386dc60ac4c2cb"
    },
    {
      "id": "1511",
      "author": "John - Mormon Foodie",
      "author_url": "http://mormonfoodie.blogspot.com",
      "date": "2010-01-18 23:11:01",
      "content": "I love using my microwave to jump start cooking on grilled potatoes. I'm not a huge Brussels spout fan, but wife and oldest daughter sure are. Knowing how amazing your recipes normally are, Michael, I'm definitely going to give this one a try. Maybe you can covert me to Brussels spouts.",
      "parent": "0",
      "gravatar_hash": "0750826129ee44caebb3eba7010ade18"
    },
    {
      "id": "1512",
      "author": "John",
      "author_url": "",
      "date": "2010-01-19 05:09:39",
      "content": "The microwave is great for MANY veggies. One of my favorite tricks: \"par cooking\" in the uWave. For example, when we make something sort of fajita-like at my place, the peppers get cooked separately. They take forever. But 5 min in the uWave, while the onions are getting sauteed, and they're 80% done.\nOther things that work really well in the microwave: asparagus (yep! I like it steamed, too, and grilled. But I actually prefer the results I get from the microwave. The only tricky bit is timing: if you cook a whole fistful, it takes about 5 min in my (smallish) oven. If you cook 5 spears for 5 min, you'll end up with charcoal.); broccoli (put the stem-parts up and the florets down -- the beam's higher intensity mid-oven, and this balances the cooking nicely); chard (to pre-wilt it enough to make it fit in the frying pan); corn on the cob; the list goes on and on. And brussels sprouts are terrific. Even if you're going to roast or pan-fry them to get that browned-and-nutty flavor, a pre-cook in the microwave can help out.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "1513",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-19 08:14:34",
      "content": "@John, @John &amp; @Marla - Good to see other folks &quot;owning&quot; the microwave! I think it is a great kitchen tool when you understand how it works and what it can and can&#39;t do well. Nice tip about the broccoli, getting the stems into the higher intensity beam.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1514",
      "author": "Cajun Chef Ryan",
      "author_url": "http://cajunchefryan.rymocs.com/blog2/recipes/florentine-omelet/",
      "date": "2010-01-19 09:37:01",
      "content": "There is not one restaurant that I worked in that did not have a microwave stationed somewhere in the kitchen. Most uses for defrosting or heating up small batches of items. And typically in dessert stations for \"quick\" heating of single portions for hot dessert menu items.",
      "parent": "0",
      "gravatar_hash": "9f3b5ef4294bafb575b419690b0d278d"
    },
    {
      "id": "1515",
      "author": "Dawn (KitchenTravels)",
      "author_url": "http://www.kitchentravels.com",
      "date": "2010-01-19 11:28:19",
      "content": "Visiting for the first time via Tastespotting. This dish looks and sounds really delicious. The heresy of your technique is genius. ;)",
      "parent": "0",
      "gravatar_hash": "cdd3b28114324aafd93b1030244c92b7"
    },
    {
      "id": "1516",
      "author": "Stacy",
      "author_url": "",
      "date": "2010-01-20 15:48:15",
      "content": "I'd like to take this to my aunt's house for dinner, but I'm worried about transportation, as she lives an hour away and the most I can hope for is a little oven reheating time. Do you think doing everything but adding the breadcrumbs prior to departure and finishing it an hour later would be feasible?",
      "parent": "0",
      "gravatar_hash": "edb81bc5b512fcb6a2236f99960e3bbf"
    },
    {
      "id": "1517",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-20 16:17:15",
      "content": "@Stacy - I think that would be fine. Just before dinner, reheat the sprouts + reduced cream in the microwave so it happens more quickly, and then just add the breadcrumbs and broil for a minute or two to finish.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1518",
      "author": "Heidi from Savory Tv",
      "author_url": "http://www.savory.tv",
      "date": "2010-01-21 21:22:20",
      "content": "Ha! Laughing at the Paul Bocuse comment and pic!  Thanks for the tip, love sprouts.",
      "parent": "0",
      "gravatar_hash": "fd51c52f966705863d77d8559c508a32"
    },
    {
      "id": "1519",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-21 22:03:31",
      "content": "@Heidi - I&#39;m glad someone appreciated that pic! He looks downright ornery there, doesn&#39;t he?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "74298",
      "author": "Tim Roth",
      "author_url": "",
      "date": "2012-11-04 20:34:17",
      "content": "Just tried this, because I happened to catch Michael demonstrating it on PBS. Great results! And steamed the sprouts to al dente first vs. microwaving. This worked just fine.\n\nThanx Michael!",
      "parent": "0",
      "gravatar_hash": "79c9d7c0973fb9e13b477a39258e00d5"
    },
    {
      "id": "74302",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-11-04 20:47:47",
      "content": "Glad you liked it, Tim! And for sure, steaming is a fine alternative.",
      "parent": "74298",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "83666",
      "author": "Jessica Petersen",
      "author_url": "http://pieofthetiger.com/",
      "date": "2012-11-20 22:39:30",
      "content": "We made this recipe a few times right after you first posted it and loved it.  Having been reminded of it, we're planning to make it for Thanksgiving to take to my in-law's house, about 40 minutes away.  Would you recommend assembling it but waiting to bake it until we get down to their house, or baking it at home and reheating?  We never had leftovers when we made it before, so we have no idea if it reheats well.  :)",
      "parent": "0",
      "gravatar_hash": "460046f4c5d2c997024c260e6d2ebfc4"
    },
    {
      "id": "83675",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-11-20 23:05:41",
      "content": "My preference would be to assemble it at home and bake at their house; I think you'll have more control that way. You might want to leave the breadcrumbs off and add them after the cream has started bubbling.",
      "parent": "83666",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}