{
  "comment_count": 23,
  "comments": [
    {
      "id": "2029",
      "author": "Ivys Manning",
      "author_url": "http://ivysfeast.blogspot.com",
      "date": "2009-09-08 18:25:38",
      "content": "Nice! Gotta love the thwump! I once made 30 of them for a catering gig and I did something wrong. They came out okay, but there was about 1/2inch of hardened caramel stuff at the bottom of each ramekin! What a nightmare. I had to soak them with boiling water to get the gunk out. Maybe I'll give it another go around with Rick's recipe. He writes good recipes.",
      "parent": "0",
      "gravatar_hash": "398d9a223280b1350d4db253ecccefe3"
    },
    {
      "id": "2030",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-09-08 19:36:44",
      "content": "He (Rick Bayless) totally does write good recipes. I really haven't made\nanything from his books that was less than superb. I felt certain he would\ndo well if not win Top Chef Masters just based on how killer his flavors\nare, not to mention the rock solid techniques, and sure enough.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2031",
      "author": "Sara",
      "author_url": "",
      "date": "2009-09-08 19:59:54",
      "content": "I have eaten a lot of flan and this truly was the best evah. Thank you! Feel free to try this in ramekins, too, if you ever are curious to see if the recipe works as well ;)",
      "parent": "0",
      "gravatar_hash": "cc577de9e5547e7e34f35469619cbc34"
    },
    {
      "id": "2032",
      "author": "John - Mormon Foodie",
      "author_url": "http://mormonfoodie.blogspot.com",
      "date": "2009-09-08 21:47:38",
      "content": "I love a good flan, and this one looks amazing. Passing it through a sieve a few times is a brilliant idea. I suspect it makes things even smoother and creamer. Thanks for sharing.",
      "parent": "0",
      "gravatar_hash": "0750826129ee44caebb3eba7010ade18"
    },
    {
      "id": "2033",
      "author": "Heidi from Savory Tv",
      "author_url": "http://www.savory.tv",
      "date": "2009-09-09 12:42:40",
      "content": "That's killer.   Curious, have you tried his other cookbooks?  I want to buy one, but am torn between \"Authentic Mexican\" and \"Mexican Everyday\".",
      "parent": "0",
      "gravatar_hash": "8df69726817340788eb79927ee9067f8"
    },
    {
      "id": "2034",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-09-09 13:45:26",
      "content": "@heidi - I have both those books, and seriously, you need them both if you\nlove to cook Mexican food. The approaches are significantly different. What\nI'll often do is first look in Authentic Mexican to come up with a basic\nidea that might be a little much to execute, or too meaty to modify for my\ntaste. Then I'll look at Mexican Everyday to see how he has updated similar\ndishes. Then I'll synthesize the two to come up with what I'm finally going\nto cook. I'll throw Diana Kennedy into that mix a lot of times too.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2035",
      "author": "Kate",
      "author_url": "",
      "date": "2009-10-13 10:36:49",
      "content": "Can creme caramel be made the day before a dinner party?  It is suggested above to \"cool\" the flan thoroughly - should this be done in the fridge?  Does this make it more difficult to turn out at the end?  Any suggestions welcome!!",
      "parent": "0",
      "gravatar_hash": "225bd2525a5489a9767028b4a0156c06"
    },
    {
      "id": "2036",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-13 10:47:12",
      "content": "You can absolutely make it the day before. Yes, cooling should be done in the fridge. I didn&#39;t have any problem turning it out, but if you do, you can warm the bottom of the serving dish in a warm water bath for a few moments to loosen the caramel.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2037",
      "author": "JennEM",
      "author_url": "",
      "date": "2010-01-10 06:28:51",
      "content": "Hi. Just to say that I am enjoying your blog, which I just discovered.  Thks for highlighting Rick Bayless' recipe for Flan. I bought his book for some time, but have not tried any recipes yet from it - not easy to get those wonderful Mexican ingredients where I live.\n\nI am an egg worshipper (think it is one of nature's miracles for cooks) and love flan. What is wonderful, is that there are a million and one ways to make it. Flan is basically the Spanish word for creme caramel (which is French).  BTW, the Spanish claim that Creme Brulee was invented by Catalonians - not the French - . In Spain, it is known as Crema Catalana - But I digress (happens whenever food is the subject!).\n\nThe best flan I have ever had was made by a Brazilian chef. It had the most amazingly delectable, rich  texture and mouth feel. I believe it was due to a large number of extra egg yolks. Look's like Bayless has followed the same idea. This spurs me to try his recipe.\n\nTo share: I live in South Asia. We have a traditional egg custard using coconut milk and jaggery (palm sugar - similar, but richer than brown sugar) in lieu of milk and sugar, as well as spices such as cardamom, clove and cinnamon and cashews thrown in. Another great custard with an amazing fragrance.  Thks again, JennEM",
      "parent": "0",
      "gravatar_hash": "6339174918a1d12b422e85b6857545a1"
    },
    {
      "id": "2038",
      "author": "cathy",
      "author_url": "",
      "date": "2010-03-29 05:45:51",
      "content": "I have to make creme brulee for my practical , it came out crumbly , is that because it needs to cook a little longer?",
      "parent": "0",
      "gravatar_hash": "b2c713888e4317d6e7a781162702d10a"
    },
    {
      "id": "2039",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-03-31 05:50:24",
      "content": "&quot;Crumbly&quot; to me sounds like it either had the wrong ratio of liquid to egg or was overcooked or at too high a temperature so that you got some scrambled eggs in there. Did you use a hot water bath to control the temperature?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2040",
      "author": "Ma",
      "author_url": "",
      "date": "2010-04-14 10:47:02",
      "content": "That looks so delicious! I must make it for my husband and kids. Roughly how many calories is in this dish?",
      "parent": "0",
      "gravatar_hash": "dfd5c66044c0c6a0b8256968920c9414"
    },
    {
      "id": "2041",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-04-14 11:42:14",
      "content": "@Ma - approximately 900,000 calories per serving! And worth every one.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2042",
      "author": "Lindsay",
      "author_url": "",
      "date": "2011-08-07 17:55:58",
      "content": "What kind of dish did you use? I have seen that the glass dishes will break because of the difference in temperature....",
      "parent": "0",
      "gravatar_hash": "4c214eb5cff369c2d723d867c1129d6a"
    },
    {
      "id": "2043",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-08-07 21:23:21",
      "content": "Hey Lindsay - I used a CorningWare type white ceramic dish. Seems to work just fine.\n\n\nThanks,\nMichael\n\n\n\n\n\n<u></u>\n\n\n\n\n\n\n\n<img height=\"53\" src=\"cid:1312764959.DFC7Db882.29267@oak-tp-worker004\" width=\"640\" />\n\n\n\n\n\n<img height=\"1\" src=\"cid:1312764959.a5CbBc00.29267@oak-tp-worker004\" width=\"1\" />\n<img height=\"1\" src=\"cid:1312764959.a5CbBc00.29267@oak-tp-worker004\" width=\"1\" />\n<img height=\"1\" src=\"cid:1312764959.a5CbBc00.29267@oak-tp-worker004\" width=\"18\" />\n\n\n\n\n<img height=\"10\" src=\"cid:1312764959.a5CbBc00.29267@oak-tp-worker004\" width=\"600\" />\n\n\nHi Michael Natkin,\nLindsay (Lreine01@yahoo.com) has left you a comment:\n\n\nWhat kind of dish did you use? I have seen that the glass dishes will break because of the difference in temperature....\n\n\n\n<b>Status:</b> Published\n\n\n<b>Options:</b>\nUnpublish",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "4573",
      "author": "Miranda",
      "author_url": "",
      "date": "2011-11-24 16:26:59",
      "content": "Hi Michael,\n\nWhat does the water do for the sugar?  I've always just heated sugar by itself until it melts.  It does take forever, though, so perhaps the water speeds the melting process?\n\nThanks,\n\nMiranda",
      "parent": "0",
      "gravatar_hash": "fdedf163e59673802e097cf815c2910b"
    },
    {
      "id": "4705",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-11-25 13:52:02",
      "content": "That's a great question, Miranda. I know it is referred to as a wet caramel as opposed to dry, but obviously all the water cooks off before it caramelizes. It may have something to do with the crystals, or maybe just evening out the cooking. I'll ask some pastry chef friends and get back to you.",
      "parent": "4573",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22899",
      "author": "Kayla",
      "author_url": "http://Beurrejaune.tumblr.com",
      "date": "2012-04-16 12:45:39",
      "content": "I just took my flan out of the oven and it looks wonderful! The tip for passing the custard thought the sieve really made a difference! Thanks!!!",
      "parent": "0",
      "gravatar_hash": "6a56f9bc5a633194f7c5331c75716c61"
    },
    {
      "id": "22915",
      "author": "Kayla",
      "author_url": "http://Beurrejaune.tumblr.com",
      "date": "2012-04-16 20:02:10",
      "content": "Just an update. My mom says it was perfect and that she could eat everyday. The texture came out perfect - no holes! Velvety and smooth! Thanks again!",
      "parent": "0",
      "gravatar_hash": "6a56f9bc5a633194f7c5331c75716c61"
    },
    {
      "id": "34971",
      "author": "Luchie",
      "author_url": "",
      "date": "2012-07-07 03:07:22",
      "content": "how much exactly is 6 1/2 c of milk in grams or ml?\nI always have difficulty in converting measurements 'coz I feel it more precised to use weighing scale when baking. And this time I really need to turn this creme caramel  just like how gorgeous yours turned out. I need to make big batches as we will be serving 100 guests in the hotel.\n\nplease help. Appreciate it very much",
      "parent": "0",
      "gravatar_hash": "06878e01fc7cfd752d635d238e21c120"
    },
    {
      "id": "35020",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-07 07:18:50",
      "content": "6.5 cups = 1537 ml or about 1690 grams (milk being heavier than water)\nBe sure and make some test batches before scaling up to serve 100, especially if you are going to be doing it in ramekins. Enjoy!",
      "parent": "34971",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "971602",
      "author": "Nina",
      "author_url": "",
      "date": "2014-07-19 21:10:36",
      "content": "Is it ok if I use ultra-fine/fine sugar instead of regular sugar? Will using less eggs affect the outcome? Because my family isn't really a fan of eggs.thanks!",
      "parent": "0",
      "gravatar_hash": "5ce20f8a6246670b520b989fec205651"
    },
    {
      "id": "972372",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-07-20 19:58:02",
      "content": "Fine sugar (aka caster sugar) is just fine; I wouldn't use powdered sugar though. Using less eggs won't go well, they are what sets the custard - use less and it will be too liquid.",
      "parent": "971602",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}