{
  "comment_count": 14,
  "comments": [
    {
      "id": "687",
      "author": "Renai",
      "author_url": "http://www.areyoumyghost.com",
      "date": "2010-12-27 16:02:24",
      "content": "Michael these are gorgeous!  I've been on a major chili kick this season and haven't quite found the perfect accompaniment.  I can't wait to try this recipe!",
      "parent": "0",
      "gravatar_hash": "f65e8f244d32bf2e7fe101bc026edc0f"
    },
    {
      "id": "688",
      "author": "Summer Mishler",
      "author_url": "http://profile.typepad.com/summermishler",
      "date": "2010-12-27 16:07:55",
      "content": "Yum!\nLooks great, I've been craving southern food from home. It's hard for me to find/make here in Bolivia where I'm living. I think I'll try and make the spoon bread this week. The only problem is the buttermilk. They have plain yogurt that's supper runny, almost the consistency of buttermilk. Do you think that would be an ok substitute? Thanks for the great recipe as usual!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "689",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-12-28 16:45:56",
      "content": "Thanks, Renai! Let me know if you make them... I think the key to having them be delicious is to bake them just enough to set but not any extra.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "690",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-12-28 16:46:37",
      "content": "Hmm, I&#39;m not completely sure whether a thin yogurt will substitute well for buttermilk in this recipe. If you try it, let me know!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "691",
      "author": "alessandra@clear.net.nz",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2010-12-28 23:16:14",
      "content": "It looks interesting, I cannot imagine the taste... a bit like polenta???",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "692",
      "author": "Carolyn Jung",
      "author_url": "http://www.foodgal.com",
      "date": "2010-12-29 08:51:09",
      "content": "I've made spoonbread once or twice before, but yes, it's always been in one big casserole-type dish. I like these individual ones so much more. They are so precious looking and make what's inside even more special.",
      "parent": "0",
      "gravatar_hash": "a9b8ca76dd8ef8419ce48533a28f4900"
    },
    {
      "id": "693",
      "author": "Lael Hazan @educatedpalate",
      "author_url": "http://www.giulianohazan.com/blog",
      "date": "2010-12-29 10:11:52",
      "content": "Your first line made me smile and your last paragraph made me want to buy individual ramekins!  I guess it is time to finally break down and get them!",
      "parent": "0",
      "gravatar_hash": "3f513a08ba12dd91fd9177912008f47a"
    },
    {
      "id": "694",
      "author": "Tofu Mom",
      "author_url": "http://tofu-n-sproutz.blogspot.com/",
      "date": "2010-12-29 21:18:11",
      "content": "You're going to cringe in horror but I'm gonna attempt these... (or a version of these, because ultimately they won't really be the same at all) and make 'em vegan. (Yes, yes, i know - I HATE it when someone takes a perfectly good version of one of my recipes and says \"I'm going to make this but totally change up the ingredients so it's nothing like what you intended...)\nSo, I guess in reality, you've INSPIRED me to try a vegan Corn Pudding because I got these darling little ramekins for Christmas that I've been DYING to use...\nObviously the buttermilk won't be there and soured/acidulated plant milk works for some things but I'll have to experiment here... (*thinking*)I've done rice-pudding, bread-pudding and corn spoonbread all vegan, so I think I can incorporate some of those ideas, yeah, OK, I'll shut up until I let you know how it turns out - IF it turns out) and obviously I won't mess your statistics by filling out the survey - heh!",
      "parent": "0",
      "gravatar_hash": "1a0b4a32e20aa0dec8b1491f2bea1ad6"
    },
    {
      "id": "695",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-12-29 21:21:48",
      "content": "Hey Tofu Mom - it seems pretty reasonable to me that you could make a good vegan version of this. I&#39;d think in terms of whatever you&#39;ve used to make your best vegan custards before. Do let me know how it turns out!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "696",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-12-29 21:57:28",
      "content": "Yep, I reckon that&#39;s right... kind of a cross between polenta and custard or souffle.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "697",
      "author": "Tanya",
      "author_url": "",
      "date": "2010-12-30 07:16:10",
      "content": "I just made these. (Yeah, I couldn't wait and I had extra buttermilk lying around). They are AMAZING. Thanks!",
      "parent": "0",
      "gravatar_hash": "daf13c57aa1f40808b3979a7a76f4a53"
    },
    {
      "id": "698",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-12-30 19:50:02",
      "content": "Hey Tanya - I&#39;m so glad you liked them, and thanks for tweeting about them as well!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "699",
      "author": "Dina",
      "author_url": "http://huntingfortheverybest.wordpress.com",
      "date": "2010-12-31 10:39:50",
      "content": "ooh great recipe.  still looking for more buttermilk recipes and this is perfect.  i'm going to make it this weekend!",
      "parent": "0",
      "gravatar_hash": "3a97f25dd42a8d4ab5921833d593f877"
    },
    {
      "id": "700",
      "author": "John",
      "author_url": "",
      "date": "2011-01-04 19:16:38",
      "content": "Great stuff. We all loved them. I think that next time I'd use a less salt than you did -- maybe 1t instead of 2t -- but then again I'm more salt-averse than most folks. The spoonbread itself was amazingly light and fluffy, with that corn-pudding sort of center that was just great.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    }
  ]
}