{
  "comment_count": 6,
  "comments": [
    {
      "id": "1625",
      "author": "Draco",
      "author_url": "",
      "date": "2009-12-10 18:43:22",
      "content": "Good luck with the show! I hope you make it. I've made several of your recipes & think that having a voice for vegetarianism on TV that can prove that we eat well & make delicious food would be great. I almost auditioned for the last season of Hell's Kitchen myself, but chickened out.",
      "parent": "0",
      "gravatar_hash": "d1b0fe8126817b097da7ab766938d457"
    },
    {
      "id": "1626",
      "author": "A&amp;N",
      "author_url": "http://reluctantchefs.blogspot.com",
      "date": "2009-12-10 20:28:25",
      "content": "Good luck! :) It will be great fun to watch you! Do let us know.\n\nAnd - I adore cauliflower though I do find Frittatas a little eggy, but this is an idea!",
      "parent": "0",
      "gravatar_hash": "50de5463f411bb5bad4710eb70af07f3"
    },
    {
      "id": "1627",
      "author": "Suzanne",
      "author_url": "",
      "date": "2009-12-12 03:53:08",
      "content": "Good luck with teh show. It rated really well over here in Australia earlier in the year and has rated well in the UK for a few years.  We had one vegetarian get through to the top 50 but she didn't make the top 20. Be prepared for taste tests (and yes it will most likely have meat in it, so know your smells if you won't eat it!).  If you make the top 20 and get onto the show then if they follow the same format there will be mystery box challenges, which can contain anything.  Usually 5 or 6 ingredients.  The invention test, which was often themed and there was one core ingredient that was used.  And the bottom three each week had to do the pressure test, which was the same recipe for all three and the best two tasting got to stay.  This got harder and harder as the show went on.  In the last couple of weeks they had 2 hours to make a crochenbush.\n\nHad never thought of using cauliflower in a savoury way, might have to try this! Thanks.",
      "parent": "0",
      "gravatar_hash": "e95750c132d32107fa4c89808694bf50"
    },
    {
      "id": "1628",
      "author": "Sheilah Schneider",
      "author_url": "http://www.ssheilah.com",
      "date": "2009-12-12 16:11:31",
      "content": "I've been reading your blog for a while -- always interesting and informative, and wonderful recipes! I was particularly interested in and impressed by your essay on why you are vegetarian. It surprises me that someone as thoughtful as you seem to be would be willing to associate with Gordon Ramsey. According to his wikipedia article ( <a href=\"http://en.wikipedia.org/wiki/Gordon_Ramsay\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Gordon_Ramsay</a> ) he says he has lied to vegetarian diners to \"conceal the presence of chicken stock in his soup.\" This is someone you want to work with?",
      "parent": "0",
      "gravatar_hash": "24f14e095c4449e8333a6c2f19198782"
    },
    {
      "id": "1629",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-12-12 20:36:08",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\nThanks for the note, Sheilah, and I&#39;m glad you like the blog. Well, that GR event you describe (and which if you follow the footnotes you can learn about in more detail) is rotten for sure and I certainly don&#39;t condone it. I also wouldn&#39;t rule out being on his show based on that one incident. Parenthetically, I&#39;ve watched quite a few episodes of Kitchen Nightmares and he very often helps people in rather dire straits to get their restaurants and lives back together - even if it does often involve a lot of bluster.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1630",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-12-12 20:46:49",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\nThanks for the detailed info about the show! I clearly should watch some of the UK and Australian episodes on the web.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}