{
  "comment_count": 16,
  "comments": [
    {
      "id": "66667",
      "author": "Emma",
      "author_url": "",
      "date": "2012-10-22 07:45:12",
      "content": "REALLY excited to get this email today!  I've been vegetarian for upwards of 20 years now, and one of the few things I miss is panna cotta so I'm thrilled.  (Incidentally, one of the few others is bacon, so I'm looking forward to trying out the butternut squash \"bacon\" in Dirt Candy, which I picked up this weekend.)  Thanks. :)",
      "parent": "0",
      "gravatar_hash": "3f544d7c14fe3a18aa646cd7c9ded030"
    },
    {
      "id": "66748",
      "author": "Elizabeth",
      "author_url": "",
      "date": "2012-10-22 10:30:20",
      "content": "I know that Eden makes a kosher agar agar. How to determine strength? I've always wanted to try panna cotta but the kosher gelatin thing is a challenge. And using the fish gelatin powder (no sheets as far as I know) gives off a slightly fishy smell...",
      "parent": "0",
      "gravatar_hash": "092b0bbf27d85dd63e97707b9569fc45"
    },
    {
      "id": "66765",
      "author": "Gourmandelle",
      "author_url": "http://gourmandelle.com",
      "date": "2012-10-22 11:05:35",
      "content": "It looks so good! I love banana desserts.",
      "parent": "0",
      "gravatar_hash": "70d21c39ab6c2b8392c262be075db803"
    },
    {
      "id": "67020",
      "author": "Maureen | Orgasmic Chef",
      "author_url": "http://www.orgasmicchef.com",
      "date": "2012-10-22 21:46:38",
      "content": "It's got to have that perfect wiggle.  A lot of things are like that.  Or so my husband says.",
      "parent": "0",
      "gravatar_hash": "3648105a666a70d5e02acb5cba6d5370"
    },
    {
      "id": "67387",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-23 11:12:36",
      "content": "Hey Elizabeth - if you can't use the Telephone brand that I've tested with, you'll probably just have to make a test batch and then adjust. You could start with a half batch. It is very helpful to have a scale that can measure in tenths of a gram to calibrate ingredients like this that are used in very small quantities.",
      "parent": "66748",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "67425",
      "author": "Betty Ann @Mango_Queen",
      "author_url": "http://www.asianinamericamag.com",
      "date": "2012-10-23 12:13:30",
      "content": "What a delightful recipe for panna cotta. I regularly use an \"agar-agar\" bar for my Filipino and Asian desserts. Filipinos call it \"gulaman\". It is available in Asian groceries, by the Philippine aisle. You must have seen this already, it is a long, rectangle bar measuring about 10 inches. I boil a cup of water and then tear the gulaman/ agar-agar bar by hand, then throw it in the boiling pot. It melts in a few quick minutes, then I pour it in a glass container to firm up. It firms up quickly, sometimes even while still hot. I've cooked with gulaman ever since I first started helping in the kitchen as a child. I add a few tablespoons per bar to sweeten it for desserts. But thanks for sharing this recipe, Michael!",
      "parent": "0",
      "gravatar_hash": "2f47cf20944759bec2f5c79ae8ee733f"
    },
    {
      "id": "67429",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-23 12:17:18",
      "content": "Hey Betty Ann - Indeed, I know well the agar bars you mean. Personally I prefer the powder because the gel strength is very predictable and I can adjust it down to tenths of a gram as needed, but the bars are a fine option as well - especially for firm gels where the precise texture isn't as critical as it might be for panna cotta.",
      "parent": "67425",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "67675",
      "author": "Craig",
      "author_url": "",
      "date": "2012-10-23 19:18:14",
      "content": "I am learning how to cook.  This sounds advance for first-time cooks.  LOL  Anyone in the Washington DC area can assist me with preparing this dish? LOL",
      "parent": "0",
      "gravatar_hash": "a17b875e70ee364dfbb1ff672ac5d914"
    },
    {
      "id": "68089",
      "author": "Jessica Fialkovich",
      "author_url": "http://www.foodwinefashion.com",
      "date": "2012-10-24 09:20:45",
      "content": "This is great! I'm always looking for new vegetarian desserts, as my mother is pretty strict about it. I'm going to have to try this, especially love the bourbon sauce.",
      "parent": "0",
      "gravatar_hash": "54824a120dd06ebb18b7a97c37a53d60"
    },
    {
      "id": "68709",
      "author": "Rachelle King",
      "author_url": "http://www.blindedbythebite.com",
      "date": "2012-10-25 09:22:35",
      "content": "I got to taste this luscious dessert last night at a class Michael was teaching here in Austin at Whole Foods Market.  I am not a big fan of Panna Cotta but this was delicious and I loved the Bourbon sauce!",
      "parent": "0",
      "gravatar_hash": "8911e59281727bc19121b2c5960542b4"
    },
    {
      "id": "69232",
      "author": "Katherine Martinelli",
      "author_url": "http://www.katherinemartinelli.com",
      "date": "2012-10-26 11:55:23",
      "content": "I love the flavor combination! While I've made panna cotta, I've never used agar - must try! Thanks for the tips.",
      "parent": "0",
      "gravatar_hash": "77cbf18926e13167a62ef95f9dc0f7cf"
    },
    {
      "id": "71731",
      "author": "Radhika @ Just Homemade",
      "author_url": "http://justhomemade.net",
      "date": "2012-10-31 10:16:16",
      "content": "Awesome! Thrilled to see this \"vegetarian\" panna cotta. Not many come egg-less.\nAgar agar makes such lovely desserts possible for people like me.\nI'm sure the caramelized banana flavor must have been as exotic as it sounds!",
      "parent": "0",
      "gravatar_hash": "29c9dbaa92cda56f546b80d2defbe788"
    },
    {
      "id": "89876",
      "author": "Tessa",
      "author_url": "http://feralkitchen.com",
      "date": "2012-11-29 20:21:02",
      "content": "Beautiful photo and lovely recipe!",
      "parent": "0",
      "gravatar_hash": "187442291ab193b1021833a9d9b611d5"
    },
    {
      "id": "147696",
      "author": "Charles Pennington",
      "author_url": "http://njmoldmanagement.com/",
      "date": "2013-05-15 16:22:49",
      "content": "This appears to be what they call Flan in Spanish country's such as Mexico. I never considered trying it with Bourbon. I grew up in Kentucky so I consider myself a Bourbon aficionado. Id suggest Woodford Reserve if you can find it, its silky smoth and goes great with deserts.",
      "parent": "0",
      "gravatar_hash": "420d4875d5d402cfacbaefd081d352b1"
    },
    {
      "id": "147707",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-15 17:01:19",
      "content": "I'm a Kentucky boy too, nice to hear from a homey! The main difference is that flan is set with eggs, traditional panna cotta is set with gelatin, and this variation is set with agar. No argument from me on Woodford Reserve, definitely tasty stuff.",
      "parent": "147696",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314534",
      "author": "juliette",
      "author_url": "",
      "date": "2018-06-21 06:10:07",
      "content": "Hello\n\nThank you for the recipe, just wanted to share that I often combine cornstarch and agar agar to get a not too gelly like texture for some flan or custards to replace eggs.",
      "parent": "0",
      "gravatar_hash": "0f0b8f3d610a25ff93411321ffaaf038"
    }
  ]
}