{
  "comment_count": 11,
  "comments": [
    {
      "id": "129828",
      "author": "Mary",
      "author_url": "",
      "date": "2013-03-25 09:46:35",
      "content": "Hi Michael- way to go, you deserve the award, your cookbook is great.  I love all the recipes.  Mary",
      "parent": "0",
      "gravatar_hash": "99d631e89ba6b628b44d74e2db19e19a"
    },
    {
      "id": "129830",
      "author": "Nathan Kingsley",
      "author_url": "",
      "date": "2013-03-25 10:00:42",
      "content": "Congratulations!\n\nI love my copy of your book. I can't always find all of the unique ingredients for a recipe but it gives me a lot of great ideas- and that's what a cookbook is for.",
      "parent": "0",
      "gravatar_hash": "ed9825d0e4d0f40998296bceab3656c2"
    },
    {
      "id": "129836",
      "author": "Sandy",
      "author_url": "",
      "date": "2013-03-25 10:59:32",
      "content": "Congratulations!\nAnother benefit of freezing blue cheese:  If you like blue-cheese dressing (or a sprinkle of it on a standard tossed salad) but don't like huge, overwhelming LUMPS of it, freezing the block and shaving it with a *serrated* knife (like a coarse serrated knife, or Rada's \"tomato slicer\") will yield a snow-like drift of powder, much more subtle in flavor.  I discovered this in Jr. High School - salads were my dinner job.",
      "parent": "0",
      "gravatar_hash": "08b4d0e5fa36d027ffb36baf85fdf3e7"
    },
    {
      "id": "129852",
      "author": "Quinn Cooper",
      "author_url": "http://quinncooperstyle.com",
      "date": "2013-03-25 11:55:08",
      "content": "Wow! Congratulations on the nomination! \nThis recipe looks great, can't wait to try this out. I'm really interested about the frozen blue cheese, sounds pretty weird, but I'm definitely going to give it a try.",
      "parent": "0",
      "gravatar_hash": "c7af8008e6002d3be73a8fe487d07792"
    },
    {
      "id": "129856",
      "author": "Martin",
      "author_url": "",
      "date": "2013-03-25 12:26:24",
      "content": "Just this past Saturday I made fennel salad, albeit with oranges and cream. Reading your recipe I'll be sure to try this next with the blue cheese trick as it certainly adds depth.",
      "parent": "0",
      "gravatar_hash": "1e79d148a0865365d213cfc6d25f16f6"
    },
    {
      "id": "129916",
      "author": "New Zealand Vegetarian",
      "author_url": "http://www.vegetarians.co.nz",
      "date": "2013-03-25 16:51:17",
      "content": "Congratulations! The fact that this recipe makes celery look incredibly appetizing to me is testament to your worthiness ;-)",
      "parent": "0",
      "gravatar_hash": "c2ddd2e7196066ccadea39222971430c"
    },
    {
      "id": "129947",
      "author": "Moira",
      "author_url": "",
      "date": "2013-03-25 20:22:25",
      "content": "Congrats, Michael!\n\nLove the frozen cheese reminder.  Have done this in the past .  What is it with fennel recently?  Or is it just me, craving the stuff ?  It started at Christmas, roasted ... then onto New Years, braised. Now it, yes, lives next to the celery in the fridge.  So, what's it got that my body is craving ?  Ah ... must be the molybdenum.  Hah!  Here's a link to fennel nutrition: big on Vit C, potassium, and some interesting phytonutrients.\n\nhttp://www.whfoods.com/genpage.php?tname=foodspice&amp;dbid=23",
      "parent": "0",
      "gravatar_hash": "e14043d0b484489c08c4c6c496a215f7"
    },
    {
      "id": "130006",
      "author": "Maureen",
      "author_url": "http://orgasmicchef.com",
      "date": "2013-03-26 01:19:56",
      "content": "Congratulations - it must be wonderful to receive this recognition after working so hard on the book.  \n\nChamber vacuum now on my wish list.",
      "parent": "0",
      "gravatar_hash": "3648105a666a70d5e02acb5cba6d5370"
    },
    {
      "id": "134764",
      "author": "John",
      "author_url": "",
      "date": "2013-04-08 19:22:04",
      "content": "None of our family is big on licorice/anise flavors, but we tried this anyhow, and liked it so much that we have made it a second time. The anise flavor is very mild, and the texture and flavor combination is excellent. For those wondering about \"lemon juice as needed\", half a small lemon is a bit too much. Perhaps a quarter of a small lemon would be better. My son says \"I think a little more olive oil would be good.\" The shaved blue cheese is great, but I'd like to figure out a way to do it without having it tend to curl up into little tubes, which is what I get using a veg. peeler.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "135355",
      "author": "Tammi L. Coles",
      "author_url": "http://yourswithbutter.com",
      "date": "2013-04-09 22:34:55",
      "content": "Lurking reader via RSS. Just popping up to congratulate you on the nomination! I absolutely love fennel, so will be making this recipe. Already sent it on to a couple of friends too. Thanks!",
      "parent": "0",
      "gravatar_hash": "0062a06a1c554aa23108913f4a26b20a"
    },
    {
      "id": "136039",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-04-11 09:23:02",
      "content": "Do try the mandoline if you have one, and be sure the cheese is frozen rock solid - you only have a few minutes after it comes out of the freezer before it starts to soften back up and be hard to shave.",
      "parent": "134764",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}