{
  "comment_count": 16,
  "comments": [
    {
      "id": "775",
      "author": "Alessandra",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2010-11-08 16:33:40",
      "content": "Lovely recipe. By Asian pear do you mean Nashi pear? (the round one)?",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "776",
      "author": "thepinkpeppercorn",
      "author_url": "http://thepinkpeppercorn.blogspot.com",
      "date": "2010-11-08 18:33:22",
      "content": "Looks beautiful Michael - as always!  Hope you are well!",
      "parent": "0",
      "gravatar_hash": "0145f8dcbe06da53cbda0bb3145f268f"
    },
    {
      "id": "777",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-11-08 19:20:08",
      "content": "I&#39;d never heard them called &quot;Nashi&quot; before, but googling, yep that appears to be the same thing.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "778",
      "author": "John",
      "author_url": "",
      "date": "2010-11-09 11:48:08",
      "content": "I have to try this -- it sounds great.\n\nBut corn season in the Northeast is just about over (we had our first snowfall yesterday!), which led me to thinking that maybe I could get something like the corn sauce by performing a similar exercise with corn grits. (If you cook grits with, say, 30% too much water, and then let it cool, you get exactly this sort of thickened \"gel\" as a result.) If I get around to trying it, I'll let you know how it works out.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "779",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-11-09 11:53:35",
      "content": "I&#39;m afraid that corn grits won&#39;t give you such a good flavor, even if you strain them to get rid of the grit. (Though of course you could serve the mushrooms over actual yummy grits and that would be delicious). You can do this with good frozen corn though and it should work fine.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "780",
      "author": "Leslie",
      "author_url": "",
      "date": "2010-11-10 06:10:14",
      "content": "Wow, Michael. Been following the blog for a couple years now. Is that right?\n\nYour food keeps getting more beautiful and interesting. You are growing by leaps and bounds as a chef. Congratulations!",
      "parent": "0",
      "gravatar_hash": "a2d55860221bf9f28f8b9b88dbe3ce44"
    },
    {
      "id": "781",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-11-10 09:11:27",
      "content": "Thanks, Leslie... you are very kind!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "782",
      "author": "Peggy",
      "author_url": "http://mybflikeitsoimbg.blogspot.com",
      "date": "2010-11-15 03:09:47",
      "content": "Every element of this dish sounds absolutely wonderful!  It's beautiful and is right up my alley!",
      "parent": "0",
      "gravatar_hash": "7d9380d7205f3f17ffc13ba3def1f84f"
    },
    {
      "id": "783",
      "author": "Quay Po Cooks",
      "author_url": "http://www.quaypocooks.blogspot.com",
      "date": "2010-11-15 05:27:33",
      "content": "This is stunning dish! I have bookmarked this recipe.  Thanks!",
      "parent": "0",
      "gravatar_hash": "d8bc7c70982284df3a61f35bc6f95053"
    },
    {
      "id": "784",
      "author": "Diet Minded",
      "author_url": "http://www.dietminded.com/",
      "date": "2010-11-21 01:40:41",
      "content": "This looks so elegant and delicious! What a beautiful recipe, can't wait to cook this for a special someone.",
      "parent": "0",
      "gravatar_hash": "6e44b0b7865117bd24ef4a4e5b760d12"
    },
    {
      "id": "785",
      "author": "John",
      "author_url": "",
      "date": "2010-11-21 18:38:44",
      "content": "Tried this for the family this evening. I used frozen corn. Hint to others: throw it in the microwave enough to defrost it before chopping in the mini-chopper. (Although what you get when you chop it frozen is kind of neat, and SHOULD be useful for SOMEthing). I also had to use green onions rather than red because I forgot to buy the red ones.\n\nGeneral review from the family: this is REALLY good. Nice balance of flavors and textures, and the unusual mix of flavors works really well. I think it would have been even better with a better Asian pear -- the one I used didn't have quite the rich flavor I'm used to.\n\nIt's a little fussy as a recipe -- several steps, waiting for stuff to cool, etc. -- so it won't go into the \"short rotation,\" but I'll definitely save it as a \"fancy stuff for a dinner party\" kind of thing.\n\nSmall error in the recipe: you call for toasted black sesame seeds, but don't say what to do with them (but I figured out I should sprinkle them on before the parsley).",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "786",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-11-21 22:18:09",
      "content": "Hey Spike - thanks for the review on this one! I know it is a bit of an unusual recipe, with the corn sauce, so it is cool that you decided to give it a rip, and I&#39;m glad you liked how it turned out. Isn&#39;t it kind of fun watching the corn thicken itself?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "787",
      "author": "Mike PDX",
      "author_url": "",
      "date": "2011-08-28 18:13:48",
      "content": "I made my wife a \"veg\" 4 course tasting last night for her Bday.  We used three of your recipes and one from a local restaurant.  This was the final, and best dish.  I made it following your recipe verbatim and it was friggin awesome.\n\nWe're not true vegetarians, but your website sure make it an attractive option!  Well done!",
      "parent": "0",
      "gravatar_hash": "633e84d3b4362af308e430a544e97e06"
    },
    {
      "id": "788",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-08-28 19:03:03",
      "content": "That&#39;s music to my ears! What were the other two recipes? And what was the one from the PDX resto?\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Peach and Sour Cream Buckle - Recipe",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "789",
      "author": "Mike PDX",
      "author_url": "",
      "date": "2011-08-28 19:27:44",
      "content": "We started with one of your recent recipes - watermelon gazpacho (fantastic take on a classic).  After that the shaved summer squash composed salad (almost all from our garden!).  The third was from the Portland restaurant Noble Rot.  It was a sweet/sour marinated eggplant with red onions - I was trying to move the meal in an asian direction in prep for the recipe above.  Here's the link:   <a href=\"http://www.portlandmonthlymag.com/eat-and-drink/articles/urban-farming-portland-chefs-september-2011/\" rel=\"nofollow\">http://www.portlandmonthlymag.com/eat-and-drink/articles/urban-farming-portland-chefs-september-2011/</a>\n\nAfter that....  Dreyer's ice cream!!  (it's a fam favorite, and after 4 courses I was too tired to make a dessert!!)",
      "parent": "0",
      "gravatar_hash": "633e84d3b4362af308e430a544e97e06"
    },
    {
      "id": "790",
      "author": "Mike PDX",
      "author_url": "",
      "date": "2011-08-28 19:42:23",
      "content": "I should add, my only regret is that I didn't do well including a protein.  Luckily after four courses of veggies we were full anyway!",
      "parent": "0",
      "gravatar_hash": "633e84d3b4362af308e430a544e97e06"
    }
  ]
}