{
  "comment_count": 11,
  "comments": [
    {
      "id": "32856",
      "author": "Betty Ann @Mango_Queen",
      "author_url": "http://www.asianinamericamag.com",
      "date": "2012-07-02 06:58:27",
      "content": "These are such delish flavors I love! Ginger and coconut cream are staples in my kitchen and often use them for vegetables, fish and meat dishes. We have so many Filipino dishes with these flavors. I just did a post on \"Broiled Eggplant with Burnt Coconut Cream\" , a heritage recipe by \"burning\" the coconut which is old fashioned method of cooking. I can never resist a recipe when I see \"coconut\" in it. Thanks for sharing this, Michael ! Just wondering, what can I substitute if I don't have sorrel leaves?",
      "parent": "0",
      "gravatar_hash": "2f47cf20944759bec2f5c79ae8ee733f"
    },
    {
      "id": "32881",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-02 07:57:29",
      "content": "Betty, please share a link to the Broiled Eggplant with Burn Coconut cream, sounds very interesting! There really isn't a substitute for sorrel, it has such a unique flavor, but I suppose about the closest thing would be to use a mild green like spinach for the base color and then add lemon and lemon zest. Wouldn't be bad, but not quite the same :(.",
      "parent": "32856",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "32883",
      "author": "Marina @ Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-07-02 08:00:42",
      "content": "I left a comment as soon as I received e-mail, and it disappeared... How odd... Anyway, to sum up what I've said before on the sorrel: love it! Anything with the sorrel tastes great, and this soup invites to be eaten right away. :)\nSorrel has such a unique taste that is really hard to replace. After hunting for sorrel each year, I started to grow my own, and back in Seattle I had it in the pots on my balcony. Glad to hear Farmer's Markets started to sell it back home...:)\nMichael, I have a favor to ask you, if you don't mind: could you, please, put metric measurements next to non-metric. It would really help your reader, that are in metric zone... :) Thanks!",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "32886",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-02 08:07:25",
      "content": "Hey Marina - that's a good idea to grow your own sorrel. Pretty easy? I totally hear you on the metric measurements, I just don't have the time to do the conversions. Sometimes I'll do things in grams if it is a recipe that really benefits from by-weight accuracy.",
      "parent": "32883",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "32903",
      "author": "Betty Ann @Mango_Queen",
      "author_url": "http://www.asianinamericamag.com",
      "date": "2012-07-02 08:58:28",
      "content": "Thanks for the reply, Michael. Will keep the Sorrel tips in mind. I tweeted this to you, but I had a follow-up tip to it. Here's my link to the \"Eggplant in Burnt Coconut Cream with Bitter Melon-Nectarines Salad\" : (from my blog \"Asian In Americamag\" )\n\nhttp://asianinamericamag.com/2012/06/kulawong-talong-eggplant-in-burnt-coconut-cream-with-white-bitter-melon-nectarine-salad/\n\nThe recipe was from the updated, revised version of cookbook \"Memories of Philippine Kitchens\" by Amy Besa &amp; Romy Dorotan. \nBefore I posted my blog, I sent my \"eggplant\" photos to Amy Besa. She replied by saying my \"Bitter Melon-Nectarines Salad\" on top of the eggplant should look more raw, fresh and should not look sauteed. I did not saute the bitter melon - nectarines salad, of course. I followed the recipe exactly as indicated. Only thing is I think I overcooked the burnt coconut cream and when I poured it over the eggplant the fresh salad on top began to look mushy and cooked. But overall, the \"burnt coconut\" method was amazing and flavors were fantastic. I urge you to try the method. It's a great base for other recipes you may have in mind. Burning coconut cream is a very old, traditional way of cooking in the Philippines, especially in provinces abundant with coconut trees. Let me know if you need help with anything else :-)",
      "parent": "0",
      "gravatar_hash": "2f47cf20944759bec2f5c79ae8ee733f"
    },
    {
      "id": "32927",
      "author": "Marina@ Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-07-02 10:09:01",
      "content": "Yes, Michael, in Seattle it's pretty easy, just find some seeds and plant it, and it will grow itself... :) Tested seeds are from Botanical Interests. I tried some other seed companies too but  with less luck though. Plant it now and you'll have your own sorrel by fall!  I am able to grow sorrel here, in the South too, in the shaded area.  \nIt's funny because I have a few recipe to be posted with sorrel this week! :) So come see it later on.",
      "parent": "32886",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "34070",
      "author": "erinwyso",
      "author_url": "http://www.olivesfordinner.com",
      "date": "2012-07-05 02:27:38",
      "content": "What a great soup for making and eating during this warmer weather. I have never tried sorrel before, but this recipe has made me curious (and also want to buy a chinois like that!)",
      "parent": "0",
      "gravatar_hash": "ae73d260a94027f9cad03ed129528964"
    },
    {
      "id": "34119",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-05 06:12:28",
      "content": "That chinois is awesome, for sure. Tips, if you get one: first, use a coarser strainer to get rid of anything larger, b/c the chinois clogs easily. Then, for the first pass, you'll want to use the back of a ladle or a spatula to push the soup through the chinois. Then if you want absolute maximum smoothness, rinse the chinois, and do a final pass with no pushing.",
      "parent": "34070",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "34665",
      "author": "erinwyso",
      "author_url": "http://www.olivesfordinner.com",
      "date": "2012-07-06 02:42:20",
      "content": "I can imagine that this would yield a supremely smooth and velvety texture -- thanks for the tip!",
      "parent": "34119",
      "gravatar_hash": "ae73d260a94027f9cad03ed129528964"
    },
    {
      "id": "39929",
      "author": "Vegan",
      "author_url": "http://www.sevenpoint2.com/",
      "date": "2012-07-22 04:55:05",
      "content": "I have never tried using sorrel before but this one looks easy to make. I hope it blends well with the coconut milk.",
      "parent": "0",
      "gravatar_hash": "bda7603876252c69c15f63b58a0bf6f0"
    },
    {
      "id": "139285",
      "author": "Esky",
      "author_url": "",
      "date": "2013-04-18 19:50:57",
      "content": "I really, really wanted to like this soup... I love coconut, and I just discovered sorrel and have been enjoying it in different dishes. Alas, this wasn't a winner... for starters, it seemed simple and quick, but it took me forever to clean the strainers afterwards. I think it would actually have been easier to just juice the sorrel, and maybe add a little bit of thickener to the soup to make up for the loss of texture :) \n\nAnyways, my husband and I did not like the soup at all. It was very fatty (and we only had a very small serving of it as an appetizer). The tastes didn't work together, either. We tried modifying the soup with various additions, but ended up throwing it out because it just wasn't edible, to be honest. Too bad... I make new dishes all the time and this is the first time in months that we threw out something I made.\n\nI have your cookbook and will definitely be trying more of your recipes! Hopefully the next one will be better ;)",
      "parent": "0",
      "gravatar_hash": "0c25165f14faab06fcb2f5aa2d743848"
    }
  ]
}