{
  "comment_count": 40,
  "comments": [
    {
      "id": "468",
      "author": "amee",
      "author_url": "http://www.rabbitfoodrocks.blogspot.com",
      "date": "2011-03-21 08:00:30",
      "content": "At first glance the photo looked like creme brulee!  A pressure cooker is KEY to a good indian (specifically, Gujarati and South Indian) meals actually.  My mom has been making 4 course 30-minute meals b/c of her pressure cooker!  And now, my sister and I each have one. The whistles do have a tendency to scare pets, though. :) Looks beautiful!  And how long do we have to wait to buy YOUR cookbook??????",
      "parent": "0",
      "gravatar_hash": "ea1fed8e804be28ee1596700c053eef2"
    },
    {
      "id": "469",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-03-21 08:15:55",
      "content": "Hey Amee - I&#39;d like to hear more about your mom&#39;s quick meals; have you done a post about them? My book won&#39;t hit the shelved until Fall of 2012, though I did just finish writing the recipes.\n\n\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "470",
      "author": "Saltyseattle",
      "author_url": "http://Www.saltyseattle.com",
      "date": "2011-03-21 09:22:54",
      "content": "Interesting technique- wonder if tomato might work similarly.",
      "parent": "0",
      "gravatar_hash": "6960acb6fc0d7e69ef97c5888e00e2b3"
    },
    {
      "id": "471",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-03-21 09:33:14",
      "content": "Worth a try! My suspicion is that it works better with vegetables that have a lower moisture content, but it couldn&#39;t hurt to give it a shot. At the worst, you&#39;ll have some tomato sauce.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "472",
      "author": "umka",
      "author_url": "",
      "date": "2011-03-21 11:50:48",
      "content": "Won't the carrots burn?",
      "parent": "0",
      "gravatar_hash": "ebac15d62a56df9ac69ac45549301470"
    },
    {
      "id": "473",
      "author": "Dylan",
      "author_url": "",
      "date": "2011-03-21 11:54:53",
      "content": "I'm wondering the same thing... why don't they burn?  And after 30 minutes don't they turn into complete mush?",
      "parent": "0",
      "gravatar_hash": "246154350d82673809b1c31e72b348f7"
    },
    {
      "id": "474",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-03-21 11:55:07",
      "content": "No, they don&#39;t burn at all. The maximum temperature they reach is about 250 F (121 C), which is much lower than what it would take to burn them - a lot lower temperature than you would use in the oven for example.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "475",
      "author": "Dylan",
      "author_url": "",
      "date": "2011-03-21 12:07:28",
      "content": "And it won't damage the pressure cooker?  All the information I've read warns against cooking without water.  I really want to try this but don't want to ruin my cooker...",
      "parent": "0",
      "gravatar_hash": "246154350d82673809b1c31e72b348f7"
    },
    {
      "id": "476",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-03-21 12:43:52",
      "content": "Re: mush - yes, they turn into mush, but since you are going to puree them, that is a good thing ;). Re damaging the pressure cooker - well, I certainly don&#39;t want to put anyone at risk, but it did work just fine for me. There is of course a decent amount of water in the carrots themselves.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "477",
      "author": "Kathy - Panini Happy",
      "author_url": "http://www.paninihappy.com",
      "date": "2011-03-21 13:06:14",
      "content": "This certainly does sound \"freaking delicious\"! I've been pretty afraid of pressure cookers for many years...are they safer these days? So many great cooking options would open up to me if I could conquer this phobia!\n\nI've been fascinated with this Myhrvold tome - that's so cool you've gotten to hear him speak about it on so many occasions.",
      "parent": "0",
      "gravatar_hash": "3173541fef2db6b40f403784d5c76724"
    },
    {
      "id": "478",
      "author": "Dylan",
      "author_url": "",
      "date": "2011-03-21 14:00:21",
      "content": "Well, I think you've convinced me.  I'm going to give it a try asap.  Thanks!",
      "parent": "0",
      "gravatar_hash": "246154350d82673809b1c31e72b348f7"
    },
    {
      "id": "479",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-03-21 14:16:12",
      "content": "Yeah, the old &quot;pressure cooker is going to explode&quot; idea can go away, as long as you have a modern unit and follow the safety precautions that come with it. I highly recommend them! Great for beans.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "480",
      "author": "Morgan",
      "author_url": "http://www.culturezest.org/home/users/detail?UserHexID=73427218-9BE9-4919-8842-F2D519B90147",
      "date": "2011-03-21 20:11:07",
      "content": "It's too bad that I don't have a pressure cooker, else I would definitely be making this. Perhaps I can steal my friend's pressure cooker to make it...",
      "parent": "0",
      "gravatar_hash": "dcd54fcd95d5c98e60bce89d3693a550"
    },
    {
      "id": "481",
      "author": "Alessandra",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2011-03-22 14:26:37",
      "content": "Carrot and Coriander soup is a great classic, I love it! Today I learned that you can slice your carrot into coins! What a lovely terms, I don't think I can use slices anymore, from now on I will slice my carrots into coins too!!!!\n\nciao\nA.",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "482",
      "author": "zenchef",
      "author_url": "http://zencancook.com",
      "date": "2011-03-22 15:27:21",
      "content": "How cool that you got to hear Myhrvold speak on so many different occasions! Priceless!\nVery interesting technique, indeed. I'm getting \"Modernist Cuisine\" at work so I'll be sure to study it thoroughly.",
      "parent": "0",
      "gravatar_hash": "80ec0a5a87db0a0f00a2b7ee787712c2"
    },
    {
      "id": "483",
      "author": "Jenné @ Sweet Potato Soul",
      "author_url": "http://www.sweetpotatosoul.com",
      "date": "2011-03-23 00:15:45",
      "content": "I bet this was delicious. I had never heard of Dr.Myhrvold, and I love the interesting WIRED article you linked. I want him to help me make the perfect baked sweet potato fries :)",
      "parent": "0",
      "gravatar_hash": "ecbfd7cf05cb8055f0de5ba4cac789db"
    },
    {
      "id": "484",
      "author": "Dylan",
      "author_url": "",
      "date": "2011-03-23 15:42:37",
      "content": "Hey Michael, I tried this tonight and was pleased with the results... thought I'd let you know.  To stay on the safe side I cooked at the lower pressure setting and for just 15 minutes.  There was a significant level of caramelization afterwards, so I can only imagine how much you had.  The result was delicious, and I'll definitely try it again in other shapes/forms and with the longer caramelization.  I'm thinking beets will be next because of the sugar content/color.\n\nThanks as always for the inspiration!",
      "parent": "0",
      "gravatar_hash": "246154350d82673809b1c31e72b348f7"
    },
    {
      "id": "485",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-03-23 15:57:44",
      "content": "Nice, baby! It makes me extra happy to hear when people are trying some of the more &quot;out there&quot; stuff I post.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "486",
      "author": "Lael Hazan @educatedpalate",
      "author_url": "http://www.giulianohazan.com/blog",
      "date": "2011-03-23 16:00:44",
      "content": "I am fascinated by Dr. Myhrvold and am looking forward to the book.  As my in-laws wrote, \"Food, like language, is constantly evolving; the act of cooking, like language, made us human,\" the question is Dr. Myhrvold's book an evolution or a vanity exercise? I look forward to finding out.  Again as they wrote, “Cooking well is like the telling use of language: Expression must be vigorous, clear, concise. There can be no unnecessary ingredient or unnecessary step. A dish may be complex, but every component, every procedure, must count. …Do not arbitrarily shuffle the vocabulary of one cuisine with that of another to make your cooking (original).\n\nIt looks like your dish is both original and clear.",
      "parent": "0",
      "gravatar_hash": "3f513a08ba12dd91fd9177912008f47a"
    },
    {
      "id": "487",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-03-23 16:06:03",
      "content": "You Hazan&#39;s have a way with words! (Which makes a lot of sense considering the Jewish meaning of the word: <a href=\"http://www.thefreedictionary.com/hazan)\" rel=\"nofollow\">http://www.thefreedictionary.com/hazan)</a>",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "488",
      "author": "Jenné @ Sweet Potato Soul",
      "author_url": "http://www.sweetpotatosoul.com",
      "date": "2011-03-24 07:13:16",
      "content": "When I posted that last comment I had only read half of the long interview.  Myhrvold is a very interesting man. Thanks for much for linking that.",
      "parent": "0",
      "gravatar_hash": "ecbfd7cf05cb8055f0de5ba4cac789db"
    },
    {
      "id": "489",
      "author": "Bill Woods",
      "author_url": "http://profile.typepad.com/woodsbill",
      "date": "2011-03-26 15:11:09",
      "content": "\"The sugar in carrots is mostly sucrose, which normally caramelizes at 160 C. Pressure cookers typically only reach around 122 C.\"\n\nBut with no water in the cooker, presumably it'll go higher, as it would if you were cooking the carrots in a skillet. My concern would be that they'd get hot enough to burn.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "490",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-03-26 15:21:55",
      "content": "Hey Bill - definitely no burning occurs; they were not in the least dark when they came out. Keep in mind that water expands about 1700 x in volume when it becomes steam, so even the small amount of water in the carrots seems to be plenty to bring the pressure cooker up to full pressure and maintain the temperature. I&#39;m also using a thermostatically controlled electric pressure cooker. I can&#39;t say exactly what the experience would be on a stovetop model, but on mine, the pressure indicator came all the way up and stayed up throughout the cooking.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "491",
      "author": "Evan",
      "author_url": "http://www.vegonline.org",
      "date": "2011-03-28 14:42:37",
      "content": "I typically like to eat my carrots raw and unadulterated, but, geez... I might just have to give this a shot. Guess I'll have to dust off the ol' pressure cooker!\n<a href=\"http://www.VegOnline.org\" rel=\"nofollow\">http://www.VegOnline.org</a>",
      "parent": "0",
      "gravatar_hash": "6f8140b87f9974f4ab9cc105118576f0"
    },
    {
      "id": "492",
      "author": "John",
      "author_url": "",
      "date": "2011-03-29 05:31:24",
      "content": "I tried this last night (as well as several of Michael's other recipes, as an anniversary dinner). I suffered the \"carrot-glaze-sticking-to-the-bottom-and-burning\" phenomenon, but I think it was mostly my own fault: I misinterpreted \"high pressure\" for \"keep the heat on the whole time\" (my cooker's old-style: just a simple weight on the top, which establishes the pressure). I think that if I'd done it the way that's more natural for me (heat until the weight jiggle violently, then back off the temp control until the little light JSUT goes out) it might have worked out fine. Anyhow, by avoiding scraping anything black off the bottom, I got wonderful mushy and partly caramelized carrots out; the resulting flavor was very similar to that of a top-notch well-spiced pumkin pie, oddly. (This is in contrast to Michael's version: mine were definitely darker in color when done, and not at all \"essence of carrot\", but instead something richly transformed. So maybe that whole accidental over-browing wasn't such a bad thing!)\n\nI \"pureed\" in my Cuisinart. Passing the stuff through the sieve was essentially pointless -- nothing remained behind, because it was already silky smooth.\n\nThe collection of \"additions\" was great. I made the shallots by slicing (1/16\" thick?) a shallot, adding about 2t of rice-wine-vinegar (it was what I had handy) and microwaving for 30 second. The flavor was great, the light pink color contrasted nicely with the dark orange of the soup, and it blended well with the pomegranate and dukkah flavors.\n\nOverall: a winner, but I think you have to know your own pressure cooker. Next time, I might try using the stovetop model that has the nonstick lining. (I was a little pressed for stovetop spacewith all the other stuff I was preparing!)",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "493",
      "author": "todd richardson",
      "author_url": "http://profile.typepad.com/onefiveone",
      "date": "2011-03-31 16:49:26",
      "content": "i tried this with a conventional stove top pressure cooker and it worked great.  nice caramelized color to the carrots when it was done.\n\ngas cooktop at med-high until it gets up to pressure, then reduce to low heat for 30 mins.  no burning of the carrots.\n\ni think my main problem was putting too much salt in the final mix, next time i'll dial it back.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "494",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-03-31 16:51:08",
      "content": "Nice! Thanks for letting us know, it is really helpful to have a data point about how it works on a stove-top model.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "495",
      "author": "Scott",
      "author_url": "http://www.seattlefoodgeek.com",
      "date": "2011-04-04 09:45:15",
      "content": "Hi Michael,\n\nThanks for posting this - this is a delicious soup!  The recipe in the book is a bit more complicated, calling for centrifuged carrot juice and carotene butter... but the biggest difference is that the Modernist Cuisine recipe calls for adding 0.5% Baking soda (by weight of the carrots).  The addition of the baking soda promotes browning and the development of complex caramelized carrot flavor.\n\nLooking forward to seeing what you come up with next!",
      "parent": "0",
      "gravatar_hash": "e24f0ecd7ed3a6dd6b0f84fa6bbdf892"
    },
    {
      "id": "496",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-04-04 09:50:48",
      "content": "Aha! Still waiting to get my hands on the book. I really appreciate you filling in the blanks of the original recipe. Baking soda makes so much sense here. It is generally a bad idea when you are trying to keep vegetables firm - it tends to create mushiness that  is unpleasant even in caramelized onions, but for a soup that is going to be pureed, that is a non-issue. p.s. readers who have an interest in (small m) modernist cuisine should definitely check out Scott&#39;s blog at <a href=\"http://seattlefoodgeek.com\" rel=\"nofollow\">http://seattlefoodgeek.com</a> - he&#39;s always making cool food and gadgets.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "497",
      "author": "Bill Woods",
      "author_url": "",
      "date": "2011-04-07 16:48:16",
      "content": "Right, acid keeps them firm while alkaline breaks down pectin.\n\n<a href=\"http://www.seriouseats.com/2011/01/the-food-lab-real-french-onion-dip-homemade-super-bowl-recipe.html\" rel=\"nofollow\">http://www.seriouseats.com/2011/01/the-food-lab-real-french-onion-dip-homemade-super-bowl-recipe.html</a>",
      "parent": "0",
      "gravatar_hash": "77cf50a1cbf2cd8b531d0727112c78b0"
    },
    {
      "id": "498",
      "author": "John",
      "author_url": "",
      "date": "2011-05-02 07:49:03",
      "content": "I re-made the soup last night, using a teflon-coated stovetop pressure cooker rather than the old electric one -- far less sticking/horrid cleanup, although not so very different in the end results. There's a wonderful molasses-y or sweet-potato-ey flavor that comes out from the caramlizing. I'll definitely try it again, this time with the baking soda. BTW, the \"garnishes\" are great. My family's favorite: the shallots, which I made by thin-slicing a shallot, covering with rice-wine vinegar in a small bowl, and heating for 1 min in the microwave. The result was lovely pale-pink rings with just the right mix of flavors.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "499",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-05-02 08:31:52",
      "content": "Oh, good, good to know it really was the old pressure cooker that was causing the cleanup problem. Did you buy a new one, then?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "500",
      "author": "dmg",
      "author_url": "http://turingmachine.org",
      "date": "2011-08-30 23:11:38",
      "content": "Thanks Michael, for your variation on the recipe.\n\nI do have Modernist Cuisine. The way Myhrvold and coauthors praise the benefits of the pressure cooker prompted me to buy one (a \"fagor duo\").\n\nI was, as many others, about cooking in it without water. It seems contrary to everything I know about them.\n\nThe Modernist recipe calls for butter in enough amount that the bottom was covered with it, which eased my concerns. I closed it, and followed the recipe instructions (the errata of the book calls for 20 minutes, not the originally 50).\n\nI was careful, though. I let it in hot until the steam started flowing, then lowered it to the point that steam kept flowing (gas stove). Nothing burned, but perfectly cooked carrots.\n\nOf course I can't centrifuge juice, so I added it \"as is\", nonetheless.\n\nNext time I'll try your variation.\n\nHopefully my experience with a stove top will ease some other home cooks and get them to try it.\n\n--dmg",
      "parent": "0",
      "gravatar_hash": "11bd86061e8fcade1299dbfc80b16493"
    },
    {
      "id": "501",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-08-31 22:17:10",
      "content": "Indeed, I&#39;ve got my copy of the book now and as you say it calls for butter. I haven&#39;t tried it again that way though. Dr. Myhrvold gave me permission to post the MC recipe as a correction here, but I haven&#39;t gotten around to it. If anyone who doesn&#39;t have MC wants it, add a comment here and I&#39;ll make it a priority!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17020",
      "author": "Mirauncut",
      "author_url": "http://www.mirauncut.com",
      "date": "2012-01-14 19:37:28",
      "content": "I was under the impression that baking soda was required for complete maillard reaction. Will be interesting to try!",
      "parent": "0",
      "gravatar_hash": "5f8739eb21002790055fa2f5e6538d8d"
    },
    {
      "id": "17028",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-14 22:31:31",
      "content": "Indeed, you can speed up Maillard reactions by raising pH (which is why adding a small amount of baking soda helps). It also tends to make things go mushy, which is fine when you are going to puree them (and terrible otherwise :). It doesn't seem to be necessary in this dish though, the carrots caramelize and maillard-ize quite nicely on their own.",
      "parent": "17020",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17073",
      "author": "Mirauncut",
      "author_url": "http://www.mirauncut.com",
      "date": "2012-01-15 12:33:59",
      "content": "Oh, good to know! Thank you :)",
      "parent": "0",
      "gravatar_hash": "5f8739eb21002790055fa2f5e6538d8d"
    },
    {
      "id": "26636",
      "author": "Rachel",
      "author_url": "",
      "date": "2012-06-11 14:19:50",
      "content": "While winging this I wound up with baby food.  I used coconut oil instead of olive, it seems like a nice substitution for some.",
      "parent": "0",
      "gravatar_hash": "91554c89cd8fd5dc4fca93bf27a795e7"
    },
    {
      "id": "116363",
      "author": "Aaron",
      "author_url": "",
      "date": "2013-02-10 08:16:46",
      "content": "I can't believe it's been a year and a half and I'm the first taker on this. I'd love the full recipe, if you've got time to post it.",
      "parent": "501",
      "gravatar_hash": "8273eeca13f27d62d26deaebeb9cd344"
    },
    {
      "id": "116379",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-10 08:49:24",
      "content": "Here you go: http://modernistcuisine.com/recipes/caramelized-carrot-soup/ . As you can see, my \"guess\" recipe was missing some key points, but it was still very good!",
      "parent": "116363",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}