{
  "comment_count": 30,
  "comments": [
    {
      "id": "1915",
      "author": "John - Mormon Foodie",
      "author_url": "http://mormonfoodie.blogspot.com",
      "date": "2009-10-06 22:47:21",
      "content": "A few months ago I went made a spinach dish when a neighbor gave us a bunch of spinach. I knew it would go bad before I could toss all of it into a salad and I didn't want to throw it away. That would be a waste.\n\nI looked around for a recipe that would use a lot of it up and found an Indian Spinach Curry recipe. I thought, “This sounds interesting. Let's try it!”\n\nIt wasn't interesting; it was awful. There was enough salt in it to make the Dead Sea blush. It's texture was somewhere between wet tissue paper and snot. I threw the remains of it, and there was plenty, out.\n\nIt still makes me sick just thinking about it.",
      "parent": "0",
      "gravatar_hash": "0750826129ee44caebb3eba7010ade18"
    },
    {
      "id": "1916",
      "author": "outdoorsman1961",
      "author_url": "",
      "date": "2009-10-06 23:31:56",
      "content": "when I was 8 my mother was cooking some cut up chickens in tomato sauce and I wanted to help so when she wasn't looking I added a cup of sugar and a large helping of nutmeg and cloves(just trying to help was all) need less to say it didn't turn out so well. Since then I have become a bit more refined at cooking.",
      "parent": "0",
      "gravatar_hash": "aa09562ffd2cbeb18a7912c55fae486b"
    },
    {
      "id": "1917",
      "author": "Tofu-Mom",
      "author_url": "",
      "date": "2009-10-06 23:46:46",
      "content": "Oh my word. I wanted Lemon Glazed Tofu in the worst way but had NO lemons.\nYou'd think, without such an integral part of the dish I would have opted for something different, but no. I used .....unsweetened lemon Kool-Aid. (I know, I know, I cringe to even think of it now...).\nWhat posessed me to do that I will never know but needless to say, it was easily the most vile food I have EVER created!!!!!",
      "parent": "0",
      "gravatar_hash": "1a0b4a32e20aa0dec8b1491f2bea1ad6"
    },
    {
      "id": "1918",
      "author": ":: Nicole",
      "author_url": "",
      "date": "2009-10-07 01:05:12",
      "content": "OK.  So it was one of those cookbooks that refers to 3 or 4 other recipes in the cookbook for the one recipe you are trying to make, so it ought to be very thorough.  NOT.  So when you make an artichoke lasagna, it's a good idea to take the CHOKE off the artichoke.\n\nThe whole thing was ruined.  From bechamel to marinara to ricotta stuffing, the choke ruined it all.  And no time to redo.  Who knew?  I'd only ever seen artichokes in the jar before that. 4 recipes in one dish, and the whole thing down the drain.",
      "parent": "0",
      "gravatar_hash": "386ccea12d81cc93e6b4d7e15f09c2fd"
    },
    {
      "id": "1919",
      "author": "Melanie Teegarden",
      "author_url": "",
      "date": "2009-10-07 04:27:46",
      "content": "The first time I made delicate Asian noodles, the kind you soak for a few seconds instead of actually cooking, was a disaster.  I didn't read the directions, and instead of soaking for ten seconds I let them sit in hot water for several minutes.  By the time I drained them, they were mush.  I hated to waste food, took a chance and tried to complete the dish anyway, hoping they would just be a bit on the overdone side.  As I stirred them in with the stirfried veggies and sauc, they started to turn back into a floury paste.  It was....awful.  So awful that my husband called family members to report my first cooking failure of our relationship.  It is still recorded in the annals of our marriage as my worst flop to date.",
      "parent": "0",
      "gravatar_hash": "0350c0138141e059fdb98f07d4ff4af3"
    },
    {
      "id": "1920",
      "author": "Mara",
      "author_url": "",
      "date": "2009-10-07 05:36:30",
      "content": "As a teenager, I was known in all circles as someone who could burn Jell-O, undercook popcorn and potentially commit arson while attempting to make a tray of ice cubes.  So naturally, I was the one who decided to make \"Jack Daniels Burgers\" for some friends when the folks went out of town for the weekend.  And naturally, I drank at least half of the JD before even prepping the (unseasoned, unbound)meat.  Which, naturally, led to the broiler being set to a high heat for a good while before I finally set the broiler pan of raw meat patties down on the rack and then, for my friends' amusement, flamboyantly poured half a bottle of Tennessee whiskey into the pan, somewhat hoping for a gallant and dazzling flambe.  What followed instead was a sort of quick and violent braising, an apartment full of black smoke, and a late-night game of hallway hockey with burgers burnt and cooled like lava into obsidian.  Oh, and a meal of undercooked popcorn.  Good times.",
      "parent": "0",
      "gravatar_hash": "a134bba92b71971e8a9589917f256fa9"
    },
    {
      "id": "1921",
      "author": "iheartkale.blogspot.com",
      "author_url": "http://profile.typepad.com/6p0120a6200e59970c",
      "date": "2009-10-07 07:00:51",
      "content": "I don't know *why* I thought this would be a good idea, but I had some leftover pickling liquid from a jar of homemade kimchee and I thought, \"Hey, this is a nice gingery broth, why not use it to make a soup with some sesame brown rice balls floating in it?\"\n\nOh, maybe because there was about a pound of salt in said pickling liquid.  It was so many kinds of disgusting.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "1922",
      "author": "Leigh",
      "author_url": "",
      "date": "2009-10-07 07:05:53",
      "content": "I had been seeing a guy for a month or so and was cooking him dinner for the first time. He was a foodie AND a wine snob and I was, regrettably, new to both. I wanted to make something classic, so I went with lemon-thyme roasted chicken, garlic mashed potatoes and steamed broccoli.\n\nI was nervous and a novice, so EVERYTHING went wrong - the chicken was undercooked and oversalted, the potatoes were gluey because I neglected to add any cream or milk and the broccoli, having been cheap frozen florets, went limp and were discolored after oversteaming.\n\nTo add injury to insult, when the guy opened the Chardonnay that I had so carefully selected to go with the food, he replied with a sigh, \"It is unoaked and too cold, tasteless.\" I was heartbroken. Needless to say, we broke up soon after, and today I'm happy to report that I know quite a bit more about food!",
      "parent": "0",
      "gravatar_hash": "80594d2d20b50100f85555e46d6843c1"
    },
    {
      "id": "1923",
      "author": "Tamar",
      "author_url": "",
      "date": "2009-10-07 07:56:51",
      "content": "The worst thing I ever made was a pot of chili into which I added the contents of an ENTIRE can of chipotles in adobo processed to a paste. It was so hot that it was unedible and we had to throw it away.",
      "parent": "0",
      "gravatar_hash": "dc48827e3a1cbf6badfc0b88a0a1b4b0"
    },
    {
      "id": "1924",
      "author": "Jess",
      "author_url": "",
      "date": "2009-10-07 08:07:53",
      "content": "I tried to bake a cake from a recipe that my mother had loved as a child for her birthday, and she had copied it down on a notecard. First mistake, subbing in 1/4 cup of baking soda instead of 1/4 tsp, and then putting it in the oven and realizing the recipe had never said to add in the butter. Lets just say the cake was hard and salty, and was promptly thrown away!",
      "parent": "0",
      "gravatar_hash": "bf4e9f21f50718f5a9dab34cd493f5bf"
    },
    {
      "id": "1925",
      "author": "lisaiscooking",
      "author_url": "http://lisaiscooking.blogspot.com/",
      "date": "2009-10-07 08:42:53",
      "content": "The dish I'm about to describe is to this day the worst thing I have ever prepared. Every other dish that has turned out not so great was in fact eaten. This one, however, survived only a couple of bites before finding its way into the garbage. I don't even remember where the recipe originated, but it sounded good on paper. It was a sauteed radicchio with pasta. Pancetta was supposed to have been included, but I don't eat red meat, so I used turkey bacon. The dry, turkey bacon did not add enough fat to the pan, and this was too early in my cooking obsession for me to think to add olive oil. The finished dish was terrible, bitter radicchio, dry pasta, bland turkey bacon. Easily the worst thing I've ever made.",
      "parent": "0",
      "gravatar_hash": "561295eae7a0ea547c538ab03aca58f2"
    },
    {
      "id": "1926",
      "author": "Scout's Honor",
      "author_url": "http://unitedstatesofmotherhood.com",
      "date": "2009-10-07 09:12:05",
      "content": "I made some nasty, nasty pasta salad.\n\nWhole wheat pasta.\n\nPlanned to make it into cold pasta salad.\n\nPlanned to add mayo.  Only 1/2 cup mayo which immediately absorbed into wheat pasta to make it gummy so added rice vinegar and oil. Added canned crab, carrots, onion, and kalamata olives.\n\nOlive, crab, congealed wheat sweet acid combo was awful, but I was committed so I kept throwing this and that in and it got worse and worse.It was like throwing good money after bad, but I compulsively could not stop.\n\nKids, who are adventurous eaters, refused to eat it. Husband raised an eyebrow.\n\nJust cleaned out my fridge last night and threw out over a pound of the pasta salad.  Sigh.  This time, improvising just didn't work at all.",
      "parent": "0",
      "gravatar_hash": "fcf165dfb6ee4004a1d1b6cb3a4499bc"
    },
    {
      "id": "1927",
      "author": "Scout's Honor",
      "author_url": "http://unitedstatesofmotherhood.com",
      "date": "2009-10-07 09:15:26",
      "content": "Forgot to mention that the whole wheat pasta was spaghetti.  So it looked like fishy, crabby dirty noodles.  Like something you'd see dumpster diving. Sigh.",
      "parent": "0",
      "gravatar_hash": "fcf165dfb6ee4004a1d1b6cb3a4499bc"
    },
    {
      "id": "1928",
      "author": "Rowan Watson",
      "author_url": "http://www.rowanwatson.mysite.com",
      "date": "2009-10-07 09:54:21",
      "content": "When I was about 22, I decided I wanted to make a quiche from scratch, something I'd never done before. I didn't have any cookbooks in the house, nor internet access, but I've always been a decent cook, and thought I could figure it out.\n\nMy first mistake was with the pie crust. Being new to the crust game, I WAY overworked it. Man, I mixed and kneaded and made that crust as smooth and pretty as any you'd ever seen! Put it in the pie pan, fluted the edges like in all the nice pictures, and then filled the bed with about a pound of grated cheese.\n\nThen, the eggs. It never occurred to me to put some milk or cream in those puppies to fluff them up and stretch them. Nope, I just happily beat up about 8 eggs and poured them into the crust, over the cheese. Filled that crust right to the TOP! Stuck it all in the oven and went and sat down in front of the tv.\n\nAfter a while I smelled something burning, so I went to check. The egg had boiled up over the sides of the crust, and there was blackened egg all over my oven! It seemed to be done overflowing, so I scooped as much of the spilled egg up as I could, and let it cook the rest of the way, hoping to salvage a meal. I pulled it out and let it cool off. I cut into it (experiencing a strange resistance), and took a bite, nearly breaking my teeth on the rock-hard crust. I mean, that thing was like concrete! And everything had a gross, smoked flavor from the egg that burned in the oven. Man!\n\nNeedless, to say, I got a recipe next time.",
      "parent": "0",
      "gravatar_hash": "b0ef26b28bfc3ac7e0fa9842b099e9c9"
    },
    {
      "id": "1929",
      "author": "Amanda Mae",
      "author_url": "http://maebird.blogspot.com",
      "date": "2009-10-07 10:15:13",
      "content": "I made a \"raw peaches and cream pie\" - my first time ever making a raw dessert with nuts and I didn't blend it enough so the texture, instead of smooth, it was a horrible chunky vomit. On top of that texture the smooth peaches made it worse, it was just a bad combination.\n<a href=\"http://maebird.blogspot.com/2009/06/raw-cheesecake.html\" rel=\"nofollow\">http://maebird.blogspot.com/2009/06/raw-cheesecake.html</a>",
      "parent": "0",
      "gravatar_hash": "bdab7a0f3603d3c5e09a9b571c40b684"
    },
    {
      "id": "1930",
      "author": "Scott",
      "author_url": "",
      "date": "2009-10-07 10:48:46",
      "content": "I love pad thai. Come to think of it, who doesn't? I was new to cooking anything, let alone something ethnic. I had heard that the sauce was basically just ketchup, soy sauce and hot peppers. My first attempt to make it called for something like 2 tablespoons of crushed pepper. I worked in a pizza place, so I got some from work, tossed it into the oil and let it work its magic. Then I added the ketchup and soy sauce, tossed in some carrots, broccoli, and boiled, gummy rice noodles and voila! I had a spicy concoction that threatened to burn me to a crisp from the heat. As a conscientious college student, I didn't want to waste the food so I forced myself to sit over the bowl of flaming nasty and eat my fill. My roommate thought it was hilarious to watch me sit there in a hot Sacramento valley summer, sweating over a meal that I hated, and try to eat my mess. You would think I would have learned my lesson.\n\nBut no. A year later, with this disaster far enough in my rear view mirror, I decided to subject a large group to my ineptitude. I was living in a co-op and we had communal meals together like good hippies should. This was a great arrangement where each of us cooked with a partner once a week but got 5 home cooked meals every week. I learned a lot about cooking veg, as well as cooking in quantities. While I learned my lesson about the heat, I hadn’t yet figured out that pad thai is not ketchup and soy sauce with gummy rice noodles. In my frantic quest to get food on the table in time I didn’t try it first. I don’t know what everyone did for dinner, but my entrée didn’t even make it into the compost. Bad hippie.\n\nYears later I still attempt pad thai on a regular basis. It is never nearly as good as what you get in a Thai restaurant, but at least the foundation of equal parts rice vinegar, sugar, and soy sauce (1/3 cup each) with some tomato paste and peanut butter make a satisfyingly inauthentic meal.",
      "parent": "0",
      "gravatar_hash": "3152eb9a826251ff5dd51e86fcb5a01d"
    },
    {
      "id": "1931",
      "author": "CarenRoma",
      "author_url": "http://fennelfiles.blogspot.com",
      "date": "2009-10-07 11:00:30",
      "content": "Dude, I don't know how many times I asked, \"Are you sure you are supposed to use ketchup?\"",
      "parent": "0",
      "gravatar_hash": "442f51823113fcb7711bef7dd09fb7e9"
    },
    {
      "id": "1932",
      "author": "JMom",
      "author_url": "http://kitchen.amoores.com",
      "date": "2009-10-07 11:05:35",
      "content": "I wish I could say I have mastered it by now, but home made biscuits are my Achilles heel. The first time I made it, I didn't know that you're supposed to handle it as lightly as possible, as little as possible.\n\nWell, I had just learned how to knead bread then and I was enthusiastic about kneading anything! Needless to say, what I got instead of flaky and buttery layers is hockey pucks. My daughter actually they were sugar cookies because I also rolled them out too thin and they didn't rise at all.",
      "parent": "0",
      "gravatar_hash": "60006c4849bbb477b14eb84bbd4c1340"
    },
    {
      "id": "1933",
      "author": "CarenRoma",
      "author_url": "http://fennelfiles.blogspot.com",
      "date": "2009-10-07 11:11:11",
      "content": "Back in the late 90's, Scott and I spent a year working at a vegetarian inn in Mendocino. Unfortunately, I was scheduled morning shifts in the garden and he, evening shifts in the restaurant. I hate to cook for just one, and in an attempt to feed my lonely self, I heated a can of refried beans and poured them over leftover polenta. Talk about a flavor and textural nightmare. Scott was totally appalled at my mealtime low when he discovered my picked over bowl sitting in the sink. That meal prompted me to switch my schedule to evenings on the reservation desk so I could eat dinner at the restaurant and avoid future single dinner mishaps.",
      "parent": "0",
      "gravatar_hash": "442f51823113fcb7711bef7dd09fb7e9"
    },
    {
      "id": "1934",
      "author": "Lisa",
      "author_url": "",
      "date": "2009-10-07 11:26:47",
      "content": "In a “previous life”, I was living in deep East Texas, near the Louisiana border. My husband was a hunter. He truly loved to kill things for fun (shuddering thinking of it now). I was 18 and newly married. He killed a deer on the opening day of hunting season, brought it home, strung it up from a tree in front of our mobile home and gutted it. He promptly handed me a piece of the back strap, telling me it was the most tender part of the animal. He wanted me to fry it up for him. I had little experience with cooking but wanted to be a good wife so I called his mother and asked for instructions.\n\nShe explained that I was to cut the meat into bite size pieces, soak it in milk to get out the “wild” taste, dip it in seasoned flour and fry it up. I did as I was told. I’ll never forget how disgusting I felt with Bambi in the frying pan.\n\nI made mashed potatoes and gravy to go with it. I couldn’t eat it. It tasted musky and was the texture of shoe leather covered in lumpy fried flour. There were little pockets of congealed blood that hadn’t cooked out. I did make fried venison a few more times, along with squirrel and rabbit stew, but never again after we divorced. I’m sure this experience is a small part of the reason I live a meat free life now.",
      "parent": "0",
      "gravatar_hash": "a1a991320a7a033842ba7960c02e8852"
    },
    {
      "id": "1935",
      "author": "Yoko Gardiner",
      "author_url": "",
      "date": "2009-10-07 12:07:55",
      "content": "After eating vegetarian for a long time, I find I prefer vegetables to meat. At the moment, I am eating meat (I'm studying abroad), but I miss eating vegetarian meals which are lighter than meat dishes.",
      "parent": "0",
      "gravatar_hash": "5eb034b7f99acdba1fb985e18146def6"
    },
    {
      "id": "1936",
      "author": "Shelly",
      "author_url": "http://experimentalculinarypursuits.wordpress.com/",
      "date": "2009-10-07 12:43:57",
      "content": "What a great idea! It was so much fun reading all the hilarious stories above. My worst cooking disaster involved a simple egg salad.\n\nI had already successfully made years' worth of meals without concrete recipes, so I thought to myself, how hard can egg salad be? So on the day of a group picnic, I offered to prepare everyone's egg salad sandwiches.\n\nArmed with mayo, hard boiled eggs, and mustard, I utilized my usual experimental approach and threw in tumeric, paprika, cumin, dried basil, ancho chili powder, cayenne pepper, tarragon, coriander...you get the point..\n\nThe case of \"too many spices\" made the egg salad into something completely unrecognizable and pretty inedible. I've made many egg dishes since then, but haven't made egg salad since.",
      "parent": "0",
      "gravatar_hash": "13d9cc91213fe6f7f27ea883fc607054"
    },
    {
      "id": "1937",
      "author": "Virginia",
      "author_url": "",
      "date": "2009-10-07 19:55:13",
      "content": "I worked as a chef for a long time. Restaurants that serve more than one meal often have two shifts, so you have to check your mise when you arrive to make sure everything is still there.\n\nMistake #1: I was late one day, did not check everything, and just jumped right in to making this amazing seafood chowder thickened with potato puree. Carrots, onions, celery, a little fennel, sweat it all together then add some fish stock you have lovingly made the day before.\n\nMistake #2: As I whipped around the kitchen (lateness kills you all day in the kitchen) I kept an eye on the chowder BUT...I didn't taste it until it was at the finishing stage (cardinal sin).\n\nInstead of fish stock, my chowder was made with the Crystal Light lemonade the previous shift had left in my reach-in by accident, in the same kind of container the fish stock was normally kept in. The flavor of veggies, potatoes, fish bits,herbs, butter, aspartame and fake lemon flavor haunts me still.\n\nPS- I just went veggie on August 1st, so the cookbook would really help the cause.",
      "parent": "0",
      "gravatar_hash": "8b78e4f9b7025082e5590b4183d63957"
    },
    {
      "id": "1938",
      "author": "heather",
      "author_url": "",
      "date": "2009-10-08 07:21:28",
      "content": "I had recently stopped eating meat, and was experimenting with new grains.  On a whim, I purchased some buckwheat from the co-op, figuring that since I had read the praises of buckwheat elsewhere, that I could find tons of recipes.  And I did, but for roasted buckwheat; I had purchased raw.  I assumed they were the same, so I made a pasta dish I had seen that was little more than buckwheat and cabbage.  Oh, and A LOT of salt.  That was it.  I can't even describe the flavor, but needless to say, I've been scared of the buckwheat ever since.\n\nEither that, or the time I took out the wheat gluten instead of the flour when baking.  That was interesting.",
      "parent": "0",
      "gravatar_hash": "0f842171422a75151312853807a1d00c"
    },
    {
      "id": "1939",
      "author": "Lynn",
      "author_url": "",
      "date": "2009-10-08 20:11:31",
      "content": "The very first time I ever cooked on my own- I must have been about 8 or 9.  I was making \"grilled cheese\" for my mom.  I put it in the microwave and kept it in there on high for so long that it came out black and hard as a rock.  Even if my mom had wanted to try to choke some down to humor me, it was impossible as it was to hard to even bite.",
      "parent": "0",
      "gravatar_hash": "b24eab36deef5618597e579408afbdef"
    },
    {
      "id": "1940",
      "author": "Caleb",
      "author_url": "http://foodgoesinmouth.com",
      "date": "2009-10-09 17:48:57",
      "content": "First I'd like to say that I'd never heard of Edward Espe Brown until I saw the movie <a href=\"http://www.imdb.com/title/tt0943512/\" rel=\"nofollow\">How To Cook Your Life</a>.  It's just a so-so movie but it's very interesting to listen to him talk about the philosophies behind the food and its preparation.\n\nOk, worst meal? Once, I started an oven grease fire, turning a duck into plasma in the process, but that didn't really make it to the plate.  So I suppose it would be once when I didn't know about reconstituting dried mushrooms before using them, I just threw some dried shiitake into a stirfry dish.  I didn't even get through the first bite before letting my mouth go limp and allowing the woody, rubbery disaster to fall out.",
      "parent": "0",
      "gravatar_hash": "533208891ddda29ec4bd12e40f3cfc4d"
    },
    {
      "id": "1941",
      "author": "Nance",
      "author_url": "",
      "date": "2009-10-10 13:41:59",
      "content": "Experimenting with vegan cooking, I got too ambitious in my efforts to ramp up both the nutrition level and ingredient novelty of each successive dish.  My carnivorous spouse was being a fabulous sport, as usual, and looking for something positive to say about everything put before him.  He likes to reference his Marine survival training when he's bragging about his ability to eat anything that isn't poisonous...and eat it with relish.  A good military man never complains.\n\nHe hadn't reckoned with true vegan weirdness, however.  In week three of the Six-Or-So Week Vegan Challenge, I produced a tempeh, kale, sweet potato, sundried tomato, and baby bela fry-up that reduced my manly man to stunned, stoical silence.  He ate it.  I couldn't.  Mimes couldn't have been quieter at my table that night.  Not a word was ever spoken about it.  Nor, barring this comment, will one ever be.",
      "parent": "0",
      "gravatar_hash": "b913ddc637dbc60f3cab1175742f148d"
    },
    {
      "id": "1942",
      "author": "Sarah",
      "author_url": "http://www.sarahmelamed.com",
      "date": "2009-10-12 11:08:55",
      "content": "sewage sludge is what comes to mind when I think of an Indian chicken and red lentil curry I made. My kids refused to eat it and when I wanted to show them how delicious it was I gagged.\"See! you even hate it\" It had the lumpy texture and color of, ah, I don't even want to say and even with all the spices I added to it, the chicken was limp and white. This meal bypassed my dog and went straight into the trash.",
      "parent": "0",
      "gravatar_hash": "7e37ba6c0e30dbfce4a8c30b0ffdae44"
    },
    {
      "id": "1943",
      "author": "Kenneth",
      "author_url": "",
      "date": "2009-10-12 12:36:17",
      "content": "Most weekends my girlfriend makes a wonderful hearty brunch for us. One weekend she wanted to be pampered and asked me to make brunch instead (big mistake!).She has a recipe book with all her favorite recipes, and she showed me the pages with the pancakes. She told me to have fun and the measurements didn't have to be exact. So I decided to combine 2 pancake recipes, but somehow in flipping the pages, I must have accidentally been reading from other recipes as well. The pancakes ended up with 2 big tablespoons of baking powder and vinegar (who knew pancakes shouldn't contain vinegar?!?).\n\nThe pancakes turned out looking just fine, and the first bite tasted normal. Until you took a second bite, then the bitterness (from the baking powder?) and vinegar taste starts to seep through. She looked puzzled but kept eating and finally asked me what I put in the pancakes. When she heard I put in vinegar, she sighed and firmly pushed the plate away. I've never been asked to make pancakes again!",
      "parent": "0",
      "gravatar_hash": "b5d5b38e2f171e0d84d09db801bae574"
    },
    {
      "id": "1944",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-12 21:02:15",
      "content": "Update, 10/12/2009 - We have winners!\n\nThe contest is over, and we had a bunch of hilarious and frightening entries. I highly recommend reading through the comments above if you could use a laugh. It was hard to pick the winners, but I settled on the ones from Tofu Mom and Virginia. Coincidentally, they both involved artificial lemonade where it never, ever belonged! Thanks to everyone who entered.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}