{
  "comment_count": 11,
  "comments": [
    {
      "id": "1575",
      "author": "Anne",
      "author_url": "",
      "date": "2009-12-31 09:39:41",
      "content": "Michael, where do you find fresh epazote? I've never been able to get it here in New England, and I've heard that the dried stuff is flavorless. Thanks, and Happy New Year!",
      "parent": "0",
      "gravatar_hash": "5cdecc447861b205659b26b2585302fb"
    },
    {
      "id": "1576",
      "author": "Stacy",
      "author_url": "http://littlebluehen.com/",
      "date": "2009-12-31 13:05:58",
      "content": "This sounds fantastic! I've been considering making queso fresco but didn't have a reason to do so before, and we have an abundance of leeks from our CSA right now that needed a more interesting treatment. I've never used epazote before, though, and am not sure where I can get it. A field trip may be in order.",
      "parent": "0",
      "gravatar_hash": "38126f0394b83a8f1a021c0f048669db"
    },
    {
      "id": "1577",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-12-31 19:39:40",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n@anne To find fresh epazote, you need to track down a good Mexican grocery store. If they don&#39;t have it, ask and they probably will know who does. It also apparently is easy to grow. I&#39;m sure dried is pointless.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1578",
      "author": "Melanie",
      "author_url": "http://melaniemusings2.wordpress.com",
      "date": "2010-01-02 01:17:58",
      "content": "This looks delicious--comfort food at it's finest!",
      "parent": "0",
      "gravatar_hash": "5fc0aba140a8a3a0796ae47bb50ae212"
    },
    {
      "id": "1579",
      "author": "feeding the saints",
      "author_url": "http://www.feedingthesaints.com/",
      "date": "2010-01-06 13:09:44",
      "content": "This sounds wonderful! I just discovered your blog this morning (post on salt) and now I see this, too. My father was born and raised in Alabama, so although I'm a Northern girl, I've got that yen for grits and other things Southern. And I just so happen to have leeks in my fridge right now. You've inspired me to do some fiddling around.",
      "parent": "0",
      "gravatar_hash": "896f776c16496648f98713516d74a680"
    },
    {
      "id": "1580",
      "author": "Jami Moss Wise",
      "author_url": "http://www.thenewlyfeds.blogspot.com",
      "date": "2010-01-24 10:58:07",
      "content": "Hi Michael--\n\nI'm glad you confirmed my suspicion that polenta and grits are basically the same thing. (On a bit of a side note, the Southern Foodways Alliance recently published an article on how the lack of niacin in grits and polenta led to rickets in both poor Italians and Southerners.) The recipe looks fabulous--we will have to try it.\n\nI suspect I'll need to find a substitute for epazote, though--any suggestions?",
      "parent": "0",
      "gravatar_hash": "4a664421ac28ea4627d5e5319c396ed0"
    },
    {
      "id": "1581",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-24 21:42:15",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n@Jami - There isn&#39;t really any substitute for epazote, it is a very unique flavor. For this dish, I&#39;d probably just make a straight cilantro pesto instead - still gonna be delicious.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1582",
      "author": "John",
      "author_url": "",
      "date": "2010-08-01 18:50:29",
      "content": "Since it's now August, I can report on my experiment this year: growing Epazote. I planted some seeds along with my tomato starts inside in mid-March; it was about 10\" tall by late May/early June when I planted things outside. I shoved it in a back corner of a planter box, where it got shaded by peas for the first 5 weeks, but by mid-July it was getting decent sun for about 5 hours a day. It's done fine. It's a nice healthy (not very attractive) plant about 4 feet high, with enough leaves for all my epazote needs for the year, I expect. I expect it'll go to seed at some point, and I'll let it self-sow and see whether things come up next year.\n\nGiven this experience, my guess is that the stuff'll grow anyplace you like in New England. If you start it in spring in a peat-pot, and shove it in the ground where there's some sun, you'll get a plant!\n\nNow I just have to try the grits, etc., recipe!",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "17893",
      "author": "Jenne",
      "author_url": "",
      "date": "2012-01-25 11:58:04",
      "content": "What?  But grits...ARE...hominy. Isn't that what makes them grits?  Otherwise you just have polenta.  I'm so confused.  \nWhere are you from that hominy grits are rare?  I live in California and they are in every grocery store.",
      "parent": "0",
      "gravatar_hash": "cc2661a21dcd75bee8a2c8d6800ca8e8"
    },
    {
      "id": "17903",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-25 13:42:03",
      "content": "Nope, not so. You've got your plain grits and your hominy grits. See this page for example: http://www.ansonmills.com/grits.htm",
      "parent": "17893",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17904",
      "author": "Jenne",
      "author_url": "",
      "date": "2012-01-25 13:43:50",
      "content": "Well now I have to go rearrange my entire worldview. :-)",
      "parent": "0",
      "gravatar_hash": "cc2661a21dcd75bee8a2c8d6800ca8e8"
    }
  ]
}