{
  "comment_count": 11,
  "comments": [
    {
      "id": "16832",
      "author": "Marina",
      "author_url": "http://www.cowboycountryvegetarian.blogspot.com",
      "date": "2012-01-11 21:15:50",
      "content": "What a coincedence! I just made a traditional soup with stinging nettles a few days ago: couldn't resist picking a handful when I almost stepped on it. This is a great post, thank you!",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "16873",
      "author": "John",
      "author_url": "",
      "date": "2012-01-12 12:39:23",
      "content": "Wow. I don't have access to any stinging nettles, since we're just starting the snow season here in the northeast. But I DO love pressure cookers ... and I also like sailing. I've never tried using a pressure cooker for either rice or pasta-in-sauce, but I'll be testing it out this weekend, and if it works, they'll go instantly into the 'recipes for on-board' list. When propane is at a premium, and when excess steam means that your living space gets damp or even moldy, avoiding the 20 min of boiling rice is a HUGE win. Thanks, Michael and Laura!",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "16888",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-12 19:07:24",
      "content": "Ah, I knew pressure cookers are popular with RVers, but I hadn't thought about boats. Makes sense. Yeah, I'm sure Laura will steer you right.",
      "parent": "16873",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "16909",
      "author": "John",
      "author_url": "",
      "date": "2012-01-13 04:25:31",
      "content": "We made rice this way last night -- a mix of white and wild rice and some others, which usually wants a mix of 2.75 to 1 water to rice (by volume), at least in our rice-cooker. It ended up perfectly cooked, but with some excess water. I think 2.25 to 1 would have been perfect, and I'd guess 1.75 to 1 for white rice, figuring that in ordinary cooking, 1/4c probably boils off during the simmering. Thanks!",
      "parent": "16888",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "16936",
      "author": "Laura @ hip pressure cooking",
      "author_url": "http://www.hippressurecooking.com",
      "date": "2012-01-13 12:01:15",
      "content": "John, I have a chart that has most grains (though not as many rices as you're using) that has a ratio of water to cups of grain:\nhttp://www.hippressurecooking.com/p/cooking-times.html\n\nYou'll see that each variety has it's own pressure cooking time as well.  Next time, try combining rices with similar cooking times like wild and brown (both 25 minutes under pressure with natural open). \n\nCiao!\n\nL",
      "parent": "0",
      "gravatar_hash": "bee72207ae432771c32e8a07978d1ee3"
    },
    {
      "id": "16937",
      "author": "Laura @ hip pressure cooking",
      "author_url": "http://www.hippressurecooking.com",
      "date": "2012-01-13 12:03:28",
      "content": "Marina, I would love to know more about <i>your</i> stinging nettle soup!\n\nCiao,\n\nL",
      "parent": "16832",
      "gravatar_hash": "bee72207ae432771c32e8a07978d1ee3"
    },
    {
      "id": "16939",
      "author": "Laura @ hip pressure cooking",
      "author_url": "http://www.hippressurecooking.com",
      "date": "2012-01-13 12:36:30",
      "content": "P.S. You can get to that chart anytime by clicking on the \"Cooking Times\" tab at the top of the website.  ; )",
      "parent": "16936",
      "gravatar_hash": "bee72207ae432771c32e8a07978d1ee3"
    },
    {
      "id": "23186",
      "author": "betsy",
      "author_url": "http://www.truepathsthroughmountains.blogspot.com",
      "date": "2012-04-23 09:06:51",
      "content": "Two of my favorite things, united! Well, 3, if you count the potatoes in, too! \nYou must have some very friendly nettle patches, because even if my nettles are 2 inches tall, they sting the bejesus out of my fingers, and sometimes through the gloves. And those early-season stings are far more long-lasting than the later, mature-flowered-plant stings. Kind of entertaining, to have buzzing fingertips all day long, though.",
      "parent": "0",
      "gravatar_hash": "9469c36c0daae99a81a6efb4076e72f3"
    },
    {
      "id": "30169",
      "author": "Melissa",
      "author_url": "",
      "date": "2012-06-24 19:29:41",
      "content": "I've got to try this. I understand that stinging nettle is FULL of nutrients &amp; it grows wild all over Alaska!  However, I don't recognize the picture, our leaves get about a foot long - maybe I need to look at the early growth closer to the base!",
      "parent": "0",
      "gravatar_hash": "7a4f612099dacd41a3e37f015588d5f4"
    },
    {
      "id": "84006",
      "author": "Angela",
      "author_url": "http://pineapplecutter.net/",
      "date": "2012-11-21 13:30:44",
      "content": "I've heard lots of good things about nettles and this is pushing me over the edge to give it a shot. Kinda worried about how they'll be stinging though!",
      "parent": "0",
      "gravatar_hash": "00a45e5140dbd19cfb6bce81873b8b98"
    },
    {
      "id": "84011",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-11-21 13:54:18",
      "content": "Just wear gloves while handling the raw leaves, and be sure to cook them fully, and you'll be fine!",
      "parent": "84006",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}