{
  "comment_count": 19,
  "comments": [
    {
      "id": "45165",
      "author": "John",
      "author_url": "",
      "date": "2012-08-13 08:45:20",
      "content": "This looks and sounds great, although I might use peaches instead of plums...I've never much liked plums for some reason. On the other hand, with the plum version, a perfect accompaniment would be a glass of Sauternes. :)\n\nAfter years of making crepes with Julia's recipe, I FINALLY figured something out: you can use two pans. I use a 10\" cast iron pan, into which I pour the batter. I lift the crepe (with my fingers, same as you!) and flip/drop it into the middle of a 12\" pan on the next burner. This (a) doubles the throughput, as we computer-geeks say, and (b) means that if your aim's not perfect, you don't end up with a crepe that's stuck halfway up the side of your 10\" pan, not getting cooked evenly on its second side. The second side needs to cook just about the same time as the first, so you remove the done crepe from the 12\" pan; flip the part-done INTO the 12\" pan, then pour 1/4c batter into the 10\" pan and swirl. Take a sip of wine, chat with a friend for a moment, tear off a fresh piece of waxed paper if you're using that to separate the crepes as they stack up, and then repeat the process. \n\nAlso: if you have some minimal woodworking skills, or about $5, you can buy a crepe spreader (do a google search) and make the whole \"getting a uniform thickness from your 1/4c of batter\" thing a LOT easier. \n\nOne more crepe suggestion: Take a pound or two of mushrooms, chop them in the cuisinart, put them and 2T butter in a saucepan, season with salt, pepper, maybe even some nutmeg if you like, and cook over low-medium until they get soft and even start to dry out a bit (in mid-cooking they'll be swimming in their own juices). The result is \"duxelles\".  Then prepare 20 crepes (omitting the sugar in the recipe). Use these to make a layer cake: 1 crepe, one T duxelles, one crepe, one T duxelles, etc. Try to spread the duxelles evenly over each crepe, or the sides of your layer cake will droop. If you need more than a tablespoon, so be it. Just make a stack. You serve this by cutting cake-like wedges from the stack. I confess that I, being a non-vegetarian, tend to serve it with a reduced-beef-stock-type-sauce, but I can also imagine it being REALLY delicious served with a sauce made with spinach and a cream-sauce, fairly thin. Or adjacent to a salad of multi-color beets, brunoise, helping to soak up the beet-juice. Darn. Now I'm hungry!",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "45166",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-13 08:50:06",
      "content": "You are on a roll today, Spike! I've done the two-pan thing but always in parallel, never pipelined. Cute idea to use the larger pan to reduce aim problems. And your gateau au crepes avec duxelles (gee my French is fantastic) sounds fantastic. Have you ever tried the Brittany version of crepes with buckwheat flour in the batter? Fantastic with a fried egg and cheese, and a glass of hard cider.",
      "parent": "45165",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "45167",
      "author": "John",
      "author_url": "",
      "date": "2012-08-13 08:55:10",
      "content": "I HAVEn't tried the Brittany version -- I'd never heard of it -- but I definitely will do so. Your suggested accompaniments sound pretty good, too. \n\nAlso: credit where it's due: the \"crepes aux duxelles\" idea comes from \"The James Beard Celebration,\" one of those books where just about every recipe is a winner. (Just about every recipe also involves meat/fish/shellfish, alas, so it's probably not a must-get for your typical reader.)",
      "parent": "45166",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "45262",
      "author": "Vegan",
      "author_url": "http://www.sevenpoint2.com/",
      "date": "2012-08-13 21:14:31",
      "content": "I love adding anything with crepes and this recipe is really amazing. Is it fine not to roast the plums?",
      "parent": "0",
      "gravatar_hash": "bda7603876252c69c15f63b58a0bf6f0"
    },
    {
      "id": "45267",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-13 22:08:17",
      "content": "For sure, you don't have to roast the plums. I also think they would be very good pan-roasted.",
      "parent": "45262",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "45367",
      "author": "Martin",
      "author_url": "",
      "date": "2012-08-14 08:48:14",
      "content": "I just came back from Germany where I enjoyed my mother's plum pancakes. Now, these are thick German pancakes (four eggs, milk, a little butter or oil, pinch of salt, vanilla sugar and a dash of soda water). Once the (rested) dough is poured in to the pan the halved Italian plums are pressed into it. Turning requires a good lid.\nFor serving sprinkle with a mix of regular sugar and cinnamon.\nA fantastic marriage of tart and sweet, and great for feeding kids.\nTraditionally cooked with butter but olive oil also give superb results.\nI've made this with sliced round plums in the US, a little more messy but tastes the same.\nBut now I'll give the sage option a try as my neighbor just gave me some.",
      "parent": "0",
      "gravatar_hash": "1e79d148a0865365d213cfc6d25f16f6"
    },
    {
      "id": "45379",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-14 09:38:54",
      "content": "That sounds completely fantastic! I wonder if you could do them in the oven instead of flipping,  like a Dutch baby.",
      "parent": "45367",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "45400",
      "author": "Martin",
      "author_url": "",
      "date": "2012-08-14 13:02:50",
      "content": "\"I wonder if you could do them in the oven\"\n\nI'd say it's a pan dish because you'll need to churn out a few in a row. And you'd want both sides with a little color.\n\nAs for John's excellent hint with using a 10\" and 12\" pan: In my mother's kitchen I had to use a small omelet pan - and loved it. It made flipping the plum-laden pancakes a piece of cake.",
      "parent": "0",
      "gravatar_hash": "1e79d148a0865365d213cfc6d25f16f6"
    },
    {
      "id": "45540",
      "author": "Bibi @ Bibi's Culinary Journey",
      "author_url": "http://www.bibisculinaryjourney.com",
      "date": "2012-08-15 10:21:42",
      "content": "Your crepes look perfect! The Italian plums &amp; slivovitz is a great flavor combo. I wish I had some of my grandpa's slivovitz to make this.\n\nI make my crepes on 10\" crepe pan and they turn out perfect every time.",
      "parent": "0",
      "gravatar_hash": "efda2e1270e5fd3f29756ae34b15fee7"
    },
    {
      "id": "45908",
      "author": "Jake",
      "author_url": "http://pinoykamayan.blogspot.com",
      "date": "2012-08-18 04:59:49",
      "content": "Simple and nice recipe.. How i wish i have something for tomorrow's event. Thanks.",
      "parent": "0",
      "gravatar_hash": "7f2ed393f9adfbb1ed475d1e03e25412"
    },
    {
      "id": "48276",
      "author": "John",
      "author_url": "",
      "date": "2012-09-02 08:54:43",
      "content": "I finally got around to making these. I had two problems: first, the plums we had were not REALLY ripe enough, and we didn't have enough, so I used some peaches and even some banana as well. Second, I lacked parchment paper, and used waxed paper. That worked (although I suppose I could have started a fire ...) but to be honest, with a cookie-sheet that's teflon-coated, I'd just skip that next time...in the few places where the drips got onto the cookie sheet, cleanup was easy enough. \n\nWe mostly could not taste the sage. It was fresh (I picked it 5 minutes before using it!) and fragrant, but I think that next time I'd use 4 or 6 leaves. I think, too, that next time I'd substitute the leftovers from a bottle of good Sauternes, if I have it, for the brandy. (I didn't have slivovitz). \n\nBTW, the alternative fruit -- peaches, bananas -- worked fine, but not as well as the plums; I think that if the sage had been more present, they would have been an even worse substitute. \n\nAnyhow, I give the recipe an \"A\" and my execution of it a B+. :)",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "48281",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-02 09:03:07",
      "content": "The Sauternes is a great idea. And I agree with you about the sage, I want it to be more present, but I also don't want to be picking it out of my teeth. Maybe a better plan would be to infuse it into (more) melted butter first, then strain that and use it to roast the plums.",
      "parent": "48276",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "53868",
      "author": "Venera@Veggykitchen.com",
      "author_url": "http://www.veggykitchen.com",
      "date": "2012-09-22 06:55:38",
      "content": "I tried this filling for crepes – it’s amazing! \nAs I don’t eat eggs I used the recipe for eggless crepes.\nI will be glad if this link for Eggless Crepes will be helpful for someone too - http://www.veggykitchen.com/eggless-crepes/",
      "parent": "0",
      "gravatar_hash": "fa24f1035ae22ade4cb815b45f6c4678"
    },
    {
      "id": "173713",
      "author": "Geraldine in Spain",
      "author_url": "",
      "date": "2013-07-14 23:34:20",
      "content": "Loved your article on crepes and plums. I had to smile seeing the photo of your cook book. I began cooking with JULIA when her PBS shows began, probably before you were born.\n\n I was always a pretty good little cook as a kid. Reading those first recipes with all the FRENCH TITLES amazed me, never could pronounce them but could cook them. Now at least I am able to pronounce them correctly, albeit, still do not speak French.\n\nThis is a delightful recipe. I would cook the sage leaves in the butter for the fragrance, and still do a chiffonade for the crepes, thus using MORE leaves from the sage. \n\nIn this part of the world breakfast is toast with tomato on top covered in olive oil, it's FAB.\n\nLove your site, thanks so much for your continued great writing and inspiration!\n\nGeraldine Toltschin",
      "parent": "0",
      "gravatar_hash": "bc13223613e7d7d1fff26cdd93c243d9"
    },
    {
      "id": "173762",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-07-15 03:08:45",
      "content": "Thanks, Geraldine! That's one of my favorite breakfasts too, at least for the couple months a year when we have good local tomatoes.",
      "parent": "173713",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "866272",
      "author": "REX TOLTSCHIN JR.",
      "author_url": "http://herbivacious",
      "date": "2014-03-30 14:23:11",
      "content": "enjoy your web page   WITH JERRI",
      "parent": "0",
      "gravatar_hash": "b5e1ae0934f1f3a275db27d168830863"
    },
    {
      "id": "866275",
      "author": "REX TOLTSCHIN JR.",
      "author_url": "http://herbivacious",
      "date": "2014-03-30 14:24:41",
      "content": "ENJOY YOUR WEBSITE.......WITH JERRI T.",
      "parent": "0",
      "gravatar_hash": "b5e1ae0934f1f3a275db27d168830863"
    },
    {
      "id": "1314064",
      "author": "jack",
      "author_url": "",
      "date": "2015-11-02 11:02:17",
      "content": "I'm making this tonight for me and my roommates, with some hefty modifications to the filling. It being fall, plums are less in-season, so I've opted for apples (which are in delicious abundance). I'm using a slightly tart and crisp variety, frying them in the butter on the stove instead of the oven. \n\nBeing under 21, I had to forgo the brandy. However, *almost* equally good when added to the yogurt: maple syrup in lieu of honey, a teaspoon or two of vanilla extract, and a dash of balsamic vinegar (thanks to jfh for that weird idea). Definitely easy to overdo the balsamic, but in the right dose you get this really cool sequence of flavors, with the final tart of vinegar complementing the apples especially nicely.",
      "parent": "0",
      "gravatar_hash": "c6011206c15036f19fc1d8e358d2d47a"
    },
    {
      "id": "1314065",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2015-11-02 11:11:30",
      "content": "Like father, like son! Sounds awesome.",
      "parent": "1314064",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}