{
  "comment_count": 12,
  "comments": [
    {
      "id": "1091",
      "author": "John",
      "author_url": "",
      "date": "2010-06-03 08:40:36",
      "content": "Sounds good to me. I know you're a polenta-nut, but I'll just mention that you can get a similar (albeit distinct) effect using grits. You cook them up a little drier than you might for breakfast cereal, let them sit in a shallow container for a couple of hours in the fridge, and you've got grits-cakes, which are great for breakfast (fried in a little of your favorite fat). OR...you can use them in recipes like this one, when you find you've got no polenta on hand. And then there are things like jalapeno and grits casserole (you can figure out the recipe from the name; a little grated cheese on the top is nice!), etc.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "1092",
      "author": "Micah",
      "author_url": "",
      "date": "2010-06-06 06:30:38",
      "content": "wow, this looks and sounds AMAZING. I just found your blog and I am so excited to try some recipes. Thanks!",
      "parent": "0",
      "gravatar_hash": "a3d424c542784bb31aa20ab0ae3f82af"
    },
    {
      "id": "1093",
      "author": "Steph",
      "author_url": "http://www.plainchicken.blogspot.com",
      "date": "2010-06-08 08:18:06",
      "content": "I had polenta cakes a few weeks ago in a restaurant and wanted to make them at home.  I'll give your recipe a try.  Looks great!",
      "parent": "0",
      "gravatar_hash": "103ee58d3577e4669a94c72abf3d9661"
    },
    {
      "id": "1094",
      "author": "Meredith",
      "author_url": "http://www.thepseudotarian.wordpress.com",
      "date": "2010-06-08 13:21:07",
      "content": "I love combining polenta and beans! One of my favorite lunches is crispy polenta cakes on top of white beans with leeks, all topped with an egg. I can't wait to try this.",
      "parent": "0",
      "gravatar_hash": "542590862c7b69feec311658b6734344"
    },
    {
      "id": "1095",
      "author": "Cucee Sprouts",
      "author_url": "http://cuceesprouts.com/2010/08/cheesy-zucchini-polenta-cakes-with-mushroom-duxelles/",
      "date": "2010-08-17 11:05:05",
      "content": "What a great recipe! And the photo! I really love polenta and this is probably the best way to serve it. Here is my variation: <a href=\"http://cuceesprouts.com/2010/08/cheesy-zucchini-polenta-cakes-with-mushroom-duxelles/\" rel=\"nofollow\">http://cuceesprouts.com/2010/08/cheesy-zucchini-polenta-cakes-with-mushroom-duxelles/</a>\nThe outcome: creamy inside and crunchy on the outside, these cakes are healthy and still very satisfying. Zucchinis add sweetness and color to the cakes, making them pretty to look at.",
      "parent": "0",
      "gravatar_hash": "009977fd98be094993f2c53ad5413e10"
    },
    {
      "id": "21672",
      "author": "Allison",
      "author_url": "",
      "date": "2012-03-19 20:25:04",
      "content": "We made the braised cabbage and beans part tonight (with the sauce!) to go with some pierogis!  It was amazing. Such a different kind of dinner for us, and so so good!!",
      "parent": "0",
      "gravatar_hash": "d994c79003936d28e37c820a1a564019"
    },
    {
      "id": "21704",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-20 15:20:28",
      "content": "Ooh, love the idea of serving that with pierogis (which I've never made, but I've eaten some good ones.)",
      "parent": "21672",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21727",
      "author": "Erin",
      "author_url": "",
      "date": "2012-03-21 13:19:53",
      "content": "How do you get the polenta cakes to not stick?  I tried to make crispy polenta cakes the other night with a black bean and corn sauce and they just stuck like glue, even though my oil was heated to near smoking.",
      "parent": "0",
      "gravatar_hash": "8237e338884f0cb09dcc1ce5ecf31024"
    },
    {
      "id": "21728",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-21 13:29:43",
      "content": "What kind of pan were you cooking them in? My preference is a perfectly seasoned cast iron pan. Second choice would be non-stick. Also, make sure the cakes don't have more moisture than necessary, and use plenty of oil.",
      "parent": "21727",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21744",
      "author": "Erin",
      "author_url": "",
      "date": "2012-03-21 16:31:38",
      "content": "It was a well seasoned cast iron.  It may have been the moisture issue, I used a different polenta recipe and the water ratio was higher.  They were very splatter prone.  I used quite a bit of oil, Spectrum Og Sunflower Oil, so it was a high heat oil.\n\nI'll have to attempt this again.  I'd love to try and make them to go with this recipe.  Thanks!",
      "parent": "0",
      "gravatar_hash": "8237e338884f0cb09dcc1ce5ecf31024"
    },
    {
      "id": "21819",
      "author": "John",
      "author_url": "",
      "date": "2012-03-22 04:39:35",
      "content": "Here's something I've found useful: If you've ever made grits for breakfast, and not eaten all of it, and left the pot there for the whole day with the cover on, you'll know that by evening, the grits have formed into this almost rubbery mass. (I might have done this just once, back in my grad-student days!) Anyhow, THAT mass is perfect for cooking into polenta cakes. So if you have time for the forethought, make a batch of grits in the morning. Pour them into a baking dish so they're about 1/2\" thick. Shove that in the fridge for the day. Cut into slabs and fry for dinner (perhaps pre-heating a bit in the microwave to make sure they're heated through). The same approach can be used with corn-meal.",
      "parent": "21744",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "21823",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-22 06:19:00",
      "content": "Absolutely! I love making cakes from leftover grits or polenta. Just to be clear, if it sat out all day, even covered, you probably shouldn't eat it from a food safety point of view, even if you re-cook it. You want to get it out of the 40-140 degree F danger zone within two hours.",
      "parent": "21819",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}