{
  "comment_count": 12,
  "comments": [
    {
      "id": "513",
      "author": "amee",
      "author_url": "http://www.rabbitfoodrocks.blogspot.com",
      "date": "2011-02-28 09:02:06",
      "content": "i was anxiously awaiting your next post.  :)  this looks fantastic and a very forgiving recipe, i imagine?  Thanks for sharing.  One day i'm going to fly over there and crash your dinner party...  haha.",
      "parent": "0",
      "gravatar_hash": "ea1fed8e804be28ee1596700c053eef2"
    },
    {
      "id": "514",
      "author": "Gina",
      "author_url": "",
      "date": "2011-02-28 15:00:03",
      "content": "dang girl",
      "parent": "0",
      "gravatar_hash": "d18e71ec41333e8acec03d9bc7684e51"
    },
    {
      "id": "515",
      "author": "Alessandra",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2011-03-01 01:03:05",
      "content": "It gives me the munchies :-), but is the apple necessary?\n\nciao\nAlessandra",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "516",
      "author": "John",
      "author_url": "",
      "date": "2011-03-01 05:10:22",
      "content": "This is one of those dishes where the TYPE of apple could really make a difference. I tend to favorthe more \"sour\" varieties like Granny Smith or Macintosh for most things, but for this recipe, I think I might actually go with a Gala or even a Delicious, esp. if I added a little vinegar to the water for cooking the lentils, or if the microgreens were tossed in a little vinaigrette. What did YOU actually use, Michael? [This is a pet peeve of mine -- folks specify that the garlic has to be grown from seed on the northeast side of the garden in the shade of a full-grown rosemary plant, or that the oil has to be triple-pressed, or that the cheesmaker can only wear paper sandals while preparing the goat's milk for the cheese, and then they say \"add one apple.\" Grrhmmmph. But perhaps I'm exaggerating a trifle.]",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "517",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-03-01 07:19:17",
      "content": "It is a very fair point! I&#39;m pretty sure I used a Pink Lady.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "518",
      "author": "Ivy Manning",
      "author_url": "http://www.ivysfeast.blogspot.com",
      "date": "2011-03-01 09:08:03",
      "content": "That is RIGHT up my alley. Though I've been fighting with and editor who called Lentils du Puy \"too esoteric\". I see them everywhere, and apparently you do too, so there! This really does look great! How did you get the bread to make that little boat shape? Did you scoop out some of the crumb?",
      "parent": "0",
      "gravatar_hash": "398d9a223280b1350d4db253ecccefe3"
    },
    {
      "id": "519",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-03-01 09:48:45",
      "content": "Yeah, I don&#39;t think lentils du Puy are too hard to find at this point, at least on the coasts or the web. I think in a lot of cases, black lentils would be a decent substitute. A little different, but offering some of the same positives. The bread was an &quot;American Baguette&quot; from PastaWorks on Hawthorne, and that is just sort of what it looked like after I hacked at it with the rather deficient bread knife I had access to at that moment! Delicious baguette though.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "520",
      "author": "amalie",
      "author_url": "",
      "date": "2011-03-03 13:06:29",
      "content": "o.m.g! My heart just sort of skipped a beat. Its just such a beautiful combination of something that reads like poetry and sounds so good mmmm. Cannot wait to try and THANK YOU for getting me hooked.",
      "parent": "0",
      "gravatar_hash": "2404476518f9e6b74698fb26077abe42"
    },
    {
      "id": "521",
      "author": "Mary @ Delightful Bitefuls",
      "author_url": "http://delightfulbitefuls.blogspot.com/",
      "date": "2011-03-03 13:29:15",
      "content": "This looks incredible delicious... loving this combo of flavors!!\n\nGreat blog; happy I found you!\n\nMary xx\n<a href=\"http://delightfulbitefuls.blogspot.com/\" rel=\"nofollow\">Delightful Bitefuls</a>",
      "parent": "0",
      "gravatar_hash": "1fe0078f9d3cd89786a0032ee1e772bd"
    },
    {
      "id": "522",
      "author": "Lael Hazan @educatedpalate",
      "author_url": "http://www.giulianohazan.com/blog",
      "date": "2011-03-06 15:47:16",
      "content": "Hmn.... I think you can find lentils du Puy at most gourmet grocery stores. I've even seen them here, in the wilds of Florida.  My issue is that I don't think I could wait to eat the truffle cheese in order to make the recipe.  One of my favorite cheeses of all time!",
      "parent": "0",
      "gravatar_hash": "3f513a08ba12dd91fd9177912008f47a"
    },
    {
      "id": "523",
      "author": "John",
      "author_url": "",
      "date": "2011-03-07 20:23:59",
      "content": "I made this tonight for the family. Everyone loved it. The universal complaint, put best by my daughter, was \"I really like this, but it's hard to eat without spewing it all over the place.\" I think this might work better with a bread a little softer (and wider) than a baguette. But the flavor and texture mix was excellent, and this'll definitely go on our \"frequent use\" list.  (I couldn't find a truffled sheep's milk cheese, so I tried a goat's milk one, and a Greek sheeps-milk cheese where I added some porcini-flavored olive oil instead of having the truffle flavor in the cheese. Both were not particularly soft cheeses, but both worked really well.\n\nBTW: small typo: 8 sliced semi-soft -> 8 slices semi-soft.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "524",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-03-07 21:52:23",
      "content": "Mmm. porcini oil sounds like an excellent alternative. Glad you guys liked it! It is true, it is a bit of a messy bite. Another way to do it is serve it on larger piece of a country style bread and eat it with knife and fork.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}