{
  "comment_count": 31,
  "comments": [
    {
      "id": "1547",
      "author": "Jennifer",
      "author_url": "",
      "date": "2010-01-04 09:28:28",
      "content": "I just received my first Maldon salt--now we'll see if I can figure out what to use it on. I'm still confused about when to salt. I've been working on some Bayless cookbooks, and he seems to recommend salting at the end of his sauces and beans (and I appreciate his size suggestions--I think I usually undersalt).\n\nLike the idea of your series.",
      "parent": "0",
      "gravatar_hash": "332f9fc8f277e1107d7cd9406b3ee8f0"
    },
    {
      "id": "1548",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-04 09:42:03",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n@Jennifer - try searching my site for &quot;Maldon&quot; to get some suggested uses. There is a search box near the top of the right sidebar. Enjoy!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1549",
      "author": "maureen",
      "author_url": "",
      "date": "2010-01-04 09:42:30",
      "content": "jennifer, i think that beans are an exception because salt can toughen their skins during the cooking process.  this is what rancho gordo says, anyway.\n\nthis is a great idea for a series of posts, and i'll be looking forward to reading about acid, fat, and crunch too. i have a friend who is a truly stellar chef, and whenever we get together to cook, i try to pay attention to the way he uses these elements.  he made an amazingly flavorful tomato sauce for gnocchi with italian sausage and delicata, and i was a little alarmed at the quantity of vinegar he splashed in while simmering, and then at the generous pad of butter and splash of cream he added as a final step.  of course, once i tasted it, i immediately understood why his sauce beat the pants off anything i'd made!",
      "parent": "0",
      "gravatar_hash": "c61ac37b42683f60912bb08f3971dad2"
    },
    {
      "id": "1550",
      "author": "Ivy Manning",
      "author_url": "http://www.ivysfeast.blogspot.com",
      "date": "2010-01-04 10:59:09",
      "content": "Hi Michael\n\nWell put! Have you ever been to At the Meadow in Portland, Oregon? It's a phenomenal little shop with a zillion types of salt. They do mail order, too. I am addicted to their black truffle salt...google it!\n\nHappy New Year!",
      "parent": "0",
      "gravatar_hash": "398d9a223280b1350d4db253ecccefe3"
    },
    {
      "id": "1551",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-04 11:05:16",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n@ivy I&#39;ll check it out! I have some black truffle salt I bought in NYC awhile back that I feel like I should be ashamed of, since no doubt it is as artificial as truffle oil. But I really like it too :).",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1552",
      "author": "Melissa",
      "author_url": "",
      "date": "2010-01-04 12:11:26",
      "content": "Wow! What a great post! Thanks for the mini culinary lesson. I'm looking forward to the rest in the series :)",
      "parent": "0",
      "gravatar_hash": "b33cca673da40073e0a0423148136813"
    },
    {
      "id": "1553",
      "author": "Scott",
      "author_url": "",
      "date": "2010-01-04 16:36:49",
      "content": "I think of olive oil as something that you spend a lot for its finishing abilities, but I have never thought of salt in that way. I will definitely have to experiment with this. Thanks for the motivation.\n\nI have been using sea salt from the bulk bin at the local food co-op for my daily cooking, but it's not iodized. Do you ever used iodized salt? I wonder if the nutritional concerns that initially lead to ionization are still existent in the modern diet.\n\nOh, and you forgot one of the other basic food groups- garlic ;)",
      "parent": "0",
      "gravatar_hash": "3152eb9a826251ff5dd51e86fcb5a01d"
    },
    {
      "id": "1554",
      "author": "shane",
      "author_url": "",
      "date": "2010-01-04 17:56:49",
      "content": "At the Meadow in Portland rules!!!  I think they sell more different kinds of salt then anywhere else in the world.",
      "parent": "0",
      "gravatar_hash": "0ee9b57df1a9be53d6bebd7d3e8e8476"
    },
    {
      "id": "1555",
      "author": "John - Mormon Foodie",
      "author_url": "http://mormonfoodie.blogspot.com",
      "date": "2010-01-04 20:52:33",
      "content": "Right on, Micheal! Fishing with salt really can make a difference to many dishes. My current favorite is Real Salt (Google it). Of course, I could be biased. It's mined just 100 miles from my house. ;-)",
      "parent": "0",
      "gravatar_hash": "0750826129ee44caebb3eba7010ade18"
    },
    {
      "id": "1556",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-04 21:37:33",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n@John - oh yes, I believe I&#39;ve seen the Real Salt brand in our stores out here, I&#39;ll have to give it a try.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1557",
      "author": "Cajun Chef Ryan",
      "author_url": "http://cajunchefryan.rymocs.com/blog2/recipes/cabbage-rolls/",
      "date": "2010-01-05 05:24:00",
      "content": "Very few recipes do not include some form of salt. In ancient times salt was treated like gold is today, and doled out for a high price.\nToday, salt has so many forms and options like the flaky Maldon variety you mention here.",
      "parent": "0",
      "gravatar_hash": "9f3b5ef4294bafb575b419690b0d278d"
    },
    {
      "id": "1558",
      "author": "The Hungry Mouse",
      "author_url": "http://www.thehungrymouse.com",
      "date": "2010-01-05 07:05:55",
      "content": "Oh, so well put, thank you!\n\n+Jessie",
      "parent": "0",
      "gravatar_hash": "9cef9c388673aefcda43f6d3c888efb2"
    },
    {
      "id": "1559",
      "author": "Kirstin",
      "author_url": "http://ivorypomegranate.com",
      "date": "2010-01-05 08:48:19",
      "content": "This is really helpful!  I have to admit that I don't taste-test my dishes enough during the cooking process, something I'm working on changing.  Your pictures are stunning, and your writing is great! I just loved the phrase \"They aren't going to turn undercooked eggplant into a silk purse...\"",
      "parent": "0",
      "gravatar_hash": "a076eaf7f8204d23f81929373721e46f"
    },
    {
      "id": "1560",
      "author": "Alessandra",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2010-01-05 13:24:06",
      "content": "I like Maldon salt, very much!\n\nYou know what is the real problem with salt Michael? That in many 'developed' countries people taste buds are either underdeveloped or have been killed. More people are using ready made food, or half made (sauces from sachets, mixes, those kind of things) which already contain sodium (sometime to much in fact) and other flavor enhancers. Salt is vital in our diet, we need it. Too much salt, and we die. But it is not the home cook, who makes everything from scratch and add his/her own salt who is at risk here! It is the one who buy ready made food, sauces, mixes, cans and packets...add the sodium that you see in the labels and see you blood pressure rise!  If these people stop buying food, and learn to cook from scratch, they will also learn to use salt :-).",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "1561",
      "author": "Caleb",
      "author_url": "http://www.ramendays.com",
      "date": "2010-01-05 17:10:13",
      "content": "I found your food blog going through a few links. Glad I ran into it. Didn’t know that the food blog/recipe community was so big online. I love your posts!\n\nI was wondering if you would like to exchange links. I’ll drop yours on my site and you drop mine on yours. Email at ramendays@yahoo.com or stop by my site and drop a comment. Let me know if you would like to do a link exchange.\n\nCheers,\nCaleb\n<a href=\"http://www.ramendays.com\" rel=\"nofollow\">http://www.ramendays.com</a>",
      "parent": "0",
      "gravatar_hash": "77f95a0129b8eb5e20a8adfc87cfb515"
    },
    {
      "id": "1562",
      "author": "Melissa",
      "author_url": "http://aloshaskitchen.blogspot.com",
      "date": "2010-01-05 18:27:04",
      "content": "Well said, Alessandra.\n\nAnd great article!  I look forward to reading the others.",
      "parent": "0",
      "gravatar_hash": "d8fb1773f83896ed9505e27b9493dc71"
    },
    {
      "id": "1563",
      "author": "Katie",
      "author_url": "",
      "date": "2010-01-05 19:33:39",
      "content": "I was coating candied orange peel with chocolate once and had leftover chocolate, so I spread it out on a silpat and added some sea salt to the top. It was so unbelievably good, especially since the chocolate was from low-quality chocolate chips.",
      "parent": "0",
      "gravatar_hash": "aec8e59c90b66902ce68529957f39d9a"
    },
    {
      "id": "1564",
      "author": "A. C. Parker",
      "author_url": "http://www.feedingthesaints.com/",
      "date": "2010-01-06 09:22:02",
      "content": "I found you through Wednesday's edition of \"Food News Journal\" and I'm so glad they picked up your post. I enjoyed reading it, and I'm sure I can benefit--I'm one of those salt-shy home cooks you mention. I do love salt used with chocolate and caramels and am finally beginning to use more salt in my savory dishes (I'm aware of how that sounds--a bit like putting the cart before the horse). Anyway, thanks. I look forward to the rest of your \"food popping\" quartet.",
      "parent": "0",
      "gravatar_hash": "896f776c16496648f98713516d74a680"
    },
    {
      "id": "1565",
      "author": "Jill Silverman Hough",
      "author_url": "http://www.jillhough.com",
      "date": "2010-01-06 09:37:42",
      "content": "Hi Michael, and thanks for your great post - I've read and learned a lot about salt over the years, but you put it brilliantly into context as being one of the arenas, if you will, that you can look to to take a dish from fine to fantastic. I look forward to reading about the others.\n\nI wrote about salt for my blog as well - this post includes a little about my salt epiphany, as well as how to train yourself to \"season to taste\": <a href=\"http://jillhough.com/blog/?p=134.\" rel=\"nofollow\">http://jillhough.com/blog/?p=134.</a> And this post talks about \"designer\" salts (I, too, am a big fan of The Meadow and Mark Bitterman, its selmelier): <a href=\"http://jillhough.com/blog/?p=149.\" rel=\"nofollow\">http://jillhough.com/blog/?p=149.</a>\n\nLastly, congratulations on being picked up by the FNJ!",
      "parent": "0",
      "gravatar_hash": "e2ab1a3737a31608d159db1b8841d2b3"
    },
    {
      "id": "1566",
      "author": "eggplant43",
      "author_url": "http://eggplant43-aubergine.blogspot.com/",
      "date": "2010-01-06 16:08:41",
      "content": "Loved your comment, an important distinction about scratch cooks vs.the rest of those who cook. Knowing about foods, their natural qualities, and nutritional content can really make a difference in the use of salt. At least it does for me.\n\nI am a person who has cooked low salt for the last 40+ years by choice. I always warn guests I use minimal salt, they frequently don't add any additional salt, although it is freely available, telling me my cooking doesn't need it.\n\nThat being said, I realize certain foods demand salt, such as mashed potatoes, and don't hesitate to use it when called for. I use a Himalayan mined pink salt for everyday, and love alder smoked salt. I will definitelt check out the Meadow.",
      "parent": "0",
      "gravatar_hash": "70645149a730ed1c666e2cce62bb85a4"
    },
    {
      "id": "1567",
      "author": "Maggie",
      "author_url": "",
      "date": "2010-01-07 09:04:09",
      "content": "Oddly enough -- oddly because I'm a big salt-fan in general -- I like my eggs completely unsalted. I don't even want particularly salty ingredients, like aged cheese or (gulp) bacon in them. It's precisely that silky, pillowy aspect I'm looking for, that seems to me to be as much about voluptuous taste as it is about texture -- all cello, no bursts of flute. However, after reading your piece I'm thinking about trying a finishing salt in a TINY quantity to see how I like that.",
      "parent": "0",
      "gravatar_hash": "5961fcbc99b68f429c6d63b23b8858af"
    },
    {
      "id": "1568",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-07 11:15:00",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n@scott - I really don&#39;t use iodized salt at all these days. As far as I know, it isn&#39;t a big issue, but if I develop a goiter I might change my mind :)",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1569",
      "author": "Debby",
      "author_url": "http://www.foodiewife-kitchen.blogspot.com",
      "date": "2010-01-08 10:24:45",
      "content": "Thank you! This was a great post, and much needed.  I don't use table salt, and haven't for years.  I have a friend, whose food is so bland that I dread eating her food. She won't salt anything. Blecccccccccch!  I'm forwarding this to her!",
      "parent": "0",
      "gravatar_hash": "fa9614403bbf477f52cb4c2227391201"
    },
    {
      "id": "1570",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-08 12:22:58",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\nThat&#39;s a great idea Debby! Always easier to hear things from a neutral 3rd party :)",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1571",
      "author": "milcarnivore",
      "author_url": "http://milcarnivore.wordpress.com/",
      "date": "2010-01-15 16:10:31",
      "content": "Very nice discussion of the importance of proper salting while cooking.  I also like the analysis of salt, acid, fat and crunch: I've become a big believer in a drizzle of sherry vinegar or a sprinkling of Maldon on a finished dish.  Would spice also fit into this model?  A little cayenne, Tabasco or Sriracha goes a long way towards lifting flavors.  Perhaps professional chefs wouldn't include spice in the same way because different customers have different heat preferences?",
      "parent": "0",
      "gravatar_hash": "95bcdc249dbe30947a9990a6e3c874a0"
    },
    {
      "id": "1572",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-15 22:52:42",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n@milcarnivore - Absolutely, spice can be used in that way. I think the only difference is that it is perhaps not as nearly universal as the need for salt, acid, fat and crunch. Another, related category might be the fresh herb garnishes, though that overlaps with crunch.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1573",
      "author": "Heidi from Savory Tv",
      "author_url": "http://www.savory.tv",
      "date": "2010-01-17 21:09:58",
      "content": "Salt addicts here.  Do try truffle salt, you will soon be hooked, I use the Ritrovo brand from Marx foods and love it (they have a killer saffron salt too).  Awesome on all things egg, potatoes, and on popcorn.",
      "parent": "0",
      "gravatar_hash": "fd51c52f966705863d77d8559c508a32"
    },
    {
      "id": "1574",
      "author": "Andrew Luhrs",
      "author_url": "",
      "date": "2010-06-15 09:50:58",
      "content": "I like the selection at Salt Traders even better --- and they ship anywhere! Check out www.salttraders.com ! I know they have Maldon too.",
      "parent": "0",
      "gravatar_hash": "ad551237d838748329e62ed9d3d128e0"
    },
    {
      "id": "50962",
      "author": "Carolina",
      "author_url": "",
      "date": "2012-09-14 16:08:50",
      "content": "Although I agree with almost everything you said...American people are SO guilty of undersalting EVERYTHING they serve, AND they purposely do it, even if they have no health problems. (One thing they often say is that they never salt nor sweeten any foods so that their children will not have 'bad habits' to break when they're adults. SMH!) HOWEVER...when it comes to unsalted butter, I MUST disagree with you. I buy only 'hand crafted, organic' butter from a woman at our local farmers market...her butter is even better than the imported Irish butter. I would never add salt to that. I serve it with my own homemade bread, and totally enjoy the sweet, creamy flavour of that butter, just 'as is'. The bit of salt in the bread is all that is needed. Please, try a really great butter WITHOUT the salt, and see if you don't agree.",
      "parent": "0",
      "gravatar_hash": "41f09ba6c525c0778908b93e5fd36715"
    },
    {
      "id": "50964",
      "author": "Carolina",
      "author_url": "",
      "date": "2012-09-14 16:18:28",
      "content": "I wanted to add that I also grow a variety of radishes called 'French Breakfast' radishes, and DO often serve them at breakfast topped with a good dab of that same unsalted butter. It seems counter-intuitive to serve radishes without salt, but this works, and works well. The French have served them like this for probably centuries now. It's a 'French classic' and for good reason. (I also saute the radish greens and use them as part of the filling for an accompanying omelet. I DO salt the greens while sauteing, depending on what else will be in the filling.)",
      "parent": "0",
      "gravatar_hash": "41f09ba6c525c0778908b93e5fd36715"
    },
    {
      "id": "51016",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-14 19:16:57",
      "content": "That's an interesting point... I'm not blind to the charm you are speaking of, of great plain sweet butter, but what I really like is a few grains of good salt on top of that sweet butter, not mixed in.",
      "parent": "50962",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}