{
  "comment_count": 5,
  "comments": [
    {
      "id": "4074",
      "author": "Snacky Pants",
      "author_url": "",
      "date": "2007-08-24 14:22:58",
      "content": "I am not a big fan of gelatinous foods, but I did give this a try.  The flavor of the dragon fruite was too mild and its texture made me expect some big juicy flavors.  I would try it again, but certainly would not rush out to buy a dragon fruit.  The chocolate crepes rocked though!!!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "4075",
      "author": "Jasline",
      "author_url": "",
      "date": "2007-08-24 18:30:17",
      "content": "So this dragon fruit is so costly in US...here in SG, much cheaper even if is organic. 2 for SGD$3.50,or non-organic SGD$0.19/100g. It is very tasty.\n\nEnjoy!\n\nCheer!\n\nJas",
      "parent": "0",
      "gravatar_hash": "cb68d4bb9064c79fc07bb0d1329255cb"
    },
    {
      "id": "4076",
      "author": "Andy",
      "author_url": "http://catertots.net",
      "date": "2007-08-26 21:11:54",
      "content": "Never tried dragon fruit, I can't get any where I am.\n\nDo they really need to put those darned little stickers on every piece of fruit?",
      "parent": "0",
      "gravatar_hash": "73d4c32adbb9b224c6644513fb4720d2"
    },
    {
      "id": "4077",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2007-08-26 22:40:13",
      "content": "Yeah, those stickers are annoying. Re the gelatinous texture of the sorbet, I emailed Harold McGee, author of On Food And Cooking which is pretty much a bible of technical food knowledge and a huge influence on all the molecular gastronomy we see these days, and he wrote back to say:\n\n<i>On 8/26/07, Harold McGee wrote:\n\nHi Michael, the fruit probably has carbohydrate gums like the kind found in okra and purslane and cactus paddles, and they're not freed from the cells until you puree and break the cells open. That's my guess. Best wishes,  Harold</i>\n\nThat makes a lot of sense to me, the texture was actually very similar to the sliminess of okra. Thanks Harold!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "4078",
      "author": "Peter DAPRIX",
      "author_url": "http://www.calimoya.com",
      "date": "2007-09-02 15:59:21",
      "content": "I just ate one of these interesting fruits yesterday and served our guests a chilled half each to be eaten with a spoon. Those who demand strong flavors were not impressed, but the rest of us loved them. So simple, so refreshing. Will try the sorbet recipe above. If it is anything like the lime sorbet I have been making for years, a \"sauce\" of tequila that has been frozen in the bottle in the freezer which makes it a syrop, would be a nice touch.\nI don't know about relative prices, but you can buy them grown in the US from www.calimoya.com for $30 US for 3 lbs of fruit (about 4-5 pieces) delivered to your door. Don't know if that helps but hope so.",
      "parent": "0",
      "gravatar_hash": "bc4d78e73b44a0de10e77902400009d7"
    }
  ]
}