{
  "comment_count": 20,
  "comments": [
    {
      "id": "20781",
      "author": "Nilam",
      "author_url": "http://khavanu.blogspot.com",
      "date": "2012-03-05 07:42:11",
      "content": "Fun! What a nice surprise in my reader, I especially liked your new cookbooks bottom left =)",
      "parent": "0",
      "gravatar_hash": "39a80437f59150fc64ae46179001398a"
    },
    {
      "id": "20783",
      "author": "sweet road",
      "author_url": "http://www.asweetroad.com",
      "date": "2012-03-05 07:49:58",
      "content": "Great video, that dutch baby looks sooo yummy!\n\nps I'm jealous of your stove/kitchen. I'm currently stuck with something like a half size electric stovetop. sigh :)",
      "parent": "0",
      "gravatar_hash": "eec3e0e058b7a2779222b9720b26acd7"
    },
    {
      "id": "20787",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-05 10:03:15",
      "content": "I only wish that kitchen were mine! It is actually belongs to Tim and Eliza from ChefShop.com. Mine isn't nearly so photogenic, though it is pretty darn functional.",
      "parent": "20783",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "20795",
      "author": "Emer from EverydayVegetarianRecipes",
      "author_url": "http://www.everyday-vegetarian-recipes.com/",
      "date": "2012-03-05 12:40:11",
      "content": "Nice job Michael! Congratulations on this new departure. And a really great quality and feel to the video. I'm looking forward to watching more of them. (P.S. I'm experiencing kitchen envy here too)",
      "parent": "0",
      "gravatar_hash": "a03b38103ebcd1cd685aa8ff9df8fa89"
    },
    {
      "id": "20818",
      "author": "Adam",
      "author_url": "",
      "date": "2012-03-05 20:16:45",
      "content": "I love this recipe, and the video itself is really well-done. Thanks for sharing with everyone, good to put a face to the name (and I love the kitchen!).",
      "parent": "0",
      "gravatar_hash": "da46fc5100e9ca636f1bc8a25da59b12"
    },
    {
      "id": "20869",
      "author": "Without Bacon",
      "author_url": "http://withoutbacon.wordpress.com",
      "date": "2012-03-06 12:52:28",
      "content": "Looks amazing!  There was a restaurant in NYC called \"Elsewhere\" that used to serve great mini Dutch Babies.  I reviewed it on my blog (withoutbacon.wordpress.com) a few months ago, but sadly the restaurant has since closed.  I didn't realize the recipe is so simple -- maybe I'll try it myself!",
      "parent": "0",
      "gravatar_hash": "d54c403f8c6c25cc9a98ced5b389ab24"
    },
    {
      "id": "20939",
      "author": "Vidhya",
      "author_url": "",
      "date": "2012-03-06 20:41:53",
      "content": "great to see a video recipe! and this dutch-baby looks so good and easy to make!! can't wait to try it ! :)",
      "parent": "0",
      "gravatar_hash": "d1d4a2a3ce9dbed8a28ff07c770ecc68"
    },
    {
      "id": "21253",
      "author": "Stephanie",
      "author_url": "http://kidscooking.about.com",
      "date": "2012-03-10 08:58:14",
      "content": "Looks fantastic - love your work. Thanks!",
      "parent": "0",
      "gravatar_hash": "90437e145d4437f0ea586c346dae3942"
    },
    {
      "id": "21350",
      "author": "Jodi",
      "author_url": "",
      "date": "2012-03-12 10:00:47",
      "content": "This looks delicious. What do you think about preparing it in a dutch oven on a camping trip? We will have an RV but will be making desert for 12 people. The oven in our RV is quite small. \nAlso, I am looking for info on the ebook version of your cookbook from B&amp;N. Is it coming out the same time as the hardback copy? I love your site btw. I have shared it with a few people now and it has really given me some food for thought (pun intended) regarding switching back to full vegetarianism.",
      "parent": "0",
      "gravatar_hash": "3f37f01adf0577e00b5eda660fe74a91"
    },
    {
      "id": "21352",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-12 11:05:59",
      "content": "Hey Jodi - I'm not so sure about how the Dutch baby will work in a campfire situation. It is hard for flour, butter and eggs to be *bad* but if you can't accurately control the temperature it may not puff as desired. If you decide to try it, let me know how it turns out. Thanks for sharing the blog! Re the e-book, I'm not actually sure whether the release date is the same as the hardcover. I'll make sure to mention it as soon as I know.\n\nThanks,\nMichael",
      "parent": "21350",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21356",
      "author": "Marina",
      "author_url": "http://www.cowboycountryvegetarian.blogspot.com",
      "date": "2012-03-12 12:12:49",
      "content": "That gas stove is fantastic! Michael, thanks for taking this video, it makes everything easy. I showed it to my son, and he exclaimed: I can do it too! Well, it adds one more meal he cam master himself. :)",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "21357",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-12 12:17:35",
      "content": "Awesome, Marina! I have no idea how old your son is, but make sure he's really careful handling that hot skillet when it goes in and out of the oven.",
      "parent": "21356",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21359",
      "author": "Marina",
      "author_url": "http://www.cowboycountryvegetarian.blogspot.com",
      "date": "2012-03-12 12:55:22",
      "content": "Thank you Michael! He is almost 16, and as you probably know, at this age they know everything! :) He was more interested in cooking when he was about 12, when he learned how to make pizza (from scratch), crepes. And then he lost his interest in cooking. I am glad he watched this video, maybe he'll get back to the kitchen and surprises us again.",
      "parent": "21357",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "22084",
      "author": "John",
      "author_url": "",
      "date": "2012-03-27 06:17:10",
      "content": "You wouldn't think it would be possible to screw this up, but I did (or at least tried to). When the oven timer for browning the butter went off, I managed to both turn it AND the oven off, so the baby cooked for 13 minutes in a slowly cooling oven. D'oh! I kicked it back up to 425 for the last 8 minutes, and it rose quite nicely, and somehow four of us managed to eat the whole thing. I used a mix of Fuji and Pink Lady apples, but if I had it to do again, I'd go with the pink ladies. BTW, the \"milk-solids\" thing works amazingly well. This recipe is definitely going on the \"breakfast and desert short-list\"!",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "22086",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-27 06:21:17",
      "content": "Ha! I'm glad to hear it was somewhat oven-temperature tolerant. I learned the hard way that it *doesn't* like to have you warm the skillet while the oven preheats and then immediately pour in the batter the second the butter melts. That shortcut leaves the pan insufficiently preheated and you don't get such a good rise.",
      "parent": "22084",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22144",
      "author": "Will",
      "author_url": "",
      "date": "2012-03-28 08:56:18",
      "content": "We made this last weekend using apples we picked last summer then froze. It came out great and was gone in a flash! Thanks for the inspiration.",
      "parent": "0",
      "gravatar_hash": "c83db55d1f37ada929e6d096500ab056"
    },
    {
      "id": "22146",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-28 09:39:00",
      "content": "Was that your famous King apples? I remember how good those are.",
      "parent": "22144",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22168",
      "author": "Will",
      "author_url": "",
      "date": "2012-03-28 14:47:59",
      "content": "This was with a batch of Spartans. I got an apple peeler/corer/slicer last year and just in time!  The Spartan tree had about 200 lbs of apples last summer.  I brought bagloads into work, but that barely made a dent in the extraordinary harvest. Hopefully this year it will take a rest. We froze about 20 bags of them at prime and have been using them in cobblers, pies, muffins, sauce and now a Dutch Baby. \n\nPS: Karen says Dutch Babies are good with pears too.",
      "parent": "0",
      "gravatar_hash": "c83db55d1f37ada929e6d096500ab056"
    },
    {
      "id": "22296",
      "author": "angela@spinachtiger",
      "author_url": "http://spinachtiger.com",
      "date": "2012-03-31 05:33:11",
      "content": "Thanks for showing me something I've been wanting to make for years. The video moved nice and quickly, and how I wish I had a Vitamix. Christmas list.",
      "parent": "0",
      "gravatar_hash": "813dc67a9d1df4ad31a84c463c10c4af"
    },
    {
      "id": "23490",
      "author": "evain",
      "author_url": "",
      "date": "2012-05-02 12:00:15",
      "content": "I love dutch babies!  I shall attempt to make one with your recipe tomorrow.   AND I'm so grateful that I have a vitamix...love!",
      "parent": "0",
      "gravatar_hash": "79202b900a97820ac05b12e1388ebd1a"
    }
  ]
}