{
  "comment_count": 20,
  "comments": [
    {
      "id": "2470",
      "author": "alice",
      "author_url": "http://savorysweetlife.com",
      "date": "2009-05-11 07:35:35",
      "content": "Beautiful Michael. I've been noticing lots of posts on dutch babies however your is the first I've seen using apples. I always have apples. I typically use granny smith with pies however I'm curious which variety you used with this recipe and if you have a recommendation?",
      "parent": "0",
      "gravatar_hash": "6ca987bc2434b8f7d0c27afd61dd1338"
    },
    {
      "id": "2471",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-05-11 08:13:13",
      "content": "I think the ones I used were Pink Ladies, but since you are cooking them\nrelatively briefly, I think most any apple that you enjoy would work fine.\nFor bonus points you could arrange them nicely around the pancake, but I\nopted for pile 'em on and let's eat :).\n\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2472",
      "author": "Maggie",
      "author_url": "http://www.thesaladgirl.com",
      "date": "2009-05-11 11:39:52",
      "content": "OMG I LOVE DUTCH BABIES!  Sorry for the caps, I'm very passionate when it comes to this amazing breakfast :)  Love the addition of apples.  My recipe is super simple, but this looks awesome.  I gotta make these more often.",
      "parent": "0",
      "gravatar_hash": "fd28c9d284f0d78bb2fb5db7e4dfc4ee"
    },
    {
      "id": "2473",
      "author": "codfish",
      "author_url": "http://caviarandcodfish.com",
      "date": "2009-05-11 16:15:04",
      "content": "I'm envisioning a brunch with savory and sweet dutch babies.\n\nYour photo is so enticing. Glad to have come across your blog. :D",
      "parent": "0",
      "gravatar_hash": "6d741bdb9b14377b268042cb381e0b7b"
    },
    {
      "id": "2474",
      "author": "Joy the Baker",
      "author_url": "http://www.joythebaker.com/blog",
      "date": "2009-05-11 22:07:17",
      "content": "I think there's something magical about a Dutch Baby, especially on a relaxed weekend morning.  The apples look just lovely too!",
      "parent": "0",
      "gravatar_hash": "a6bde8307a2f78232f0919de2ec29ade"
    },
    {
      "id": "2475",
      "author": "heather",
      "author_url": "http://squirrelbread.wordpress.com",
      "date": "2009-05-12 06:47:31",
      "content": "I'm recently smitten by dutch babies as well. In case you're in need of more ideas for db combinations, I posted about them on my blog here: http://squirrelbread.wordpress.com/2009/05/08/oh-baby-babies/.\n\nJust stumbled over - I really enjoy your blog!\n\nCheers,\n\n*Heather*",
      "parent": "0",
      "gravatar_hash": "4a45e1491351b7f180f26f06777b413b"
    },
    {
      "id": "2476",
      "author": "Adelina",
      "author_url": "",
      "date": "2009-05-12 10:06:28",
      "content": "I tried making these a few weeks ago.  Instead of using the cast iron skillet, which I don't own, I baked them on ramekins.  I would think making these in a cast iron skillet would yield a much better flavor (?).  But the one I baked in the oven turned out very good as well.  These Dutch babies are simply delicious!\n\nThanks for posting!",
      "parent": "0",
      "gravatar_hash": "429b6ecf5327db7f2180b93142743b58"
    },
    {
      "id": "2477",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-05-12 10:12:00",
      "content": "Good tip to know that ramekins are an option. I think if you have enough\nbutter, they will taste just fine :)!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2478",
      "author": "Siiri",
      "author_url": "http://www.decorazzi.blogspot.com",
      "date": "2009-05-12 12:02:23",
      "content": "Hey Michael, Siiri here.  I had these religiously growing up, except at my house, they were called \"Baby Dutchmen\" (or Dutchman if you just make one).  I don't know if that was us kids transposing the name, or if that's what they were always called in my scand-centric family.\n\nAt any rate, one quick tip for your batter - blend it ALL in the blender.  My mom insists it be done this way, and the result is a super light and fluffy/layered bottom, but what's even better is that the edge/crust rises SO high, it's almost unbelieveable! (god my spelling is bad these days, sorry).  Anyway, next time you're making them, give the blender a whirl, you might just find it adds to the texture and hieght of your Baby Dutchman.\n\nAnd if you're doing a sweet version, to add to the finishing touch, don't blot away the excess butter (I mean come on, this is not exactly a healthy recipe breakfast with the 8 tablespoons of butter anyway). Instead, do a sprinkle of powdered sugar right on the Baby Dutchman first, to soak up the butter, then put your fruit down, and another layer of finishing powdered sugar. YUM!\n\nAnd make sure there's plenty of bacon involved if you're not a veggie!\n\n(THIS IS MAKING MY MOUTH WATER!~!!!! I'm totally making this for sunday brunch this week. And I'm going to try it with gluten free flour, for my BF who's allergic, so I'll report back on my blog.)  www.decorazzi.blogspot (dot) com",
      "parent": "0",
      "gravatar_hash": "bc051ec8cae31c5c5a164c59683bf5e1"
    },
    {
      "id": "2479",
      "author": "Allen",
      "author_url": "http://www.eatingoutloud.com",
      "date": "2009-05-12 13:29:25",
      "content": "What an amazing dutch baby!  I love the use of sauteed apples and will have to try it next time.\n\nOur friends have been asking to come over for dutch babies ever since I posted about it, so maybe I'll make a sweet and savory dutch baby brunch :-)",
      "parent": "0",
      "gravatar_hash": "f7a387ca497aaa1d3ca4866af04801ce"
    },
    {
      "id": "2480",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-05-12 13:36:36",
      "content": "Thanks for the tips and the enthusiasm! I used the blender too, but your\ncomment made me realize the recipe wasn't totally clear, so I updated step\n2. I love it when readers help me get these things right.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2481",
      "author": "JMom",
      "author_url": "http://kitchen.amoores.com",
      "date": "2009-05-12 13:54:25",
      "content": "This is one my my daughter's favorite dish on weekends. I'll have to try your version. It looks delicious!",
      "parent": "0",
      "gravatar_hash": "60006c4849bbb477b14eb84bbd4c1340"
    },
    {
      "id": "2482",
      "author": "A&amp;N",
      "author_url": "http://reluctantchefs..blogspot.com",
      "date": "2009-05-13 17:53:13",
      "content": "This is fantastic, Michael. N loves these and has been looking for a recipe for ages now. I think I might just surprise her with these for breakfast this weekend :)",
      "parent": "0",
      "gravatar_hash": "50de5463f411bb5bad4710eb70af07f3"
    },
    {
      "id": "2483",
      "author": "agy",
      "author_url": "http://greenissuessingapore.blogspot.com/",
      "date": "2009-05-17 06:33:08",
      "content": "Your blog is making my mouth water. Yummy! Looking forward to trying your recipes :-)",
      "parent": "0",
      "gravatar_hash": "59113e0f8e1f4d18d16e3174619aaa9d"
    },
    {
      "id": "2484",
      "author": "Siiri",
      "author_url": "http://www.decorazzi.blogspot.com",
      "date": "2009-05-19 12:12:32",
      "content": "Okay, so I got the recipe out of the binder, but haven't made them yet, so no pictures now, but I at least wanted to send you the recipe before it escaped me to do so:\n\n(be ready to be underwhelmed, it's only a few ingredients and sounds way less fancy than yours)\n\n1/3 c. butter - melt in pan (like glass pie plate)\n4 eggs\n1c. milk\n1c. flour\n\nmix eggs in blender for one minute; add milk and flour and blend till mixed.\n\npour batter into pie pan which has melted butter in it and bake in 425 degree oven for 20-25 minutes.\n\nthis batter makes two babies, so split the batter before pouring it into your pan.\n\nMy mom's note is that it's my Uncle Jeff's recipe. He's my mom's little brother, who lives in his Eastlake (let-me-drool-all-over-your-perfect-house)home with his FAB girlfriend, my aunt, Lisa.\n\nI had dinner with him this Sunday (perfect BBQ in Seattle Sunday) and he said it's from an old friend of his....so who knows the origin. Isn't that the best anyway?!?!?\n\nSo, there it is....nothing too fancy, but holy God it was the stuff childhood dreams are made of!  enjoy! -Siiri",
      "parent": "0",
      "gravatar_hash": "bc051ec8cae31c5c5a164c59683bf5e1"
    },
    {
      "id": "2485",
      "author": "zoe",
      "author_url": "http://thezoeblog.blogspot.com",
      "date": "2009-05-20 09:18:30",
      "content": "I recently made this for a small brunch and I squeezed lemon juice over it, spread some pear preserves, and powdered sugar..to die for!",
      "parent": "0",
      "gravatar_hash": "da95b6426c43d00947a19567a7b28d12"
    },
    {
      "id": "2486",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-05-20 09:24:00",
      "content": "Love the idea of the pear preserves, that sounds ridiculously good.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2487",
      "author": "Glenn",
      "author_url": "",
      "date": "2009-10-24 18:23:03",
      "content": "Aloha from Hawaii!\n\nGoogle the \"Original Pancake House\"  From my earliest recollections as a child, we in Hawaii have been fortunate to enjoy Dutch babies and Apple Dutch babies here since the 50's.  They were founded in 1953 in Oregon.  I think.\nbut It is a tradition for many locals..the 49er pancakes are good also and the best crisp Belgian Waffle. But even their basic pancakes rule,  secret is they use fresh creme in their batter. and only butter and real Maple syrup..Oh did I mention the Daily's thick cut bacon.  Well at least in Hawaii!",
      "parent": "0",
      "gravatar_hash": "f72c7f26cc15ea3309a830b59cf417ae"
    },
    {
      "id": "24385",
      "author": "Jeni",
      "author_url": "",
      "date": "2012-05-23 02:32:18",
      "content": "Hmmmmm, as I am very allergic to eggs, I wonder how it would do with my substitute?  It's wouldn't rise as much, but it looks delish enough to give it a go!",
      "parent": "0",
      "gravatar_hash": "f4fb1fbedbe70383cc2c0d78e13ad622"
    },
    {
      "id": "24408",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-23 06:20:23",
      "content": "Hi Jeni - I don't think this would work well with an egg replacer - the recipe is too much about eggs for that to come out right I think.",
      "parent": "24385",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}