{
  "comment_count": 7,
  "comments": [
    {
      "id": "3879",
      "author": "Christina",
      "author_url": "http://www.ramblemagazine.com",
      "date": "2007-11-10 06:15:34",
      "content": "Hi and thanks for cool site. I haven't been here before, but your Ethiopian article caught my attention. I'm ashamed (almost) to say I've never had Ethiopian food, yet I've heard a lot of nice things about it. Come think about it, the African food section in my recipe collection is terribly blank.",
      "parent": "0",
      "gravatar_hash": "a5bd98a3792fdf7ab1ee5cf869b13ac5"
    },
    {
      "id": "3880",
      "author": "bri",
      "author_url": "http://figswithbri.com",
      "date": "2007-11-10 11:15:55",
      "content": "Yum!!!  I *love* vegetarian Ethiopian food.  My husband and I get a strong hankering often, but we haven't lived closer than an hour or two to good Ethiopian places, in a while.  Turns out, we have the distinct pleasure of going to a place with my aunt in Oakland tomorrow.  I had been looking forward to it, and then, as an appetizer, I saw your picture on Tastespotting.  We tried to make injeera a few times, to no avail.  I think most American Ethiopian places predominently use wheat flour and a little teff, because our was quite a bit darker than the color we get at restaurants.  Anyway, I could sing the praises of red lentils and injeera all day, but I'll stop now.  Thanks for the fun informative post!",
      "parent": "0",
      "gravatar_hash": "e1adf5ffb76e72da07429a38e8594186"
    },
    {
      "id": "3881",
      "author": "cakespy",
      "author_url": "http://www.cakespy.com",
      "date": "2007-11-10 20:25:25",
      "content": "Oh, I love Ethiopian food. I have never been to this one but based on the pictures and your review, it sounds really good!",
      "parent": "0",
      "gravatar_hash": "d299bd59d39d884043aced3319ba1eae"
    },
    {
      "id": "3882",
      "author": "KathyF",
      "author_url": "http://whatdoiknow.typepad.com",
      "date": "2007-11-10 22:52:27",
      "content": "Yeah, I also think many places use wheat instead of teff, probably because they can't find it or it is more expensive. I've tried to make it, and used wheat flour and soda water, which works okay. Better than the three day method involving teff--that was a disaster!\n\nAnyway, that is a great photo of Ethiopian food, better than the descriptions I've tried to give people. I'll send 'em here instead!",
      "parent": "0",
      "gravatar_hash": "2a280efad60cb1fc8e12fb2d54be21b6"
    },
    {
      "id": "3883",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2007-11-11 03:42:26",
      "content": "Thanks for the info about places using wheat instead of teff, I'll amend the info in the article so we don't send anyone gluten intolerant to eat without asking!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3884",
      "author": "molahs4",
      "author_url": "",
      "date": "2007-11-13 11:02:19",
      "content": "When we lived in San Francisco area we were spoiled with the amazing Ethiopian restaurants. Telegraph Ave in Berkeley/Oakland is lined with them. Our favorite was Cafe Colucci where everything tasted fresher and better seasoned than its nearby competitors. To me, one of the ways to tell the quality of the eatery was by the injera- if it was white and rubbery then the food would probably be geared towards an American palette, not its indigenous clientèle. Most ethnic restaurants have some sort of signal dish that lets you know how authentic it is. Now that I'm closer to Sacramento there are a couple decent palces here, one with an all-you-can eat lunch buffet. It's not the best, but you can't beat the price for what you get. DC is supposed to have a strong Ethiopian population too.",
      "parent": "0",
      "gravatar_hash": "3152eb9a826251ff5dd51e86fcb5a01d"
    },
    {
      "id": "3885",
      "author": "April",
      "author_url": "",
      "date": "2010-02-11 11:15:38",
      "content": "Thanks for this recipe.  We make both Syrian and Ethiopian lentil soup in our house.  Our housekeeper makes the ethiopian version and I'll be happy to have your recipe on hand when she is no longer with us.  I love the Syrian version but the Ethiopian takes lentils to a whole new level.",
      "parent": "0",
      "gravatar_hash": "f713a51cd0d46e2874255b528cd0a960"
    }
  ]
}