{
  "comment_count": 21,
  "comments": [
    {
      "id": "4103",
      "author": "Anne",
      "author_url": "",
      "date": "2007-08-14 08:00:52",
      "content": "This sounds fantastic. I was surprised that you used high heat to fry the eggplant - does that really cook it through without burning? I can't seem to fry eggplant, no matter how low the heat, without setting off the smoke alarm. I use olive oil (not extra virgin, just regular) - do you think veg. oil would do the trick?\n\nI haven't tried panko on eggplant, but I will definitely try that next. I like to mix in some herbs with my breadcrumbs, especially herbes de Provence with a little extra dried lavender. Something about the sweet lavender makes the eggplant seem even sweeter.",
      "parent": "0",
      "gravatar_hash": "5cdecc447861b205659b26b2585302fb"
    },
    {
      "id": "4104",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2007-08-14 08:28:13",
      "content": "Hi Anne - yes, I think if you switch to an oil that has a higher smoke point you'll get better results. Spectrum Organics makes a canola oil that is specifically for high heat that I find works very well. For this recipe on my stove, I want to be just about 1 notch under maximum heat, but of course it may vary based on your burners and pan. Herbs de Provence in your breadcrumbs sounds delicious!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "4105",
      "author": "Cassandra",
      "author_url": "",
      "date": "2007-09-07 11:02:10",
      "content": "Thanks for the tips- I wouldn't have thought to salt the eggplant first. We're having this for dinner more often!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "4106",
      "author": "radish",
      "author_url": "http://www.sassyradish.com",
      "date": "2007-10-15 10:17:38",
      "content": "Looks delicious - sadly there'll never been anything 'parmesan' in our kitchen as my boyfriend is lactose intolerant! I do like the panko crust idea!",
      "parent": "0",
      "gravatar_hash": "04341568a39187cf5897aaea878fb272"
    },
    {
      "id": "4107",
      "author": "ex-cheesemonger",
      "author_url": "",
      "date": "2007-11-15 09:19:54",
      "content": "Radish: If your boyfriend is really lactose intolerant (rather than unable to eat dairy products for other reasons), then hard cheese shouldn't be a problem, as the lactose is all consumed by the cheesemaking process. I'm not sure how the mozzarella would go down, though.",
      "parent": "0",
      "gravatar_hash": "3c72cac05109381e02e5e746e4c2fa07"
    },
    {
      "id": "4108",
      "author": "",
      "author_url": "",
      "date": "2008-11-08 16:26:15",
      "content": "Umm this recipe sounds delicious and Yummy! I just bought an eggplant today, I'll definetely make this recipe tomorrow.  I love eggplant parmigiana but I have never made it and the recipe you gave it sounds so simple.                         Fajard",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "4109",
      "author": "malinky",
      "author_url": "http://malinky.co.nz",
      "date": "2009-05-24 20:31:24",
      "content": "Hi Michael, I have made a few of your recipes before and they've been delicious but I wasn't so happy with the results of this one made worse by the fact that I made this for dinner guests. It came out too dry and we couldn't really taste the eggplant. Maybe too heavy on the breadcrumbs? I'm not exactly sure where I went wrong but if I was going to make it again I would slice the eggplant thicker and use either more sauce or not reduce the sauce as suggested. Thanks for posting this but I think I'll stick with the Vietnamese Lemongrass Green Beans and Tofu...yum!",
      "parent": "0",
      "gravatar_hash": "54dde47ff81d00baa17f418f0728a3c8"
    },
    {
      "id": "4110",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-05-24 21:44:37",
      "content": "Hi Malinky - sorry this one didn't work out for you. Thanks for letting me\nknow. I published that recipe a couple of years ago, so maybe it is time to\nrevisit it this summer and double check everything. I'll let you know if I\ndiscover anything amiss.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "4111",
      "author": "Kirsten Maile",
      "author_url": "",
      "date": "2010-06-16 22:33:45",
      "content": "Amazing :) I just made it this evening for roommates and boyfriend. I think I'll be wedded soon...haha",
      "parent": "0",
      "gravatar_hash": "98eed38f5be4d07994dcda6265c8cf1d"
    },
    {
      "id": "4112",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-17 06:40:45",
      "content": "Allright! Our first Herbivoraciou-induced engagement :) :)",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "4113",
      "author": "Renée",
      "author_url": "",
      "date": "2010-08-24 12:35:30",
      "content": "mmmm Just made this with my first eggplant from my little container garden on my balcony in Montreal. Complete with basil from the garden and homemade tomato sauce with tomatoes from the local market. Paired it with a little salad with veggies from the market, edible flowers from my garden, and a homemade orange-mint dressing with mint from the garden. (and a gin and mint drink of course). Perfect perfect meal.\n\nDays like these make me fall in love with food over and over and over again!",
      "parent": "0",
      "gravatar_hash": "473e870b050f725daa89e2d82b6bdb69"
    },
    {
      "id": "4114",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-08-27 20:55:21",
      "content": "Thanks Renee! I&#39;m glad it was a hit, and the rest of your menu sounds great.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "4115",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-09-13 22:31:44",
      "content": "I just retested this, and added the new photo at the top. I think you are right that the eggplant should be a little thicker, so I adjusted that. Everything else worked out how I like it, but of course not every dish will be to everyone's liking. I appreciate your feedback as always!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "4116",
      "author": "michella",
      "author_url": "http://twitter.com/thebestbabybug",
      "date": "2010-09-30 18:36:02",
      "content": "my husband and I despise eggplant but it came in the CSA box so I decided to try this out. it was SO DELICIOUS - we loved it. salting it and wringing the water out really helped with the bitterness that turns us away. thanks for sharing!",
      "parent": "0",
      "gravatar_hash": "188fe1790d79d58d6997a0b6ad7e8952"
    },
    {
      "id": "4117",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-09-30 19:12:26",
      "content": "I&#39;m so glad it was it a hit for you, and that you took a chance on using a vegetable you don&#39;t generally like!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "15953",
      "author": "Sarah Hammond",
      "author_url": "",
      "date": "2012-01-03 10:16:03",
      "content": "So, I don't cook well. I get overwhelmed with having too many ingredients, tasks, things cooking at once..BUT I made this and even though I'm pretty sure I didn't do it right, it was still the best thing I have ever cooked in my entire life! Also, I so did eat this cold for breakfast the next day.",
      "parent": "0",
      "gravatar_hash": "47475c386d3ffba6d92deda16acbd2bd"
    },
    {
      "id": "21299",
      "author": "Romy",
      "author_url": "",
      "date": "2012-03-11 08:52:46",
      "content": "I thought parmesan isn't vegetarian?",
      "parent": "0",
      "gravatar_hash": "754b7f7a6f15ac34780a5eeac9672e51"
    },
    {
      "id": "21303",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-11 09:10:13",
      "content": "Quite right. True parmigiano-reggiano is always made with animal rennet. I, like many vegetarians, choose not to let this particular detail go. I pretty much will eat any kind of cheese. If you want animal-rennet free cheese, in general you'll have to do a fair amount of research. Microbial and vegetable rennets are often cheaper than animal rennet, so even cheeses that aren't specifically labeled are often safe in practice. Hopefully your cheesemonger will know.",
      "parent": "21299",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "35897",
      "author": "Maria Wannabeitalian",
      "author_url": "http://none",
      "date": "2012-07-09 10:24:54",
      "content": "My husband of 34 years has always said he hates eggplant.  I know he has not triedit since we have been married.  He planted a garden this year and I convinced him to plant some for me. I picked my first one today along with a huge zucchini, so I plan to make this recipe with one end being eggplant and the other zucchini....wonder how it will go over. I have fresh mozarell, basil and tomatoes to top it off.  I think he will love it.  Well, better get to work!",
      "parent": "0",
      "gravatar_hash": "29f48defde24a2604f2c933c65ad0ffb"
    },
    {
      "id": "67491",
      "author": "Miranda",
      "author_url": "",
      "date": "2012-10-23 14:01:21",
      "content": "So I made this dish one night after work (with chicken in addition to the eggplant for the non-veggie lovers in my house), and I made the unfortunate mistake of misreading your instructions to give the eggplant a \"heavy *sprinkling*\" and gave it a heavy rub, instead.  Even though I wiped off as much salt as I could, it was far too salty to eat.  Luckily, the chicken parmesan was divine, and I was sad that I ruined the eggplant.\n\nSo now for my question so I don't mess it up next time:  what constitutes a heavy sprinkling?  When do you cross the line into a heavy rub?  Should I be tasting the raw eggplant to make sure I haven't over salted?",
      "parent": "0",
      "gravatar_hash": "fdedf163e59673802e097cf815c2910b"
    },
    {
      "id": "68052",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-24 07:51:18",
      "content": "Hey Miranda - a sprinkling would be a healthy pinch of salt on each layer of eggplant. Don't rub it in, or as you say, you'll never be able to wipe off the excess. I think that will work much better for you!",
      "parent": "67491",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}