{
  "comment_count": 20,
  "comments": [
    {
      "id": "847",
      "author": "Roxan",
      "author_url": "http://kitchenmeditation.blogspot.com",
      "date": "2010-09-29 06:47:10",
      "content": "This looks hearty and delicious! Other than the soup and cilantro, I have all the ingredients at home to make this. I will definitely have to try it, thanks.",
      "parent": "0",
      "gravatar_hash": "98722837ed0b2769e49af8430b080294"
    },
    {
      "id": "848",
      "author": "Xiaolu @ 6 Bittersweets",
      "author_url": "http://www.6bittersweets.com",
      "date": "2010-09-29 07:14:46",
      "content": "Mm this looks so delicious.  I love black beans (though sadly my boyfriend doesn't).  But that just means more for myself.  Going over to vote, and good luck on winning the trip!",
      "parent": "0",
      "gravatar_hash": "c90f8e5d3f0ef8fd93e1605d8c6a2f61"
    },
    {
      "id": "849",
      "author": "Kris B",
      "author_url": "http://bitofhindi.wordpress.com",
      "date": "2010-09-29 08:15:49",
      "content": "This will make a great meal from my garden: spinach, onion, garlic, cilantro...",
      "parent": "0",
      "gravatar_hash": "157d86ffc3201a66d16cfb159ec8477f"
    },
    {
      "id": "850",
      "author": "CarenRoma",
      "author_url": "http://fennelfiles.com",
      "date": "2010-09-29 09:25:16",
      "content": "Sounds wonderful, Michael. I will have to give the recipe a try on one of those crazy \"no-time to create a good meal soccer practice nights.\"",
      "parent": "0",
      "gravatar_hash": "442f51823113fcb7711bef7dd09fb7e9"
    },
    {
      "id": "851",
      "author": "Apeksha",
      "author_url": "http://veggiewiz.blogspot.com",
      "date": "2010-09-29 20:15:03",
      "content": "That looks yummy....never heard of this dish before but now I want to try it! Mexican is one of my fav cuisines cos I think it's so great for vegetarians!",
      "parent": "0",
      "gravatar_hash": "ec1535525e2b2614c13fa1ddf8071b42"
    },
    {
      "id": "852",
      "author": "Amee",
      "author_url": "http://www.rabbitfoodrocks.blogspot.com",
      "date": "2010-09-30 08:43:09",
      "content": "Going to vote!!!  Thanks - looks delish.",
      "parent": "0",
      "gravatar_hash": "ea1fed8e804be28ee1596700c053eef2"
    },
    {
      "id": "853",
      "author": "sarah",
      "author_url": "http://www.thedeliciouslife.com",
      "date": "2010-09-30 11:49:26",
      "content": "voted!",
      "parent": "0",
      "gravatar_hash": "16fc901f1af330979278b360fd81b092"
    },
    {
      "id": "854",
      "author": "WitStop",
      "author_url": "http://profile.typepad.com/witstop",
      "date": "2010-09-30 19:29:46",
      "content": "This looks like a home run!  Ole'!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "855",
      "author": "Heidi",
      "author_url": "http://www.mamaveggie.com",
      "date": "2010-10-01 11:52:35",
      "content": "This bean sauce sounds amazing - and a good way to sneak in beans for kids, too. Thanks!",
      "parent": "0",
      "gravatar_hash": "3d5e92b5914544aac7b17451db479862"
    },
    {
      "id": "856",
      "author": "Mira Jone",
      "author_url": "http://hjlr.info",
      "date": "2010-10-02 21:03:05",
      "content": "This recipe is crying out for me to make it. At first glance it seemed intimidating to me, but I know if I hunker down and take my time, I will be successful. Thanks for the great recipe.",
      "parent": "0",
      "gravatar_hash": "e0368904c531da9107bc1f3a4e3872cc"
    },
    {
      "id": "857",
      "author": "Wendy (The Local Cook)",
      "author_url": "http://thelocalcook.com",
      "date": "2010-10-03 15:45:15",
      "content": "I wonder if I could sub Swiss chard for the spinach? This sounds like a good recipe, thanks and good luck with the contest!",
      "parent": "0",
      "gravatar_hash": "fbe4a049cb0a05ea18beaedc60488670"
    },
    {
      "id": "858",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-10-03 15:47:17",
      "content": "Absolutely; Swiss chard will be great in there, just cook it down thoroughly.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "859",
      "author": "John",
      "author_url": "",
      "date": "2010-10-04 06:17:32",
      "content": "Made this last night, to generally strong reviews. I was serving it on plates rather than in bowls, and thus just spread about 1.5T of soup across the tops of the enfrijoladas. That meant that I had a bunch of soup (perhaps half?) left over. The filling was delicious, but I'd have liked a bit more -- I might multiply by 1.5 next time.\n\nI also had a little trouble with \"remove most of the liquid\" -- it was clear that I removed rather too much, because the spinach was hard to break up and mix with the aromatics. So I added a little water, and it was fine.\n\nThe entire recipe was dead simple, and delicious, and got great reviews from the family. I used a bit more cilantro than you show (because I had it!), and a bit less cheese, because some of us don't like cheese all that much (sigh), but it's clear that this is a recipe where exact quantities aren't the critical element. The only thing where \"exactness\" seems to matter is \"how long you dip the tortillas in the soup\" -- I found that anything over about 12 secs made them start to fall apart when I lifted them out. I ended up going with about 5-7 secs of soaking in near-boiling soup, and it worked great.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "860",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-10-04 07:38:42",
      "content": "Thanks, Spike! I&#39;ll adjust the recipe to say &quot;squeeze some of the water out&quot;.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "861",
      "author": "Liz H",
      "author_url": "http://www.indiatree.com",
      "date": "2010-10-05 09:44:23",
      "content": "Voted. Looks delicious. I'm going to give it a try tonight to see if I can sneak spinach past the kid, disguised as it is in his favorite medium: cheese and beans.",
      "parent": "0",
      "gravatar_hash": "be07ba9a8038225b909babaed3063bbe"
    },
    {
      "id": "862",
      "author": "Karen Paulson",
      "author_url": "http://nofoodleftbehind.blogspot.com",
      "date": "2010-10-07 10:11:11",
      "content": "Hey there. I made this recipe the other night for my family. Everyone loved it. I did sub Wolfgang Puck's black bean soup for the other because my grocery store carried the other brand, but not that particular soup! I simmered the soup with a halved spicy banana pepper to jazz it up. The spinach was AWESOME and I'll do that combo of spices again even if I don't make the tortillas. I think I may also sometime make the tortillas the old-fashioned way, frying them in oil, then wrap up the enchiladas and put them all in a 9x13 pan with the soup and cheese on top.",
      "parent": "0",
      "gravatar_hash": "bde0d3971a5179bc1632ac4d4b00f6d4"
    },
    {
      "id": "863",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-10-07 10:17:39",
      "content": "Thanks Karen, I&#39;m glad it was a hit and that you made it your own! And yes, just as you intuited, enfrijoladas are sometimes made by running the tortillas through oil before the bean sauce, much like enchiladas.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "864",
      "author": "Aaron",
      "author_url": "http://profile.typepad.com/aaron26",
      "date": "2010-12-15 06:39:00",
      "content": "Quite tasty, and very easy. Only thing I would change was to warm the tortillas a bit before dipping into the soup (we used Trader Joe's Latin Black Bean Soup, btw - vegan and kosher/pareve) - I took the tortillas straight out of the fridge before dipping, so they were still a little hard even after dipping into the soup.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "865",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-12-15 10:29:54",
      "content": "Good tip!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22141",
      "author": "ChicagoCook",
      "author_url": "",
      "date": "2012-03-28 08:14:30",
      "content": "Made this last night to rave reviews! I added mushrooms to the spinach mixture, along with hot pepper flakes. I also really packed in the filling, so it didn't quite make it to 12 tortillas, but was delicious none the less! I think next time I might try to thicken the soup a bit or make my own, and add some spices to really condense the flavor--I had a lot of soup leftover. Thanks for the delicious recipe!",
      "parent": "0",
      "gravatar_hash": "572bc11cf507aeb623dbaf2aa958ec90"
    }
  ]
}