{
  "comment_count": 11,
  "comments": [
    {
      "id": "926",
      "author": "lisaiscooking",
      "author_url": "http://lisaiscooking.blogspot.com",
      "date": "2010-08-23 11:42:47",
      "content": "I'd love learn more about Ethiopian food starting here. This looks great! I'm going to have to see if I can find ful and berbere locally.",
      "parent": "0",
      "gravatar_hash": "0a9a4542e87845b6596d9c41d7e3c257"
    },
    {
      "id": "927",
      "author": "Lea",
      "author_url": "",
      "date": "2010-08-23 14:38:46",
      "content": "Love those foul (of ful) beans! I've never had them served this way, but looks like a must try!!",
      "parent": "0",
      "gravatar_hash": "442e785c165a05ff7b50e50f01391355"
    },
    {
      "id": "928",
      "author": "maybelles mom",
      "author_url": "http://feedingmaybelle.blogspot.com",
      "date": "2010-08-23 17:38:04",
      "content": "ful really is soul food. friend's always made this for me in college (though not this ethiopian version.)  makes me think I should make some soon.",
      "parent": "0",
      "gravatar_hash": "1a781cd9ade28c24cff5c664d1345abe"
    },
    {
      "id": "929",
      "author": "jodye @ 'scend food",
      "author_url": "http://sendfood.wordpress.com",
      "date": "2010-08-25 11:44:48",
      "content": "Ful medames is one of my favorite foods, as well.  I just can't pass up fava beans and garlic.  I love ethiopian food, too, so I'll definitely have to try this version. Thanks for sharing the recipe!",
      "parent": "0",
      "gravatar_hash": "15ffce83eb1ce3e46d5be4dea7c98e6b"
    },
    {
      "id": "930",
      "author": "abesha wannabe",
      "author_url": "",
      "date": "2010-08-29 11:46:14",
      "content": "FYI - this is very very different than the ethiopian ful I've eaten that has been cooked by various ethiopians in DC (largest Ethiopian population outside of Ethiopia). One essential ingredient that is missing is nit'r kibe, the spiced clarified butter characteristic of many Ethiopian dishes. also, berbere is usually added in substantial quantities! And yes, sometimes Ethiopians do use spoons to help eat this dish. Otherwise you end up eating mostly bread, which BTW is usually a good baguette or ciabatta, or sometimes pita. Feta, eggs...these ingredients sound more like the way Israelis or Lebanese, or maybe Egyptians eat ful. I'd be careful taking one chef's version of ful and claiming it is \"Ethiopian\" style just because the chef is Ethiopian (or is she Eritrean? Eritreans have more arabic influence in their cooking).",
      "parent": "0",
      "gravatar_hash": "17e7da27e19a8266442f9296e0e81676"
    },
    {
      "id": "931",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-08-31 20:47:28",
      "content": "Thanks for all of the info! You are quite right that I&#39;ve only been exposed to one chef&#39;s way of making and serving this. Although we have a large Ethiopian and Eritrean population in Seattle, I think only one restaurant serves ful. (If anyone knows another besides Cafe Selam, please let me know, I&#39;m so there to try it!). And I&#39;m actually not sure if she is Ethiopian or Eritrean - actually doing a little web research, I think you are right that she&#39;s Eritrean. I did not know that Eritrea has more Arabic influence.\n\nNo one at this restaurant ever uses a spoon, only the bread. As with anything food related, there are infinite variations. I believe she does use nit&#39;r kibe, but I left it out of my version because most American cooks won&#39;t have it, though I should do a separate post on that. Her version is quite mild, so I think the berbere must be in small quantities.\n\nAnyhow, I appreciate the information you&#39;ve added and I really look forward to trying more versions if I&#39;m ever in DC.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "128766",
      "author": "selam",
      "author_url": "",
      "date": "2013-03-21 22:34:16",
      "content": "Did you forget to list the cumin? I am Eritrean and cumin is what gives ful its distinct lovely taste.",
      "parent": "0",
      "gravatar_hash": "67a7eb92d3a2f6277bddf4c2c2b353a1"
    },
    {
      "id": "128920",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-03-22 08:10:14",
      "content": "I've got cumin dusted on at the end, but I can sure see that more of it in the beans would be good! I just wish I had a bowl of ful right now.",
      "parent": "128766",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "194973",
      "author": "Matthew",
      "author_url": "",
      "date": "2013-09-08 13:44:25",
      "content": "Planning on making this, and our Berbere does not contain korarima, rue, ajwain, or nigella. I found Rue and Ajwain seeds seperately, but wanted to ask how much of the Rue and Ajwain should we add? Should we grind or do anything to them before putting them in?\n\nThanks Michael!",
      "parent": "0",
      "gravatar_hash": "fb07f0262f58e5d70062250bec1742ef"
    },
    {
      "id": "195031",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-09-08 20:15:57",
      "content": "I've only ever bought berbere, never made it... so I'm not sure I can offer any really helpful advice there. I'd guess enough of each to be maybe 5% of the total amount of berbere, but that is just a ballpark guess. You could also just use the berbere you have, if you like how it tastes.",
      "parent": "194973",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "219184",
      "author": "be",
      "author_url": "",
      "date": "2013-11-05 09:41:18",
      "content": "Hey I love just looking at this picture! Im making this for my husband and I tomorrow! I see some people know a lot about ethiopian vs eritrean ful, well i think every chef is different. And its ok to spice it up. \n\nIm actually half Ethiopian and the other half Eritrean. So I have had every version of ful growing up! Which was awesome..now i have to learn how to make it myself!\n\nAnd whenever you are in the DC area, please go visit this hole in the wall ful restaurant owned by cute eritrean couple. cafeaurorausa.com\n\n Im no where near dc now, so your recipe is exactly what i needed!",
      "parent": "0",
      "gravatar_hash": "6808302ed8482e95992d45d1320d649b"
    }
  ]
}