{
  "comment_count": 11,
  "comments": [
    {
      "id": "1851",
      "author": "John",
      "author_url": "",
      "date": "2009-10-26 10:50:04",
      "content": "Sounds great.\n\nSince you had another article about people with food allergies, I should mention \"favism\", which my father-in-law (a physician) brought up when I cooked favas earlier this summer. According to Wisegeek (<a href=\"http://www.wisegeek.com/what-is-favism.htm),\" rel=\"nofollow\">http://www.wisegeek.com/what-is-favism.htm),</a> \"[f]avism is a medical condition which is caused by an enzyme deficiency in the blood. People with this deficiency can experience anemia as a result of exposure to fava beans,\" and \"[the person] may feel tired, feverish, or experience a headache, and the condition can also cause abdominal pain, nausea, and vomiting. If left untreated, favism can result in serious health problems, like a coma. Early warning signs of favism include jaundice, dark urine, and a general sense of feeling run down and tired all the time.\"\n\nSo: (1) favas are great, and this sounds like a wonderful recipe. (2) watch your family carefully after the first time you serve them, just in case.\n\nBy the way, the canned favas make a lot of sense in this recipe. Fresh ones have this extra \"skin\" around each bean that can be a real pain. It'll turn your 10-minute salad into a 45-minute annoyance. :(",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "1852",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-26 11:36:01",
      "content": "Interesting! I had mistakenly thought that favism was only developed by people who harvest fava beans for a living, didn&#39;t know it was something arbitrary members of the population could have. Good thing to watch out for.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1853",
      "author": "lisaiscooking",
      "author_url": "http://lisaiscooking.blogspot.com/",
      "date": "2009-10-26 14:47:34",
      "content": "I haven't cooked with tamarind, so I'm glad to learn about my options. This dish sounds delicious, and in fact, I'd like to try the whole meal you described!",
      "parent": "0",
      "gravatar_hash": "561295eae7a0ea547c538ab03aca58f2"
    },
    {
      "id": "1854",
      "author": "Tiffani",
      "author_url": "http://manzanilloblog.com",
      "date": "2009-10-27 07:29:53",
      "content": "I make something similar but with Chick Peas (Garbanzo beans). I use tamarind sauce, a pinch of garam masala, and salt and pepper. It is my lazy food. So easy, and so yummy. Especially when you have some trader joe's flat bread handy. Yumm.\nLove your site. Posted you on our Manzanillo Mexico travel blog as a good source for Veggie recipes. Being a vegetarian in Mexico takes some creativity... and large suitcases.",
      "parent": "0",
      "gravatar_hash": "bee503ad065ec3da4402985294d0fa50"
    },
    {
      "id": "1855",
      "author": "Ivy Manning",
      "author_url": "http://ivysfeast.blogspot.com",
      "date": "2009-10-27 12:26:16",
      "content": "Dear oh dear. That looks great. My Brit friend call Ful Mudamas \"the Full Mohammed\", when he orders it, he eats way too much of it. I'll have to make this for him. I love Tamicon too, especially since writing it into a recipe is much more exact than making your own from the sticky block. (See my pad thai recipe, or instance.)",
      "parent": "0",
      "gravatar_hash": "398d9a223280b1350d4db253ecccefe3"
    },
    {
      "id": "1856",
      "author": "Alessandra",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2009-10-28 19:11:53",
      "content": "I am glad I don't have favism....lovely salad, I could do with this right now...tell me Michael, does your tamarind paste taste sweet?",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "1857",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-28 19:30:15",
      "content": "@alessandra - nope, the Tamicon has no added sugar - it quite sour and fruity",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1858",
      "author": "Hannah",
      "author_url": "http://www.eatitgood.blogspot.com",
      "date": "2009-10-28 22:00:14",
      "content": "Just in time - my sister is making a bit of a Middle Eastern Feast over this long weekend in Melbourne - have sent this onto her and now I'm excited to try it! :)",
      "parent": "0",
      "gravatar_hash": "7ae42ba75471eb4919c46eb9cbf3ef35"
    },
    {
      "id": "1859",
      "author": "ariella",
      "author_url": "http://aricooks.wordpress.com",
      "date": "2009-10-31 05:43:29",
      "content": "How exciting! I am always looking for new things to do with fava beans- other than lightly pan frying them and throwing them on top of some home made hummus, which is good but it's been done many a time at our house. I just happen to have some tamarind concentrate and a bag of dried favas that I will not put to soak! Thank you again Michael, your website continues to inspire :)",
      "parent": "0",
      "gravatar_hash": "722c5b76bc7cdb8b9091cf091bb33d26"
    },
    {
      "id": "1860",
      "author": "ariella",
      "author_url": "http://aricooks.wordpress.com",
      "date": "2009-10-31 11:28:46",
      "content": "oops, I meant 'now put to soak'!",
      "parent": "0",
      "gravatar_hash": "722c5b76bc7cdb8b9091cf091bb33d26"
    },
    {
      "id": "1861",
      "author": "Spike",
      "author_url": "",
      "date": "2009-11-02 12:43:21",
      "content": "I made this recipe. When I got to the \"drizzle in the oil while whisking,\" part, I thought \"Michael's out of his mind. There's no mixing taking place at all. The oil's just floating on top.\" But 10 minutes later, when I was ready to add it to the beans, I whisked a little more...and it mixed right up to the consistency I wanted. I think that perhaps if the tamarind is still quite hot from its mixing with the boiling water, it doesn't want to emulsify.\n\nOverall, I liked the recipe, although I was handicapped by not having Fava beans. Who knew that in Providence, with its large Portuguese population, they'd be hard to find? I substituted a mix of 2/3 edamame, 1/3 lima, and it was OK as well. I think that next time I'll increase the amount of sauce by about 50%.\n\nBy the way, my own preferred tamarind concentrate is \"Tamcon\". When you wrote \"Tamicon,\" I assumed it was a typo, but a web=search shows that both are available, both sold in containers with yellow labels and red printing, etc. Live and learn! I can attest that \"Tamcon\" is quite decent, for those who cannot find \"Tamicon.\"",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    }
  ]
}