{
  "comment_count": 31,
  "comments": [
    {
      "id": "3255",
      "author": "Lael",
      "author_url": "http://onehungrysoul.blogspot.com",
      "date": "2008-10-03 14:04:08",
      "content": "mmm, quick and easy sounds great. Indian spices sound even better!",
      "parent": "0",
      "gravatar_hash": "6d506e8693d10c31dcab2f0b30f7bda4"
    },
    {
      "id": "3256",
      "author": "Alison @ Wholesome Goodness",
      "author_url": "http://wholesomegoodness.net",
      "date": "2008-10-06 10:08:24",
      "content": "I can't wait to try this!  I've been on a cabbage kick (it's cheap, nutritious, and delicious), so this will be a great addition to the rotation.  Thanks for the idea!",
      "parent": "0",
      "gravatar_hash": "069d6b389387f278ba6656f24d11163c"
    },
    {
      "id": "3257",
      "author": "Lesley",
      "author_url": "http://www.cookingwiththejoneses.com/not-so-italian-recipes/starter/onion-bhajee/",
      "date": "2008-10-07 11:05:16",
      "content": "I will trying this one out for sure!\nRight up my street.\nLesley",
      "parent": "0",
      "gravatar_hash": "cea4752b4556750efc583bc3edf9bfcb"
    },
    {
      "id": "3258",
      "author": "orange",
      "author_url": "http://www.oh-range.com",
      "date": "2008-10-15 12:57:37",
      "content": "yum! raisins and cashew nuts are a great addition :-)",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3259",
      "author": "aleigh",
      "author_url": "",
      "date": "2009-06-19 13:54:02",
      "content": "I just made this after doing a search for indian cabbage recipe...this was amazingly good!  Thanks :)",
      "parent": "0",
      "gravatar_hash": "89a267c0f26a163bc9f831111f8e1413"
    },
    {
      "id": "3260",
      "author": "Deb",
      "author_url": "http://greenvneck.blogspot.com",
      "date": "2009-08-11 15:21:01",
      "content": "Excellent recipe!!  A few changes I made:  after sauteing, I added some diced red onion, a couple splashes or mirin, and a dollop of Vegenaise.  I did add 1 t. of garam masala with the other spices.  I'm going to serve it with a curried brown rice & lentil pilaf and coconut tofu.  I can't wait for dinner!",
      "parent": "0",
      "gravatar_hash": "4534d90d6ae6fbc07829e291b185657d"
    },
    {
      "id": "3261",
      "author": "Tracy",
      "author_url": "http://www.tracyfood.com",
      "date": "2009-10-24 18:49:25",
      "content": "So, so delicious!  I just copied this into my paper notebook of recipes I would be very sad to lose if the Internet went away.  Thanks for sharing it!",
      "parent": "0",
      "gravatar_hash": "ec4ee57bf1dbee11d6fa8f212eaf2f13"
    },
    {
      "id": "3262",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-24 19:00:54",
      "content": "Thanks Tracy! We&#39;ll try to keep the internet around for a little longer, just in case.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3263",
      "author": "karen",
      "author_url": "",
      "date": "2011-01-02 20:16:43",
      "content": "I came across this recipe looking for a way to use mustard seeds in an indian-inspired cabbage dish. I served it with potato-cauliflower curry and it was fantastic! I added a fresh chile, garlic, upped the cayenne by almost double and then added lemon and cilantro, both of which I found were important to the dish for my taste.\n\nThanks for the recipe, I'll surely make it again and browse the rest of the recipes on your site.",
      "parent": "0",
      "gravatar_hash": "b8b742d9e7ae305c9a0ff65dd54b9a84"
    },
    {
      "id": "3264",
      "author": "John",
      "author_url": "",
      "date": "2011-01-04 11:41:30",
      "content": "I found this recipe unsatisfactory, but for silly reasons, I think: the cabbage I got was too large (perhaps 8\" diameter), and the largest burner on my stove is too small, maybe. Anyhow, stir-frying the cabbage was really not working, so at some point I gave up and added a few oz of water and covered the wok and stemed things so as to get the cabbage a BIT cooked. Then, when the water boiled off, I stirred a bit more to make sure everything was oil-coated, and served it. It was oddly taste-less; the mustard-oil flavor was weak, and the spice-flavors all but disappeared. I suspect that with a 5\" diameter cabbage (which is only about 1/4 the volume of an 8\" one), the flavors would be stronger, and the cooking might go better. I'll certainly give it another try, because the ingredient combination seems like a winner.\n\nOne last suggestion: \"sliced thin\" is a little vague. That could be 1/16\" or 1/4\", whcih is a pretty wide range of variation. Maybe you should add a suggested thin-ness (or say that it doesn't matter).",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "3265",
      "author": "John",
      "author_url": "",
      "date": "2011-01-10 09:54:12",
      "content": "I tried it again, and liked it lots more. I think I must have been tired or just screwed up the last time. This time around, I went with half of the half-cabbage that was left (i.e., one quarter of an 8\" cabbage), and the flavors were much clearer, and the cabbage-cooking went better. I still had to add a bit of canola oil (I used pure mustard oil, and there just wasn't quite enough there during the stir-frying. I cut down the cayenne to just a sprinkle (I've got a kid who doesn't like hot food) and the salt by half because I tend to be salt-averse, but next time I'd go ahead and use 3/4tsp.\n\nAnyhow, this time around it got generally good reviews. I'll probably try it once more, with that last 1/4-cabbage.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "3266",
      "author": "PL",
      "author_url": "",
      "date": "2011-03-07 09:03:43",
      "content": "Looks like a great recipe, just an added flavour you could try is curry leaves. You can get fresh curry leaves at an Indian/South Asian grocery store. Add a few to the oil with the mustard seeds.",
      "parent": "0",
      "gravatar_hash": "fff2ff4e138e64f4a921b03382efff44"
    },
    {
      "id": "3267",
      "author": "veggiesvillage",
      "author_url": "http://www.veggiesvillage.com",
      "date": "2011-03-07 16:59:21",
      "content": "A pinch of asafoetida is usually added to all cabbage dishes in India. I also add a cup of peas to the cabbage, when I make this dish.",
      "parent": "0",
      "gravatar_hash": "00992fa751e85356d1fbea2deecccf69"
    },
    {
      "id": "3268",
      "author": "kathryn",
      "author_url": "http://kathrynelliott.com.au",
      "date": "2011-07-16 21:16:54",
      "content": "Hi there Michael, I came across your site from a Google search and just made this for lunch.  What a lovely, lovely dish it is.  I added a dried red chilli to the oil with the mustard seeds, and also some green shallots (as I had a few leftover that needed using up).  And then we had this with some flatbreads.  Brilliant.  Thank you so much for posting",
      "parent": "0",
      "gravatar_hash": "7eb1ead124f846cbb49c8136ce189b62"
    },
    {
      "id": "10041",
      "author": "Mamaliciousindc",
      "author_url": "http://www.mamaliciousinthecity.com",
      "date": "2011-12-08 17:39:14",
      "content": "I just served this with tandoori chicken thighs and brown rice pilaf.  Fabulous and so easy!",
      "parent": "0",
      "gravatar_hash": "33d76bae4b2a505515ac227552222338"
    },
    {
      "id": "19044",
      "author": "Cynthia K Seymour",
      "author_url": "http://SeymourResults.com",
      "date": "2012-02-10 19:16:16",
      "content": "Michael,\nI made the 5 minute Indian Cabbage tonight and it was FABULOUS.  I am definitely adding this recipe to my repertoire.  I did throw in a small handfull of coconut in the end.  \nThanks for such a great site &amp; great ideas.  Definitely count me in to become a proud owner of your new cookbook!\nCynthia K. Seymour\nSeymourResults",
      "parent": "0",
      "gravatar_hash": "938b82042b04e40293c70c5442a51070"
    },
    {
      "id": "19045",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-02-10 19:49:47",
      "content": "Thanks, Cynthia! The coconut is a nice addition.",
      "parent": "19044",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22014",
      "author": "Daniella",
      "author_url": "",
      "date": "2012-03-25 10:18:39",
      "content": "I love this recipe. Thank you! I was searching for a recipe comparable to one in an Indian cookbook I've misplaced. So happy to have discovered your blog in the process! I use coconut oil and red pepper flakes. It's helpful to mention to use a very large pot or wok as the cabbage takes up a lot of volume before it cooks down :-)",
      "parent": "0",
      "gravatar_hash": "25d0996fe71a84f0531068b8daf14bd2"
    },
    {
      "id": "22735",
      "author": "Sarah",
      "author_url": "",
      "date": "2012-04-12 16:08:29",
      "content": "Delicious! I just made this and though I was suspicious at first (it looks nothing like the picture!), I really liked the taste! I added lots of red pepper flakes and more turmeric. Tasty and goes very well with many other dishes.",
      "parent": "0",
      "gravatar_hash": "6ece7105a5c32b81db70f7e333884253"
    },
    {
      "id": "28992",
      "author": "Judith",
      "author_url": "",
      "date": "2012-06-21 04:46:03",
      "content": "Looking forward to trying is out.  It sounds like the pav bhaaji that we order at our local Indian restaurant.",
      "parent": "0",
      "gravatar_hash": "7577ae246086d1616ad2d8e23da4e61b"
    },
    {
      "id": "44931",
      "author": "Sherie",
      "author_url": "",
      "date": "2012-08-11 13:54:23",
      "content": "In a crunch, this recipe works beautifully with refrigerated coleslaw mix that can be found in the pre-washed salad section. Look for vaccum packed, with no added chemicals.",
      "parent": "0",
      "gravatar_hash": "0e71754f321918d9022a3fef9773ca85"
    },
    {
      "id": "70455",
      "author": "Annette",
      "author_url": "http://verteblog.tumblr.com/",
      "date": "2012-10-29 01:38:14",
      "content": "My new favourite way to eat cabbage! I halved the salt, added a few cloves of finely sliced garlic and ginger and sautéed until the cabbage was just beginning to soften. It's quick and the spices add a perfect warmth for a healthy winter dish. Thank you!",
      "parent": "0",
      "gravatar_hash": "425f917525002771e042a263fd36ad9f"
    },
    {
      "id": "71285",
      "author": "diane",
      "author_url": "",
      "date": "2012-10-30 15:26:19",
      "content": "this was so good!!!  i added some sliced baked potato when the cabbage was half done to make it substantial enough for a vegan main dish.  we loved it.  might use a tad less cayenne next time.",
      "parent": "0",
      "gravatar_hash": "168a27c9040af3edf977f89aca28468e"
    },
    {
      "id": "115468",
      "author": "Stephanie@glutenfreebynature",
      "author_url": "http://Glutenfreebynature.com",
      "date": "2013-02-07 14:13:12",
      "content": "I made this last night as an alternative to my old stand by braised cabbage. I toasted 1 tsp cumin and 1 tsp turmeric in a saucepan then added 11/2 tap kosher salt and 2 tblsp fresh ginger. I shredded the cabbage in my food processor (took 90 seconds) and let it all cook down for about 20 minutes stirring pretty frequently. It. Was. Amazing. Even my kids adored it. Thanks so much for the awesome recipe :)",
      "parent": "0",
      "gravatar_hash": "741aa13225417e05abc6de78e983db97"
    },
    {
      "id": "297506",
      "author": "kim",
      "author_url": "",
      "date": "2013-12-11 09:15:29",
      "content": "This was Great next time I will make double !",
      "parent": "0",
      "gravatar_hash": "3c093b274d9266971b7a704a705eb970"
    },
    {
      "id": "1253277",
      "author": "Gail",
      "author_url": "",
      "date": "2015-02-10 16:26:12",
      "content": "Yummy!  Quick, easy &amp; tasty!  Thanks for sharing.",
      "parent": "0",
      "gravatar_hash": "a84fa67838b69381212768153a6e63ed"
    },
    {
      "id": "1314117",
      "author": "Julia",
      "author_url": "",
      "date": "2016-02-26 20:14:11",
      "content": "Thank you so much for this cabbage recipe!  It tastes just like my mom's.  I also used it on peacock kale that came in a CSA box.  The kale was way better with this recipe than raw in a salad.",
      "parent": "0",
      "gravatar_hash": "528500f4ce4e5e86286a3bcf20214a86"
    },
    {
      "id": "1314182",
      "author": "Sunil",
      "author_url": "",
      "date": "2016-07-10 01:50:32",
      "content": "Simple and Delicious! Brilliant :)",
      "parent": "0",
      "gravatar_hash": "1c564b7ba6e017842d88b9b71b4d6838"
    },
    {
      "id": "1314218",
      "author": "diane schyberg",
      "author_url": "",
      "date": "2016-10-01 16:52:36",
      "content": "i've been making a variation of this for several years now.  we make it into a vegan main dish by adding potatos and onions.  i use cumin seeds with the mustard seeds instead of ground cumin.  and we garnish with peanuts.  it is a favorite even with non vegan husband.  thanks, michael.  another one of your recipes that has become a regular is the mission style tofu with shiso, even tho i don't know what shiso is, so i substitute other greens.",
      "parent": "0",
      "gravatar_hash": "168a27c9040af3edf977f89aca28468e"
    },
    {
      "id": "1314347",
      "author": "peter",
      "author_url": "",
      "date": "2017-08-17 13:36:01",
      "content": "Thank you Michael.   I tweaked the spices a bit to suit my taste  and it was great !    So quick too.",
      "parent": "0",
      "gravatar_hash": "49aa81e320467dd9a9fd0a2f0da718f8"
    },
    {
      "id": "1314471",
      "author": "Maria",
      "author_url": "",
      "date": "2017-11-14 15:58:53",
      "content": "I don't know why people have to comment \"ooh looks good, I gotta try it!\"  When people are actually looking for reviews on if it was good or not....\nAnyway- I made this and it was super fast and very good.  I did add peas and garbanzo beans to make it a meal for myself.  Perfect.",
      "parent": "0",
      "gravatar_hash": "5502f50f084019acd480c48b617bdd90"
    }
  ]
}