{
  "comment_count": 5,
  "comments": [
    {
      "id": "4160",
      "author": "Dan",
      "author_url": "",
      "date": "2007-08-03 11:36:49",
      "content": "Tender biscuit people are obviously wrong. :-)",
      "parent": "0",
      "gravatar_hash": "9b9fe541e277a9e769103a61b499d8f7"
    },
    {
      "id": "4161",
      "author": "nithya at hungrydesi",
      "author_url": "http://www.hungrydesi.com",
      "date": "2009-08-22 16:07:57",
      "content": "Just found your blog while looking for a good flaky biscuit recipe. Great blog!",
      "parent": "0",
      "gravatar_hash": "3cf25ebcaa3098674f11e97334bdc8f3"
    },
    {
      "id": "4162",
      "author": "jodicooks@hotmail.com",
      "author_url": "",
      "date": "2010-02-13 06:26:21",
      "content": "I aslo stumbled on this blog, I also have been auditioning\nfor master chef, If at all possible could I contact you?\nI'd like more info on your text powder,(cornstarch sub?) I can't recall the name. I am Jodi and would love to chat with you!! Your anti griddle is nothing short of pure genius!!!",
      "parent": "0",
      "gravatar_hash": "0fe2ffa120d2a65c5f30ee6ee2124f2d"
    },
    {
      "id": "4163",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-02-13 07:11:19",
      "content": "You bet! Contact info is on the About page.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "4164",
      "author": "Michael Watanabe",
      "author_url": "",
      "date": "2011-05-18 09:28:02",
      "content": "i cubed up my butter and tossed all the cubes in a littttle bit of flour and then stuck them in the freezer along with the buttermilk. i put all the dry ingredients together in a bowl and incorporated them and stuck it in a food processor. took the butter out and food proccessed it until there were pea sized chunks of butter in it. only takes a couple of pulses. poured it back out into the glass bowl i had my dry ingredients in and then i added the COLD buttermilk from the freezer. mixed it with a fork JUST until the dough barealy barely came together. poured it out onto the floured board and folded the dough into itself probably 4 or 5 times. instead of a biscuit cutter (cuz i didnt have one) i cut them into squares with a sharp knife. it actually made them quite elegant and cute. i also used a silpat instead of parchment and there was no issue with the butter smoking ;) This is a GREAT recipe! The first time i made biscuits they were horrible.....now i feel like a pro! haha",
      "parent": "0",
      "gravatar_hash": "f0d40ae5e9cd42f9173a37c77408eac7"
    }
  ]
}