{
  "comment_count": 6,
  "comments": [
    {
      "id": "2667",
      "author": "sarah",
      "author_url": "http://www.tastespotting.com",
      "date": "2009-03-19 10:19:55",
      "content": "i am always impressed when someone take s aGOOD pic of pizza (bc pizza is imho, one of the top5 hardest things to photograph well) :)",
      "parent": "0",
      "gravatar_hash": "ced442ae9b1de61c48ddc651db0286a7"
    },
    {
      "id": "2668",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-03-19 12:05:31",
      "content": "Thanks, that means a lot, especially coming from you!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2669",
      "author": "The Other Tiger",
      "author_url": "http://profile.typepad.com/theothertiger",
      "date": "2009-03-19 14:15:30",
      "content": "<I>The egg is added about halfway through the baking, then when it reaches an \"over-easy\" consistency, the cooks spread it around the pie.</I>\n\nWow.  I hadn't looked closely at the photo before I scrolled down to start reading, and so I was thinking, \"Oh, yeah, an egg in the center of a pizza...seen that.\"  But the smearing of the egg, that's awesome.\n\nWe don't live too far away from there, and I've been thinking about checking them out, but now I know I have to go.  And bring a mix tape with me.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2670",
      "author": "Ian",
      "author_url": "",
      "date": "2009-03-20 10:56:49",
      "content": "I discovered this post on TasteSpotting and thought the pizza looked gorgeous and sounded delicous.\n\nWhen I clicked over to this website and saw that FSPC is in Seattle and then realized that I <i>too</i> am in Seattle...well, I almost jumped out of my seat.\n\nI know what I'm having this weekend!",
      "parent": "0",
      "gravatar_hash": "04a1e27ed2367b36abc8afaa9713b84e"
    },
    {
      "id": "2671",
      "author": "A&amp;N",
      "author_url": "http://reluctantchefs.blogspot.com",
      "date": "2009-03-22 08:30:57",
      "content": "Wow - I have never had an egg on a pizza before. I should totally, totally try this out!",
      "parent": "0",
      "gravatar_hash": "50de5463f411bb5bad4710eb70af07f3"
    },
    {
      "id": "2672",
      "author": "Fairly Odd Tofu Mom",
      "author_url": "http://tofu-n-sproutz.blogspot.com/",
      "date": "2009-03-22 21:47:51",
      "content": "I'm excited. They have an actual VEGAN PIZZA listed on the menu!! No \"please-leave-the-butter-the-eggs-the-cheese-the-whatever\" off my pizza to make it vegan... they actually have one - and many options I could easily make vegan with little trouble. I'm in love.\nThank you (Yes, I know, your original post has EGGS in it and so not vegan, but I like exploring options regardless of what the original recipe is...)",
      "parent": "0",
      "gravatar_hash": "1a0b4a32e20aa0dec8b1491f2bea1ad6"
    }
  ]
}