{
  "comment_count": 11,
  "comments": [
    {
      "id": "2606",
      "author": "TimK",
      "author_url": "",
      "date": "2009-04-03 12:02:17",
      "content": "Awesome article. Bookmarked for future hunger pangs.\n\nTimK's take - I tend to eat dinner more than lunch in Fremont, and being non-veggie, non-foodie and a hophead my outlook is decidedly different.  Some quick thoughts.\n\nDad Watson's - Sorry Mike, this doesn't belong grouped with the Red Door.  Granted, the pub fare food is similar, but as a McMenamin's branch the beer choices are focused on McM's own tasty brews and the food is their chain-wide menu (plus local specials). But I may be biased- I grew up in Portland and weened onto beer by their Ruby Ale, so McM's is a taste of home for me.  Decent burgers (mmm... Communications Breakdown), though the soft buns tend to disintegrate quickly.  Skip the nasty, burnt shoestring fries and get the salad, which is garnished with tasty pickled onions.  Just be prepared for McM's other trademark- almost negligently absent service.\n\nBlue C - I'm frequently disappointed when I come here. Kaiten sushi should be cheap, grab and go stuff. Blue C tries to elevate the concept to be hip, with prices to match. For me this is failure for both concept and execution. The quality, and therefore value, is not there- the fish is cut too long and thin, the speciality rolls are overstuffed, and the selection of nigiri is disappointing.\n\nCostas Opa - My exposure to greek food is pretty limited, but I'm always satisfied when I visit here. Tasty food, albeit often greasy with olive oil.",
      "parent": "0",
      "gravatar_hash": "241f7ef0d532d67a26f6c896643ca85d"
    },
    {
      "id": "2607",
      "author": "Rachel",
      "author_url": "http://profile.typepad.com/6p010536b4dd10970c",
      "date": "2009-04-03 12:55:34",
      "content": "Hey, I'm one of your daytime neighbors! And this is a great roundup. I've been lunching around this neighborhood for 7 years. It's time for me to head to lunch, so the reminder on the Flair Taco truck is especially appreciated.\n\nI think that 35th St Bistro closed a few months ago, though. I hope to make it to Nana's sometime, but I was glad to see we feel the same on the Thai options.\n\n-Rachel\n(I'm Sally S on twitter, by the way -- the one with the blue wig. I like to call SS my legacy username. :) )",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2608",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-04-03 21:37:20",
      "content": "That's funny, I didn't even realize Dad Watson's was a McM outpost. I've\nmostly been there with large groups at lunch, so not paying close attention.\nI've been to Six Arms and the one on lower Queen Anne a few times. I like\ntheir beer too, and yeah, now that you mention it... that food is awfully\nfamiliar... and you know, fine :). I'll have to give Costas Opa another try,\nit has been years.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2609",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-04-03 21:41:45",
      "content": "Hey Rachel / Sally / Blue haired twitter-person - thanks for the note! I\nthink 35th St. Bistro is open, but I see it has changed hands since I was\nlast in and has even fewer vegetarian options than the past... unless they\nwill do a croque madame minus the ham. Like Cafe Presse. Yum.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2610",
      "author": "alice",
      "author_url": "http://savorysweetlife.com",
      "date": "2009-04-03 22:24:13",
      "content": "Thanks for the post.  I use to go to Yak's Deli about 20 years ago.  Unfortunately the ownership changed so many times that I stopped going.  But I love Jai Thai.. there little spring rolls make me happy!",
      "parent": "0",
      "gravatar_hash": "6ca987bc2434b8f7d0c27afd61dd1338"
    },
    {
      "id": "2611",
      "author": "A&amp;N",
      "author_url": "http://reluctantchefs.blogspot.com/",
      "date": "2009-04-06 06:18:53",
      "content": "Lovely round up Michael! You've covered a ton of restaurants there :) Kudos on the effort :)",
      "parent": "0",
      "gravatar_hash": "50de5463f411bb5bad4710eb70af07f3"
    },
    {
      "id": "2612",
      "author": "DanaInK",
      "author_url": "",
      "date": "2009-06-05 09:08:12",
      "content": "I'll agree with Timk on all his point - except: McMenamin's fries are THE BOMB!!!  But then I love Dick's fries... which McM's are like a better version of.",
      "parent": "0",
      "gravatar_hash": "bbf9eff28a3b17329d5d0fb3dd2d5c36"
    },
    {
      "id": "2613",
      "author": "jess",
      "author_url": "",
      "date": "2009-07-03 11:50:29",
      "content": "Many of the dishes labeled as \"vegetarian\" at Tawon contain shrimp paste, including some of the curries.",
      "parent": "0",
      "gravatar_hash": "f5ed792925a7024015bbe0b18ec6727b"
    },
    {
      "id": "2614",
      "author": "Mark",
      "author_url": "http://www.veggieopolis.com",
      "date": "2009-09-15 16:02:09",
      "content": "Wow, so many vegetarian food options!  If I order can you send to the uk? : - )\nVegetarian here = cheese. Good reviews! Seattle sounds an excellent place to find veg food. Mark, Veggieopolis.",
      "parent": "0",
      "gravatar_hash": "a0ff45894bfa6b2f21607bd859d13e06"
    },
    {
      "id": "2615",
      "author": "N",
      "author_url": "http://www.caitieandnanako.tumblr.com",
      "date": "2010-06-16 13:59:32",
      "content": "I stumbled upon your blog while browsing foodgawker. Pleased to see that you are from Seattle, I go to UW so I will be using this post as a reference for all the yummy places I can go to! :)",
      "parent": "0",
      "gravatar_hash": "600f03ff99b29e22aab7ccc37e33d7b4"
    },
    {
      "id": "1314056",
      "author": "Dominique",
      "author_url": "",
      "date": "2015-10-21 19:27:03",
      "content": "Tacos Guaymas puts chicken broth in their rice which is included in the vegetarian burrito.",
      "parent": "0",
      "gravatar_hash": "8df816794c29a8e950aae7bee756dba5"
    }
  ]
}