{
  "comment_count": 9,
  "comments": [
    {
      "id": "2962",
      "author": "Laura",
      "author_url": "http://whatilikenyc.blogspot.com",
      "date": "2009-01-22 12:27:37",
      "content": "This is definitely my kind of recipe.  I am obsessed with fresh ricotta.  Unfortunately, whenever I buy some it doesn't stick around for long.  I eat most of it standing in front of the fridge with a spoon.  If I'm feeling especially fancy I top a bit with honey or balsamic vinegar in a bowl.  But this recipe has strengthened my resolve to save it for pasta.",
      "parent": "0",
      "gravatar_hash": "8a04728fb44504bd9fa74188aae30036"
    },
    {
      "id": "2963",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-01-22 13:43:45",
      "content": "Laura - you've been watching my kitchen webcam haven't you!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2964",
      "author": "Amy",
      "author_url": "http://www.vegesveggiepatch.blogspot.com",
      "date": "2009-01-23 01:55:20",
      "content": "This sounds absolutely wonderful and there's no doubt I'll be making it in the very near future (I'm thinking maybe for dinner tomorrow night). Thank you for the recipe.",
      "parent": "0",
      "gravatar_hash": "02e41df52438ed388da59bdc372bcf85"
    },
    {
      "id": "2965",
      "author": "spooninandforkin",
      "author_url": "http://spooninandforkin.com",
      "date": "2009-01-24 06:56:34",
      "content": "I was thinking chanterelles would sound great in this recipe just as you were comparing it to hedgehog. Didn't know about hedgehog but I'm going to search for some.",
      "parent": "0",
      "gravatar_hash": "28ac9cbf9b23c9e7144b048ccee0d25d"
    },
    {
      "id": "2966",
      "author": "Sara",
      "author_url": "http://smallkitchenbigideas.wordpress.com",
      "date": "2009-01-25 03:16:32",
      "content": "This dish looks amazing.\nI love pasta dishes for weeknight dinners.",
      "parent": "0",
      "gravatar_hash": "44020b280f34b593376633e9b425d3cf"
    },
    {
      "id": "2967",
      "author": "Joanna",
      "author_url": "http://scalloped-edge.blogspot.com",
      "date": "2009-01-25 15:01:48",
      "content": "Oh I love this idea!  Fresh ingredients, simple preparation, and it looks delicious.  Definitely bookmarking this one!",
      "parent": "0",
      "gravatar_hash": "162fb33db8c91df1cb51af7780965c65"
    },
    {
      "id": "2968",
      "author": "Jyotsna",
      "author_url": "",
      "date": "2009-02-17 12:27:47",
      "content": "Hi, I've been waiting to try this and try it we did on Sun. Part of the adventure for me was a trip to our fm to get fresh herbs, pasta and Calabro ricotta.  We made two batches.  The first course was very simple: fresh tagliatelle, ricotta, sea salt & freshly ground pepper, and newly cut thai basil.  Delish!  For the second course we sauteed (and then simmered for a long time) regular button mushrooms in butter, garlic and red wine.  Tossed with the pasta, ricotta, a bit of S&P and then put back on the heat for a few minutes.  Third course (for him) was lamb roasted with fresh rosemary, olive oil, S&P, and breadcrumbs, and we shared a salad of mixed baby greens/arugula/and fresh sage.  Homemade balsamic vinegar dressing - excellent.  Finished with few chocolate truffles with fresh straw & blue berries.  The leftover basil pasta I had the next day with the leftover balsa/vin soaked salad on top.  EXCELLENT!!! Thanks Michael - I am glad I stumbled upon your site.",
      "parent": "0",
      "gravatar_hash": "e36b9090c2184c256b7668dfe53cdda4"
    },
    {
      "id": "2969",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-02-17 13:06:38",
      "content": "Wow Jyotsna, that sounds like an amazing meal. Thanks for writing about it!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2970",
      "author": "zoe",
      "author_url": "http://thezoeblog.blogspot.com",
      "date": "2009-05-20 07:42:51",
      "content": "YUM! I may add some lemon juice in addition to the zest. Awesome recipe, thanks!",
      "parent": "0",
      "gravatar_hash": "da95b6426c43d00947a19567a7b28d12"
    }
  ]
}