{
  "comment_count": 26,
  "comments": [
    {
      "id": "428",
      "author": "Ivy Manning",
      "author_url": "http://ivysfeast.blogspot.com",
      "date": "2011-04-11 11:31:57",
      "content": "Oh lovely. Any excuse to make gobi again! (And dal for that matter!)\n\nWhere do you find your mustard oil? I have some lurking somewhere, but it's not refrigerated. Probably rancid at this point, huh?",
      "parent": "0",
      "gravatar_hash": "398d9a223280b1350d4db253ecccefe3"
    },
    {
      "id": "429",
      "author": "John",
      "author_url": "",
      "date": "2011-04-11 14:43:46",
      "content": "I make a closely-related version of this dish, but it also includes cubed potatoes, and getting the potatoes and cauliflower to be done at the same time is a little tricky at first.\n\nThe key ingredient that I use and you don't is nigella seeds -- about 10-20 seeds for a dish that serves 4 seems about right. They have a flavor that goes perfectly with the cauliflower. You can throw them in at the same time as the mustard seeds. (I get them from a local indian store; I think my 8oz bag cost me about what one 3/4oz Spice Islands jar of cumin would cost!)\n\nMy only other suggestion is that it's good idea to add the mustard oil LATE in the process. High heat seems (to me) to make it lose its mustardy-ness.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "430",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-04-11 20:08:55",
      "content": "Hey Ivy - You can find mustard oil at any Indian grocery, but it will likely be labeled for external use only. You have to use your own judgement on that one. Apparently the US has banned it as a cooking oil and labeling it that way is wink to get around it. I haven&#39;t studied it extensively, but figure I&#39;m willing to take the chance on a teaspoon here and there. You are probably right that it should be refrigerated if you don&#39;t use it often.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "431",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-04-11 20:09:46",
      "content": "Nigella seeds would indeed be very welcome at this party! I like their slightly oniony little bite. They are nice on flatbreads as well.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "432",
      "author": "Xiaolu @ 6 Bittersweets",
      "author_url": "http://www.6bittersweets.com",
      "date": "2011-04-12 16:40:03",
      "content": "I love cauliflower in Indian curry.  Happen to have a whole cauliflower waiting in the fridge for just such a recipe =D.",
      "parent": "0",
      "gravatar_hash": "c90f8e5d3f0ef8fd93e1605d8c6a2f61"
    },
    {
      "id": "433",
      "author": "Joanna goes vegan",
      "author_url": "http://skorak.blogspot.com/",
      "date": "2011-04-13 06:40:52",
      "content": "Your cauliflower looks delicious. I have never tried it your way but I will try for sure.",
      "parent": "0",
      "gravatar_hash": "08258c42eeffd5ab3e30b7f103ee09ee"
    },
    {
      "id": "434",
      "author": "Cassie",
      "author_url": "http://kitchen--alchemist.blogspot.com",
      "date": "2011-04-13 09:26:18",
      "content": "I think cauliflower is so delicious with Indian spices. I made a dish very similar to this recently. Yum!",
      "parent": "0",
      "gravatar_hash": "e6802adf23c04a802733dafe4b2aef64"
    },
    {
      "id": "435",
      "author": "Mimi (Gingersnaps)",
      "author_url": "http://damnthefreshman15.wordpress.com/",
      "date": "2011-04-17 17:05:24",
      "content": "That looks delicious! I'm trying to get better at making my own Indian food. In London I've fallen in love with it but I'm about to return to the U.S.\n\nSo I'm guessing mixing your own spices is always superior to a pre-made blend?",
      "parent": "0",
      "gravatar_hash": "cb20fbaa8f65865b54aed3a19d4ca3a3"
    },
    {
      "id": "436",
      "author": "Morgan",
      "author_url": "http://www.culturezest.org/home/users/detail?UserHexID=73427218-9BE9-4919-8842-F2D519B90147",
      "date": "2011-04-17 18:08:29",
      "content": "I love gobi masala, but I've never heard of mustard oil. It just makes me wonder why I've never heard of it, since I love mustard so much. Also, where would one go about finding asafoetida powder?",
      "parent": "0",
      "gravatar_hash": "dcd54fcd95d5c98e60bce89d3693a550"
    },
    {
      "id": "437",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-04-18 19:36:26",
      "content": "@Mimi - the best thing about mixing your own spices is that you can start with whole seeds and other spices which will retain their flavor better than powdered. That said, there are some reputable brands of spice mixes that are quite good. Your best bet is to buy them at a busy Indian grocer where they will have turned over quickly and so not turned to dust on the shelf.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "438",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-04-18 19:39:07",
      "content": "@Morgan - well, there is the issue that in the US at least, mustard oil can&#39;t be sold for eating, although it is used quite heavily in Indian food. Do some reading on the web and make your own decision whether you want to use it or not. Asafoetida can be found at any Indian grocery, or you can buy it online: <a href=\"http://amzn.to/gOJsGB\" rel=\"nofollow\">http://amzn.to/gOJsGB</a> . It is used in very small quantities, and it adds somewhat of garlicky, resinous flavor, and is purported to be good for digestion.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21011",
      "author": "jan butcher",
      "author_url": "http://herbivoracious",
      "date": "2012-03-07 16:55:59",
      "content": "hi i just tried the cauliflower curry and something in there was really bitter? i did use brown mustard seed instead of black? did i not cook the mustard enough. that is the only thing i can think of that may make it bitter?\nthanks\njan",
      "parent": "0",
      "gravatar_hash": "8da6feb3abf18a4b7e94b67dff33f82d"
    },
    {
      "id": "21012",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-07 17:04:45",
      "content": "Hey Jan - the most likely way to have this dish turn out bitter would be to burn the spices, or maybe use too much turmeric. It is worth finding the black mustard seed though, it it a different flavor and used in a huge number of Indian dishes so you won't have any trouble using it up.",
      "parent": "21011",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21698",
      "author": "Alixe",
      "author_url": "",
      "date": "2012-03-20 12:09:31",
      "content": "That was flippin' delicious! I added potatoes and left out the mustard oil (I didnt have any on hand). Thanks for the recipe, it's a keeper :)",
      "parent": "0",
      "gravatar_hash": "9bb2b8273188faa2a8ddc176ff3bea1e"
    },
    {
      "id": "21705",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-20 15:21:04",
      "content": "Good deal! (And with potatoes you've got Aloo Gobi, a classic.)",
      "parent": "21698",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "33953",
      "author": "Lakh",
      "author_url": "",
      "date": "2012-07-04 15:56:05",
      "content": "I grew up eating Indian food so I am hard to please but this recipe is excellent. Me and boyfriend loved it. Thank you !!!",
      "parent": "0",
      "gravatar_hash": "3389c3387f434ea9a4d196a65dab2290"
    },
    {
      "id": "160725",
      "author": "Marylee",
      "author_url": "",
      "date": "2013-06-17 19:14:00",
      "content": "I tried this today and loved it!  I will certainly be making it again and again.  I bought some asafetida a while ago for another recipe and never got around to using it.  It's quite potent and it seems I have a lifetime supply if all I need is a pinch at a time.  What I like about this recipe is how easy it is to make as the only perishable ingredient I need is the cauliflower.  (I omitted the fresh cilantro garnish and I always have onions on hand.)  Thank you for providing a new and delicious way to eat cauliflower!",
      "parent": "0",
      "gravatar_hash": "b702e35724a889b00ee2bbb8234c2df7"
    },
    {
      "id": "180874",
      "author": "Sue",
      "author_url": "",
      "date": "2013-07-29 20:38:35",
      "content": "Just a note on the gluten-free-ness of the recipe.   Asafoetida is usually NOT gluten free, as the gum is most often mixed with wheat flour.  I've read that Frontier sells an asafoetida that is made with rice flour though.",
      "parent": "0",
      "gravatar_hash": "05e7933694a987d4e53755c10633e426"
    },
    {
      "id": "180891",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-07-29 21:24:35",
      "content": "Fascinating, I had no idea! You could also just omit it. I'll add a note to the recipe.",
      "parent": "180874",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "915031",
      "author": "Marcy Sheiner",
      "author_url": "http://www.marcys.wordpress.com",
      "date": "2014-05-22 13:32:19",
      "content": "Can you add broccoli ?",
      "parent": "0",
      "gravatar_hash": "0c8336912d9f7c05e5575f8e712a3f81"
    },
    {
      "id": "915970",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-05-23 08:26:52",
      "content": "I've never tried... it might be good.",
      "parent": "915031",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1165183",
      "author": "GuruKaram",
      "author_url": "",
      "date": "2014-11-30 13:03:50",
      "content": "Hey Michael - Did you really mean 1 tablespoon of Turmeric? I used that much against my better judgement and got the bitterness that I expected. Mine was also a LOT more yellow than your pic. Usually 1 teaspoon is considered a lot. It was still pretty darn good but next time I will reduce that spice. Ah, well at least my liver should be happy with all that turmeric...",
      "parent": "0",
      "gravatar_hash": "c44bfa5f31e4095d85ae3c516b9cef20"
    },
    {
      "id": "1165209",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-11-30 13:23:42",
      "content": "You know, it has been a long time since I've made this, so I can't say for certain, but I agree 1 tablespoon seems on the heavy side. I do love turmeric though. You could always start with less and then add in more at step 4 if you feel like you'd like a bit more.",
      "parent": "1165183",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314281",
      "author": "Kate",
      "author_url": "",
      "date": "2017-03-10 06:43:34",
      "content": "Does this recipe freeze successfully?",
      "parent": "0",
      "gravatar_hash": "af6296e307493c47e20617629bb7e0cc"
    },
    {
      "id": "1314282",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2017-03-10 06:54:55",
      "content": "I don't think i've tried, but I'd suspect the cauliflower will get watery.",
      "parent": "1314281",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314283",
      "author": "Kate",
      "author_url": "",
      "date": "2017-03-10 13:28:45",
      "content": "Thanks, Michael. I think I'll make a soup this time; I'm focused on the freezer for a specific reason. But I'll make this another time. The site is intriguing; I'll explore. :)",
      "parent": "0",
      "gravatar_hash": "af6296e307493c47e20617629bb7e0cc"
    }
  ]
}