{
  "comment_count": 42,
  "comments": [
    {
      "id": "902734",
      "author": "Tracey",
      "author_url": "",
      "date": "2014-05-08 17:21:33",
      "content": "Is this a joke?\n.... MSG?\n\nIt has to be a joke..? Right? I think I missed the punch line.",
      "parent": "0",
      "gravatar_hash": "13b86bc50e1bea7c0f4a79aadebb1504"
    },
    {
      "id": "902737",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-05-08 17:26:31",
      "content": "Actually MSG is totally fine. If you eat Parmesan cheese, tomatoes, shiitake mushrooms, etc, you are eating lots of glutamates. There have been great double blind studies that show that the people that think they are affected by it are simply experiencing a placebo effect. You can read all about it on wikipedia: http://en.wikipedia.org/wiki/Monosodium_glutamate",
      "parent": "902734",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "904533",
      "author": "Joe Seattle",
      "author_url": "",
      "date": "2014-05-10 17:47:21",
      "content": "A veggie burger with MSG - you have got to be out of your mind to add this to your diet.  MSG is so bad for you!",
      "parent": "0",
      "gravatar_hash": "92a5908930da797192727c33dc12076c"
    },
    {
      "id": "905117",
      "author": "Tammy",
      "author_url": "",
      "date": "2014-05-11 15:28:08",
      "content": "Wikipedia is not a very credible reference, and there are many studies published in peer-reviewed medical journals that say otherwise.",
      "parent": "0",
      "gravatar_hash": "cefd7f10a101f69b39bb72e0afaeb9c6"
    },
    {
      "id": "905232",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-05-11 20:07:10",
      "content": "You are right, it is great to look at the peer reviewed medical literature. And if you look at every single study that has been done correctly (double blind, placebo controlled, and with the MSG given in a gelatin capsule so the tasters can't tell whether they are getting MSG or the placebo), there has been no observed effect. For example, see this study that was published in Food and Chemical Toxicology. The conclusion was: \"71 healthy subjects were treated with placebos and monosodium L-glutamate (MSG) doses of 1.5, 3.0 and 3.15 g/person, which represented a body mass-adjusted dose range of 0.015–0.07 g/kg body weight before a standardized breakfast over 5 days. The study used a rigorous randomized double-blind crossover design that controlled for subjects who had MSG after-tastes. Capsules and specially formulated drinks were used as vehicles for placebo and MSG treatments. Subjects mostly had no responses to placebo (86%) and MSG (85%) treatments. Sensations, previously attributed to MSG, did not occur at a significantly higher rate than did those elicited by placebo treatment. A significant (P < 0.05) negative correlation between MSG dose and after-effects was found. The profound effect of food in negating the effects of large MSG doses was demonstrated. The common practice of extrapolating food-free experimental results to ‘in use’ situations was called into question. An exhaustive review of previous methodologies identified the strong taste of MSG as the factor invalidating most ‘blind’ and ‘double-blind’ claims by previous researchers. The present study led to the conclusion that ‘Chinese Restaurant Syndrome’ is an anecdote applied to a variety of postprandial illnesses; rigorous and realistic scientific evidence linking the syndrome to MSG could not be found.\" Here's the link if you'd like to read more. http://www.sciencedirect.com/science/article/pii/027869159390012N . If you can cite a peer reviewed paper that has all 3 of those controls and shows an effect, I'd love to read it.",
      "parent": "905117",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "905233",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-05-11 20:07:44",
      "content": "See the further discussion in the comments.",
      "parent": "904533",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "905587",
      "author": "Vijay @ NoshOnIt",
      "author_url": "http://www.noshon.it",
      "date": "2014-05-12 05:50:04",
      "content": "Can't wait to try this Michael. I actually picked up some sodium caseinate and activa RM a few weeks ago in NYC when I was passing through just to make this. It'll be my first time working with both of them, but the process looks pretty straightforward! Think I'll be making a half-batch to start.",
      "parent": "0",
      "gravatar_hash": "4fe96b487bd7e05936e1c07733f6759b"
    },
    {
      "id": "905596",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-05-12 06:16:35",
      "content": "That's awesome that you already have the ingredients on hand!",
      "parent": "905587",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "907181",
      "author": "Su Cooper",
      "author_url": "",
      "date": "2014-05-14 05:09:18",
      "content": "Hello,  Ihave been extremly afraid of cooking Tofu. Attempted to make Tofu Scrambler and failed miserably.  However, I did get enough courage to try it in a Stir-fry and it was really good.  I live in Northern, NJ and would love to take a class in preparing Tofu that's how serious I am about it.  I really want to try this.  Why is MSG added and Is it really necessary?  Just asking.....",
      "parent": "0",
      "gravatar_hash": "fa335183af00675b0b1a098b832bf9ea"
    },
    {
      "id": "908077",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-05-15 05:43:46",
      "content": "Yes, you can make the veggie burger without MSG if you like. It is there for enhanced umami, and it is quite harmless (see comments above), but you can certainly omit it. Re tofu, this article may be helpful to you: <a href=\"https://herbivoracious.com/2012/05/how-to-make-tofu-really-freaking-delicious-tofu-101.html\" target=\"_blank\" rel=\"nofollow\">https://herbivoracious.com/2012/05/how-to-make-tofu-really-freaking-delicious-tofu-101.html</a>",
      "parent": "907181",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "908097",
      "author": "Su Cooper",
      "author_url": "",
      "date": "2014-05-15 06:05:08",
      "content": "Thank you Michael for responding.  Currently doing a lot of researching on becoming a Vegetarian.  I did it for four years and failed miserably.  I wasn't ready and I did not do a lot of research.  Now I'm taking my time and taking one day at a time.  I wnat to make the Mushroom Burgers the recipe sounds yummy.  I could use some help with converting the grams. \n\n1500 grams mushrooms (4 Cups), \n50 grams sodium caseinate (3 Tablesponns and 3 teaspoons), \n50 grams Activa RM (transglutaminase), \n10 grams salt (2 teaspoon), \n2 grams MSG(1/4 teaspoons)\n\nThanks again, truly inspriring.",
      "parent": "0",
      "gravatar_hash": "fa335183af00675b0b1a098b832bf9ea"
    },
    {
      "id": "909922",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-05-17 07:37:40",
      "content": "Hey Su - for a slightly technical recipe like this, I'd really recommend investing in an inexpensive digital scale. You'll get much more predictable results. Here are our recommendations: http://www.chefsteps.com/assemblies/why-work-by-weight#/choosing-a-scale . And by the way, the best way to cook these burgers is to sear them hard in a cast iron skillet with enough oil to develop a good crust.",
      "parent": "908097",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "910033",
      "author": "Su Cooper",
      "author_url": "",
      "date": "2014-05-17 10:00:51",
      "content": "Thank you. I agree. Trying to upgrade my utilities for the kitchen and a scale would definitely be helpful. Thanks again for responding. I will let you know when I've completed the burger mission. LOL",
      "parent": "0",
      "gravatar_hash": "fa335183af00675b0b1a098b832bf9ea"
    },
    {
      "id": "914192",
      "author": "Nen",
      "author_url": "",
      "date": "2014-05-21 18:12:37",
      "content": "I love you michael",
      "parent": "0",
      "gravatar_hash": "cb804537961fcdc13d800094d635f324"
    },
    {
      "id": "918121",
      "author": "Karina",
      "author_url": "",
      "date": "2014-05-25 14:09:04",
      "content": "Thank you so much for helping fight the stigma against MSG. Like salt or sugar, anything in moderation is fine. Love the blog!",
      "parent": "0",
      "gravatar_hash": "3f30865fe80f32f4d3ec0da83288b72c"
    },
    {
      "id": "921633",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-05-28 20:12:27",
      "content": "Amen!",
      "parent": "918121",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "958123",
      "author": "Kokimasak",
      "author_url": "http://kokimasak.com/",
      "date": "2014-07-06 09:42:26",
      "content": "I was here to search veggie food, and I got it, plus i got the bonus about MSG knowldge. Thanks",
      "parent": "0",
      "gravatar_hash": "c5b314638905d19e98094bf9739c38ee"
    },
    {
      "id": "962596",
      "author": "Michelle",
      "author_url": "http://www.leosigh.com",
      "date": "2014-07-11 21:44:03",
      "content": "Wow, that looks really unhealthy. MSG (truly terrible for your health and, despite what some studies show, many people are allergic to it, including my mother who gets violently ill and has to be hospitatlized), sodium caseinate (has links to high incidences of cancer in more than one study, and of autism in children) and 10 grams of salt, not to mention the Activa RM . Honestly, this one is barely 'food', but considering what so many Americans eat that most other countries wouldn't touch if their lives depended on it I'm probably not that surprised. \n\nUsually love your recipes, but wouldn't touch this one with a 10 foot :)",
      "parent": "0",
      "gravatar_hash": "bbc6c6e8e141276624a109120ec9f7b7"
    },
    {
      "id": "972319",
      "author": "Jackie",
      "author_url": "",
      "date": "2014-07-20 18:39:45",
      "content": "Despite MSG studies this is a recipe I'll definitely be skipping.",
      "parent": "0",
      "gravatar_hash": "133f47e60a133222c2b3a20288cf001e"
    },
    {
      "id": "976362",
      "author": "Susie",
      "author_url": "",
      "date": "2014-07-23 16:33:21",
      "content": "Sodium caseinate has links to autism in children? (facedesk) I mean, if you don't want to eat it, you don't have to--but that's not proven remotely to be true. Not even remotely. (Biased personal experiences are not conclusive evidence.)\n\nPS, I have autism. So keeping up on this sort of information is kind of important to me. Please don't go throwing us around as a reason to stay away from various things without bedrock evidence. Autism has a huge genetic component anyway--twin and family studies indicate that.\n\nAs far as people being allergic to MSG--some people are deathly allergic to peanuts, should none of us then cook with peanuts or write recipes that have peanuts in them? the whole initial MSG scare was based on bad science. For most people, it's fine--for people who have sensitivities, obviously they should avoid this recipe and choose another one.",
      "parent": "962596",
      "gravatar_hash": "15715a528bf0f602287c23be703c5ea3"
    },
    {
      "id": "984435",
      "author": "Anna_PMorgan.",
      "author_url": "http://platefulofyum.com/",
      "date": "2014-07-28 01:43:39",
      "content": "I am allergic to MSG and so cannot try this one but it looks fantastic! I wish we could have excluded the MSG part in order to make it more healthy and complete. Rest, it deserves a try for sure. Thanks for sharing information :)",
      "parent": "0",
      "gravatar_hash": "0bb514581fb93ed634aa4f81a2c3707a"
    },
    {
      "id": "994527",
      "author": "Sandra",
      "author_url": "",
      "date": "2014-08-02 11:37:09",
      "content": "Michael,\n\nI'm having trouble finding Sodium Caseinate. Any ideas where online I might order it?\n\nI'd like to give these a try.\n\nThanks!",
      "parent": "0",
      "gravatar_hash": "d2a471c15e15085eff65c9fbc08857cb"
    },
    {
      "id": "998117",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-08-04 05:43:44",
      "content": "Here you go: http://www.modernistpantry.com/product.asp?itemid=162&affid=3",
      "parent": "994527",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "999296",
      "author": "juana",
      "author_url": "",
      "date": "2014-08-04 16:03:34",
      "content": "msg is totally dangerous, it is unfortunate that you are using it. I am a dietician and nutritionist and the research is out there. You should remove this from your site and do your research. thanks",
      "parent": "0",
      "gravatar_hash": "1c6529800fff039ca94b1629fcb99c92"
    },
    {
      "id": "1000340",
      "author": "Sandra",
      "author_url": "",
      "date": "2014-08-05 01:57:28",
      "content": "Thanks, Michael.",
      "parent": "0",
      "gravatar_hash": "d2a471c15e15085eff65c9fbc08857cb"
    },
    {
      "id": "1001821",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-08-05 15:18:00",
      "content": "@Juana - I've cited my research in a comment above (https://herbivoracious.com/2014/05/greatest-veggie-burger.html#comment-905232). Where's yours?",
      "parent": "999296",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1056453",
      "author": "Doob",
      "author_url": "",
      "date": "2014-08-29 04:04:36",
      "content": "Some folks simply need to chill out, and just move on.",
      "parent": "0",
      "gravatar_hash": "4b88c8edb9a1d05d52a17c02bb973e24"
    },
    {
      "id": "1061135",
      "author": "Danielsan",
      "author_url": "http://www.Foodandwhining.com",
      "date": "2014-09-01 08:12:57",
      "content": "First, I always love hearing the phrase \"(so and so) is harmful despite what scientific studies and doctors say\". It means that, to retire, I need only rekindle the market for dowsing rods, reike, or some variant of \"Airborne\".\n\nSecond, I've been wondering how the world can't seem to produce a \"textural\" veggie burger. They tend, inevitably, to crumble to pieces or taste like some kind of packing material. (This is most often the case when it is thrown on a menu as a \"token\" vegetarian option.)\n\nI didn't realize that transglutaminase would work on other proteins. Can you actually bind vegetable proteins at all or? As for those who fear it, I suspect they'd also be frightened off by sodium chloride or dihydrogen monoxide. (Too much of either is guaranteed fatal. Even a tiny amount of the former in your lungs can cause violent coughing.)\n\nThe one caveat is that, in at least my first search for a source, it came up at ~$90 for two pounds. Fortunately, there are some other sources for MUCH less.\n\ndB",
      "parent": "0",
      "gravatar_hash": "3fecc9da31c31d865029e61d4473a014"
    },
    {
      "id": "1061652",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-09-01 15:27:44",
      "content": "I will take 3 dowsing rods as soon as you have them available. Transglutaminase doesn't care too much what protein, it just needs protein, so it should be possible to dose with soy protein as well if you don't feel like using casein. A good place to buy it in small quantities is at modernistpantry.com: http://www.modernistpantry.com/moo-gloo-rm-transglutaminase.html",
      "parent": "1061135",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1071955",
      "author": "ben",
      "author_url": "",
      "date": "2014-09-10 10:30:28",
      "content": "http://lifehacker.com/this-graphic-explains-why-msg-isnt-a-health-hazard-for-1633008859?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+lifehacker%2Ffull+%28Lifehacker%29\n\nwhile not a huge fan of additives to food ....  the above link shows that MSG is generally fine to ingest ....\n\ni happen to think this is an amazing veggie burger ... http://www.thekitchn.com/recipe-best-ever-veggie-burger-96967\n\nben",
      "parent": "0",
      "gravatar_hash": "825a1e4c2a61919d1de8623b92eeed1d"
    },
    {
      "id": "1072452",
      "author": "Davo",
      "author_url": "",
      "date": "2014-09-10 20:13:35",
      "content": "Hi Michael, is there a particular cheese (as per as the Chefsteps melty cheese recipes) you're fond of pairing with these mushroom burgers?",
      "parent": "0",
      "gravatar_hash": "d1379ee2a530f1067b71fe4c18fa243e"
    },
    {
      "id": "1073029",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-09-11 06:27:29",
      "content": "I think it is all about flavor pairing; so if you want to emphasize the mushrooms, Swiss is a logical choice. But you can also run with any of the amazing combos here: http://www.chefsteps.com/classes/burgers#/the-chefsteps-custom-burger-guide using the veggie burger instead of meat. The meltable cheese slices are great, but regular cheese quickly broiled or blowtorched or just allowed to melt in the last minute of cooking the patty is great too.",
      "parent": "1072452",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314237",
      "author": "Collin",
      "author_url": "",
      "date": "2016-12-04 13:35:09",
      "content": "I am highly doubtful you are allergic to MSG. If so, never salt your tomatoes or ever eat Parmesan cheese or eat most things with protein in them. Glutamate is an extremely common amino acid and when you add salt (NaCl), poof! MSG...",
      "parent": "984435",
      "gravatar_hash": "fde06e924dad8eb4f00b6d22d3b70a87"
    },
    {
      "id": "1314238",
      "author": "Collin",
      "author_url": "",
      "date": "2016-12-04 13:36:26",
      "content": "It actually bonds lysine and glutamine so the protein source matters.",
      "parent": "1061652",
      "gravatar_hash": "fde06e924dad8eb4f00b6d22d3b70a87"
    },
    {
      "id": "1314261",
      "author": "Maria",
      "author_url": "",
      "date": "2017-01-09 11:42:24",
      "content": "you lost me at MGS! bye!",
      "parent": "0",
      "gravatar_hash": "9a619f6cdc0c89913a07d68ba0e15d53"
    },
    {
      "id": "1314476",
      "author": "Heather Francois",
      "author_url": "",
      "date": "2017-12-15 11:40:14",
      "content": "I am super confused as to why people are referring to Transglutaminase as MSG. MSG is monosodium glutamate. I buy regularly from Modernist Pantry, and Transglutaminase is one of the items I noticed that they sell. MSG is not listed as an ingredient in any of their Transglutaminase packages (although I suppose it could be naturally occurring in one or more of the ingredients). This is commonly known as \"Meat Glue\" and the public became more aware of it during the Pink Slime incident a few years ago. I am vegan and would not buy it because one of the common ingredients is dairy derived and the packages do not specify whether or not the enzymes used in the Transglutaminase are animal or plant derived. I was really excited to try this recipe, but I would need to find a source of confirmed plant based Transglutaminase to do that.",
      "parent": "0",
      "gravatar_hash": "d1950ca3d87f4b9fe3458daf72ace103"
    },
    {
      "id": "1314477",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2017-12-16 09:56:01",
      "content": "Activa TI is is vegan... see https://www.ajifoodsolutions.com/products/activa-ti/ . You are quite right that transglutaminase and MSG are two totally different things.",
      "parent": "1314476",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314478",
      "author": "Heather Francois",
      "author_url": "",
      "date": "2017-12-16 11:38:29",
      "content": "Thank you Michael! I will definitely try out this recipe!",
      "parent": "1314477",
      "gravatar_hash": "d1950ca3d87f4b9fe3458daf72ace103"
    },
    {
      "id": "1314489",
      "author": "Cleo Recipecritique",
      "author_url": "http://recipecritique.com",
      "date": "2018-01-12 07:21:30",
      "content": "Why ingest meat glue at all. Yes it can occur naturally within the body, but the version that is being used to glue foods together is not the same. \n\nUsing a large delicious Portobello mushrooms makes a fantastic burger.",
      "parent": "0",
      "gravatar_hash": "372d6aa0a21ddcfca623e93a2a1795d3"
    },
    {
      "id": "1314582",
      "author": "Jules",
      "author_url": "",
      "date": "2019-03-24 08:23:01",
      "content": "I visited the website, and it says nothing about Activa TI being vegan. Can you elaborate?",
      "parent": "1314477",
      "gravatar_hash": "a9611621b266035a2d15e43ccf117ab1"
    },
    {
      "id": "1314591",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2019-05-28 08:55:35",
      "content": "Hmm, yeah, I can't find any proof either. If you reach out to them, let me know what you find out.",
      "parent": "1314582",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1315153",
      "author": "Zelda",
      "author_url": "",
      "date": "2022-04-29 16:08:40",
      "content": "If you are allergic to it, don't use it. Most people are not. It's just that simple.",
      "parent": "962596",
      "gravatar_hash": "37b61adcb8068b6c830f802bc46470f5"
    }
  ]
}