{
  "comment_count": 10,
  "comments": [
    {
      "id": "932",
      "author": "Rae",
      "author_url": "http://battledin.blogspot.com/",
      "date": "2010-08-20 11:01:49",
      "content": "Another amazing recipe! I have been following your blog since I first discovered it back in Boston and have always looked forward to each post with great pleasure. I moved to North Seattle a couple months ago and have found your restaurant reviews to be most helpful in my city to city transition(oh Senor Moose where have you been all my life?). Thanks so much for what you do and keep it coming!",
      "parent": "0",
      "gravatar_hash": "5aaf2642b129b9d13adc5bc79b292d05"
    },
    {
      "id": "933",
      "author": "David {Green Kitchen Stories}",
      "author_url": "http://www.greenkitchenstories.com",
      "date": "2010-08-25 16:09:32",
      "content": "It sounds like a great recipe. I have never actually been successful in grilling pizza, but after reading this post I.will.try.again (even though I am one of those vegetarians who only own a \"normal\" grill).\nThanks for the recipe!",
      "parent": "0",
      "gravatar_hash": "b34cdcfa7fa64a07ad52748dd515e9ad"
    },
    {
      "id": "934",
      "author": "Jackie in MN",
      "author_url": "",
      "date": "2010-08-29 13:31:19",
      "content": "I love your site - I'm a regular visitor from Minnesota. We've had great success grilling our pizzas on our Weber Spirit gas grill using a pizza screen (a round flat disk made of woven metal). Like you, we first put the untopped, flattened-out dough on the grill to crisp up the bottom - we use our peel to put the dough on the screen set on the grates. When the crust starts to bubble and the bottom starts to crisp, we take it off the screen with the peel, flip,  and then bring it into the house and take our time topping it. Then we take it back out to the grill, first placing aluminum foil sheets under the screen (we re-use these foil sheets over and over), and then placing the topped pizza on the screen. The foil helps deflect the heat from the bottom of the crust to the top so both the bottom and the top cook at about equal rates. We get perfect pizza results using this method, and its virtually fool proof.",
      "parent": "0",
      "gravatar_hash": "2cd91df4d227968eedf84fc94aefd89b"
    },
    {
      "id": "935",
      "author": "Tbonesandtofu.wordpress.com",
      "author_url": "http://profile.typepad.com/tbonesandtofuwordpresscom",
      "date": "2010-09-01 10:49:39",
      "content": "Thanks for sharing.  We recently got a big green egg and I've been anxious to try a pizza.  Do you use a plate setter?",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "936",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-09-01 11:13:39",
      "content": "I don&#39;t use the plate setter. I&#39;ve tried it and found it insulated the bottom too much, and also it was rather small. But give it a shot and let me know if you get better results.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "937",
      "author": "CookingToday.co.uk",
      "author_url": "http://CookingToday.co.uk",
      "date": "2010-09-13 06:00:43",
      "content": "What a great recipe and a very nice blog.",
      "parent": "0",
      "gravatar_hash": "e6624cc38440e6d24112898d11bc1113"
    },
    {
      "id": "938",
      "author": "Suzanne",
      "author_url": "",
      "date": "2010-10-18 20:45:48",
      "content": "Hi,\n\nFound your blog by Googling \"big green egg vegetarian\" to see if there were any others out there with the cooker- seems that there are about seven! We're considering getting one, too primarily for pizzas. Do you use yours for cooking anything else?",
      "parent": "0",
      "gravatar_hash": "3751706f4d405996c3ad066c495a2d54"
    },
    {
      "id": "939",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-10-18 20:56:24",
      "content": "Hi Suzanne - great question! I always joke that I&#39;m the only vegetarian with a Big Green Egg; glad to know it isn&#39;t strictly true. My main use has been for pizza. I&#39;ve had a few spectacular successes and numerous &quot;so-so&quot; pies. It requires a good bit of fiddling to land on a technique that works for you, but then that could also be true in any pizza oven. I haven&#39;t made a ton of other stuff on it. I do like the Egg a lot but am not sure I can honestly recommend it as being worth the price tag for a fellow vegetarian.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "20750",
      "author": "Gina",
      "author_url": "",
      "date": "2012-03-04 17:46:02",
      "content": "Made this for dinner tonight.  Great easy recipe.  I did add some arugula for some green and because it is plentiful in the garden!",
      "parent": "0",
      "gravatar_hash": "2f564c995a0ce52635a0c2a35f856da8"
    },
    {
      "id": "20755",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-04 19:07:12",
      "content": "Mmm, I love arugula on pizza. That sounds like a perfect way to finish this one.",
      "parent": "20750",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}