{
  "comment_count": 4,
  "comments": [
    {
      "id": "2097",
      "author": "Ivys Manning",
      "author_url": "http://ivysfeast.blogspot.com",
      "date": "2009-08-17 18:27:34",
      "content": "Michael, To Salt or Not To Salt the Eggplant, That is the Question. I hate the question cuz I never know exactly how to answer it when I'm teaching. If you're frying, salt. But if you're not??  What do you think? I'd love to see a post about it on your site. I do love me some eggplant and all'arrabiata is the best. Have you seen the Star Wars lego youtube about penne all'arrabiata? Too funny...",
      "parent": "0",
      "gravatar_hash": "398d9a223280b1350d4db253ecccefe3"
    },
    {
      "id": "2098",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-08-17 20:10:48",
      "content": "That video is frickin hilarious (the Penne all'Arrabiata one that Ivy\nmentioned: <a href=\"http://www.youtube.com/watch?v=muaAZE0M3LU\" rel=\"nofollow\">http://www.youtube.com/watch?v=muaAZE0M3LU</a> ). As far as salting\ngoes, I haven't ever found it to be particularly necessary. People say it\nremoves bitterness but most of the eggplants I get are creamy and sweet,\nwith maybe just a slight but pleasant bitter edge. Certainly nothing\nobjectionable. Maybe folks who think you need to salt it just aren't cooking\nit thoroughly enough? Although I'll give one caveat... the eggplant parm.\nrecipe I have on the blog, I did salt it the time I made that, because a\nguest insisted they would hate it otherwise! And I haven't remade it since,\nso I can't vouch that it would work without salting before frying.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2099",
      "author": "A&amp;N",
      "author_url": "http://reluctantchefs.blogspot.com",
      "date": "2009-08-18 15:13:08",
      "content": "I love the arrabiata. Bookmarked to try it sometime :)",
      "parent": "0",
      "gravatar_hash": "50de5463f411bb5bad4710eb70af07f3"
    },
    {
      "id": "2100",
      "author": "Nanette",
      "author_url": "http://nanetteblanchard.blogspot.com",
      "date": "2009-08-26 15:05:24",
      "content": "This looks excellent and fortunately I have all the ingredients. Thanks for the recipe!",
      "parent": "0",
      "gravatar_hash": "22abb6429686e4672dae721df1bd1b8b"
    }
  ]
}