{
  "comment_count": 7,
  "comments": [
    {
      "id": "2054",
      "author": "dave",
      "author_url": "",
      "date": "2009-08-27 11:14:54",
      "content": "I might try lightly salting the sliced tomatoes and letting them sit in a colander or on a rack for half and hour or so  to encourage them to give up some of their water.   Then blot them lightly with a paper towel before assembling.  This might help avoid a soggy crust.  And it concentrates the tomato flavor a bit.  I'd just want to be a little careful with the finishing salt.",
      "parent": "0",
      "gravatar_hash": "aca4ff020001f10b04bffc6b5d448a58"
    },
    {
      "id": "2055",
      "author": "Melissa",
      "author_url": "",
      "date": "2009-08-27 20:41:57",
      "content": "Thanks for this recipe! Your blog is my favorite of all the culinary blogs I follow weekly. I love the tips that you offer as well. Can't wait to try this one with the beautiful tomatoes available now at the farmers' market.\n\nHave you worked at all with kale? I've never had it and am looking to experiment with it in some of my dishes. I would love to see some recipes with kale... :D",
      "parent": "0",
      "gravatar_hash": "b33cca673da40073e0a0423148136813"
    },
    {
      "id": "2056",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-08-27 21:01:33",
      "content": "Thanks Melissa! Re: kale, I adore the stuff but unfortunately my wife\ndoesn't feel the same way :), so I don't get so many opportunities to cook\nwith it. The main things are to clean it really thoroughly and strip the\nstems, then cook it till quite tender. A couple things I like are a simple\nsaute with any subset of garlic/onions/chili flakes/lemon zest, and cut into\nthin strips and added to soup with lots of garlic and potatoes.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2057",
      "author": "A&amp;N",
      "author_url": "http://reluctantchefs.blogspot.com",
      "date": "2009-08-28 09:04:21",
      "content": "Loving it! I have some heirloom tomatoes in the fridge right now. Might just make a mini tart :D as an appetizer!",
      "parent": "0",
      "gravatar_hash": "50de5463f411bb5bad4710eb70af07f3"
    },
    {
      "id": "2058",
      "author": "Alessandra",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2009-08-28 15:35:35",
      "content": "Ciao Michael,\n\ncan you remove the tart from your baking pan? Or is it too hard and better to cut it inside it?\n(I am not good at it, so I always use baking paper...)",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "2059",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-08-28 16:04:06",
      "content": "Yep! I use the kind of tart pan that has the removable bottom, so all you\nhave to do is lower it onto someting like a can of tomatoes and the side\npops right off. There is enough fat in the crust that it easily separates\nfrom the pan.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2060",
      "author": "oddjob",
      "author_url": "",
      "date": "2009-09-06 07:05:27",
      "content": "If you slice the stems cross-wise fairly thinly (say, 1/8\"-1/4\") you can saute them along with the rest of the leaf.  That way there's nothing left over and nothing thrown away.  The result has some crunch to it, but it's not much different from the crunch of celery (just a bit more dense).\n\nI love kale!  It's also excellent when braised, or in soup!",
      "parent": "0",
      "gravatar_hash": "496463cbaaf0166b92f85ecd7df4ddeb"
    }
  ]
}