{
  "comment_count": 5,
  "comments": [
    {
      "id": "2950",
      "author": "The Other Tiger",
      "author_url": "http://profile.typepad.com/theothertiger",
      "date": "2009-01-30 08:57:30",
      "content": "Michael, the meal was amazing!  Thank you again for letting us be part of the experience.  We had a great time meeting you and your wife, Dawn and Eric, and everyone else gathered around the table.  The space was so lovely, too.  We both really like the communal table concept.\n\nI'm still thinking about several of the dishes, especially the morel \"hot chocolate\", which made me do a mental double-take because it had the flavor of the mushrooms accompanied by the distinct sensation that I was drinking the richest, creamiest hot chocolate I've had in a long time.  The grapefruit had a similar thought-provoking effect, and I loved the way the grapefruit burst through. The apple-celery sorbet was also very interesting, especially with everyone tasting the banana that wasn't there (I still think it was the texture, not the flavor, which was so creamy for a sorbet).  The fideos and boyikos were very, very tasty, and I loved the texture and the range of flavors of the dessert.  That caramel sauce was amazing.\n\nBravo, and both of us from Tiger Chow are looking forward to the next one!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2951",
      "author": "The Other Tiger",
      "author_url": "http://profile.typepad.com/theothertiger",
      "date": "2009-01-30 09:09:15",
      "content": "I forgot to say hooray for the baby turnips from Whistling Train Farm.  We used to get a share from their CSA before we moved away from all the delivery spots, and now we miss it a lot.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2952",
      "author": "veggiebelly",
      "author_url": "http://www.veggiebelly.blogspot.com",
      "date": "2009-01-30 17:13:03",
      "content": "What a great idea! The dinner sounds spectacular!",
      "parent": "0",
      "gravatar_hash": "c9b1259ff74b0aee40402ce029be9633"
    },
    {
      "id": "2953",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-01-30 21:26:29",
      "content": "Thanks Tiger! It was such a pleasure to meet the two of you. And thanks for the nice writeup at <a href=\"http://tiger-chow.blogspot.com/\" rel=\"nofollow\">Tiger Chow</a> too.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2954",
      "author": "roopa",
      "author_url": "http://raspberryeggplant.blogspot.com",
      "date": "2009-01-31 06:04:28",
      "content": "I am always so impressed by your creations, and this is no exception.  I would LOVE to come to one of your dinners, except I live in NYC so that might not work out too well.\n\nSo in the meantime I'll just keep reading :)",
      "parent": "0",
      "gravatar_hash": "e8ddd23d349aa9612dfa4709d47e3d8b"
    }
  ]
}