{
  "comment_count": 15,
  "comments": [
    {
      "id": "19556",
      "author": "Jenny@vegetarianhatesvegetables",
      "author_url": "http://vegetarianhatesvegetables.blogspot",
      "date": "2012-02-20 09:56:08",
      "content": "These look like the perfect vessel for your spicy cabonata!",
      "parent": "0",
      "gravatar_hash": "efd63fa22c1a4cd1b5e1e7c8fc2b99bb"
    },
    {
      "id": "19573",
      "author": "Justin",
      "author_url": "http://www.thechubbyvegetarian.com",
      "date": "2012-02-20 14:45:05",
      "content": "UGH. I know I do that all the time. You just don't know how good it'll be until it's finished...then you wish you had written it down.\n\nThose look awesome.\n\n-j",
      "parent": "0",
      "gravatar_hash": "0eed4dafa745a0739bf786861e36cccb"
    },
    {
      "id": "19601",
      "author": "Axat",
      "author_url": "http://whatscookingmom.in",
      "date": "2012-02-21 00:32:11",
      "content": "Saw these yummy crackers on foodgawker. These look delicious. A variation could be using corn flour - these could make nachos, will surely try.",
      "parent": "0",
      "gravatar_hash": "efb968de2e763c9ac00582c5591219a0"
    },
    {
      "id": "20042",
      "author": "easy recipes",
      "author_url": "http://www.fastrecipes.com",
      "date": "2012-02-26 13:34:18",
      "content": "Making rye bread at home works best with sourdough starter - and growing that is an interesting experience.  It is a kind of pet, really.",
      "parent": "0",
      "gravatar_hash": "0d98836887e5cfad293dae77db5d8b78"
    },
    {
      "id": "20061",
      "author": "emmycooks",
      "author_url": "http://www.emmycooks.com",
      "date": "2012-02-26 20:44:28",
      "content": "I agree about the flavor of rye, and I also made some rye crackers that I really liked recently.  They were thicker and a bit flakier than I imagine these being, with some added crunch from Turbinado sugar.  If you're experimenting with crackers and rye, the recipe I used is here: http://emmycooks.com/2012/02/11/homemade-rye-crackers-with-apricot-chevre-spread/  And I look forward to trying your variation, which look like they'd make a righteous vehicle for a white bean dip!\n\nI am a new reader and I am excited to have found your blog, but now that I've seen your recipes and read a few posts I am REALLY excited to learn that you're planning to open a restaurant in our shared fair city.  Congratulations on your big plans, I look forward to dining at the Herbivoracious restaurant!",
      "parent": "0",
      "gravatar_hash": "a61a30a9ebb08ca22bc83f8cda99f9e9"
    },
    {
      "id": "20063",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-02-26 21:39:48",
      "content": "Hey Emmy - nice to hear from you, and your crackers look quite delicious too. Thanks for sharing! Stay tuned for restaurant news in the summer.",
      "parent": "20061",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "20607",
      "author": "Vegetarians",
      "author_url": "http://www.sevenpoint2.com/",
      "date": "2012-03-01 22:15:53",
      "content": "Lovely color and texture on the photo. It's as if i could almost taste it. Do you think it would go well with dips and spreads like guacamole, salsa, etc. and use them for parties?",
      "parent": "0",
      "gravatar_hash": "bda7603876252c69c15f63b58a0bf6f0"
    },
    {
      "id": "20634",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-02 07:25:45",
      "content": "Good question. I think the flavor of rye (intentionally) comes through quite clearly, so you would want to serve them with things where that is complementary. Cheese is a no-brainer, and I think a beet or cream-cheese based dips would be good. Seems to me that guacamole would work too although the combination is a little more unusual. I probably wouldn't serve them with salsa.",
      "parent": "20607",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21960",
      "author": "Ron Tacchi",
      "author_url": "http://None",
      "date": "2012-03-24 00:07:05",
      "content": "I made these crackers very successfully yesterday, of course I had to change the recipe a little bit, I've never been known to follow a recipe exactly. I used some fresh herbs rather than caraway seeds, mainly because I had fresh herbs and didn't have caraway seeds. I suspect next batch will have a pinch of chilli in it or maybe a garlic flavoured olive oil will be used. Who knows, experimentation is half the fun of cooking..\n\nI think I did one mildly clever thing - I used my pasta roller attachment for my Kenwood Chef to roll out the dough. It took seconds with no physical effort and perfect thinness was achieved.",
      "parent": "0",
      "gravatar_hash": "3ce459bb6c05462786af14bac8f20ae5"
    },
    {
      "id": "22017",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-25 12:21:45",
      "content": "Absolutely, the pasta roller is an excellent idea!",
      "parent": "21960",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "171441",
      "author": "Leah",
      "author_url": "",
      "date": "2013-07-09 12:25:09",
      "content": "I love the flavor of rye and have used different types of rye: whole rye, light rye, medium rye and am wondering which type of rye flour you are using in this recipe.  Please let me know!  All the best.....Leah",
      "parent": "0",
      "gravatar_hash": "b284c07e688e908894b6168f0935f798"
    },
    {
      "id": "171446",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-07-09 12:53:10",
      "content": "To the best of my recollection it was about a medium rye.. but any would be good.",
      "parent": "171441",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "750888",
      "author": "Cori",
      "author_url": "http://amazon.crescendopeace.com",
      "date": "2014-02-23 12:01:35",
      "content": "Okay, here's a challenge for you - I am looking for an old fashioned rye cracker recipe WITHOUT wheat flour, or any substitute thereof.\n\nA good friend's mom, when I was a kid, made delicious rye crackers with rye flour and buttermilk - nothing else.  I have searched but have yet to find the recipe, and since I no longer eat wheat, it pretty much eliminates all the recipes I have found without major adaptations.  Thanks!",
      "parent": "0",
      "gravatar_hash": "1d987d199fb038bc59043e66038360a9"
    },
    {
      "id": "911878",
      "author": "Matthew",
      "author_url": "",
      "date": "2014-05-19 11:12:43",
      "content": "Cori, I've tried a variation of what you're describing with bread, and you've made me excited to try it with crackers. I suspect the non-refined flours benefit from a little acid to break down the tougher proteins and allow the dough to develop. Can you remember if she let it sit for a bit with the buttermilk? Yogurt might work, too, as it appeared to help me in whole grain sourdough.",
      "parent": "750888",
      "gravatar_hash": "d70c608a6ef0bfba7d9e3ab096fe3aac"
    },
    {
      "id": "911922",
      "author": "Cori",
      "author_url": "",
      "date": "2014-05-19 12:24:35",
      "content": "Greetings, Matthew - \n\nI'm not sure, but it seems to me that she would have had to let the dough sit for a while, if nothing else to allow the grain to be thoroughly soaked.  I also think I recall that she didn't bake them, so much as dried them for several hours in a low oven - I think she just used the pilot light on her gas stove, if I am remembering correctly.  I hope that helps.",
      "parent": "0",
      "gravatar_hash": "1d987d199fb038bc59043e66038360a9"
    }
  ]
}