{
  "comment_count": 197,
  "comments": [
    {
      "id": "25311",
      "author": "Smriti D. Isaac",
      "author_url": "http://twitter.com/sdisaac",
      "date": "2012-05-29 06:30:54",
      "content": "Excellent post on crisp-frying up tofu.  One additional tip:  in order to make the tofu even more moisture-free, zap it in the microwave for a minute or two and pat dry with towels each time.  Microwaving will \"cook\" it a bit, bringing to the fore more moisture which is what you wish to remove before you put it into your skillet to brown.\n\nI trust this is helpful!",
      "parent": "0",
      "gravatar_hash": "04754ffb2faaeeff77a109b0dbb916c2"
    },
    {
      "id": "25316",
      "author": "Emma",
      "author_url": "",
      "date": "2012-05-29 07:08:05",
      "content": "In Denver, we have always relied on the fabulous Denver Tofu, but their space got bought out several months ago, the ultimate fate a mystery, and I am bereft and tofu-less!  If anyone in the area can recommend a place in the area to buy comparably good tofu, I will forever be in your debt.  Barring that, it looks like I'll be making my own.",
      "parent": "0",
      "gravatar_hash": "d12483db2446c6e36e8d1c32e62be8cf"
    },
    {
      "id": "25317",
      "author": "Kathy - Panini Happy",
      "author_url": "http://www.paninihappy.com",
      "date": "2012-05-29 07:10:06",
      "content": "And to think I didn't even know it was possible to buy freshly made tofu! I'd love to do a comparison taste test some day. :-) Thanks for the reminder to grill up some tofu soon.",
      "parent": "0",
      "gravatar_hash": "3173541fef2db6b40f403784d5c76724"
    },
    {
      "id": "25318",
      "author": "Kelly",
      "author_url": "http://www.kellyandaustin.com",
      "date": "2012-05-29 07:21:57",
      "content": "Fantastic post, thanks! After years of cooking with tofu, I still learned a lot. My question: have you made your own tofu? I'm told it's really, really simple but I haven't tried it myself yet.",
      "parent": "0",
      "gravatar_hash": "5e22b880a56c5048c8290b3353a21852"
    },
    {
      "id": "25321",
      "author": "Mixolidia",
      "author_url": "",
      "date": "2012-05-29 07:51:30",
      "content": "This is great. I will try immediately. Where can I find fresh tofu in Miami? Preferably Miami, the main land, not Miami Beach or Aventura but I will take those too if push come to shove. Sorry to be so specific but sometimes people think all these cities are interchangeable &amp; their not. And sometimes traveling so far is not always worth the gas.\n\nOo Kathy, I would love to see a comparison test. I, too, did not realize stores sold fresh tofu. I thought you either made it yourself, go it at a restaurant or bought the stuff that comes in the box.",
      "parent": "0",
      "gravatar_hash": "25794415aa24110fb72577065c87959b"
    },
    {
      "id": "25327",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-29 08:09:41",
      "content": "That's an interesting tip. I've seen recipes that have you poach the tofu in boiling water before frying, so I imagine microwaving might have a similar effect on the texture, as well as expunging moisture. I'll have to give this is a try.",
      "parent": "25311",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "25328",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-29 08:10:14",
      "content": "Hey Kelly - I've never made my own either, but Andrea's book has motivated me. Look for a post in the next few weeks.",
      "parent": "25318",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "25329",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-29 08:12:18",
      "content": "Re Miami, I don't know but maybe another reader will make a suggestion. If you can find tofu that was made that day, you won't need a comparison! It is like the difference between artisan bread from a small bakery and wonder bread. Well, maybe not quite that extreme, but close.",
      "parent": "25321",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "25330",
      "author": "Smriti D. Isaac",
      "author_url": "http://twitter.com/sdisaac",
      "date": "2012-05-29 08:18:18",
      "content": "I'm glad you will try it!  Incidentally, if you ever wish to do a post on homemade paneer (Indian cotttage cheese), I'll be curious to see how you do it.  I've made it at home many a time and although not rock hard, it is firm enough to pass muster!  BTW, I'm the one who was inspired to make my onion kulchas a while back, and also recommended pressure-cooking your saag instead of boiling.  Hope these ring bells!",
      "parent": "0",
      "gravatar_hash": "04754ffb2faaeeff77a109b0dbb916c2"
    },
    {
      "id": "25331",
      "author": "Emma",
      "author_url": "",
      "date": "2012-05-29 08:22:18",
      "content": "Kelly, I've made my own tofu and while it's easy, it's also time-consuming.  I used the old classic \"The Book of Tofu\" so I'm excited to try Andrea's book and see if it's a little easier to understand.  (The other has a decided '70s feel to it, and the instructions are not as clear &amp; appealing as one might like.)  It reminds me quite a bit of making bread: you can definitely do it at home, but it's so much easier if there's a good supply near you!\n\nMichael, tips on finding good local tofu?  We Japanese Americans in the Denver area have been so reliant on Denver Tofu that I've never even looked elsewhere.",
      "parent": "0",
      "gravatar_hash": "d12483db2446c6e36e8d1c32e62be8cf"
    },
    {
      "id": "25333",
      "author": "Martin",
      "author_url": "",
      "date": "2012-05-29 08:24:49",
      "content": "re Denver:\nHi Emma,\nLittle Saigon Market on the corner of S. Federal and Alameda has fresh tofu. Also, \nCostco has switched suppliers and I like their new one. No longer comes in blocks but in thicker slices. Used it for the caramel tofu recipe with excellent results (except I turned the sauce into rock candy).\n\nMichael, I agree that marinating tofu is futile. And it interferes with getting is suitably dry.",
      "parent": "0",
      "gravatar_hash": "1e79d148a0865365d213cfc6d25f16f6"
    },
    {
      "id": "25335",
      "author": "Emma",
      "author_url": "",
      "date": "2012-05-29 08:27:00",
      "content": "Little Saigon Market!  Beautiful.  I imagine they don't have my favorite Japanese variety, kinugoshi  or soft-silken....  Maybe I'll work to prefect that one, myself.  Many, many thanks, Martin.",
      "parent": "0",
      "gravatar_hash": "d12483db2446c6e36e8d1c32e62be8cf"
    },
    {
      "id": "25337",
      "author": "Martin",
      "author_url": "",
      "date": "2012-05-29 08:35:19",
      "content": "Emma, for Japanese specialties you should get lucky at Sakura Square's Pacific Mercantile Market in LoDo: http://www.yelp.com/biz/pacific-mercantile-company-denver-2",
      "parent": "0",
      "gravatar_hash": "1e79d148a0865365d213cfc6d25f16f6"
    },
    {
      "id": "25339",
      "author": "Emma",
      "author_url": "",
      "date": "2012-05-29 08:40:19",
      "content": "Yes, I hit Pacific quite often, but Denver Tofu has been our supplier for decades so the whole community is at something of a loss.  There are rumors that Denver Tofu has been bought by someone else, but nobody's been able to confirm (or, for that matter, deny) these.  Pacific has some okay kinugoshi but it's from LA and I just don't find it quite as good, probably because it has to travel from California.",
      "parent": "0",
      "gravatar_hash": "d12483db2446c6e36e8d1c32e62be8cf"
    },
    {
      "id": "25342",
      "author": "fanny",
      "author_url": "http://www.likeastrawberrymilk.com/",
      "date": "2012-05-29 08:53:25",
      "content": "it sounds delicious Michael. I'll definitely try soon as I looove tofu. especially those crunchy brown bits. x",
      "parent": "0",
      "gravatar_hash": "633aea9c5db15fdf4375d51973c9b25d"
    },
    {
      "id": "25344",
      "author": "AD",
      "author_url": "",
      "date": "2012-05-29 08:53:44",
      "content": "Love, love, love your blog.  A couple of questions.\n\n1.  Have you tried the freeze-thaw method of cooking tofu to make it chewier?  It works well if you want a meatier bite.  Requires more planning though.\n2.  Have you ever coated tofu in corn starch and then pan fried it to get a crispy texture like the restaurants?  I have done it, but it makes the pan very dirty, so I don't do it too often.",
      "parent": "0",
      "gravatar_hash": "f7df69a16de419186fa71c99485c5817"
    },
    {
      "id": "25345",
      "author": "Pamela",
      "author_url": "",
      "date": "2012-05-29 08:54:28",
      "content": "Emma, do not overlook H Mart on Parker in Aurora. Not only do they have some of the finest homemade tofu, but they make rice cakes right before you and have the best produce section of any place I have found. Fresh shitakes and more sauces than you can ever use.",
      "parent": "0",
      "gravatar_hash": "ef1b241eda7d4654c7a6b583cd03ed1b"
    },
    {
      "id": "25346",
      "author": "Andrea Nguyen",
      "author_url": "http://Vietworldkitchen.com",
      "date": "2012-05-29 08:55:43",
      "content": "Smriti -- Microwaving tofu to facilitate draining is somewhat akin to warming it up by letting it sit in hot water or blanching it. The heat helps to open up the pores in the tofu. Then the water leaks out...",
      "parent": "25311",
      "gravatar_hash": "a1d7f072782d87b883f44b98aa70b9af"
    },
    {
      "id": "25348",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-29 09:00:43",
      "content": "*love* H Mart",
      "parent": "25345",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "25349",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-29 09:01:52",
      "content": "I think the freeze-thaw texture is interesting; not something I necessarily want every day but I do like it in its own way. I have done coated tofu occasionally, and I agree it is pleasing. Andrea has at least one method for that in her book beyond the plain cornstarch coating.",
      "parent": "25344",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "25350",
      "author": "Emma",
      "author_url": "",
      "date": "2012-05-29 09:05:43",
      "content": "I do love H Mart, Pamela, but it's just far enough from where I live to be mildly annoying to get to....",
      "parent": "0",
      "gravatar_hash": "d12483db2446c6e36e8d1c32e62be8cf"
    },
    {
      "id": "25351",
      "author": "Andrea Nguyen",
      "author_url": "http://Vietworldkitchen.com",
      "date": "2012-05-29 09:06:17",
      "content": "Michael, \n\nThanks for championing tofu and my book!  I blush at your saying that \"Asian Tofu\" is the *new definitive\" work on the lil' bean curd. \n\nLove that you point out the wealth of artisan tofu shops in Asian communities all over the US. You just have to look for these mom-and-pop places. Asian markets often stock local tofu because freshness is key to tofu lovers. \n\nWhen I interviewed tofu makers in Japan, Taiwan and China, they often said that their tofu shops are the equivalent of our local bakeries. People go daily for some tofu, take it home and cook it. It's an everyday food. Only in supermarkets did I see tofu in tubs. It's typically put into plastic bags and carried off.\n\nWith regard to frying tofu, if you soak it in salted hot water for about 15 minutes, drain, then shallow-fry or deep-fry, it gets a gorgeous crust and is lightly seasoned. And, you can keep tofu that you've fried around for days! I often call for that in Asian Tofu as it makes a really nice fried tofu.",
      "parent": "0",
      "gravatar_hash": "a1d7f072782d87b883f44b98aa70b9af"
    },
    {
      "id": "25352",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-29 09:10:47",
      "content": "Thanks, Andrea! And I say your book is the new definitive work, because it absolutely is. The Book of Tofu was great for its time, but the English-speaking world was really for a modern overview of this subject. I hope it sparks a big revival in bean curd interest. \n\nI'm definitely going to try the soaking and microwaving things; I was dimly aware of them but I guess it never struck me as seeming like it would make a big difference. I'll do a side-by-side comparison, should be a cool learning experience.",
      "parent": "25351",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "25355",
      "author": "Cookin' Canuck",
      "author_url": "http://www.cookincanuck.com",
      "date": "2012-05-29 09:29:13",
      "content": "Crispy tofu is definitely where it's at!  Do you (or any reading these comments) know of any places to buy fresh tofu in the Salt Lake City area?  Thanks!",
      "parent": "0",
      "gravatar_hash": "daadac3a0e2ae01f7b316e8d9ce68783"
    },
    {
      "id": "25356",
      "author": "Andrea Nguyen",
      "author_url": "http://Vietworldkitchen.com",
      "date": "2012-05-29 09:36:18",
      "content": "William Shurtleff and Akiko Ayogagi wrote a pivotal book in the \"Book of Tofu\". They were on a mission in the 1970s. Much has changed and Bill loves \"Asian Tofu\". He was the first person I interviewed for the book introduction. \n\nTofu can be manipulated in a zillion (okay not a zillion, but many) ways, and there are different types too. Poke around at a market and you'll see it in the refrigerated section, dry goods, jarred and frozen. It's endlessly fascinating. I kid you not.",
      "parent": "25352",
      "gravatar_hash": "a1d7f072782d87b883f44b98aa70b9af"
    },
    {
      "id": "25357",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-29 09:38:33",
      "content": "Absolutely! It is so cool that Bill and Akiko are still involved, several decades later. They have made a huge contribution.",
      "parent": "25356",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "25360",
      "author": "Emma",
      "author_url": "",
      "date": "2012-05-29 09:48:08",
      "content": "Yes, I absolutely still love my \"BOT,\" but I'm excited to get my hands on a copy of \"Asian Tofu.\"  Quick question: I've ordered nigari from sources in Japan in the past.  Is there any distributor closer to home?  Gets kind of pricey when it comes from overseas....",
      "parent": "25356",
      "gravatar_hash": "d12483db2446c6e36e8d1c32e62be8cf"
    },
    {
      "id": "25361",
      "author": "Maija Haavisto",
      "author_url": "http://www.vegventures.com",
      "date": "2012-05-29 09:49:28",
      "content": "In many Asian restaurants tofu is pretty gross or at least meh. Either it's really dry, often too chewy strips or just huge, bland, mushy lumps of tofuness. I don't usually cook my tofu crisp, but I do want it firm and flavourful. Baking is the best if you really want to infuse it with flavour.",
      "parent": "0",
      "gravatar_hash": "4ca222817d9f878ddac2b7ff23b5624d"
    },
    {
      "id": "25362",
      "author": "Jill, The Veggie Queen",
      "author_url": "http://www.theveggiequeen.com",
      "date": "2012-05-29 09:50:09",
      "content": "I have made my own tofu a few times and I have to say that while it was a great experience, I didn't end up with the \"best\" tofu. In the process, though, you do end up with a lot of okara which is the soy pulp which can be put to great use.\n\nI highly recommend Andrea Ngyen's Asian Tofu book, and also The Book of Tofu, to get you started.\n\nLuckily, here in the SF Bay area we have tofu makers. My favorite packaged tofu is HodoSoy and also from WA state, Small Planet Tofu.\n\nMichael, I can't wait to hear about your tofu-making experience and if it differs from mine.",
      "parent": "25318",
      "gravatar_hash": "e918dad880e60ff08b80eda51d7e2b0c"
    },
    {
      "id": "25363",
      "author": "Cindy Myers",
      "author_url": "",
      "date": "2012-05-29 09:53:53",
      "content": "Thanks for the tips! I've tried the freezing method which makes the tofu a little too spongy for our taste and am realizing that marinating is a waste of time too, since it only absorbs into the thin outer layer and then you can't get it crispy without burning the sauce. We like Wildwood organic super firm sproutofu, but never knew about homemade. I love learning new things! We have a H-Mart and Uwajimaya here in Portland Oregon. Can anyone  recommend a fresh homemade brand or shop here in SW Portland?Thanks!",
      "parent": "0",
      "gravatar_hash": "4809a4ba72ddd32b156a08a1fbea1921"
    },
    {
      "id": "25376",
      "author": "Nilam",
      "author_url": "http://khavanu.blogspot.com",
      "date": "2012-05-29 11:24:33",
      "content": "Hi Michael, great post! In between steps 2 and 3, I sometimes salt the tofu lightly and dab it with a towel before adding to a hot prepared cast-iron. Then when the initial tofu goes in, I don't touch it at all. Even when I'm tempted to move it around. I leave it for a few minutes until a small shake to the pan moves the tofu. This has prevented many \"tofu sticks\" to the bottom of the pan which can happen if it's too watery (imo).  I would echo the high quality extra-firm Asian tofus (and wow what awesome reader recs for where to buy). Abroad, I found the best tofu at, no surprise, Thai and Korean shops. \nMmm I love tofu.",
      "parent": "0",
      "gravatar_hash": "39a80437f59150fc64ae46179001398a"
    },
    {
      "id": "25997",
      "author": "Judy Enos Himmelman",
      "author_url": "",
      "date": "2012-05-29 11:49:54",
      "content": "still soy, I avoid it ty",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "25379",
      "author": "Sondi",
      "author_url": "",
      "date": "2012-05-29 11:57:56",
      "content": "Does anyone know a maker of Tofu in Utah?  We live about 30 minutes south of SLC.  I'm a new vegetarian and I'm struggling to like Tofu.  So if fresher is better tasting, I'm for it.  Utah is not very culturally diverse, but I'm hoping someone might be making tofu in Utah.",
      "parent": "0",
      "gravatar_hash": "c794428f3cdbdfdd92fd4afaab2377fc"
    },
    {
      "id": "25385",
      "author": "Emma",
      "author_url": "",
      "date": "2012-05-29 12:47:14",
      "content": "Hi Sondi.  I don't know any tofu-makers in Utah, but I can recommend a couple books for you that I think are especially good for new veggies: Madhur Jaffrey's excellent \"World Vegetarian\" is great if, like me, you like diverse eats.  Mark Bittman's \"Food Matters Cookbook\" is good for people transitioning to vegetarianism, and lots of the recipes are very easy to make.  And the excellent folks at Post-Punk Kitchen (http://www.theppk.com/) have a great selection of cookbooks, my favorite of which is \"Veganomicon.\"  I don't have Michael's book yet, but I've tried several of the recipes on this site, and they're excellent, so check those out as well!  Many vegetarian recipes are completely tofu-free.",
      "parent": "0",
      "gravatar_hash": "d12483db2446c6e36e8d1c32e62be8cf"
    },
    {
      "id": "25387",
      "author": "anne vaillancourt",
      "author_url": "",
      "date": "2012-05-29 12:53:50",
      "content": "I have been marinating tofu for years. You need use Soy sauce or  Tamari in the marinade and let it sit for at least 2 hours.",
      "parent": "0",
      "gravatar_hash": "f7d0f7485159614a6bce32425ed7edd0"
    },
    {
      "id": "25998",
      "author": "Theresa Prescott",
      "author_url": "",
      "date": "2012-05-29 17:03:29",
      "content": "Cut the tofu, dry it and dust it with cornstarch before pan frying it.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "25431",
      "author": "Oldhalloween",
      "author_url": "http://oldfashionhalloween.blogspot.com/",
      "date": "2012-05-29 19:55:10",
      "content": "Waiting to pull a cookie sheet with baked tofu out the oven right now. I like to freeze, thaw, rinse, and pat between towels. Marinate for an hour and the results are always good. It helps to use smaller cubed tofu to get the marinade to soak up all the flavor. Thanks for this really informative blog.",
      "parent": "0",
      "gravatar_hash": "888e5b638e67c334b3e2d9ff9c4fb41d"
    },
    {
      "id": "25502",
      "author": "Robin Garr",
      "author_url": "http://www.LouisvilleHotBytes.com",
      "date": "2012-05-30 02:12:21",
      "content": "In Louisville, it's Coco Tran's Roots and Heart &amp; Soy. Great restaurants, great fresh-made tofu.",
      "parent": "0",
      "gravatar_hash": "24e30f4e1f2e872c1a4fcd9a2f5a1387"
    },
    {
      "id": "25706",
      "author": "Vegan",
      "author_url": "http://www.sevenpoint2.com/",
      "date": "2012-05-31 05:39:43",
      "content": "I love crispy tofu! My son also don't want to eat tofu unless its fried. I'm always cooking it with sprouts.",
      "parent": "0",
      "gravatar_hash": "bda7603876252c69c15f63b58a0bf6f0"
    },
    {
      "id": "25726",
      "author": "Sondi",
      "author_url": "",
      "date": "2012-05-31 08:03:42",
      "content": "Emma, thanks... I already have Madhur Jaffrey’s excellent “World Vegetarian”.  I think it is a GREAT cookbook.  I think the Indian way of thinking about eating is much healthier than the American way.  I'll check the others out.  :-)",
      "parent": "0",
      "gravatar_hash": "c794428f3cdbdfdd92fd4afaab2377fc"
    },
    {
      "id": "25741",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-31 09:43:28",
      "content": "I tried a side-by-side test of the hot salt water soak last night. Took two slabs  from the same block of high quality local firm tofu. Soaked one in salted water that I brought to a boil and poured over the tofu, left the other as is. Patted them both dry and pan-fried as described. Indeed! The soaked one got a significantly crisper, thicker crust that I really liked. I couldn't noticeably taste the seasoning, but the the crust was a big improvement. Considering how easy this is to do, I'm going to add it as an optional step in the article. Thanks for suggesting it! I'm curious what is happening scientifically that creates the difference in crust.",
      "parent": "25351",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "25999",
      "author": "Betty Ann Besa-Quirino",
      "author_url": "",
      "date": "2012-05-31 10:38:54",
      "content": "I love tofu. I grew up eating tofu. I'm going to try your cookbook's recipe !",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "25837",
      "author": "againstagamemnon",
      "author_url": "http://againstagamemnon.tumblr.com",
      "date": "2012-05-31 20:26:40",
      "content": "If there's not a tofu shop near you, which is my situation, it's relatively easy to make your own tofu from store-bought soy milk. \n\n500ml soy milk\n1tsp nigari OR 2tsp calcium sulfate dissolved in 8oz hot water\n\nBring the soy milk to near scalding. Make the solution from nigari (or calcium sulfate) in 8oz water while the soy milk heats up. Once it's hot, pour 3/4 of the coagulant solution into the pot, stirring gently. Allow to rest for two minutes. After resting, stir very gently, checking for any liquid, milky areas. If there are some, use the other 1/4 of the solution. If not, and if the soy milk has separated into small, white curds of tofu and an amber liquid (whey), you're ready to put the curds into your tofu mold. Line the mold with cheesecloth, then pour the curd in. Place a weight on top (I use right around 5lbs.) and allow to sit for 30 minutes. After 30 minutes, empty the resulting block into a tub of cold water, and allow to rest for one hour before storing in the fridge. Change the soaking water daily. \n\nNigari is nearly impossible to find locally in the US, but it's easily available on the internet. Best tofu ever.",
      "parent": "0",
      "gravatar_hash": "c5de87d8762e808a83fe1989f689356a"
    },
    {
      "id": "25853",
      "author": "Andrea Nguyen",
      "author_url": "http://www.vietworldkitchen.com",
      "date": "2012-05-31 22:17:22",
      "content": "Hi Emma,\n\nYou can order tofu coagulants -- either food grade gypsum or refined nigari crystals -- from this source: http://www.soymilkmaker.com/order.html\n\nScroll on down! A home brewing supply shop will have the gypsum. I detail various kinds of coagulants in the Homemade Tofu Tutorial in Asian Tofu. There are types of tofu that you can make without starting from the bean! Check them out.",
      "parent": "25360",
      "gravatar_hash": "a1d7f072782d87b883f44b98aa70b9af"
    },
    {
      "id": "25854",
      "author": "Andrea Nguyen",
      "author_url": "http://www.vietworldkitchen.com",
      "date": "2012-05-31 22:19:29",
      "content": "Thanks Jill. Good tofu depends on many things -- try using Laura soybeans, which is fabulous. Also, it takes some practice. The fact that you made a block of tofu is fabulous! There's tofu pudding and other kinds of tofu that you can make. Or, just buy tofu and cook fabulous food with it.",
      "parent": "25362",
      "gravatar_hash": "a1d7f072782d87b883f44b98aa70b9af"
    },
    {
      "id": "25857",
      "author": "Andrea Nguyen",
      "author_url": "http://www.vietworldkitchen.com",
      "date": "2012-05-31 22:24:06",
      "content": "Glad you tried it out. It does wonders with deep-fried tofu. The flavor result depends on the firmness of your tofu. There are different ranges of firm. That said, the salted water is drawing out a bit of the natural umami in the tofu. Foods that I prepare with tofu that have been prepped that way taste better overall.\n\nI'm not 100% sure what the scientific explanation is for the better crust on the fried tofu. It's as if it's tightening up the outer layer.",
      "parent": "25741",
      "gravatar_hash": "a1d7f072782d87b883f44b98aa70b9af"
    },
    {
      "id": "25858",
      "author": "Andrea Nguyen",
      "author_url": "http://www.vietworldkitchen.com",
      "date": "2012-05-31 22:28:30",
      "content": "Try one of the Vietnamese tofu shops, such as Thanh Son, 103 NE 82nd Ave, Portland, OR 97220. Thanks for your interest in Asian Tofu.",
      "parent": "25363",
      "gravatar_hash": "a1d7f072782d87b883f44b98aa70b9af"
    },
    {
      "id": "25969",
      "author": "Cook",
      "author_url": "",
      "date": "2012-06-01 11:58:03",
      "content": "OK, you've convinced me to at least try something with 'plain' tofu; fried enough to change the underlying texture just might be enough to change my mind.  Heretofore my only regular use has been a super-firm, smoked variety, usually with pepper flakes that I small dice and add to some (Asian) soups.  I am beginning to taste the fried firm tofu, perhaps with some black bean and garlic paste and a dash of sesame oil.  Great post and recipe, thanks!!  C.",
      "parent": "0",
      "gravatar_hash": "1da4e23aef7f7d502c826a4afebe8284"
    },
    {
      "id": "26034",
      "author": "Annie Banani",
      "author_url": "",
      "date": "2012-06-03 05:37:22",
      "content": "Thanks Ben! I am going to look into this myself. We have come across a GREAT recipe for tofu in peanut sauce... we've modified it to include extra spice and curry. Are you interested?",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "26035",
      "author": "Herbivoracious",
      "author_url": "",
      "date": "2012-06-03 06:37:41",
      "content": "Annie Banani always love to hear a good recipe!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "26029",
      "author": "Susan G.",
      "author_url": "",
      "date": "2012-06-03 06:52:05",
      "content": "I am not a natural cook; that is, I am creative in lots of other ways, but not so much with food.  I've been cooking for a long time, and I find that, although I'm not a \"great cook\", I DO follow directions really well!  The upshot is, if I have a great recipe, I cook a great dish.  That said, I have a question which  will sound ridiculously anal:  When you say soak the tofu in \"hot, salty water\", how salty are we talking??  How much salt should I add to say, 6 cups of near-boiling water?",
      "parent": "0",
      "gravatar_hash": "3e8feef88e80e1193616ae29b4ce8ee8"
    },
    {
      "id": "26030",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-06-03 07:13:32",
      "content": "Good question, Susan. I haven't measured, but I'd say about 2 teaspoons - enough that it tastes about like ocean, same as you would for the water you boil pasta in.",
      "parent": "26029",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "26031",
      "author": "michaelnatkin",
      "author_url": "https://herbivoracious.com/",
      "date": "2012-06-03 07:34:19",
      "content": "I'm glad so many folks are finding this article helpful! By all means, help me spread the word about good tofu - please share with your friends on twitter and facebook.",
      "parent": "0",
      "gravatar_hash": "98c10d2d92fe38bf3eb8cdd3eeb4cc7c"
    },
    {
      "id": "26037",
      "author": "Zebada Aleia Mohamed",
      "author_url": "",
      "date": "2012-06-03 14:10:27",
      "content": "Awesome! Thank you! :)",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "26038",
      "author": "Crazy Raw Vegan",
      "author_url": "",
      "date": "2012-06-03 14:20:04",
      "content": "funny - I found (and used) this last night!! it really works :)",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "26039",
      "author": "April Blankenship",
      "author_url": "",
      "date": "2012-06-03 17:08:47",
      "content": "i love tofu in restaurants, but have never been courageous enough to try cooking it at home - thanks!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "26040",
      "author": "Daisy Lynn Austin",
      "author_url": "",
      "date": "2012-06-03 17:22:00",
      "content": "Just finished my review on amazon!  I cook my tofu like you do about 90% of the time.  I really like using coconut oil for frying it or sometimes I bake it and it turns out really crispy.  The tofu comments ALWAYS come up when speaking to new clients. \"Oh, we eat vegetarian dishes sometimes but we don't eat like a vegetarian- like eating tofu at every meal. We don't like it because its bland and rubbery.\" It drives me nuts.  Then I make it for them and they love it.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "26042",
      "author": "Colby",
      "author_url": "",
      "date": "2012-06-03 19:04:49",
      "content": "Do you know any goof Tofu places in Oklahoma, in the OKC metro area and south?",
      "parent": "0",
      "gravatar_hash": "2ad7408dd0c2d2b644e8931e20c1dcb5"
    },
    {
      "id": "26046",
      "author": "Ben Kressel",
      "author_url": "",
      "date": "2012-06-04 19:17:23",
      "content": "It's so good! I made it, for the first time, the day after the initial post and again tonight. My wife said i'd already mastered it. It's so easy to make perfect tofu! Thanks!!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "26047",
      "author": "Herbivoracious",
      "author_url": "",
      "date": "2012-06-04 19:55:42",
      "content": "Ben Kressel I love to hear that!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "26048",
      "author": "Herbivoracious",
      "author_url": "",
      "date": "2012-06-04 19:55:42",
      "content": "Ben Kressel I love to hear that!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "26049",
      "author": "Stef Jhala",
      "author_url": "",
      "date": "2012-06-05 13:03:46",
      "content": "I've made it 3 times since I saw this post!! Such a great snack even between meals with some light soy / agave syrup / sriracha / japanese rice vinegar.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "26054",
      "author": "AMac",
      "author_url": "",
      "date": "2012-06-06 02:29:14",
      "content": "Yum-crispy, delicious tofu....I typically follow these steps (minus the salted water part...will try for sure!) but I've gotten into the habit of dusting my 'fu with a mixture of cornstarch and garlic salt, then frying a bit of oil. I know, I know...not quite so healthy, but holy hanna, it's tasty.",
      "parent": "0",
      "gravatar_hash": "24b78bcefea6a58262dbc3d1c7226f60"
    },
    {
      "id": "26058",
      "author": "Jeremy",
      "author_url": "",
      "date": "2012-06-06 14:13:54",
      "content": "In OKC, try the Asian district along Classen Ave north of 23rd St. The Cao Nguyen supermarket should have good quality tofu.",
      "parent": "26042",
      "gravatar_hash": "7cdf1fdbe1757a037be2cff1b1ad35b8"
    },
    {
      "id": "26107",
      "author": "Cat",
      "author_url": "https://mojocentral.wordpress.com/",
      "date": "2012-06-07 18:18:36",
      "content": "Just finished dinner--that was goooood! Had the tofu as a side dish, dipped in a little mix of soy/sriracha/sesame oil. Great method; it's a keeper!",
      "parent": "0",
      "gravatar_hash": "0ce371552a838da16bb61a53797fa49e"
    },
    {
      "id": "26518",
      "author": "Little Sis",
      "author_url": "http://mysisterspantry.wordpress.com",
      "date": "2012-06-10 17:35:34",
      "content": "Thanks so much for this.  I already  more or less follow this procedure, but I've never soaked with salt water.  Will definitely try next time as I DO love that crispy crust.  Yum.",
      "parent": "0",
      "gravatar_hash": "2319fc0002e07881dea5e6a56bd774e0"
    },
    {
      "id": "27011",
      "author": "Kristine",
      "author_url": "http://www.veggirlrd.com",
      "date": "2012-06-13 19:16:48",
      "content": "I found out about your blog at the BlogHer 2012 Conference in Seattle last weekend.  Saw this fabulous tofu post, headed right to Chuminh and happily bought my first ever fresh tofu.  Can't wait to try it.  Thanks!",
      "parent": "0",
      "gravatar_hash": "c7b5210e9999d1b14d6b484d85c98534"
    },
    {
      "id": "27026",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-06-13 20:50:44",
      "content": "Nice! I'm excited to hear whether you agree with me that there is a big difference vs. grocery store tofu.",
      "parent": "27011",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "27392",
      "author": "Laurie Smith",
      "author_url": "",
      "date": "2012-06-15 17:28:36",
      "content": "Just tried it, and I have to say that using the big iron pan and the brine made it great, but no matter how much I dried it I had a splattery mess all over the stove. Two questions arise:\n\n1. I think making large batches to use over time would be great. Have you tried freezing it AFTER frying? Frozen uncooked tofu has a changed texture, but after too much time in the freezer it gets dry and spongy. I'm thinking the absorbed oil might help that.\n\n2. Have you tried dusting it with a bit of cornstarch after brining and drying it? That might cut down on the splatter. I think I might try that next time.",
      "parent": "0",
      "gravatar_hash": "37b61adcb8068b6c830f802bc46470f5"
    },
    {
      "id": "27396",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-06-15 17:58:31",
      "content": "My guess is that freezing after frying wouldn't work well, but I can't say I've tried it. If you do, let me know what you find out. Cornstarch dusting can be a nice variation, gives it a little different crust. Not sure it will help that much with the spattering, but maybe. Would be a good experiment to try.",
      "parent": "27392",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "29761",
      "author": "M Simpson",
      "author_url": "",
      "date": "2012-06-23 11:42:44",
      "content": "Hi!  I just got your book as a present and it looks really interesting.  I think  I may venture into these more complicated recipes than I am used to.  I'm curious why you did not include the nutritional info on the recipes? I'm sure there are at least thousands of us who need to count calories, or protein or carbs and I'm not sure I even know where to start using some esoteric components of your recipes. Many cookbooks and cooking magazines do this...It really makes cooking and eating these recipes a lot more difficult if I have to do this myself...\n\nThanks,\nM.Simpson",
      "parent": "0",
      "gravatar_hash": "24b4d0a2bb89c92c995875710bb6f3f6"
    },
    {
      "id": "29791",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-06-23 15:14:22",
      "content": "Hi M -\n\nI'm glad you are liking your first look at the book, and of course I'll be thrilled if you decide to try a few recipes that take a bit more shopping or preparation than you are used to. \n\nAs far as nutritional information goes, my personal approach is all about eating for pleasure and choosing a wide variety of foods, without being particularly focused on tracking protein, calories, etc. That said, I know there are many people who need to track those things, so I'm sorry I wasn't able to offer it. One thing you could do is to use an online calculator like this one: http://recipes.sparkpeople.com/recipe-calculator.asp - depending on which nutrients you are concerned about, you probably don't need to enter every minor ingredient, just the main carb and fat ones. I was surprised at how comprehensive these tools can be though. As a test, I put in \"kochujang\", which is a Korean chili paste, and the info came right up.\n\nThanks,\nMichael",
      "parent": "29761",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "30728",
      "author": "Ian",
      "author_url": "http://foodfrom4.com",
      "date": "2012-06-26 08:32:08",
      "content": "I find adding a light weight - like a chopping board - at step 3 works well just to gently press some of the moisture out. I also find that when frying, fry for considerably longer than you would think was necessary, then just when the tofu is crisp and browning nicely, add a little honey and soy sauce. The honey caramelises adding a little flavour but a lot of colour.",
      "parent": "0",
      "gravatar_hash": "7442922a876a242fddcd70f9cb1cc912"
    },
    {
      "id": "30730",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-06-26 08:39:02",
      "content": "Yes indeed, glazing with something sweet can add a whole layer of flavor - sometimes I use kecap manis (an Indonesian sweet soy sauce, which can be found at Asian markets.)",
      "parent": "30728",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "33846",
      "author": "Jill McKeever",
      "author_url": "http://SimpleDailyRecipes.com",
      "date": "2012-07-04 07:34:22",
      "content": "Hi Michael!\n\nThank you for sharing your expertise.  I'm a complete newbie to cooking with tofu.  I turned to the vegetarian side of life 7 months ago and it's been awesome!  I feel like I'm learning to cook all over again.\n\nIn the Dallas, Texas area, the best tasting tofu I can get my hands on is Wildwood Sproutofu.  I  actually live in deep East Texas (cattle &amp; poultry country).  Finding good tofu is IMPOSSIBLE.  Just the other day, I drove 160 miles roundtrip for tofu &amp; organic produce.  It's crazy, but completely worth it.  Anyhoo.\n\nThanks again!",
      "parent": "0",
      "gravatar_hash": "fbff0bf3d6df4337f87a36527acc98e7"
    },
    {
      "id": "33855",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-04 08:55:19",
      "content": "Wow, that is hard work! I'm guessing not a whole lot of CSAs delivering organic produce to your neighborhood, huh? I like that Wildwood Sprouttofu - one of my go-to choices when I can't make it to the actual tofu store.",
      "parent": "33846",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "33868",
      "author": "Jill McKeever",
      "author_url": "http://SimpleDailyRecipes.com",
      "date": "2012-07-04 10:12:45",
      "content": "CSAs and family farms that grow pasture-raised meats fair pretty well here, so long as they have a Dallas market base.  As for organic produce, or sustainable farms selling produce, the farmer cannot pay his bills selling to folks that shop Walmart.  They too, must take their goods to Dallas. \n\nI've lived in East Texas for 10 years now, and have watched local farms go bankrupt around me.  Our town does have a farmers market, where one to two serious gardeners bring true \"locally grown\" grub.  Sadly, there's just not enough to make a well rounded menu.  \nI'm sorry to be a bummer.  I'm just trying to share why I drive so far.",
      "parent": "33855",
      "gravatar_hash": "fbff0bf3d6df4337f87a36527acc98e7"
    },
    {
      "id": "33873",
      "author": "Jill, The Veggie Queen",
      "author_url": "http://www.theveggiequeen.com",
      "date": "2012-07-04 10:26:41",
      "content": "Jill McKeever, \nNo bummer but it is a truly sad state of affairs when people are so into their meat but forget about the importance of vegetables. I see them change their minds when they are overweight or obese and face serious health issues. It makes me a bit crazy that they wait that long.\n\nIf you continue to consume a meat-based diet and lead a sedentary lifestyle, chances are the you will encounter some chronic (but preventable) illness, whether it be heart disease (the leading killer in the U.S.), cancer, stroke, diabetes and more. Or a number of them at once. That's the bummer.\n\nWe all have a choice. I hope that the tides change in Texas and other places where meat trumps vegetables, and we can support small farmers who do their best to keep people, and themselves, healthy in more ways than one.",
      "parent": "0",
      "gravatar_hash": "e918dad880e60ff08b80eda51d7e2b0c"
    },
    {
      "id": "33876",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-04 10:31:28",
      "content": "That's sad to hear that vegetable farmers can't make a go of it. It really is a systemic problem, as you say.",
      "parent": "33868",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "34176",
      "author": "Anna K.",
      "author_url": "",
      "date": "2012-07-05 08:54:45",
      "content": "I wanted to write and leave my appreciation for this technique. I am a longtime vegetarian married to a (tolerant) omnivore and even though one thing we both love is Asian food and stir fries, I've never been able to cook good tofu and tempeh. But this technique has thankfully changed all that and I am really truly grateful! \n\nFor the benefit of others, here are some things that have worked for me:\n\n-A 7/10 is the perfect temp on my stove (which is NOT a Wolf or Viking or anything close to it).\n-Once you put the tofu in the hot oil, you HAVE to leave it alone for a couple minutes before turning or even checking. If you try to lift it before a crust has formed it will just tear off and stick to the pan and make a huge mess. \n-On that note, even though I don't use a nonstick skillet much in general I have found that it worked better here than my Le Creuset dutch oven. Just extra insurance against sticking. That said, I don't have my well-seasoned cast iron skillet with me this summer but I think it will work great and eliminate concerns about the nonstick pan.\n-Because I've been mainly been including this tofu in stir fries I've been cutting it in cubes and being pretty diligent about flipping every cube with a pair of tongs. That gets amazing results but is a lot of work, so I think I might switch to triangles.\n-Patting the cubes in cornstarch after drying and right before putting in the pan enhances the crust even further.\n\nA huge and sincere thank you to Michael and Andrea! I'd pretty much quit trying to cook tofu but now it's the best thing on the menu. Next up is an exploration of tempeh...",
      "parent": "0",
      "gravatar_hash": "32b0b1e026ece93bbd8fba0a8abf2799"
    },
    {
      "id": "34185",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-05 09:44:02",
      "content": "I'm so glad this has made tofu work for you! And thanks for sharing your tips about how you've found it works best with your gear.",
      "parent": "34176",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "38806",
      "author": "Mary @ Fit and Fed",
      "author_url": "http://fitandfed.net",
      "date": "2012-07-18 09:06:40",
      "content": "Just found your blog today thanks to the NYT mention, congrats on all your success! I love pan-fried tofu but never knew a few of your tips like soaking the tofu in hot, salted water. I've never bought freshly made tofu, I suppose I should give that a try. I'm on the Seattle Eastside. I do shop at Uwajimaya sometimes, perhaps they have fresh tofu. Guess I've been a creature of routine and just picked up my tofu at Trader Joe's or PCC.",
      "parent": "0",
      "gravatar_hash": "42744c39eb841ae95ecca2e5ae3a5a3d"
    },
    {
      "id": "38818",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-18 10:57:43",
      "content": "Hey Mary - yes, Uwajimaya usually has at least a couple of the local brands of tofu. Not quite as fresh as when you get it at the shop, but very, very good.",
      "parent": "38806",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "38822",
      "author": "Emma",
      "author_url": "",
      "date": "2012-07-18 11:06:00",
      "content": "I've just made my first batches of tofu from Andrea Nguyen's excellent book, and let me tell you all, I am never going back!  I think it's every bit as good as what I used to get from the specialty tofu vendors in Japan, and the process isn't hard at all.  It is a little time-consuming, but most of that is hands-off time.  I think the actual work takes somewhere in the neighborhood of half an hour-- and it's totally worth it.",
      "parent": "0",
      "gravatar_hash": "d12483db2446c6e36e8d1c32e62be8cf"
    },
    {
      "id": "41656",
      "author": "taberarenai",
      "author_url": "",
      "date": "2012-07-27 10:48:09",
      "content": "This tofu technique is genius. As a scientist (and vegan that lived in Japan), I can't believe I never heard of it before! I suspect that due to osmosis, the water molecules leave the tofu (especially from the surface in direct contact with the salted water) in order to dilute the salted water. The hot water would speed up the process. This is great because your tofu shouldn't get all salty which can happen if you try to use a salty marinade. I pretty much need to go try this right now but I don't have any tofu /(&gt;.&lt;)\\",
      "parent": "25741",
      "gravatar_hash": "05351916cb4f58997274c63afb806a85"
    },
    {
      "id": "43537",
      "author": "Jenny",
      "author_url": "",
      "date": "2012-08-03 09:01:33",
      "content": "Don't use peanut oil on high heat--the smoking point isn't high enough and it will catch fire.",
      "parent": "0",
      "gravatar_hash": "a329a65ebd3a94f2ce993a16afc39aa6"
    },
    {
      "id": "43993",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-05 20:16:54",
      "content": "That would definitely be true of unrefined peanut oil. Refined peanut oil is used in most of the wok cooking in China at very high temps, so I don't think that would necessarily be a problem. (I don't use it b/c my wife is allergic to peanuts, and though there should be no allergen protein left in refined oil, there is no real reason to add any risk at all.)",
      "parent": "43537",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "48464",
      "author": "Lee",
      "author_url": "",
      "date": "2012-09-03 10:46:47",
      "content": "I tried this, and was inspired to brush it with a tiny bit of vegetarian oyster sauce and put blackening seasoning on the tofu before I fried it. OMG! My health food hating husband scarfed it down. (Told him it was fish.) I told him the reason it was square is that I bought frozen fillets. He said that was the best fish he'd ever had-amazing for frozen. Said the *fish* was so tender it melted in his mouth like butter. Ahem. Yes, that was some tender *fish*. LOL. He suggested we try it in fish tacos, so I guess we will. Blacken seasoning could probably make a flip flop taste good, though. Loved the prep tips you gave: they worked REALLY well!",
      "parent": "0",
      "gravatar_hash": "715ebfaa7901ed0e68fa450abc710c91"
    },
    {
      "id": "48534",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-03 16:57:27",
      "content": "That's hilarious! Thanks for sharing.",
      "parent": "48464",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "49475",
      "author": "Janey Winter",
      "author_url": "",
      "date": "2012-09-09 19:39:51",
      "content": "Been searching high and low for this piece on tofu. I am currently in love with its nutritional value but not exactly on taste. Now, your post solves my problem and deserve my thanks.",
      "parent": "0",
      "gravatar_hash": "0a0cb823fb9ac79d415d38a1b4db6531"
    },
    {
      "id": "62213",
      "author": "Chris of Stumptown",
      "author_url": "",
      "date": "2012-10-12 19:53:17",
      "content": "In Portland, OR I would recommend either Bui Natural or Thanh Son.  For softer tofu, Ota is very good.",
      "parent": "0",
      "gravatar_hash": "13e18356c7e44e47a189e87b1b23db45"
    },
    {
      "id": "64222",
      "author": "Affordable natural &amp; organic foods!",
      "author_url": "http://www.juhub.com",
      "date": "2012-10-18 08:47:23",
      "content": "This is great advice! Often when I fry tofu, must crank up the oven on high in order to dry up all the water. Now, this will be the method used for frying nice crispy &amp; tasty tofu! Thanks for sharing this!",
      "parent": "0",
      "gravatar_hash": "27e7aaeae34adc2ca4c1ba30400e28b8"
    },
    {
      "id": "74047",
      "author": "diane",
      "author_url": "",
      "date": "2012-11-04 08:56:30",
      "content": "liked this info much.  have been dredging my tofu in cornstarch before frying (sometimes seasoning it and sometimes not) which is really good, but i will try this as it is probably a little healthier.  thanks michael, smriti and andrea.",
      "parent": "25311",
      "gravatar_hash": "168a27c9040af3edf977f89aca28468e"
    },
    {
      "id": "78273",
      "author": "Gail",
      "author_url": "",
      "date": "2012-11-11 12:47:02",
      "content": "If you are in Bellevue, Washington, you can get fresh tofu from Tofu 101 in Factoria.  It's delicious!",
      "parent": "0",
      "gravatar_hash": "bd536e19a431794cc768aad4e7b6cdde"
    },
    {
      "id": "83409",
      "author": "Dan",
      "author_url": "",
      "date": "2012-11-20 13:26:39",
      "content": "I find that pressing tofu gets significant water out of extra firm tofu, I get very good marinade absorption in my pressed tofu..it works quite well. Using a press like the EZ Tofu Press gets the water out in 15 minutes and marinade infuses quite easily...",
      "parent": "0",
      "gravatar_hash": "69dcc03359f49b5de4edd03ece67db3b"
    },
    {
      "id": "88226",
      "author": "Pam",
      "author_url": "http://herbivoracious",
      "date": "2012-11-27 20:07:15",
      "content": "Trying to go vegan and don't like tofu but will try this one.",
      "parent": "0",
      "gravatar_hash": "2fc2b12d5ae4c0d427c6fc7875720384"
    },
    {
      "id": "90048",
      "author": "Emer from EverydayVegetarianRecipes",
      "author_url": "http://www.everyday-vegetarian-recipes.com/vegetable-salad-recipes.html",
      "date": "2012-11-30 03:30:21",
      "content": "Hi Michael,\n\nI'm late to the party but wanted to thank you especially for passing on the tip about soaking the tofu in salted water. I've been doing this and getting great results. I've also found it a good trick when baking.  Sometimes, I love baking tofu until it is really dense. Other times, I want the tofu to be softer and the soaking helps a lot. I've just added a recipe to my own site for crispy tofu sticks, incorporating the method and I've credited you for this tip.  Cheers Michael. Your recipes are as inspiring as ever... Emer",
      "parent": "0",
      "gravatar_hash": "a03b38103ebcd1cd685aa8ff9df8fa89"
    },
    {
      "id": "103379",
      "author": "Cheri",
      "author_url": "",
      "date": "2012-12-31 08:06:58",
      "content": "Thanks for the tips! I haven't tried the soaking in hot salted water, but I will now. Just wanted to share where the best tofu I've found in Champaign Urbana is -- at the Co-Op at Lincoln Square. Buy the kind they package themselves in 4-lb blocks. Cut and freeze what you don't use right away. The frozen part is great for baked tofu. \n\nAlso wanted to say I talked to a professor of food science who studies soy, and when I remarked that long marinating seemed to hold no edge over short marinating (despite what I always read), she said that there seems to be some component in soy that diminishes other flavor compounds over time, so long marinating really doesn't help. I have found that frozen sliced tofu, thawed and pressed (briefly, with my hands) absorbs marinade all the way through in no time. I just pour the marinade over and immediately bake it. Yum!",
      "parent": "0",
      "gravatar_hash": "961c9ed8b3f03aa5434d6596e93413a1"
    },
    {
      "id": "103380",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-12-31 08:12:47",
      "content": "Thanks, Cheri! And quite right, if you freeze and thaw tofu it becomes very porous and will absorb the heck out of a marinade. It is a very different texture that has its own charm.",
      "parent": "103379",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "103384",
      "author": "dan",
      "author_url": "",
      "date": "2012-12-31 08:19:51",
      "content": "Cheri,\n\nYour professor is right, I usually marinate pressed tofu for only 15-20 minutes...I notice no difference when I get side tracked and marinate for an hour or more. I use the EZ Tofu Press so I get most of the water out and the marinate seems to infuse rather quickly.",
      "parent": "103379",
      "gravatar_hash": "69dcc03359f49b5de4edd03ece67db3b"
    },
    {
      "id": "104474",
      "author": "Terry",
      "author_url": "",
      "date": "2013-01-05 07:25:18",
      "content": "Because I'm vegetarian and do a lot of backpacking, I make tofu jerky from the recipe in Lipsmakin' Vegetarian Backpackin' by Christine + Tim Conners.  It's a big treat in the wilderness when you've been sweating all day + crave something salty, and it's a great protein source.\nYou cut the block of tofu into 1/4\" thick pieces then marinate the tofu in Bragg's Liquid Amino Soy Seasoning, garlic + ginger. I find the tofu absorbs the marinade well- too well if you leave it for the authors' recommended 1-2 hours (waaay too salty). I marinate for 45 minutes to get the right amount of flavour + saltiness. \nPut the tofu in your dehydrator + dehydrate till chewy.\nYum!",
      "parent": "0",
      "gravatar_hash": "36865bedf9fa2176dacf680fcc3f96f4"
    },
    {
      "id": "108823",
      "author": "Jenny",
      "author_url": "",
      "date": "2013-01-20 17:23:00",
      "content": "wow! i just made this and almost ate an entire pound of tofu! i can't tell you how many times i've tried to like tofu now i LOVE IT!!! &lt;3 thanks SO much!",
      "parent": "0",
      "gravatar_hash": "99970b76353bea725bea7b71b915e02a"
    },
    {
      "id": "111649",
      "author": "Ethyl",
      "author_url": "",
      "date": "2013-01-29 06:10:32",
      "content": "I'm loving the brining method for getting extra-crispy tofu!  \n\nSince we're sharing where to get excellent, fresh tofu, I wanted to let folks in Upstate New York know to keep an eye out for Ithaca Soy tofu -- you can find it at farmer's markets and some local natural food stores and co-ops.  It's FANTASTIC, so much better than grocery store!",
      "parent": "0",
      "gravatar_hash": "8605c53b566a9da933a2ce60d2d87707"
    },
    {
      "id": "115797",
      "author": "Chistina",
      "author_url": "",
      "date": "2013-02-08 13:44:47",
      "content": "so awesome!  I have been cooking tofu for years and this is the best way yet!!!!!",
      "parent": "0",
      "gravatar_hash": "892f445133bd1aa03d559510d1331f12"
    },
    {
      "id": "125323",
      "author": "Elizabeth Mars",
      "author_url": "http://thebackyardlemontree.com",
      "date": "2013-03-09 02:37:33",
      "content": "I'm definitely  going to try the hot water and salt method. I make a schezuan pepper and salt mix that I sprinkle on while I'm pan frying tofu and it is delicious.  I marinate tofu for three or four hours if I'm going to barbecue it and find it does soak up the flavours.",
      "parent": "0",
      "gravatar_hash": "c4a906edc94022179f90191aeafc54ca"
    },
    {
      "id": "128005",
      "author": "Willy",
      "author_url": "http://broccolicauliflowersoup.blogspot.ca/",
      "date": "2013-03-19 05:44:45",
      "content": "I was planning on making a stir fry later with tofu I'll have to try to soaking it in hot water. I noticed you said that marinade doesn't permeate the tofu. The drier it is the more it will absorb any marinade that its soaking in. i have gotten some freeze-dried tofu before that absorbed quite a bit of sauce. If you know of any fresh tofu makers in the toronto area let me know please.",
      "parent": "0",
      "gravatar_hash": "fabe86830f5074f3323b3dfad54f4ec6"
    },
    {
      "id": "128007",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-03-19 05:47:15",
      "content": "For sure, freezing or freeze-drying tofu makes it very porous so lots of marinade will soak in in that case. It is a very different texture in that case, but it can certainly be appealing.",
      "parent": "128005",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "129421",
      "author": "janet @ the taste space",
      "author_url": "http://tastespace.wordpress.com",
      "date": "2013-03-24 04:24:56",
      "content": "There are many places that sell fresh tofu in the GTA. Ying Ying in the St Lawrence Market. There are other places, too, like Chodang Soon Tofu, but I can't vouch for them myself.\n\nhttp://torontoist.com/2011/06/made_in_toronto_fresh_tofu/",
      "parent": "128005",
      "gravatar_hash": "7f86e32fb3c941045ee50de9ef2d3490"
    },
    {
      "id": "134235",
      "author": "Ilene",
      "author_url": "",
      "date": "2013-04-07 15:02:28",
      "content": "I just made this and although it's a lot of steps, the tofu is terrific! crispy on the outside and still a bit creamy on the inside.",
      "parent": "0",
      "gravatar_hash": "ff83ad2fe0f84a2b4903b25c10d0f92c"
    },
    {
      "id": "134339",
      "author": "Tammi",
      "author_url": "",
      "date": "2013-04-07 19:34:16",
      "content": "After the smoke cleared in my kitchen and well, entire loft and I finally got the fire alarms to stop screaming at me, I've come to several conclusions: 1) This blog entry would have been more appropriately titled, \"How to Make Tofu Really Freaking Crispy\". The texture? Great. As Ilene states, it's nice and crispy on the outside but still soft in the inside. 2) They are still bland. I figured they would be flavorful due to the salt soaking in so I didn't prepare any sauces. Not the case. So either I didn't use enough salt in the boiling water (about 1 tsp) or you didn't mean to say \"freaking delicious\". 3) I need to find a place with fresh tofu, as you mentioned to see if this would even make a difference. Till then, I continue to marinate and dredge in my flour/nutritional yeast/bread crumb combo and fry/bake as usual. Regardless, thanks for the tip on how to make it crispy! I will look around your site for tasty sauce recipes. Bon apetit!",
      "parent": "0",
      "gravatar_hash": "cb58182e6d2f4f38a3e9960bbe7986a9"
    },
    {
      "id": "134399",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-04-07 21:56:32",
      "content": "Thanks for the note, Tammi! I find the well-browned crust to be flavorful, but I do indeed always serve it with sauces. You can find some ideas scrolling through here: https://herbivoracious.com/?s=tofu",
      "parent": "134339",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "138298",
      "author": "Lori",
      "author_url": "",
      "date": "2013-04-16 11:07:22",
      "content": "I heard a great tip recently to *broil* extra-firm tofu to get a crispy texture. I needed a way to make fried tofu without deep-frying. It's my favorite appetizer at Thai restaurants. One of the cooks suggested I try just using my broiler. Broiling has worked out great for me, instead of pan-frying which eliminates some oil and I have a glass-top stove and nonstick pans that make it hard to get right, like Michael explains here at the top. I buy Trader Joe's extra firm sprouted tofu twin-pack and slice it 3/8\" thick like Michael described , but slice again into little squares or rectangles. I lay the pieces on a lightly oiled -aluminum- baker's quarter sheet. A little sesame oil across the tops and place under the broiler for 5 mins on each side. They turn out a little curled and dried -but crispy!-, but that is all I was going for. It's great on salad or with thai chili sauce.",
      "parent": "0",
      "gravatar_hash": "235d10d1e33c8ab2f26b44ddadbe13fa"
    },
    {
      "id": "139198",
      "author": "Rhonda",
      "author_url": "http://www.wine-y-wife.com",
      "date": "2013-04-18 16:32:06",
      "content": "My family recently did a vegan challenge, and while blogging about it, I told everyone my deepest fear. I was afraid of tofu. It was intimidating. I'm not a novice cook, either. But there was something about tofu that made it the one ingredient I was afraid to tackle.\n\nI had a few people tell me it wasn't so bad, I shouldn't be afraid. Then Tofu Mom gave me the link to this page. After reading your post I felt like I could do that! \n\nI went to (the right) store and picked up my tofu and followed your instructions to the letter. I added it to my cauliflower and chick pea coconut curry. It was delicious. I love the texture it added and it gave the curry just the depth that was needed.  \n\nThank you so much!",
      "parent": "0",
      "gravatar_hash": "9c37d4b579822a7e5ec062bb4ce0d6cd"
    },
    {
      "id": "139296",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-04-18 20:26:43",
      "content": "So glad you liked it! Another tofu lover in the fold :)",
      "parent": "139198",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "140670",
      "author": "constance",
      "author_url": "",
      "date": "2013-04-21 22:26:47",
      "content": "The new BLACK tofu is quite good and is anti-oxidant rich.  I think nasoya is the brad I have seen and tried but it might become trendier and other tofu makers might adopt it.  It has a fresh quality.",
      "parent": "0",
      "gravatar_hash": "2e12a5a50ae36f4a8c79ae3d55e061dc"
    },
    {
      "id": "140680",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-04-21 22:43:09",
      "content": "I haven't run into that yet; will definitely keep my eyes open!",
      "parent": "140670",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "141347",
      "author": "Linda",
      "author_url": "",
      "date": "2013-04-23 13:54:27",
      "content": "This was DELICIOUS.  I never eat plain, pan-fried tofu, simply because it is so bland.  I always use it in recipes where it absorbs other flavors, like in lasagne or salad dressings.\n\nNow I have an easy way to enjoy tofu without \"making something.\"  My husband said it was good, too, but he didn't RAVE over it like I did.  I will DEFINITELY do this again.\n\nThe hot, salty water is a must, to flavor the tofu.  I think the salt also draws water out of the tofu making it firmer.  I used Firm (not Extra Firm) tofu, and I could tell a difference in firmness when I took it out of the water to pat it dry.\n\nThe only oil I had besides olive oil was coconut oil.  Don't know about the smoke point, but I know it can take higher heats than olive oil.  It DID start smoking about 3/4 of the way through.  My kitchen was a smoky mess and I had to open windows and doors, but it was WORTH IT.  The tofu was delicious!!!!\n\nThank you!!  So glad I tried this!",
      "parent": "0",
      "gravatar_hash": "dd4371862cfa72babe84af5ab9b74d6c"
    },
    {
      "id": "141349",
      "author": "Linda",
      "author_url": "",
      "date": "2013-04-23 14:06:34",
      "content": "I noticed another poster said the tofu was still bland after soaking with 1 tsp of salt.  The directions I read say \"well-salted\" water.  (Maybe the directions were changed at some point).  I WELL-salted my water.  I didn't even measure, but dumped in some Celtic salt (maybe a couple TBS or more???), and my tofu needed NOTHING else to be absolutely fantastic.",
      "parent": "0",
      "gravatar_hash": "dd4371862cfa72babe84af5ab9b74d6c"
    },
    {
      "id": "143366",
      "author": "Brixe",
      "author_url": "",
      "date": "2013-05-01 23:59:55",
      "content": "In Berlin / Germany: The huge Asian supermarket at the Trainstation Hackescher Markt has fresh Tofu every day - and it's delicious!",
      "parent": "0",
      "gravatar_hash": "dc3181536b2f29085406bb6f6326c063"
    },
    {
      "id": "144427",
      "author": "bevedawn",
      "author_url": "",
      "date": "2013-05-05 19:43:57",
      "content": "it tast like fried eggs",
      "parent": "0",
      "gravatar_hash": "ff782a4a894cfa1d94fc7d4326f0e3bb"
    },
    {
      "id": "149648",
      "author": "Meah2O",
      "author_url": "",
      "date": "2013-05-20 18:15:44",
      "content": "I live in Houston. There are lots of Asian supermarkets and restaurants - but does anyone have a specific ecommendation for where I would find fresh tofu?",
      "parent": "0",
      "gravatar_hash": "c090341ca200b6f6e45843cc241a34e9"
    },
    {
      "id": "151340",
      "author": "Lili",
      "author_url": "",
      "date": "2013-05-24 16:46:53",
      "content": "This was my first time making tofu and I followed your instructions to the letter! The color was exactly like in your picture and you were right, it stays really creamy on the inside and is so beautifully golden brown on the outside. We made it with a stir fry type of sauce with soy sauce, green beans cooked in the oven then briefly fried, roasted orange pepper, mushrooms and a little ginger. Delicious!",
      "parent": "0",
      "gravatar_hash": "31617fa007888d038cd380e32c3d1292"
    },
    {
      "id": "151344",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-24 17:01:33",
      "content": "I'm so glad it worked out for you!",
      "parent": "151340",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "160294",
      "author": "Andrea",
      "author_url": "",
      "date": "2013-06-16 16:03:51",
      "content": "My favorite way to prep tofu is to simply brush it with a little sesame oil &amp; soy sauce and then bake it for about 20 minutes @ 350, turning it half way through. No need to dry it since it's being baked instead of fried. Soooo easy! \n\nI'm looking forward to trying the \"soak in salted water method\" as an alternative to using soy sauce. Thanks for the idea!",
      "parent": "0",
      "gravatar_hash": "e94823fe62365697c954120891ba0283"
    },
    {
      "id": "173778",
      "author": "Janet",
      "author_url": "",
      "date": "2013-07-15 04:27:44",
      "content": "The first time I had tofu, I'm sure it wasn't cooked the right way....not good!  Recently though, a friend made some for me, and it was very tasty.  I want to try this recipe, and have noted some sauces etc mentioned here that I want to try.  Asian is one type of food that I really have little experience making, but I love it so much!  I would love to see more recipes using tofu!",
      "parent": "0",
      "gravatar_hash": "046ec3cab180b6a21ede86c06391facf"
    },
    {
      "id": "177664",
      "author": "lilly",
      "author_url": "",
      "date": "2013-07-23 19:48:50",
      "content": "http://www.yelp.com/biz/thanh-son-tofu-seattle\nThanh Son Tofu sells fresh tofu and soy milk in Seattle , sometimes it is still warm when you get it.",
      "parent": "0",
      "gravatar_hash": "85a8c329d80612cdbbb7c8df7d494c77"
    },
    {
      "id": "179517",
      "author": "Phoebe",
      "author_url": "",
      "date": "2013-07-26 16:39:24",
      "content": "I pan fried medium firm sliced tofu dusted with cornstarch, then quick braised in a fresh tomato sauce (chopped onion &amp; diced peeled tomatoes) with great result, not bland at all.",
      "parent": "0",
      "gravatar_hash": "0658f05f03deb18035d00ea59aa2b710"
    },
    {
      "id": "194413",
      "author": "Margo",
      "author_url": "",
      "date": "2013-09-05 15:13:53",
      "content": "Yup. You nailed it. Crispy, crunchy on the outside. Creamy inside. Heaven!",
      "parent": "0",
      "gravatar_hash": "edc881b97d675d09c6b3f8382c21e339"
    },
    {
      "id": "194414",
      "author": "Margo",
      "author_url": "",
      "date": "2013-09-05 15:15:43",
      "content": "Yeah, it does taste a little like eggs!",
      "parent": "144427",
      "gravatar_hash": "edc881b97d675d09c6b3f8382c21e339"
    },
    {
      "id": "199384",
      "author": "Elda",
      "author_url": "http://www.lifegarden.se",
      "date": "2013-10-07 09:13:39",
      "content": "I buy a marinated tofu that is dense in texture (similar to small picture of the cut tofu).\n\nI do lots of inventive dishes but one I would like to share that I have created is a take on \n\njapanese tastes that I love. Very simple.\n\n\nSESAME FRIED TOFU and HIZIKI\n\n(Actually, I don't do any patting dry to be honest :-( and it turns out perfect)\n \n\nI begin by using sesame oil, such a wonderful nutty taste to the tofu. Fry the tofu so that it \n\ncomes out golden brown on each side. Set aside.\n\nI slice and fry Shitake mushroom also in sesame oil (not too much). Set aside.\n\nHiziki, a japanese seaweed is prepared by first soaking in water until double in size, preferably over night. But an hour will do.\n\nIn olive oil, (quite plentiful) fry fresh garlic cloves (depending on the amount of Hiziki being prepared, the amount of garlic added depends on taste, at least 1 - 2 medium cloves. . Hiziki should be simmered at a low temperature so as not to burn. The idea is to let each strand of seaweed be caressed by the olive oil. When this has been done approximately 10 - 15 minutes. Shoyu soya is added and the Hiziki is simmered at low heat for at least 30 minutes. Until the Shoyu soya has soaked into the seaweed.\n\nDelicious warm or room temperature\n\nServing, as desired. On its own! With or without bread.\nOn a piece of sour dough bread alternatively hard Swedish bread place the tofu first, secondly place Shitake, top with Hiziki .... and finally top with finely chopped parsley. Absolutlely DELICIOUS!\n\nI eat this for breakfast!",
      "parent": "0",
      "gravatar_hash": "47c332b58d93eeb9d0bdace83c9416b1"
    },
    {
      "id": "202016",
      "author": "Kip",
      "author_url": "http://messyvegetariancook.com",
      "date": "2013-10-13 20:47:27",
      "content": "For years I followed the standard method of pressing, but after travels around various Asian countries I found that to be a very Western practise. I also noticed many people commenting on the amazing texture of tofu in Thai restaurants, one they could not recreate at home. Once I figured out the trick, I realised that's no surprise since it was (and is still) a method virtually unheard of outside of Asian communities.\n\nGreat blog, by the way. It's very well presented and quite clear you put a lot of thought and work into each post!",
      "parent": "0",
      "gravatar_hash": "05bf3b00da9a7d46d904193daf8caa82"
    },
    {
      "id": "203085",
      "author": "Ashley",
      "author_url": "",
      "date": "2013-10-16 16:54:41",
      "content": "This turned out perfectly, the kids and I loved it. Thank you so much for the clear instructions!",
      "parent": "0",
      "gravatar_hash": "b16231535830a76991174a920899f885"
    },
    {
      "id": "212385",
      "author": "Gloucesterina",
      "author_url": "",
      "date": "2013-10-29 20:30:32",
      "content": "Andrea Nguyen's brine soaking suggestion worked brilliantly for me - no scary spattering in the pan, and a beautiful firm-crisp golden crust! I look forward to trying the pre-cooking in the microwave.",
      "parent": "0",
      "gravatar_hash": "da58554bd8dd21d514e4a120ed9efb71"
    },
    {
      "id": "214375",
      "author": "Erin",
      "author_url": "",
      "date": "2013-10-31 20:43:29",
      "content": "I often marinate tofu, with great, saturated results. After cutting up the tofu, I press out the liquid, or leave it under a weight with towels. Then on low I Slowly draw out more liquid in a frying pan, making sure not to actually cook the tofu. After that I marinate it anywhere from an hour to over night, then it's good to bake or bbq or fry.\n\nMakes great tofu \"steaks\"",
      "parent": "0",
      "gravatar_hash": "e628e96e46ae19d0fcc7335829e058ec"
    },
    {
      "id": "331434",
      "author": "Ryan Elizabeth",
      "author_url": "http://sevenintheocean.com/",
      "date": "2013-12-16 14:08:58",
      "content": "Thank you SO MUCH for the tofu tips! The first time I made this successfully, using this method, I was dancing around my kitchen. I used to dread having to fry tofu, but I'm making it again tonight and can't wait! :-)",
      "parent": "0",
      "gravatar_hash": "2a26e1f9e1a68dcfbb5b23022b5965f9"
    },
    {
      "id": "331450",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-12-16 14:11:28",
      "content": "Well we like dancing!!",
      "parent": "331434",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "556567",
      "author": "yss",
      "author_url": "",
      "date": "2014-01-13 06:18:46",
      "content": "What I found was really good &amp; I used to hate tofu is :\nFrench Onion Pie - The Vegan Table: 200 Unforgettable Recipes for Entertaining Every Guest at Every Occasion by Colleen Patrick-Goudreau\n (p. 128)\nyou can preview the recipe on Google Books,its also on a blog online somewhere",
      "parent": "0",
      "gravatar_hash": "cda2479d14072a21bb3c893e1a2c44f7"
    },
    {
      "id": "556569",
      "author": "yss",
      "author_url": "",
      "date": "2014-01-13 06:21:24",
      "content": "the best part is that the recipe can be made oil free by sauteing the onions in water",
      "parent": "0",
      "gravatar_hash": "cda2479d14072a21bb3c893e1a2c44f7"
    },
    {
      "id": "556652",
      "author": "yss",
      "author_url": "",
      "date": "2014-01-13 06:44:29",
      "content": "Sorry for making so many comments I Think its worth mentioning that Tofu that is prepared with calcium sulfate will contain more calcium than tofu made with nigari,check ingredient label for more info.",
      "parent": "0",
      "gravatar_hash": "cda2479d14072a21bb3c893e1a2c44f7"
    },
    {
      "id": "673674",
      "author": "Allana",
      "author_url": "",
      "date": "2014-02-04 02:14:56",
      "content": "Thanks for the tips! I go to a Cambodian restaurant in Newmarket, Ontario for their vegetarian tofu soup. I don't know how they do it, but their tofu cubes are puffy and crispy! Absolutely delicious! I've tried to fry it, but it just isn't the same! And smile and tell me \"we just fry it\" haha, I literally crave this soup! Any idea's to get puffy crispy tofu? And, just a heads up, I'm still kinda new to the whole tofu world! And to say the least, my tofu isn't that great \"yet\"! :)",
      "parent": "0",
      "gravatar_hash": "593aedd8e0663e9ec8a5c117519f7f4c"
    },
    {
      "id": "674447",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-02-04 06:43:23",
      "content": "I haven't tried it, but I believe that texture might be achieved by freezing extra firm tofu, then thawing it, and then deep frying it. If you give it a go, let me know.",
      "parent": "673674",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "675730",
      "author": "Phoebe Jones",
      "author_url": "",
      "date": "2014-02-04 12:40:08",
      "content": "Asian has many way to treat tofu, what is important is cooking/eating tofu as 'tofu', not a substitute of something else.  Here is the question:  is the tofu puff in the soup actually crispy?  how can anything still be crispy after being in the soup?  if your tofu is only puffy but crispy is only in appearance, I can offer a suggestion. In cities like Toronto &amp; Vancouver  (in Canada) with huge Chinese markets, they sell tofu in dozens forms.  One form is simply called tofu puff, which was deep-fried, with almost all skin with very little inside. Cut up/diced/sliced and braised in soup will provide the texture of meat. Could that be what you are looking for? \nDeep fry soft tofu in high temperature briefly will give you a crispy exterior and silky interior,  Sprinkle seasoning of your choice, enjoy the best cheap snack.",
      "parent": "0",
      "gravatar_hash": "0658f05f03deb18035d00ea59aa2b710"
    },
    {
      "id": "703182",
      "author": "wle",
      "author_url": "",
      "date": "2014-02-11 18:42:07",
      "content": "atlanta location for fresh tofu:\nbuford highway farmers market\n\nthe best FRIED tofu ever, made every day fresh: \nVN tofu,  2 locations\nbuford highway\njimmy carter blvd\nDIRT CHEAP\n$1 for a HUGE block, at least 24oz\n1.50 for flavors\nlemongrass/chili\nmushroom/beef\nsome others\n\n\nwle",
      "parent": "0",
      "gravatar_hash": "b97f1119cacafd703ff7a5e6c47860e5"
    },
    {
      "id": "705900",
      "author": "DD",
      "author_url": "",
      "date": "2014-02-12 11:37:35",
      "content": "Hello!  Thank you for the tofu ideas.  But would you happen to know why my tofu doesn't get all nice and spongy when I freeze it?  I've had it like this in restaurants, and I've read hundreds of times on the Internet that one should freeze tofu to make it spongy.  But whenever I try this, the defrosted tofu has exactly the same texture as it had before freezing.  Does it need to be frozen for some minimum amount of time in order to become spongy?",
      "parent": "0",
      "gravatar_hash": "0fe31d683486cb894c99870f0e68b8b9"
    },
    {
      "id": "705908",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-02-12 11:41:15",
      "content": "Are you using firm or extra firm? I've definitely gotten spongy results doing that. Just freezing overnight, then thawing out the next day and gently expressing the water.",
      "parent": "705900",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "705918",
      "author": "DD",
      "author_url": "",
      "date": "2014-02-12 11:47:20",
      "content": "Many thanks for the quick response!  I always use firm or extra firm tofu.  After freezing I thaw and express the liquid just as you say.  Hmmm.....maybe I just have such a great freezer that the ice crystals don't form properly...?  Oh well, I guess I'll just have to enjoy my tofu unspongy. :-)  Thanks anyway!",
      "parent": "0",
      "gravatar_hash": "0fe31d683486cb894c99870f0e68b8b9"
    },
    {
      "id": "706489",
      "author": "Phoebe Jones",
      "author_url": "",
      "date": "2014-02-12 15:48:55",
      "content": "When boil/simmer tofu for a long time (1/2 hour and up) in water/soup stock, will turn spongy as well if your freezer fails to freeze it solid.",
      "parent": "0",
      "gravatar_hash": "0658f05f03deb18035d00ea59aa2b710"
    },
    {
      "id": "757105",
      "author": "Oops",
      "author_url": "",
      "date": "2014-02-24 19:27:49",
      "content": "Side Note: Don't let the cast iron skillet heat for too long or the oil will immediately start a fire upon contact…Not that that happened to me or anything….",
      "parent": "0",
      "gravatar_hash": "34a366fde43c5408e826528db1183c64"
    },
    {
      "id": "809943",
      "author": "laurie",
      "author_url": "http://www.crunchygooey.com",
      "date": "2014-03-10 10:18:10",
      "content": "THANK YOU - can't tell you how many times I've tried to get crispy tofu and been rewarded with a smoky kitchen and rubbery tofu. That soak really works and they cook up so quickly.",
      "parent": "0",
      "gravatar_hash": "f9df6b24ef3908455107e09ac68bf1e9"
    },
    {
      "id": "873297",
      "author": "Tammy",
      "author_url": "",
      "date": "2014-04-06 06:41:18",
      "content": "I'm a little confused. It says \"How to make tofu really frickin delicious\". The only thing used is brine water. No spices, no nothing. Am I the only seeing that all you do is fry it plain and it will be the best tofu ever....In order to make something better is how you spice it up and cook it..",
      "parent": "0",
      "gravatar_hash": "6096486fef9b9dac7c340171f67b00af"
    },
    {
      "id": "873311",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-04-06 07:22:23",
      "content": "This post shows you how to make the tofu *itself* have a delicious, crispy, Maillardized crust. Good tofu itself has a mild, sweet soy flavor in the interior that tastes great with this crust. And then, yes, absolutely, you'll want to use this as a component in a dish with a wider set of flavors. I've got <a href=\"https://herbivoracious.com/?s=tofu&submit.x=0&submit.y=0&submit=Go\" target=\"_blank\" rel=\"nofollow\">lots of ideas for you</a>, just keep scrolling.",
      "parent": "873297",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "873895",
      "author": "Debbie",
      "author_url": "",
      "date": "2014-04-06 22:43:48",
      "content": "What are some good dipping sauces for crispy tofu?",
      "parent": "0",
      "gravatar_hash": "e1e0c7552d89d0fba625a6491a7461d0"
    },
    {
      "id": "874275",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-04-07 06:39:43",
      "content": "I tend to use fried tofu more in Southeast Asian curries and stir-fries than for dipping, but that can be good too. Here are a couple of ideas for sauces that can be used for dipping though: https://herbivoracious.com/2008/01/recipe-kaffir-l.html, https://herbivoracious.com/2009/10/vietnamese-vermicelli-bun-with-ginger-grapefruit-sauce-recipe.html . Also, a mixture to taste of soy sauce, chili paste, mirin or rice vinegar, and sesame oil is always good.",
      "parent": "873895",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "887769",
      "author": "Amanda",
      "author_url": "",
      "date": "2014-04-19 16:23:05",
      "content": "I just made this tonight - amazing! I've never been able to get a good crust until now - thank you!",
      "parent": "0",
      "gravatar_hash": "34d389575b8c10864c8cdd266e02727b"
    },
    {
      "id": "888168",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-04-20 06:55:09",
      "content": "You are very welcome! Glad it was a winner.",
      "parent": "887769",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "891514",
      "author": "Maria",
      "author_url": "",
      "date": "2014-04-24 08:01:26",
      "content": "Followed this method last night and it was a marked improvement. So much so that my husband, who didn't know I was trying something different, remarked: \"What did you do the tofu?! It's so much better!\" And this from a die-hard carnivore who just went veggie two months ago. Thank you!",
      "parent": "0",
      "gravatar_hash": "eefc9437e57cacc88e7d3d7d7fa0bcf2"
    },
    {
      "id": "891523",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-04-24 08:14:27",
      "content": "That. Is what I like to hear.",
      "parent": "891514",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "936567",
      "author": "annabeth",
      "author_url": "",
      "date": "2014-06-12 08:35:06",
      "content": "When i put my stove on any more than low heat the tofu started to pop out of the pan. Anyone else have this experience?",
      "parent": "0",
      "gravatar_hash": "bc5bb24d44b2d123df0dd79624452e08"
    },
    {
      "id": "936578",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-06-12 08:48:44",
      "content": "The only reason I can imagine it popping out of the pan is if you have a lot of moisture causing steam bubbles. Be sure and dry the tofu very thoroughly and let us know if that helps.",
      "parent": "936567",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "983953",
      "author": "Cathy",
      "author_url": "",
      "date": "2014-07-27 18:17:33",
      "content": "This made any absolutely delish cripy fried tofu! And adding the sauce at the end (rather than marinating) made it oh so yummy! I don't think I'll be making tofu any other way moving forward lol",
      "parent": "0",
      "gravatar_hash": "db87de7c71ce1c4309b5c0d3cd090c4b"
    },
    {
      "id": "1001743",
      "author": "Sunshine",
      "author_url": "",
      "date": "2014-08-05 14:31:31",
      "content": "I am a tofu junkie - if that's even possible....but I love tofu. The first time I tried tofu was about 25 years ago, and my whole world changed... at the time I lived in Atlanta and had my very first visit to the Rainbow Restaurant/health food grocery store near Emory...and when I tell you my meal was fantastic - even that's an understatement. I have since moved and live in McDonough, Georgia, and ever so often I get a chance to go through Conyers. Well, I don't know what led me to the Silver Dragon - you probably guessed it to be an Asian restaurant, and you'd be right. It was there that I found the very best Salt and Black Pepper Tofu ever - ordered with my own special request \"spicy brown sauce\" - delish!!! The only problem is that SD isn't as clean as I'd like - the restroom reeks of crap, although I did get a peek into the kitchen and it was fairly clean - for a restaurant. Anyway, long story short, I haven't been in over a year and have tried to re-create the dish - so I am super excited to have come across Herbivoracious!!!! Thanks for everything! My apology for being so chatty.",
      "parent": "0",
      "gravatar_hash": "a315e8766933dffa1c7203c2fcd4283f"
    },
    {
      "id": "1002183",
      "author": "Phoebe Jones",
      "author_url": "",
      "date": "2014-08-05 19:27:15",
      "content": "Hello Sunshine,  Being a tofu junkie, do you know tofu not only comes in extra soft, soft, semi firm, firm, extra firm, it comes in dried or fresh, in various form such as dried stick, crispy or soft sheets, thin sheets like wonton wrapping, thick sheets you can cut into ribbons, toss like pasta, or bundled up as part of the stew.  If you want to explore different ways in cooking tofu, try to locate some authentic Chinese/Japanese/ Korean cookbook.  They are the expert in preparing tofu and soy bean product.",
      "parent": "0",
      "gravatar_hash": "0658f05f03deb18035d00ea59aa2b710"
    },
    {
      "id": "1002365",
      "author": "Sunshine",
      "author_url": "",
      "date": "2014-08-05 21:08:37",
      "content": "Phoebe, I am definitely a \"tofu junkie\"....and my pantry and my refrigerator are both stocked with many of the items you've listed, and I've tried many different recipes, but I wasn't able to re-create the dish from the Asian restaurant, and though I tried many times - I failed miserably. Now, I will say this - one of my favorite recipes is Pumpkin Tofu Cheesecake, my family absolutely devours it every single time I use this recipe, and I am never able to fix just one cheesecake. Try it - I am most certain you'll love it just as much as we do.",
      "parent": "0",
      "gravatar_hash": "a315e8766933dffa1c7203c2fcd4283f"
    },
    {
      "id": "1003408",
      "author": "Phoebe Jones",
      "author_url": "",
      "date": "2014-08-06 06:46:16",
      "content": "Hello Sunshine,  Would you care to share your 'tofu pumpkin cheese cake' recipe with me, I have a 27 years old son also crazy about anything tofu.  One of dishes I prepare often is 'steamed tofu with black bean &amp; garlic sauce (home made is better, but store bought will work)', steam over boiling water until hot (5 min.) &amp; serve.  Quick, easy, low fat &amp; high protein. Being a Chinese descent, tofu is probably in my blood.  I know of a Japanese girl in my daughter's class in high school, her lunch was opening up a package of plain tofu (comes in a rectangular tub in our area), ate it like jello-pudding.",
      "parent": "0",
      "gravatar_hash": "0658f05f03deb18035d00ea59aa2b710"
    },
    {
      "id": "1003784",
      "author": "Sunshine",
      "author_url": "",
      "date": "2014-08-06 10:08:33",
      "content": "Oh, why sure Phoebe, I am more than happy to share the recipe - I must also say that I have no clue where the recipe came from and I pretty much tweak the recipe to adjust the sweetness and enhancement of other flavors, and also make sure your cold ingredients are at room temperature:\nPumpkin Tofu Cheesecake-\n2 cups of graham cracker crumbs (16 whole crackers - more or less)\n6 tbs slightly softened soy margarine (soy butter)\n1 1/2 Ibs of silken tofu (I used soft and sometimes extra soft too!!! and I used 16 oz's)\n1 1/4 cups of sugar (I used a mixture of Agave nectar/Turbinado/ and a small amount of Raw sugar, I suggest tasting and then adjust the amount of sweetener accordingly).\n1 cup of fresh or canned pumpkin (I used a bit more).\n1 tsp ground cinnamon\n1/2 tsp ground nutmeg\n1/4 tsp ground cloves\n12-16 oz soy cream cheese\n1 tbs pure vanilla extract\n1 lemon (juiced)\n\nPut graham crackers in a food processor on high until finely ground, add soy butter to crackers until the mixture looks like coarse crumbs. Place the mixture in a thick layer at the bottom of n 8 inch springform pan , or or in thinner layers in the bottom of 2 nine - inch pie plates (this is what I do),or purchase a graham cracker crust. Set aside.\n\nNext start on the filling, make sure all ingredients are at room temperature. Preheat the oven to 325 degrees.\n\nIn a food processor or blender, which ever you have, puree the tofu until smooth, add pumpkin, sugar, spices, soy cream cheese, lemon juice, and extract, process until smooth, make sure to scrape down the sides as you go along.\n\nAfter you've adjusted your sweetness and other flavors to your liking, pour the tofu mixture into the prepared pie crusts, and bake for about 50 minutes (depends on your oven), until the cheesecake is firm (we don't like ours extremely firm - but it still tastes great - you can't really even taste the pumpkin).\n\nNow, most importantly!!!! Turnoff the oven and leave the cheescake in the oven for 1 hour, afterwards remove it from the oven and then cool to room temperature. Then if you like refrigerate overnight, and serve slightly chilled. Now, this works for most, but in my family once i remove it from the oven - well it's a done deal - with a couple scoops of vanilla flavored soy ice cream, delish!!! And in all honesty I actually re-heat this delicious treat after it has been refrigerated -even better, please let me know how you it turn out and how you like it. Oh and I hope my instructions aren't confusing! Just let me know.",
      "parent": "0",
      "gravatar_hash": "a315e8766933dffa1c7203c2fcd4283f"
    },
    {
      "id": "1005693",
      "author": "Phoebe Jones",
      "author_url": "",
      "date": "2014-08-07 06:26:17",
      "content": "Hello Sunshine,  There are lot of tofu dessert in Asia cuisine, but I have yet come across 'cheese cake', will definitely try it and report back to you.  Thank you.",
      "parent": "0",
      "gravatar_hash": "0658f05f03deb18035d00ea59aa2b710"
    },
    {
      "id": "1006104",
      "author": "Sunshine",
      "author_url": "",
      "date": "2014-08-07 10:13:30",
      "content": "I am so super excited that you are going to try the cheesecake and will sit on pins and needles until I get an email. I did forget to mention that if you don't like lemon - don't use it. Do you have any other Asian dessert recipes that you'd like to share (with tofu as an ingredient - of course), I'd love to try a few out.",
      "parent": "0",
      "gravatar_hash": "a315e8766933dffa1c7203c2fcd4283f"
    },
    {
      "id": "1010896",
      "author": "Phoebe Jones",
      "author_url": "",
      "date": "2014-08-09 13:47:40",
      "content": "Hello Sunshine, Most Asian (living in Asia) do not consume milk or milk products, soy milk (often sweetened) are regularly consumed as daily drink, and flavours are almost never added.  You might want to try making dessert such as panna cotta, mousse, ice cream using soy milk in place of dairy milk (it is not good for you anyway).  Also using unsweetened soy milk as soup base for cream soup works well.  Add one pkg of plain gelatin in 2 cups of soy milk (sweetened or unsweetened), to make tofu pudding, fruit puree/berries/maple syrup etc. can be use as topping of unsweetened kind.  I believe more people will enjoy tofu if they accept tofu as tofu, not a substitute for something else (i.e. fake meat).  I have a suggestion for a salad: caprese salad using firm tofu top with a pesto dressing.  what do you think? A last suggestion, have you considered  using mango (ataulfo, can also be find in can pulp from India store) puree is place of pumpkin?",
      "parent": "0",
      "gravatar_hash": "0658f05f03deb18035d00ea59aa2b710"
    },
    {
      "id": "1011141",
      "author": "Sunshine",
      "author_url": "",
      "date": "2014-08-09 16:17:28",
      "content": "I hope others in the forum will try these really delicious sounding recipes. I think.... I will switch a few ingredients around per your recommendations. Also, I totally understand about milk, I've been lactose intolerant for over 26 years now, so, I always find a substitute for dairy items. I've never tried a mango puree in place of the pumpkin but it sounds like a delightful idea - I'm open to it. Excellent idea for the salad, thanks - it's definitely doable for my family..I have to be careful with the tomatoes....I'll let you know how it turns out.",
      "parent": "0",
      "gravatar_hash": "a315e8766933dffa1c7203c2fcd4283f"
    },
    {
      "id": "1040828",
      "author": "Ari",
      "author_url": "http://Aritreschic.blogspot.com",
      "date": "2014-08-21 13:40:25",
      "content": "What kind of sauce can I make to go with?",
      "parent": "0",
      "gravatar_hash": "270ca2386022ca1766c0dda41e3793f8"
    },
    {
      "id": "1050031",
      "author": "A. Perez",
      "author_url": "",
      "date": "2014-08-25 21:43:27",
      "content": "Thats called dry frying Tofu! Its something you rarely hear about but it makes the Tofu (If done right) absorb the marinade like a sponge. The First time I did it the Tofu was so fantastic (Just make sure your marinade is the right strenght) and once dry fried you can freeze it or put it in the fridge (Flavorless) till your ready for your marinade..So along with the freezing method you get a tofu that will taste fantastic..Its a little tricky at first but once you get the hang of it (especially keeping the heat REALLY LOW!) You will never go back..Search for Dry Fry Tofu on google and there will be one website that has a lot of info and very detailed instructions..\nIm assuming its not popular cause people lack patients but once you get how to do it I just did large batches of it...You definatly can end up with fantastic tasting Tofu steaks!!",
      "parent": "214375",
      "gravatar_hash": "8398aac60570dafbfec246fda1079c98"
    },
    {
      "id": "1050080",
      "author": "A. Perez",
      "author_url": "",
      "date": "2014-08-25 21:59:26",
      "content": "Any good Tofu Shops in the Los Angeles, California area or surrounding cities? We have  a lot of Asian communities and even large Asian markets but I have yet to find Fresh Tofu or Soy Milk or temphe (I can make all 3 but too much work when your disabled) I think its funny that in the Los Angeles area there doesnt appear to be any...\nIm assuming that most stores dont want to buy the fresh when they can get the cheaper prepackaged ones and Mom and Pop stores probably cant compete with em..Even Whole Foods doesnt have fresh...\nIve looked so if anyone knows...Let me know...Im in Pasadena but thats just a quick train ride to LA and the surrounding cities by Freeway...\nemail me if you know where..\napap2@sbcglobal.net  Tony",
      "parent": "0",
      "gravatar_hash": "8398aac60570dafbfec246fda1079c98"
    },
    {
      "id": "1051136",
      "author": "Phoebe Jones",
      "author_url": "",
      "date": "2014-08-26 07:28:32",
      "content": "Hello A. Perez,  There is a made in China/Taiwan small appliance on making soy milk/almond milk/sesame dessert, costs around $80 CAN, very convenient, take the hard work out of soy milk making &amp; hence homemade tofu, when fresh soy product isn't readily available.",
      "parent": "0",
      "gravatar_hash": "0658f05f03deb18035d00ea59aa2b710"
    },
    {
      "id": "1104502",
      "author": "Nichole",
      "author_url": "http://trumpetflowers.com",
      "date": "2014-10-09 08:44:04",
      "content": "Hi again Michael,\nYou know, of course; that I have tried your great process and it works fantastically! \nThis is the way to do tofu! \nBut it leads me to ask of you a question, and you being a professional Chef, may know the answer.\nSay I soaked the tofu in soy sauce? Since soy sauce is very salty, would it give me the same effect? Or would I need to add salt to it as well? Also, the entire reason for thinking this, is would it impart any flavor (along with the crisp when fried) to the tofu, or is this thought just a waste of ingredients and time?\nThanks Michael,\nNicci",
      "parent": "0",
      "gravatar_hash": "9372aae49ce746794d69e299190ebcbe"
    },
    {
      "id": "1104596",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-10-09 10:21:12",
      "content": "That's an interesting question. Soy sauce is certainly salty enough, but I can't say I've noticed that \"tightening\" effect when tofu is marinated in soy. So I'm not sure - if you decide to run some tests, let us know how it turns out!",
      "parent": "1104502",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1146937",
      "author": "Len",
      "author_url": "",
      "date": "2014-11-15 17:50:24",
      "content": "Thank you for the recipe (I think). :) I don't usually cook, but after preparing the tofu for dinner tonight, my wife insists that I start cooking twice a week. It really was delicious.",
      "parent": "0",
      "gravatar_hash": "5a387e87deb5e8dc7cf49753b6893669"
    },
    {
      "id": "1218693",
      "author": "Celestial",
      "author_url": "",
      "date": "2015-01-09 20:01:41",
      "content": "Thanks for the salt idea! I made some tofu for the first time and it tasted really great!! :D",
      "parent": "0",
      "gravatar_hash": "814282c26f2498cc38b4885e84452ebc"
    },
    {
      "id": "1249037",
      "author": "James",
      "author_url": "http://none",
      "date": "2015-02-05 14:32:24",
      "content": "I have been making my own tofu with Soy Milk I make myself.  It is not hard to do and a real deal of satisfaction of having your own!",
      "parent": "25318",
      "gravatar_hash": "01a19c9879c2b60d14eefa96adc9bcb9"
    },
    {
      "id": "1259981",
      "author": "Becknob",
      "author_url": "",
      "date": "2015-02-20 12:57:45",
      "content": "I tried this the other day and it was SO YUM!  :) Thanx!",
      "parent": "0",
      "gravatar_hash": "abd75789c98be4df5926ca6f843cfc5c"
    },
    {
      "id": "1296459",
      "author": "Paula",
      "author_url": "",
      "date": "2015-04-15 18:39:24",
      "content": "Thanks so much for sharing this method!  The boiling salted water really does the trick.  I coated the tofu with Emeril's seasoned panko crumbs before frying to add some flavor and the result was crispy and delicious.",
      "parent": "0",
      "gravatar_hash": "2d89c38a0a37f11e52bb6321b63fed91"
    },
    {
      "id": "1298109",
      "author": "Linda",
      "author_url": "",
      "date": "2015-04-21 15:25:20",
      "content": "I have never cook tofu before. I am so glad I look on how to cook it and found this post. Thank you for all the good advise on the post, and even in the great comments.",
      "parent": "25311",
      "gravatar_hash": "dbcda44fc47ab39687b03a8957629e22"
    },
    {
      "id": "1300325",
      "author": "David I",
      "author_url": "",
      "date": "2015-04-27 08:00:31",
      "content": "I like Indian food, but...\n\nEven though India has the largest per-capita population of vegetarians, it also has the highest rate of heart attacks in the world.",
      "parent": "25726",
      "gravatar_hash": "7e935ed81bd2203bcbf8560db2ac0030"
    },
    {
      "id": "1301104",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2015-04-28 05:44:29",
      "content": "That doesn't appear to be true.. more like #37:\n\nhttp://www.worldlifeexpectancy.com/cause-of-death/coronary-heart-disease/by-country/",
      "parent": "1300325",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1305567",
      "author": "ali",
      "author_url": "",
      "date": "2015-05-07 13:43:44",
      "content": "nice",
      "parent": "0",
      "gravatar_hash": "aaa70bae2a0943dee9ffd8fdb740f33e"
    },
    {
      "id": "1314114",
      "author": "AreYouKiddingMe",
      "author_url": "",
      "date": "2016-02-24 11:51:23",
      "content": "This is all too much work. Just take a dishtowel, wrap the block of tofu in it and massage some of the water out, cube it, then stick it in the oven on a LIGHTLY greased nonstick cookie sheet at 375. 45ish minutes later, it's crisp. No need to fry it to death, American-style.",
      "parent": "0",
      "gravatar_hash": "b5d0df73b42b9e7d4bd8eab501defe30"
    },
    {
      "id": "1314128",
      "author": "Pipes",
      "author_url": "",
      "date": "2016-03-22 17:22:22",
      "content": "Where in DC/VA/MD area can I found fresh tofu?",
      "parent": "0",
      "gravatar_hash": "c14ffdc592f6bcbb5da4c4043b5e2928"
    },
    {
      "id": "1314147",
      "author": "Karmah",
      "author_url": "",
      "date": "2016-04-24 17:21:11",
      "content": "Don't buy ANY of this, I followed the instructions to the letter and ended up with a handful of blisters (from adding the tofu to a high heat pan), black tofu (almost immediately) and every smoke detector in the house going off (triggering an asthma attack in me). I spent many hours trying to be certain my tofu was dry enough to perfect this recipe, and now I'm sitting here with just a few pieces left and on the verge of an hospital visit. \"Highest heat, my ass!\".",
      "parent": "0",
      "gravatar_hash": "11e2838538f1187e5a2be86a56656dcc"
    },
    {
      "id": "1314177",
      "author": "Red",
      "author_url": "",
      "date": "2016-06-22 17:13:29",
      "content": "I just found this site while Googling \"perfectly seared tofu.\" I'm going to try this method tonight with Tofurky Barbecue Chik'n, and hope the results are good--I'm pretty excited about it! Glad I found you guys, and I will definitely be back!",
      "parent": "0",
      "gravatar_hash": "02235c2edf83cb7ae596b31ebafaa78d"
    },
    {
      "id": "1314239",
      "author": "Rose",
      "author_url": "",
      "date": "2016-12-06 18:47:49",
      "content": "Hi Michael, Could you explain a little more what you mean by \"pouring boiling salted water over\" the tofu and then letting it sit for 15 minutes? Do you mean to imply the tofu is in a strainer and the water is poured over (and passed on down the drain) and then the tofu sits for 15 minutes, or, do you mean pour the boiling salted water over the tofu and let the tofu sit in it for 15 minutes? \n\nThank you! I want to try this but not real clear on this one instruction. Rose",
      "parent": "0",
      "gravatar_hash": "0c9110897342b2e528e1c12ea57d7058"
    },
    {
      "id": "1314240",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2016-12-06 19:20:45",
      "content": "Oh, good question. I mean put the tofu in a bowl, pour the salted boiling water over it, let it stand 15 minutes, then drain in a strainer and proceed.",
      "parent": "1314239",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314241",
      "author": "Rose",
      "author_url": "",
      "date": "2016-12-06 22:55:23",
      "content": "Thank you for the reply. I made this tonight. It was good but I think I over cooked it a little bit. Next time I will make the tofu a little thicker. Thank you for the great post and the clarification.",
      "parent": "1314240",
      "gravatar_hash": "0c9110897342b2e528e1c12ea57d7058"
    },
    {
      "id": "1314257",
      "author": "A. Perez",
      "author_url": "",
      "date": "2017-01-08 12:37:07",
      "content": "Make sure its the firmest tofu you can get! And dont use silken Tofu! You want the kind thats a block sitting in a pool of liquid...\nTip about dry frying tofu:\n\nThe heat must be VERY low. You arent cooking the tofu..your essentially slowly removing the moisture from it...Too high will cause burnt tofu..Good non stick skillet is essential...\nFreezing the tofu first is good. The squeezing out water..Then you dry fry it...\n\n\nif done right the tofu becomes like a sponge in that it soaks up the marinade all the way in. You can do it ahead of time and then refrigerate.. Dont know if freezing it would affect it..(Maybe after dry frying but before the marinade??)",
      "parent": "0",
      "gravatar_hash": "8398aac60570dafbfec246fda1079c98"
    },
    {
      "id": "1314298",
      "author": "Soymoon",
      "author_url": "",
      "date": "2017-04-30 15:06:56",
      "content": "Excellent advice!\nJust wanted to recommend Milwaukee's fresh tofu company:\nThe Simple Soyman makes fresh, organic Tofu!\nIt has a wonderful texture and a good clean flavor.\nNext time you are in Wisconsin, check them out!",
      "parent": "0",
      "gravatar_hash": "2ea28c9bc48e759dc913a810ef34911d"
    },
    {
      "id": "1314338",
      "author": "JJ McClanahan",
      "author_url": "",
      "date": "2017-07-18 13:20:32",
      "content": "Thanks for the tips on cooking tofu - this really worked for me and now it's the right texture!  I am using it in a Panda Express copycat recipe for their string bean chicken dish instead of the chicken and it's perfect for that!",
      "parent": "0",
      "gravatar_hash": "f23125f206446346656336f4b6727b40"
    },
    {
      "id": "1314352",
      "author": "bill marsano",
      "author_url": "http://pouredwithpleasure.com",
      "date": "2017-08-22 07:47:55",
      "content": "Here in Manhattan we have an abundance of Asian markets, so I've thought of making my own tofu from soy milk (unsweetened). Has anyone done that? I'm not up to starting from soy beans--not just yet, anyway. Anyone done that. My idea was to add herbs/spices at the beginning. (Have had zero success with marinades.) Also, will try the boiling salted water and the oven-baking methods. My favorite tofu supplier s Tung Woo, on the north side of Grand St just west of Bowery. Very close to the impressive Greek-columned bank that is now called Capitale. TW isn't a storefront as it doesn't even have a front. They just roll up the riot-shutter and there you have it--a cavernous space like a suburban 2car garage. Across the front is a simple counter. Behind it are a couple of iceboxes and lots of 5gallon plastic pails full of tofu.For a buck you can get 4 slabs of firm tofu, enough to fill a 1quart Chinese take-out carton (the old-fashioned kind with the wire handle). Almost all the customers are Chinese from the neighborhood, which suggests that it's good stuff, not just cheap.",
      "parent": "0",
      "gravatar_hash": "712af55e0312b36db1741de8fbac78d7"
    },
    {
      "id": "1314353",
      "author": "Phoebe Jones",
      "author_url": "",
      "date": "2017-08-22 15:16:06",
      "content": "We are the lucky folks living in Vancouver BC Canada, has the largest Asian population north of San Francisco (maybe not Toronto).  I know of no one bothering making their own tofu.  It will take you a long time to consume the large quantity you will be making, and tofu does not keep well.  Commercial made tofu is usually vacuum sealed.  If you would like to experiment with small quantity, try if you can by a 'kit\" from Japanese store, I believe.  Chinese tofu is set with small quantity of 'plaster of Paris' which can be purchased from Chinese herbal store",
      "parent": "0",
      "gravatar_hash": "0658f05f03deb18035d00ea59aa2b710"
    },
    {
      "id": "1314390",
      "author": "Jen E",
      "author_url": "",
      "date": "2017-09-04 07:48:07",
      "content": "I can never cook tofu right it always sticks in my pans. I have used a cast iron skillet, non stick, ceramic etc. always sticks.",
      "parent": "0",
      "gravatar_hash": "b39cdfb047482c6ce2e1aaa62b188c71"
    }
  ]
}