{
  "comment_count": 56,
  "comments": [
    {
      "id": "16089",
      "author": "Z.Grimm",
      "author_url": "http://grimmreality.wordpress.com",
      "date": "2012-01-04 07:30:40",
      "content": "I'm trying to convert myself to a more plant-centric lifestyle, but my omnivorous boyfriend is reluctant to compromise with me on meals, feeling that I'm not going to get enough protein from a vegetarian diet.  I think he's overreacting.  From what I've read, it's exactly as you've suggested - if you're eating enough, you're most likely already getting enough protein.  Just eat wisely!",
      "parent": "0",
      "gravatar_hash": "9f8f3dc9f893f5fa7668e84e9d312f26"
    },
    {
      "id": "16092",
      "author": "RLB",
      "author_url": "",
      "date": "2012-01-04 07:34:46",
      "content": "Nice post. I agree that this is the last thing most people should be worried about. I am not a vegetarian, but I eat vegetarian dinners at least twice a week (and leftovers for lunches) - if not more now that I am pregnant and meat is less appealing - and I have never worried about it at all. I love your ideas and the recipes I've made from here so far have been great.",
      "parent": "0",
      "gravatar_hash": "9eca23b634740948002e7ffea4706087"
    },
    {
      "id": "16094",
      "author": "Becca @ Amuse Your Bouche",
      "author_url": "http://www.amuse-your-bouche.blogspot.com",
      "date": "2012-01-04 07:48:35",
      "content": "I totally agree with everything you said! A lot of people assume that if you're not eating a massive pile of beans for dinner every day, you're not getting enough protein - but while some foods are obviously a lot higher in protein than others, protein can hid in places you wouldn't even consider!",
      "parent": "0",
      "gravatar_hash": "3b9efc269735cb16a43c4048130219de"
    },
    {
      "id": "16097",
      "author": "Emily H.",
      "author_url": "http://www.emilyhorner.com",
      "date": "2012-01-04 08:03:36",
      "content": "I do worry about protein! I don't always eat a variety of food that I love, is the thing. If I'm too busy to cook, and too busy to go to Whole Foods rather than the suspicious-produce tiny grocery store near my home, then I eat a lot of grilled cheese sandwiches and freezer pizzas, which I guess makes me the stereotype of a bad vegetarian. But aside from being a bit fat (which I'm okay with), my health and energy levels seem fine after 2 and a half years of being a vegetarian...",
      "parent": "0",
      "gravatar_hash": "749b650a638ee366fcefe23851844ff8"
    },
    {
      "id": "16101",
      "author": "Ambuja",
      "author_url": "",
      "date": "2012-01-04 08:11:15",
      "content": "I have been a lifelong vegetarian, one of those 40% from India. Have never eaten meat and i get asked this question all the time. I now live in the US, married to an American. My in-laws recently started eating vegan to control their cholesterol and they worry about this all the time as well. I have always tried to explain that Indian food has evolved over many hundreds of years into a well balanced meal with dhals and lentils and beans and that it quite easy to meet your daily requirement of protein eating vegetarian. But they continue to worry about it all the time!",
      "parent": "0",
      "gravatar_hash": "65ea274f7954e60f35d6aef49cbf625a"
    },
    {
      "id": "16103",
      "author": "Sarah",
      "author_url": "",
      "date": "2012-01-04 08:24:17",
      "content": "From my own experience I find that Americans worry much more about the \"protein question\" than many Europeans. I have lived in different countries across Europe and never did I get asked this question, whereas when I was living in the States, people were worried about my protein intake all the time. Maybe it has got something to do with different ways nutrition is promoted in the media and by the government...",
      "parent": "0",
      "gravatar_hash": "8a6fa90f14b7f89b2a70c737ad16dd23"
    },
    {
      "id": "16104",
      "author": "Spanish Steps",
      "author_url": "http://rusticfare.blogspot.com/",
      "date": "2012-01-04 08:28:36",
      "content": "Good article and answer about protein!\n\nI have been a vegetarian for more than twenty two years now. I feel pretty healthy for my age while other younger friends have some health issues. Americans get too much protein in their food. That's why they worry when they change their diet. It wasn't an issue for me. Actually, I don't even count.   \n\nQuestion... what's persniquaquon?",
      "parent": "0",
      "gravatar_hash": "b9dfaa75ac880dc496999c2ff65d2d49"
    },
    {
      "id": "16105",
      "author": "Nilam",
      "author_url": "http://khavanu.blogspot.com",
      "date": "2012-01-04 08:32:33",
      "content": "Excellent post. As a fellow veg (one of those in the 40%) I don't worry about protein either - but I know that I have always relied on meal planning. A lot of the examples you posted are also great sources of fiber, iron, calcium, and other B vitamins, while being low (or having no) in saturated fats and cholesterol (not including cheese or eggs). Some of these foods are often healthier than meat-based proteins, because of the other nutrients they carry. Not to focus too heavily on nutritionism =) just that I think it's helpful to point that out every once in a while. Plus veg based proteins are so much easier to cook with, and cleaner.",
      "parent": "0",
      "gravatar_hash": "39a80437f59150fc64ae46179001398a"
    },
    {
      "id": "16106",
      "author": "kenny hamm",
      "author_url": "http://bikedoc.com",
      "date": "2012-01-04 08:38:19",
      "content": "I'm 57 yo male a bike mechanic who  rides 5000 miles a year.    Been a vegan 30 years. Regular doctor visits with blood test.   Never a low protein count.  Not enough protein in a veggie diet is just another meat industry myth.",
      "parent": "0",
      "gravatar_hash": "606c66ba4973d0fa539bead99dcbb9e8"
    },
    {
      "id": "16107",
      "author": "Silvia",
      "author_url": "http://mushitza.blogspot.com",
      "date": "2012-01-04 08:47:19",
      "content": "I'm always amazed of all the stupid questions I receive about being a vegetarian, but my favourite is \"When you don't eat meat, then what do you eat?\", as if there could be nothing else. Besides I've noticed people always think I should eat enormous quantities to get enough, which actually isn't true.\nVery good article!",
      "parent": "0",
      "gravatar_hash": "fdb55b5801e340053e459d0cc0fa8307"
    },
    {
      "id": "16109",
      "author": "eva @VegucatingMyKid",
      "author_url": "",
      "date": "2012-01-04 08:56:12",
      "content": "i can't remember who i heard this from, but it definitely was a thought leader, and it's stuck with me...\n\nhere's the gist of it....it goes something to the effect that there are full wards in hospitals devoted to cardiac patients, diabetic patients, cancer patients....there are tons of medications that are for these diseases too...have you ever heard of a part of a hospital dedicated to people who are protein deficient? why are there not pharmaceuticals being developed for people with protein deficiencies?...\n\nif vegans did not get enough protein and suffering because of it, we'd hear about it...if not in mainstream media, at least in our virtual vegan communities...\n\nso i use this when i really feel like getting into a conversation with someone who is 'concerned for me'--like my parents",
      "parent": "0",
      "gravatar_hash": "b8db197b1128c281926bef4c91ad418b"
    },
    {
      "id": "16110",
      "author": "Avory",
      "author_url": "http://shortcut-to-mushrooms.blogspot.com",
      "date": "2012-01-04 09:01:50",
      "content": "I don't think you're totally off base, but I do think that this varies a lot among vegetarians.\n\nWhen people ask the \"but how do you get your protein??\" question, I do think there's a fundamental misunderstanding about vegetarianism there.  You're right that it's perfectly easy to get protein in a vegetarian diet, particularly if you're a relatively healthy eater and particularly if you cook regularly.  However, it can be a challenge for some of us.\n\nI grew up in a Diet for A Small Planet family, and my father is excellent at (when he tries) cooking in this well-balanced, healthy-without-thinking-about it way.  A typical dinner might include grains, legumes, and vegetables.  I enjoy eating this way too, but when you get home an hour before bedtime, often it's too much work to chop up and steam a couple of vegetables, cook some rice, heat up some beans, eat, and do the dishes.  There are shortcuts, and I try whenever possible to do weekend cooking to eat throughout the week, but for me a typical day doesn't include 55 g of protein (about what I need, too).  Whenever I've tracked protein I've ended up between 20-30 g, 40 if I'm really trying.  That's because most cheap convenience foods don't have much protein.  Bread and cheese or peanut butter do have some protein, but it's still difficult.  I don't really worry about it, as I don't feel sick or have health problems that I know of, but it is something I'm aware of.",
      "parent": "0",
      "gravatar_hash": "b44f3621e7bbb5e64b0176cb54742bae"
    },
    {
      "id": "16119",
      "author": "YumVeggieBurger",
      "author_url": "http://yumveggieburger.com",
      "date": "2012-01-04 10:51:37",
      "content": "This is such a great post!  Thanks :)",
      "parent": "0",
      "gravatar_hash": "0f0ad3a1c3190cfbd27e1ea646398667"
    },
    {
      "id": "16121",
      "author": "amee",
      "author_url": "http://www.rabbitfoodrocks.blogspot.com",
      "date": "2012-01-04 11:05:52",
      "content": "So true michael!!!  I submitted a similar post on Switch2veggies a while back with some of the same things!  (and my recipe for Chana masala or Chhole)  Great minds!!!  \n\nhttp://switch2veggies.com/guest-post-high-protein-veg-meals-for-the-day/\n\nThanks for tweeting and posting this.  Too important not to!",
      "parent": "0",
      "gravatar_hash": "22476a0ce17918636d3355926c514729"
    },
    {
      "id": "16128",
      "author": "Jolly Rodger",
      "author_url": "",
      "date": "2012-01-04 12:46:13",
      "content": "\"The results suggest also that the minimum protein intake federal health officials currently recommend—46 grams per day for women and 56 grams per day for men—may not be enough to maintain muscle mass in some people. The study participants needed to consume at least 78 grams of protein per day to avoid losing muscle, Bray and his team found.\"\n\nRead this today... http://www.cnn.com/2012/01/03/health/too-little-protein-too-much-fat/index.html",
      "parent": "0",
      "gravatar_hash": "1d1821cfe25bff0004e944eb1d04795d"
    },
    {
      "id": "16129",
      "author": "Joelle",
      "author_url": "",
      "date": "2012-01-04 13:00:19",
      "content": "Kind of an unrelated question, but I notice that tofu is included pretty frequently.  Do you ever worry about the hormone levels in tofu/unfermented soy in your diet?",
      "parent": "0",
      "gravatar_hash": "d3ac785ecd3ad68cf397c5a7055361d6"
    },
    {
      "id": "16131",
      "author": "Kathleen",
      "author_url": "",
      "date": "2012-01-04 13:15:03",
      "content": "Spot on!  I think another mental hurdle for people is iron, as many don't realize there are other iron sources than red meat.  The only time I've known protein concerns to be related to vegetarianism was with pregnancy and breastfeeding, since intake does need to be higher.  But it's still not hard to do.  A couple of spoonfuls of almond butter in the middle of the night- yum!- and baby feeding commenced!",
      "parent": "0",
      "gravatar_hash": "1ea4b5a6e347e926817bc6696a576065"
    },
    {
      "id": "16134",
      "author": "Rainier Wolfcastle",
      "author_url": "",
      "date": "2012-01-04 13:47:26",
      "content": "Please please please please don't say \"1/3 of a package of tofu\". Tofu comes in at least packages of 6, 8, 9, 10, 11, 12, 14, 16, 20, and 24 ounces, and those are only the ones I've personally seen. So your \"1/3 of a package\" could be anywhere from 2oz to 8oz.\n\nThis is part of my campaign for European-style weight (or at least volume) measures in recipes, as opposed to completely meaningless measures like \"one medium onion\" or \"a can of tomatoes\".\n\nThank you for listening to me whine about one of my pet peeves.",
      "parent": "0",
      "gravatar_hash": "aecfbd5f79cdb93170da3d5495ccd969"
    },
    {
      "id": "16137",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-04 14:10:09",
      "content": "> Persniquanquon\n\nA made up name... just trying to make my \"disclaimer\" sound like a humorous version of a drug company ad.",
      "parent": "16104",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "16138",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-04 14:10:53",
      "content": "I like it!",
      "parent": "16109",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "16139",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-04 14:12:50",
      "content": "Right, I agree, although I think the issue of finding ways to eat healthy balanced meals while under the time pressure that is so common in our society applies to pretty everyone, not just vegetarians. That would be a good separate post on strategies for eating healthy and delicious food when you don't have much time to cook.",
      "parent": "16110",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "16140",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-04 14:13:56",
      "content": "Indeed! We are very much on the same page. But hey you got to 87 ;) !",
      "parent": "16121",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "16141",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-04 14:16:41",
      "content": "Right, that is exactly the sort of flavor-of-the month nutritional advice I make very sure to tune out. Name any nutritional theory, no matter how outlandish and I can find you a study that proves it and another that debunks it. That particular study is of just 25 people, and they intentionally ate 1000 calories too much and didn't exercise! Again, not to say there isn't a role for science, but I'll take mine in data that accumulates over the course of decades.",
      "parent": "16128",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "16142",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-04 14:17:37",
      "content": "Personally, no, I don't worry about it, but I also haven't looked into it at all. I do love me some tofu, but I probably average no more than say 14 ounces a week of it.",
      "parent": "16129",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "16143",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-04 14:18:56",
      "content": "Right you are! I was thinking of the 14 once packages, the common plastic tub you will find in the refrigerator section of most groceries.",
      "parent": "16134",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "16155",
      "author": "Elana",
      "author_url": "http://theinventivevegetarian.blogspot.com",
      "date": "2012-01-04 15:35:46",
      "content": "This is the number one thing everyone always asks me!  I used to immediately begin listing nuts, beans, dairy, anything I could think of!  Then I started studying nutrition, and now my response is usually something along the lines of \"you don't need nearly as much protein as Americans tend to think,\" and I leave it at that.  Sometimes I add in that a serving of broccoli has 4 grams of protein in it, because I think it's one my favorite protein fun facts.  People who eat meat three times a day don't seem to understand that you don't actually NEED to eat that much.",
      "parent": "0",
      "gravatar_hash": "eec6094145be5861ed0d8e9109ecddfb"
    },
    {
      "id": "16190",
      "author": "Sarah @ pão e queijo",
      "author_url": "http://www.paoequeijo.typepad.com",
      "date": "2012-01-04 19:58:43",
      "content": "I couldn't agree more with what you've said here.  Many people question my nutrition, especially because I'm naturally pretty pale they think I'm anemic.  Well, I just got tested, and no anemia!  I find vegetarians usually eat a wider variety of foods than meat eaters, which is probably very good.  \n\nAlso, about nutrition, I would completely agree.  I don't want to underestimate the science, but there is so little we actually know about the way our body processes food, and every couple of years nutrition finds a common enemy to blame for health problems (I call these fads).  My solution?  Like Michael Pollan says in Food Rules, eat as much unprocessed food as possible, and a plant-based diet filled with variety.",
      "parent": "0",
      "gravatar_hash": "93112733509471b71342b45f0fdabf1e"
    },
    {
      "id": "16191",
      "author": "Marina",
      "author_url": "http://www.cowboycountryvegetarian.blogspot.com",
      "date": "2012-01-04 19:59:25",
      "content": "Thank you for this post! I had a silly idea some time ago, after being asked \"Where do you get you protein?\" ten times a day, to make a t-shirt with answer to this I believe not a very smart question. Why  the people in this part of the World are so obsessed with how much of protein, carbs, etc they need?",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "16205",
      "author": "Diana",
      "author_url": "",
      "date": "2012-01-04 22:01:08",
      "content": "I've been really curious about using nutritional yeast for protein.  It has a lot of complete protein and also B-vitamins.  I put it in mashed potatoes and on spicy fried tofu.  I don't like the regular health food kind of recipes for using it too much. I wish I knew what to do with it.  Michael, have your ever considered trying to make a recipe with nutritional yeast?  Would you ever consider it?",
      "parent": "0",
      "gravatar_hash": "079d9612024d0d82814c9974d1bc197e"
    },
    {
      "id": "16215",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-04 23:16:02",
      "content": "I remember eating nutritional yeast on popcorn years ago, where it lends a pleasing sort of lactic acid flavor (kind of generic cheese flavor). It never occurred to me to use it beyond that.  I tend not to use ingredients just to to try and boost nutritional value, but if I thought it was the best flavor in some spot, I'd use it. I could see where it would be good on mashed potatoes!",
      "parent": "16205",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "16289",
      "author": "Ivy",
      "author_url": "",
      "date": "2012-01-05 12:07:27",
      "content": "I've been a vegetarian since I was ten. Only time I had to worry about protein was when I was pregnant and having trouble gaining weight because of food aversions - the doctor asked me to try to eat 100 grams of protein every day. I hadn't had trouble getting the 70 or so pregnant women need, but adding 30 more required me to pay attention to it.",
      "parent": "0",
      "gravatar_hash": "8ffab1aa866044a3f1c6d9335439e002"
    },
    {
      "id": "16374",
      "author": "Laura",
      "author_url": "",
      "date": "2012-01-06 07:27:52",
      "content": "What a great post; those are definitely the top two questions I hear as well. I also never count up my protein or fat, etc. I know pretty much everything contains a certain amount and as long as I'm not eating junk all day, I should be able to get everything I need. Your calculations (i.e. this post) will be something I reference when I want to get my point across more clearly, thanks for that :)",
      "parent": "0",
      "gravatar_hash": "f5350782dd1f4476feec48f0d36a8e89"
    },
    {
      "id": "16495",
      "author": "The Cozy Herbivore",
      "author_url": "http://thecozyherbivore.blogspot.com",
      "date": "2012-01-07 13:55:22",
      "content": "Fantastic article-- I'm totally posting it on my facebook page! People just can't seem to understand that a varied diet that is heavy in vegetables and whole grains, with healthy fats and limited sugar provides everything a healthy person needs. No need to stress about calories or protein or carbs. Thanks for saying all of this so clearly!",
      "parent": "0",
      "gravatar_hash": "1d5985d7cc6f6858b98242094ff0124d"
    },
    {
      "id": "16496",
      "author": "TJ",
      "author_url": "",
      "date": "2012-01-07 14:31:03",
      "content": "Nutritional yeast is nice for things where you want to bump up a buttery flavor without adding a bunch more butter (hence on popcorn or mashed potatoes).  It's great on upma and in tofu scramble.",
      "parent": "16215",
      "gravatar_hash": "923deba1279dececbbe6ced6fd2b4555"
    },
    {
      "id": "16498",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-07 15:09:38",
      "content": "Great point! I'd never really thought of it as a buttery flavor, more cheesy, but I can see what you mean. I wonder if it would be possible to get that flavor out of it without so much of the powdery texture.",
      "parent": "16496",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "16500",
      "author": "Magic of Spice",
      "author_url": "http://www.theardentepicure.com/",
      "date": "2012-01-07 15:50:54",
      "content": "Fantastic post! I have been a vegetarian since the age of 7, and apparently did not care for meat even as a baby. You have compiled a great list here.",
      "parent": "0",
      "gravatar_hash": "3556f431797ca0cd049b93420013ed80"
    },
    {
      "id": "16589",
      "author": "Kat @ Indie Domestic",
      "author_url": "http://indiedomestic.wordpress.com",
      "date": "2012-01-08 19:55:51",
      "content": "Haha, I get asked this too - along with the \"What do you eat?!\" that other people have mentioned.  Like I eat sawdust or something.  I've been a vegetarian since I was 11 - so, 13 years - and my mom never supported the idea, so I had to find a lot of my own food.  I do think vegetarians have to be conscious of their diets, because it's easy to eat a ton of carbs and premade stuff (ick) instead of learning about vegetarian sources of protein, but once you're in the know it becomes second nature to eat a balanced diet.  Plus, it's only in the past 50 years of so that meat has become the centerpiece of ANYONE's diet, which most people don't know.  Such a shame!",
      "parent": "0",
      "gravatar_hash": "9b088ef92a51cdb06d8b59365659292f"
    },
    {
      "id": "17776",
      "author": "John",
      "author_url": "",
      "date": "2012-01-24 01:57:57",
      "content": "It's not too often people are studied and live in a controlled research environmental with diet for months though... You can say what you want about the study but that's pretty much the gold standard for science.",
      "parent": "16141",
      "gravatar_hash": "33169679d79e7cb641192dae608e3999"
    },
    {
      "id": "17778",
      "author": "John",
      "author_url": "",
      "date": "2012-01-24 02:26:15",
      "content": "And 25 is large for this type of controlled study so dismiss it as small is kind of funny. Not to mention, despite your claim, they did exercise, just not a lot... and they were studied on a weight controlling diet for a period. I wouldn't exactly say anything they concluded was outlandish, either.\nhttp://jama.ama-assn.org/content/307/1/47.abstract",
      "parent": "17776",
      "gravatar_hash": "33169679d79e7cb641192dae608e3999"
    },
    {
      "id": "17794",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-24 07:16:22",
      "content": "John, the abstract you cite says:\n\n\"Compared with energy intake during the weight stabilization period, the protein diets provided approximately 40% more energy intake, which corresponds to 954 kcal/d (95% CI, 884-1022 kcal/d).\"\n\n... so they ate an extra (approx) 1000 calories per day, every day, above their own baseline! Not exactly relevant to my life. I think that would warrant a lot of caution to assume it applies in any significant way to the real world.",
      "parent": "17778",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17797",
      "author": "Marc",
      "author_url": "",
      "date": "2012-01-24 07:49:13",
      "content": "Kinda late to the party but I'll post my comment anyway.\n\nGreat article. I suggest that the body needs even less protein than you presented: 10% of one's daily caloric intake coming from protein is more than enough for the body to thrive (some studies suggest that 2.5% is enough to thrive). Mother's milk, composed of only 5% protein, allows a baby to double in size and triple in weight in her first year. I don't see how I would require a larger percentage since I am no longer no longer growing but I've found it difficult to eat less than 10%.\n\nI have been vegetarian for 20 years and am raising three kids who have never eaten meat. We eat some dairy, but not lots - 2-4 l. of milk per week,1-2 containers of yogurt, and a little cheese here and there, for a family of 5 - and we don't eat eggs. We don't eat beans or tofu every day (we don't even eat them every week). Our diet is 80% fruits and vegetables, with the balance in grains, pseudo-grains like quinoa (yum!), nuts, seeds, and quality oils. Probably about 50% raw. Very little sugar and processed foods (though we have pizza night every Friday). \n\nFor example, right now my breakfast is a smoothie made of 3 bananas, 1/2 an avocado, 1 cup frozen blueberries, and two grapefruits (substitute grapefruits for pomegranates when they are in season to significantly boost the nutrition intake) and provides me with 12 grams of protein. I change the fruit mix with the seasons. For dinner, my lunch and dinner plates typically look like this: 50% fresh salad with dressing, nuts, and seeds, 25% cooked veggie prep, and the remaining 25% with grains and/or beans or tofu.\n\nI am not a not really into nutrition, but I do like, from time to time, to check on how I am doing nutrient-wise (cronometer.com is a fantastic resource to that end). Eating as described above, without any concern for protein intake, I easily eat 50-60 grams of protein a day, which is a little lower than your ratio of 0.8 grams of protein per kilo of body weight, and a few percent above my target of 10% of calorie intake from protein. \n\nFurthermore, I am very active with a physically involved job - I don't sit at a desk the whole day and manipulate heavy objects. I train at Crossfit 4 days a week, do yoga, and enjoy many outdoor activities such as cross country skiing in the winter and mountain biking in the summer. I never experience any shortage of energy and have a solid muscle mass, weighting in at 185lbs for a height of 5'9\" (I am overweight according to the BMI, hehe). I could even loose a few pounds if I wanted to be super lean.\n\nMy kids are above average in terms of height and weight, have tons of energy (sometimes it feels like too much) and are very strong.\n\nMany people have commented about the lack of time to prepare healthy meals. An easy way to get a LOT of nutrition in no time all is to eat/drink smoothies. Buy a Blendtec blender, throw in a bunch of fruits and/or veggies, blend, drink up, feel fantastic. Delicious and nutritious with minimal prep time and cleanup.\n\nBest,\nMarc",
      "parent": "0",
      "gravatar_hash": "c47f50ed818a703dd81a9257bc5d5f91"
    },
    {
      "id": "17800",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-24 08:33:56",
      "content": "It sounds like you guys have really found a groove of eating what you enjoy and being in great shape! Well done.",
      "parent": "17797",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17804",
      "author": "John",
      "author_url": "",
      "date": "2012-01-24 10:58:33",
      "content": "I understand, yes, they ate 40% above baseline, that doesn't exactly make the study inapplicable because you're not... muscle loss is happening regardless of how many calories, excess or not, you consume unless it's counterbalanced with protein which the amount of was studied in varied percentages of participant diet. \n\nBut regardless of you saying you don't think it applies in the real world, people in charge of dietary recommendations are taking a serious look at this for future guidelines.",
      "parent": "17778",
      "gravatar_hash": "33169679d79e7cb641192dae608e3999"
    },
    {
      "id": "17806",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-24 11:09:18",
      "content": "My suggestions in the post aren't in any way geared towards people who consistently eat 40% above what it would take to maintain their weight. Anyone doing that is probably morbidly obese (or will be soon) and needs help from a doctor, not me. Human metabolism is nothing remotely like linear. You can't extrapolate from what happens to body composition when you eat 40% too much and hope to have it tell you what will happen when eating a reasonably normal, healthy diet. If people making dietary recommendations are looking at this for future guidelines, it only reinforces my belief that those guidelines should be taken with a grain of delicious, flaky sea salt. You may have noticed that they change those guidelines constantly anyhow, so why should anyone have confidence to follow them knowing they will probably be obsolete two years later? I think Michael Pollan has it basically right: eat a wide variety of mostly whole foods, not too much, not too processed and don't worry about it.",
      "parent": "17804",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17811",
      "author": "John",
      "author_url": "",
      "date": "2012-01-24 11:27:48",
      "content": "They change constantly? No, not really... The .8g/kg has been around for at least 30 years with the Lemon and Nagle studies.",
      "parent": "17778",
      "gravatar_hash": "33169679d79e7cb641192dae608e3999"
    },
    {
      "id": "17812",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-24 11:33:12",
      "content": "I didn't mean the .8g/kg, I meant nutrition recommendations in general. Not only do they change constantly, but you can easily find a nutritionist recommending any nutty thing under the sun. I'm not trying to discourage you from following any particular recommendation to the letter, if that is what works for you. My point of view is that most people don't need to stress about it.",
      "parent": "17811",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "23509",
      "author": "Becky @ veghotpot",
      "author_url": "http://www.veghotpot.wordpress.com",
      "date": "2012-05-03 00:33:08",
      "content": "I found this really interesting to read. I've been vegetarian for under a year but have felt great for the change. Recently I decided to track my protein/ carbs/ calorie intake and found that I was quite carb heavy and protein low without realising it so I thought I better make some changes but I hadn't realised that there was protein in foods like brocolli etc so I think if I was to look more carefully I probably am taking in more protein than I had realised! Now I just need to cut the carbs a little bit :)",
      "parent": "0",
      "gravatar_hash": "33b11941a8e791c58b2b2d67dcbfe401"
    },
    {
      "id": "38416",
      "author": "Datey",
      "author_url": "",
      "date": "2012-07-17 06:46:18",
      "content": "I quit eating meat around the same time as you and I never worry about protein.  I include it in most meals because at my most active, if I don't, I tend to get hungrier than I like.  If anything, the more I age, the less food I need (sadly).",
      "parent": "0",
      "gravatar_hash": "3c1c424ca1e0e341f1f6d113e40dce59"
    },
    {
      "id": "72446",
      "author": "Pamela Drake",
      "author_url": "",
      "date": "2012-11-01 17:39:25",
      "content": "Boy are you right! I had to laugh about that \"People in India...\" line. What about the well-known fact that the smiley natives of Latin America are eating rice and beans? Arroz con pollo is for the one percent who can afford pollo; the 99 percent have been eating rice and beans for generations, and they're working hard and not keeling over from protein deficiency.  They're happy, healthy people (although admittedly many of them do look forward to some pollo or puerco for Christmas).  I find that I operate best on simple vegetarian foods like brown rice and chick peas and lentil soup. When I have a cold I make curried lentil, and with enough cayenne and curry powder, who needs chicken soup to cure a cold? That stuff cuts the congestion and gives you lots of protein to make you feel stronger.  I also have trouble digesting meat, so I like vegetarian for how comfortable it is to digest.  If you feel sluggish eating beef, cut the meat!",
      "parent": "0",
      "gravatar_hash": "1cdf1555a2308bd8b4bca37deb9e71f6"
    },
    {
      "id": "76570",
      "author": "Angela",
      "author_url": "http://www.chasingtheunexpected.com",
      "date": "2012-11-08 09:16:58",
      "content": "The questions about proteins to vegetarians is so outdated that thankfully very few people ask me. When they do, though, my answer is very quick: Proteins are pretty much everywhere!\nI eat a lot of beans and raw veggies, I wasn't always a vegetarian, but since I've stopped eating meat I've been feeling great, much more energies and a much better mood!",
      "parent": "0",
      "gravatar_hash": "497c03c47bf741c22566b46354215de2"
    },
    {
      "id": "105781",
      "author": "Cody",
      "author_url": "",
      "date": "2013-01-10 12:29:49",
      "content": "Buahahhaaaaa! ...\"purple goo\"...\"zodiac sign\"! That's absolutely hysterical and I'm definitely bookmarking this very page for quick reference the next I'm asked that same question:)",
      "parent": "0",
      "gravatar_hash": "3fbae8959c26d46449b31c3b5a70aefe"
    },
    {
      "id": "110862",
      "author": "Moira",
      "author_url": "",
      "date": "2013-01-26 15:34:49",
      "content": "Here ya go folks ~ more nutritional data on \"whole foods\" than you ever thought you'd need!\n\nhttp://www.whfoods.com/foodstoc.php\n\nThe site also provides recipes, and cross references if you search for health conditions that certain foods can improve.\n\nI find this source invaluable when I'm craving certain foods (beets, mushrooms, asparagus, bran, oat, etc) ~ the tables indicate which nutrients are most prevalent in the foods the author has chosen that pack the most punch.",
      "parent": "0",
      "gravatar_hash": "e14043d0b484489c08c4c6c496a215f7"
    },
    {
      "id": "122111",
      "author": "Joanne",
      "author_url": "",
      "date": "2013-02-28 01:48:33",
      "content": "I'm not vegetarian although I have been in the past and have absolutely no problems with the concept of vegetarianism however as I've been recently diagnosed with Vit B12 deficiency I've become very aware of the sources of Vit B12 in the diet and in particular how you get a source of B12 in a Vegan diet without taking supplements because if you have to take supplements to stay healthy because of your diet, you aren't eating a healthy diet IMHO \n\nEven the Vegan society advises that there isn't a viable source of B12 in a whole-ly natural Vegan diet without supplemented foods or vitamin supplements http://www.vegansociety.com/lifestyle/nutrition/b12.aspx\n\nHow do Vegans deal with this and if you do take supplements instead of eating say eggs from a free range source, how do you justify it? I am genuinely interested because I also have a dairy intolerance and I've been trying to cut down the amount of dairy in my diet.",
      "parent": "0",
      "gravatar_hash": "5e274196f5fae4b1f647f142911c5d07"
    },
    {
      "id": "122821",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-03-01 08:11:43",
      "content": "I've been tested for B12 a few times over the years and haven't had a problem - but as you say, I'm vegetarian, not vegan.",
      "parent": "122111",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "129942",
      "author": "Chelsea",
      "author_url": "",
      "date": "2013-03-25 19:21:31",
      "content": "This is an older post, but since it was recently tweeted-- I feel like the odd vegetarian out, since I actually do have trouble eating enough protein in a day! I think this is because I seem to naturally eat rather less than you do, even though our protein \"needs\" are about the same.... I need to really consciously choose high-protein food (that's not too filling) at least a few times a week to not feel out of sorts, and it's something of a pain to keep in balance. \n\nMaybe I just need more practice; until a few years ago I was very much a stereotypical bad veg: she of the cheese sandwiches and spinach salads and other five minute meals....",
      "parent": "0",
      "gravatar_hash": "0cc985d2b19afb2d7ac25c2d77601824"
    },
    {
      "id": "228522",
      "author": "Sarah",
      "author_url": "",
      "date": "2013-11-12 21:30:43",
      "content": "I really like your attitude towards cooking and being a vegetarian. It's right in line with my own philosophy. \n\nI almost never get the \"Why\" question, but often get the protein question. My usual response that I don't pay much (any) attention to it and I'm fine. But once I did the same exercise you did here and counted up how much protein I was consuming.  \n\nOatmeal should be added to your list, as it is one of the highest vegetable sources of protein there is. This was a pleasant surprise as I really like oatmeal!\n\nThanks for the great blog and recipes!",
      "parent": "0",
      "gravatar_hash": "2a3196a2feeec114fac0096847c626ef"
    }
  ]
}