{
  "comment_count": 25,
  "comments": [
    {
      "id": "1096",
      "author": "Kathy",
      "author_url": "",
      "date": "2010-06-01 07:26:42",
      "content": "Michael -- Hearing your thinking as you plan is a great help, but the other piece I have less intuitive knowledge about is getting enough protein. Do you have a simple way of thinking about that?",
      "parent": "0",
      "gravatar_hash": "bce072ef9070e75c7cd92574c23fe24f"
    },
    {
      "id": "1097",
      "author": "Kara",
      "author_url": "",
      "date": "2010-06-01 10:39:14",
      "content": "Though I've been vegan for all of my adult life, I tend to think of veg meals more as a meat eater would, starting with the protein. I feel that a meal based around tofu, tempeh, setian, beans, or lentils (or even a nut-based pesto) are much more satisfying and cohesive than rice and vegetables ever could be.",
      "parent": "0",
      "gravatar_hash": "3f96025bf1e31f5af2aba1288a99625c"
    },
    {
      "id": "1098",
      "author": "Dawn (KitchenTravels)",
      "author_url": "http://profile.typepad.com/kitchentravels",
      "date": "2010-06-01 11:49:31",
      "content": "\"...a co-worker brings you eggs laid that morning.\" Lucky, lucky. I was offered some home-grown kumquats this morning, but fresh eggs? Still waiting for that to happen. :)",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "1099",
      "author": "Cajun Chef Ryan",
      "author_url": "http://cajunchefryan.rymocs.com/blog2/",
      "date": "2010-06-01 11:52:01",
      "content": "Well done, especially with consideration for all cuisines.\n\nBon appetite!\nCCR\n=:~)",
      "parent": "0",
      "gravatar_hash": "9f3b5ef4294bafb575b419690b0d278d"
    },
    {
      "id": "1100",
      "author": "Stacy",
      "author_url": "http://littlebluehen.com/",
      "date": "2010-06-01 11:56:36",
      "content": "Wonderful post. I take a very similar approach. Since we get a CSA share, my \"what's fresh\" criteria is more based on \"what's in the fridge.\"\n\nThe main reason I start by choosing the starch is because it usually takes the longest to cook. Kara has a point, but I try to integrate my protein option with the \"food culture\" choice. Asian dishes are more likely to include tofu, Mexican dishes often have beans, etc.",
      "parent": "0",
      "gravatar_hash": "38126f0394b83a8f1a021c0f048669db"
    },
    {
      "id": "1101",
      "author": "Nicole",
      "author_url": "http://www.twitter.com/noxo",
      "date": "2010-06-01 12:17:36",
      "content": "Great suggestions for brainstorming meal ideas. I think it's important to emphasize vegetarian sources of protein too. In my experience, many carnivores simply don't realize this is something they need to consider. As Kara noted above, beans, tofu, etc make a meal much more satisfying – and nutritionally well rounded.",
      "parent": "0",
      "gravatar_hash": "50880bc9bb503f8359690cf04419454a"
    },
    {
      "id": "1102",
      "author": "alessandra@clear.net.nz",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2010-06-01 13:08:32",
      "content": "I find the protein issue very strange, I think that culturally some people tend to think much more about proteins than others, and certainly more than me. Some vegetarian beliefs say that you should have protein at every meal, like rice and lentils, pasta and beans and so on.\n\nI react to this the same way as a I react to the person who tells me that he/she cannot function unless they have a stake a day.\n\nDo you really believe that you need plenty of protein every day?\n\nI remembered being told off mostly by vegetarians for my meals than by non vegetarians.\n(For example, British vegetarians eating baked beans on toast and telling me that they were having a balanced meal, while my salad wasn't complete.) But I stuck with my principles based mostly on quality and fresh rather than quantity and nutritional value, and it has been over twenty years now, with small amount of food and even smaller amounts of proteins. I survived.\n\nI learned that I need concentrated proteins (nuts, beans, dairy) in small quantity few times per week, not daily. And proteins are everywhere, not just in tofu, lentils and so on. They are in pasta, in fruit, in vegetables...If your body is healthy it will absorb proteins from most food.\n\nThe very important thing to me is, and not just for vegetarians and vegans but for everyone, variety. Variety, variety and more variety!\nTeach your body variety and it will respond.\n\nBut this is just me :-), maybe someone does need a slice of tempeh a day to survive...",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "1103",
      "author": "Allison",
      "author_url": "http://urbanresearch.wordpress.com",
      "date": "2010-06-01 17:38:10",
      "content": "This is great, Michael! It's motivated me to finally cook the wheat berries I bought at the farmers market a while back! I'm going to brainstorm accompaniments while they soak so if you have any suggestions I'd love to hear them!",
      "parent": "0",
      "gravatar_hash": "2b0d040664ab3df718102dc8c0fab22f"
    },
    {
      "id": "1104",
      "author": "Joanne",
      "author_url": "http://www.applecrumbles.com",
      "date": "2010-06-01 17:45:03",
      "content": "Great post! Being a vegetarian, I think planning a meal without meat is easy. What makes it difficult is when your spouse wants meat to make the dinner complete.  Then, if you don't want to make two sep. meats every night, you have to get original and try to make it meatless but satisfying to the meateater. That gets to be challenging. Maybe an idea for your next post :)",
      "parent": "0",
      "gravatar_hash": "29826f1d5ec829a4f247451a663daf76"
    },
    {
      "id": "1105",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-01 18:50:14",
      "content": "Hey Allison - your comment brought a smile to my face because wheat berries were focus of one of my worst early experiments in cooking, 25 years ago. I&#39;d tell you what was in that dish but then I&#39;d have to hide under a rock for the rest of my life, it is that embarrassing. I think the key thing is to get the texture right. It really depends how old they are, you need to keep checking to make sure that they are tender but not complete mush. They are extremely hearty and a little will go a long way. My first inclinations would be to either emphasize that heartiness by pairing them with something like cabbage or beet borscht or roasted mushrooms, or to try to lighten them into a salad with a nice vinaigrette and plenty of fresh veg.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1106",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-01 18:54:08",
      "content": "@Joanne and anyone else looking to make meals for both veg and omnivores at the same time: run, don&#39;t walk, to buy this book: <a href=\"http://bit.ly/44BodX\" rel=\"nofollow\">http://bit.ly/44BodX</a> (by Ivy Manning, a friend of mine and expert on that exact subject).",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1107",
      "author": "Frith",
      "author_url": "",
      "date": "2010-06-01 19:51:26",
      "content": "Hi Michael,\nI have just realized that this is how I've been planning meals since I spent eight years as a vegetarian, starting 20 years ago. Every night I stand in my kitchen and think \"pasta, rice or potatoes?\" (I guess going for starch, rather than just a grain), and then work in the protein and veggies based on the cuisine I feel like. So interesting to see my thought process spelled out by someone else! Well done.",
      "parent": "0",
      "gravatar_hash": "5f3417dbc4895063a8a60fb0a6499efb"
    },
    {
      "id": "1108",
      "author": "John",
      "author_url": "",
      "date": "2010-06-02 05:17:14",
      "content": "My own version opf menu-planning is slightly inverted from yours: I start with the cuisine I’m longing for, and then assemble a meal in that style. Last night it was Indian…so I made an okra/tomato curry, and a dal-chicken-other-veggies curry. And some rice to serve them over, because both are a little more liquid than they could be. The balance of ingredients sort of works itself out, I find…but that’s because I’ve been cooking for a while. The temptation to make, say, a squash curry, that okra/tomato curry, and an eggplant curry, and find oneself without any protein or basic starch…that’s bad.  But it’s not the route I usually find myself following.\n\nI was interested to see your planning refer to the weather. As I do my week's menu planning, one of the first things I check is the weather forecast. If Tuesday's going to be one of those odd summer days where there's a chilly fog all day, I might make a mediterranean fish stew with aioli rather than the Potage St. Germain.  If it's gonna be stinking hot, gazpacho starts to sound really nice, etc.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "1109",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-02 19:39:04",
      "content": "@Kathy, @Kara, @Nicole,@Alessandra - I can see the protein question is prominent in people&#39;s minds, both in the literal sense of &quot;am I getting enough grams to be healthy?&quot;, and in the metaphoric sense of &quot;is it going to be satisfying?&quot;. I think these are great questions which deserve their whole own post. Soon. Thanks for your comments!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1110",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-02 19:41:11",
      "content": "@Stacy - you are so right about asking &quot;What is in the fridge?&quot; That is a good way to cut back on food waste as well.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1111",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-02 19:58:01",
      "content": "@John - Weekly menu planning! I wish I did that. For me it tends to be no more than a day or two in advance, and that ends up limiting how many nights I can cook. Here&#39;s to discipline. Although my short-range approach does allow me to fine-tune to the actual weather. I don&#39;t think starting with the cuisine/culture is an inversion; although I might not have made it clear enough, I start with any of the three questions probably with equal frequency and see where it leads me with regard to the other two.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1112",
      "author": "kristen",
      "author_url": "http://hardly-starving.blogspot.com",
      "date": "2010-06-15 12:04:45",
      "content": "this is a great post. if you're thinking about writing a cookbook, this would make for a nice introductory section.",
      "parent": "0",
      "gravatar_hash": "1f0c3052ae5dbda1548f3909dda73942"
    },
    {
      "id": "1113",
      "author": "The Green Beet",
      "author_url": "http://www.thegreenbeet.com",
      "date": "2010-10-17 18:52:17",
      "content": "This is fantastic and extremely helpful.  I also found the three step checklist I read about recently in The Kind Diet; plan a meal by choosing (i) a grain, then (ii) a protein; and finally (iii) load up on veggies.  This has been a helpful tool for me thus far to planning well rounded vegetarian meals.",
      "parent": "0",
      "gravatar_hash": "bcc2dbdae5e656388616702df1953b35"
    },
    {
      "id": "1114",
      "author": "Aliza",
      "author_url": "",
      "date": "2011-01-04 15:38:43",
      "content": "Agreed.",
      "parent": "0",
      "gravatar_hash": "9f5e983c5a39a8b12a0cf3c5c928644b"
    },
    {
      "id": "1115",
      "author": "Stephanie",
      "author_url": "http://groundcherry.wordpress.com",
      "date": "2011-10-12 07:11:06",
      "content": "Funny, I do the opposite.\n\n1) What's in the garden (veg drawer)?\n\n2) What flavors (spices, aromatics) flatter #1?\n\n3) What's the protein?\n\n4) What's the suitable/handy grain to fill in the corners?",
      "parent": "0",
      "gravatar_hash": "9c6f6c4d51c26bb1db180d2731990432"
    },
    {
      "id": "47839",
      "author": "Val",
      "author_url": "",
      "date": "2012-08-30 15:09:22",
      "content": "I, an admitted foodie hear a lot of talk about veggies, vegans, pescies etc.  I get concerned when I hear youth, especially young girls proudly announce that now they are veggie etc.  My concern is that they have little or no information or experience to make that decision and parents seem to go right along.  Not only, where are these kids getting their protein, but also where are they getting their iron.  Iron (from my little knowledge) is not readily absorbed when derived from not meat sources.  Perhaps you could address this subject in the future.",
      "parent": "0",
      "gravatar_hash": "e59c3d0bd8b8311a426fc83883c675c4"
    },
    {
      "id": "69047",
      "author": "Mary",
      "author_url": "http://www.vegetariansbeginnersguide.com",
      "date": "2012-10-26 00:47:01",
      "content": "This is very helpful. I always find i have to make time to plan my meals ahead of time. I really liked the recipes that you mentioned above. Thanks",
      "parent": "0",
      "gravatar_hash": "06ac45b02659199499eab13697370373"
    },
    {
      "id": "149205",
      "author": "John",
      "author_url": "",
      "date": "2013-05-19 12:46:07",
      "content": "@alessandra Thanks so much for your wisdom! I get weary of \"How can you possibly...? I could never survive without my steak a day!\" Most people – veggies included – have very little idea about constitutes good nutrition. Tons of protein ain't it. \n\nI was vegan for a year or so and a doctor expressed horror that I could live without dairy. \"Where do you get your calcium?!\" (My answer: broccoli) This is a smart, educated MD, with little more knowledge of nutrition than what she learned from TV \"Got milk?\" ads.",
      "parent": "1102",
      "gravatar_hash": "91973615cca3124eb7d88c4c5dc89bb3"
    },
    {
      "id": "194983",
      "author": "Genevieve",
      "author_url": "",
      "date": "2013-09-08 15:32:43",
      "content": "Hi Michael, \n\nthanks for this lovely post. My issue, however, is always sauce. I find that I can usually think of spices to add to a dish, and I understand many of the spices used in my favourite cuisines (Indian, Thai, etc), BUT, my food often comes out dry, and I can never figure out how to correct this! Any advice is helpful.",
      "parent": "0",
      "gravatar_hash": "ff34d4d735388509674fbafa9d2b0eb1"
    },
    {
      "id": "195030",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-09-08 20:14:14",
      "content": "Without seeing your dishes, it is hard to be sure... but if I had to guess, you either aren't making enough sauce, or you are cooking too long and it is either getting absorbed or too much liquid is evaporating. You can always add some water or other liquid back to thin out a sauce that has gotten a little too \"tight\".",
      "parent": "194983",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}