{
  "comment_count": 14,
  "comments": [
    {
      "id": "3927",
      "author": "Maxine",
      "author_url": "http://www.chewonthatblog.com",
      "date": "2007-10-16 05:43:51",
      "content": "Mmmmm! I could eat Israeli hummus every day! I was in Israel for a Birthright trip a few years ago and I just couldn't get enough falafel and hummus. Unfortunately, I haven't been able to recreate it at home either. Although for the especially lazy, the Sabra brand with a little olive oil mixed in is a pretty decent substitute!",
      "parent": "0",
      "gravatar_hash": "b1f442ef0b84c2fbbcfbcde3fd6b4a81"
    },
    {
      "id": "3928",
      "author": "Christiane",
      "author_url": "http://www.28cooks.com",
      "date": "2007-10-16 06:56:08",
      "content": "I could eat hummus daily! I've never had the true hummus but this looks absolutely fantastic!",
      "parent": "0",
      "gravatar_hash": "a5aac6b92590136127aed3b0d590b2e8"
    },
    {
      "id": "3929",
      "author": "Rivka",
      "author_url": "http://www.notderbypie.blogspot.com",
      "date": "2007-10-16 10:26:54",
      "content": "are you still in Israel?  If so, please pretty please eat at Lena!  It's also in the Old City, only a few short turns past the Jaffa Gate and the entrance to the Arab Shuk.  If you ask any of the vendors in the shuk as you walk down the stairs, they'll point you in the right direction.  Also, great chummus can be had at either of the restaurants in Abu Gosh, both also called Abu Shukri -- one is the original, the other started by the sous-chef -- they're pretty much the same product though.  But the holy grail of hummus, IMHO, is not in Jerusalem or environs: it's in Akko, at a place called Hummus Said.  Their hummus is known to be the best.  Have you tried Masabacha?  It's a dish of hummus, whole chickpeas, tahina, and some lemon (sometimes), served hot. I LOVE this and I think the best is served at Abu Hasn, in old Yafo.  Happy eating -- I'm jealous!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3930",
      "author": "molahs4",
      "author_url": "",
      "date": "2007-10-16 12:12:20",
      "content": "I agree that the Sabra brand is the closest thing I have found in the states to the glory that is Israeli hummus. I hear rumors that the key is using icewater, but I have a hard time believing that is how they have been making it for generations.\n\nI was watching Anthony Bourdain's show yesterday and he was talking about how cultures can be defined by how well their poorest people eat. He was in China at the time and marveling at how they had developed incredibly simple, cheap foods that everyone could afford to eat. The incredible vegetarian options in the middle east are a great example of this.",
      "parent": "0",
      "gravatar_hash": "3152eb9a826251ff5dd51e86fcb5a01d"
    },
    {
      "id": "3931",
      "author": "radish",
      "author_url": "http://www.sassyradish.com",
      "date": "2007-10-16 12:55:53",
      "content": "This looks so good - I've never been to Israel and have been wanting to go for awhile. I'll have to get your food recommendations when I finally get my act together and get a ticket :)",
      "parent": "0",
      "gravatar_hash": "04341568a39187cf5897aaea878fb272"
    },
    {
      "id": "3932",
      "author": "Meli",
      "author_url": "",
      "date": "2007-10-16 17:20:59",
      "content": "You probably thought of this already, but I used to always make grainy hummus until I peeled the chickpeas before pureeing them. It really made a huge difference, and wasn't much work at all.",
      "parent": "0",
      "gravatar_hash": "a1857a37f190ae69e9f427a40b4a8e3e"
    },
    {
      "id": "3933",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2007-10-16 23:47:56",
      "content": "Thanks for all the comments, tips, and suggestions everyone! I wish I was still in Israel, all of those places sound amazing but I'm back in Seattle. I'll have to try removing the skins from the chickpeas, now that I know it is easier than I would have guessed.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3934",
      "author": "Shmuel Browns",
      "author_url": "http://israeltours.wordpress.com",
      "date": "2008-06-23 15:55:42",
      "content": "Here are 2 places in the Old City that I recommend - the other Abu Shukri, on the right, just up from Station VII of the Via Dolorosa (peek in and notice the column, in the exact place where it stood on the Roman Cardo). Lena is along the same street past Station VIII, on the left.\nFor my full list check out http://israeltours.wordpress.com/2008/05/13/fastfood-slowfood/",
      "parent": "0",
      "gravatar_hash": "d51b204b0364a327275c1b0a4d09da8e"
    },
    {
      "id": "3935",
      "author": "Jeff",
      "author_url": "",
      "date": "2008-07-06 17:00:43",
      "content": "I lived in Jerusalem for a year and a half and ate at Abu Shukri's at least twice a week, maybe more. Best I've ever tasted. I once asked the owner (Abu Shukri?) how he made the Humus, he explained it to me---in Arabic.",
      "parent": "0",
      "gravatar_hash": "ef0183982cad5c80e43b02195da16e37"
    },
    {
      "id": "3936",
      "author": "David",
      "author_url": "",
      "date": "2008-07-29 02:07:03",
      "content": "Shalom Michael,\nI (wrongly?)commented to your prose about hoummous at Stumble It!\nI'll try to rewrite what was:\n1.  There are fine choummous restaurants all over Israel.  Said is one of the superior ones and there are more that bring no shame to the institution!\n2.  I cook hoummous with a variety/strain/breed called \"Bulgarian\", which are smaller and better adapted to making pureed choummus.  Available in US?\n3.  If sufficiently cooked (I soak dried chickpeas in water some 24 hours or so and then cook 12 or more hours in a slow cooker) then your beans should be the texture of butter!\n4.  I leave the skins on for health purposes.\n5. I suggest not using bean softener for health purposes.\n6.  Hoummous can be eaten whole with the spices added on top or mixed in... mmmmmmmmmm.\n\nIf you plan on being back in Israell and wish to visit other hoummous eateries all over the counry, I'd be honored to join and guide you.\nYour culinary trips are just too much..   they fit my way of thinking!\n\nWarmly,\nDavid",
      "parent": "0",
      "gravatar_hash": "d077b0f781ec30e13c81fc2494ae59ba"
    },
    {
      "id": "3937",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-07-29 07:38:39",
      "content": "Thanks for the tips David!\n\nWhat is a bean softener?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3938",
      "author": "Sarah",
      "author_url": "http://www.sarahmelamed.com",
      "date": "2009-11-04 10:13:25",
      "content": "Hummus! one of my favorite topics. I ate at Abu Shukri's (abu gosh) a few weeks ago and have yet to go to Taami. Yochanan's (yemenite restaurant) makes a very good hummus and he told me what David above said- cook for a very long time, he does it overnight. He also doesn't remove skins, too much work I guess. Bulgarian hummus is very popular for hummus but Hadas is also used. I don't normally see Bulgarian chickpeas at the shuks for some reason, perhaps the hummus joints buy it up? (I was at Ramla today). Jaffa also has some great places which I have to try.",
      "parent": "0",
      "gravatar_hash": "7e37ba6c0e30dbfce4a8c30b0ffdae44"
    },
    {
      "id": "3939",
      "author": "kim",
      "author_url": "http://thoughtfulplate.blogspot.com/",
      "date": "2009-12-29 10:14:37",
      "content": "We've a few restaurants in NYC that specializes in hummus, but also include other appetizers as well. I love hummus. I'm having some right now. :)",
      "parent": "0",
      "gravatar_hash": "ac9360c8223ea349ea3c1d1b4a741837"
    },
    {
      "id": "3940",
      "author": "gabcorter@hotmail.com",
      "author_url": "",
      "date": "2011-04-26 11:41:23",
      "content": "you can skip the peeling by buying already 'split' chickpeas.  not easy to find but works.  also, blend in a blender and not in a food processor.  you need to add a bit more water but it's how to make it smoother.  also, you need to overcook the chickpeas in the first place.",
      "parent": "0",
      "gravatar_hash": "2eb28dfad921ffcaff329c264229fd41"
    }
  ]
}