{
  "comment_count": 14,
  "comments": [
    {
      "id": "3095",
      "author": "lisaiscooking",
      "author_url": "http://lisaiscooking.blogspot.com/",
      "date": "2008-12-11 10:00:37",
      "content": "Sounds fantastic! I was wondering if the Top Chef book was a good one. Thanks for the review.",
      "parent": "0",
      "gravatar_hash": "561295eae7a0ea547c538ab03aca58f2"
    },
    {
      "id": "3096",
      "author": "The GastroGnome",
      "author_url": "http://www.thegastrognome.wordpress.com",
      "date": "2008-12-11 19:33:55",
      "content": "Depending on the original recipe, I'd guess that the clams would let off a decent amount of juice, thus, you make up for it by adding the extra wine? Or maybe not at all...",
      "parent": "0",
      "gravatar_hash": "52922ce305f3d307ea02bd727e43d26e"
    },
    {
      "id": "3097",
      "author": "Jackie",
      "author_url": "http://devourthis.typepad.com/",
      "date": "2008-12-12 07:06:47",
      "content": "This sounds fabulous!!  The recipe on the show seemed complicated to me, but this makes it sound very accessible. Thanks for the inspiration!",
      "parent": "0",
      "gravatar_hash": "a5af96f6e4bc24b0563b9c2b4ed8a45a"
    },
    {
      "id": "3098",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-12-12 07:16:52",
      "content": "Oh, very good point! I've never cooked with clams so that didn't even occur to me.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3099",
      "author": "veggiebelly",
      "author_url": "http://www.veggiebelly.blogspot.com",
      "date": "2008-12-12 19:44:48",
      "content": "This is such a unique recipe! Ive book marked it to try :) I agree with you, Top Chef is a great show!",
      "parent": "0",
      "gravatar_hash": "c9b1259ff74b0aee40402ce029be9633"
    },
    {
      "id": "3100",
      "author": "Foodista Fan",
      "author_url": "http://www.foodista.com",
      "date": "2008-12-13 02:40:48",
      "content": "Thank you also for the review on the book, I was thinking of giving it as a gift this Christmas! What a great site you have here! oh and if you have time will you drop by at <a HREF=\"http://www.foodista.com/2008/11/25/help-test-foodista/\" rel=\"nofollow\">Foodista </A>? We are building an online food and cooking encyclopedia ala wikipedia and you can also check out our<a HREF=\"http://www.foodista.com\" rel=\"nofollow\"> recipes </A> on the site as well :) Cheers!",
      "parent": "0",
      "gravatar_hash": "5b798aad81a7e7226ef0f686e4c05ea9"
    },
    {
      "id": "3101",
      "author": "Leslie",
      "author_url": "http://www.three-bowls.com",
      "date": "2008-12-13 15:46:12",
      "content": "I was wondering how useful the Top Chef cookbook would be if one is vegetarian or just not a big meat eater.  I certainly hope there was more testing/rigor around those recipes than some of the Top Chef recipes that make it onto Bravo's site!  I was going to try to do a little feature each week of making one Top Chef recipe to go with the other TC articles I'm doing, but as I started to look through what was on Bravo's recipe finder, the elliptical and shorthand nature of what was posted made it seem like frustration waiting to happen! Most seem like they were like sleepily dictated to someone after 2-3 hours/2-3 bottles of wine consumed in the stew room.  :)",
      "parent": "0",
      "gravatar_hash": "a0b16afd28eb241745f3099e5867c748"
    },
    {
      "id": "3102",
      "author": "Bharti",
      "author_url": "http://veggiefoodist.blogspot.com/",
      "date": "2008-12-13 18:36:17",
      "content": "That sounds like a lovely recipe. I am familiar with that technique- I'm from India and we usually toast the thin noodles in hot oil till brown and then cook it in a sugar syrup. It's great!",
      "parent": "0",
      "gravatar_hash": "30c23af5a6faa208a56d9f40641e1f95"
    },
    {
      "id": "3103",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-12-15 13:13:40",
      "content": "Leslie - you know, not a ton of the recipes are veg, but you can definitely extract useful ideas and techniques from the other ones.\n\nBharti - is that called falooda or sev? I've had than in a sweet drink in Indian restaurants, but not any other way. What is it called and what else is it served with?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3104",
      "author": "Lesley",
      "author_url": "http://lesleyeats.blogspot.com",
      "date": "2008-12-18 10:28:18",
      "content": "I'm a late fan for Top Chef since I only recently got cable, but I'm hooked. It's great for a total amateur like me to see real technique and creativity in every episode.\n\nSince I missed Season 2, I'm very happy you posted this recipe--it looks delicious!",
      "parent": "0",
      "gravatar_hash": "1da8a8df7f00378ce9496cc845075fa0"
    },
    {
      "id": "3105",
      "author": "[eatingclub] vancouver || js",
      "author_url": "http://www.eatingclubvancouver.com",
      "date": "2008-12-18 21:54:00",
      "content": "Toasting in the oven first? Hm, have to try that soon. Thanks!",
      "parent": "0",
      "gravatar_hash": "42b70c6dff6ac61c95301855b02bb636"
    },
    {
      "id": "3106",
      "author": "Stacy",
      "author_url": "",
      "date": "2009-01-20 14:01:32",
      "content": "Thanks for the recipe -- I made it last night.  It was tasty, but I had a couple of observations for anyone thinking of making it.  I've seen a lot of fideo recipes that really emphasize toasting the noodles until they're quite dark.  I didn't even let them get very dark, and there was still a faint \"burnt\" taste to the final dish.\n\nAlso, for Step 6 here, it just didn't work that way for me.  Dried spaghetti doesn't cook in 1/2 c. of wine in four minutes, especially when it's toasted first. :)  I added the cream mixture, but with the pot off the heat, the dried noodles just sat up in all directions.\nI had to keep adding milk and veggie broth for about another 15 minutes, with the pot on medium heat, and pushing the noodles down into the mixture, and even then they were a bit too al dente for me. :(  Just my two cents.",
      "parent": "0",
      "gravatar_hash": "c0460f1e1991df721eb2c22ad5b0aa6f"
    },
    {
      "id": "3107",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-01-20 14:39:40",
      "content": "Hey Stacy - thanks for the note! I didn't experience a burnt taste to the dish, but I did have the same problem as you at step 6. I already had an \"editor's note\" there saying that it seems to need more liquid and time, but your email made me realize it wasn't written clearly, so I've gone back to edit it. GastroGnome suggested that the reason the original recipe works for Ilan is that the clams release enough additional liquid to cook the noodles.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314071",
      "author": "Toni",
      "author_url": "",
      "date": "2015-11-13 17:08:11",
      "content": "i made this &amp; it came out terrible... not trying to be mean, just honest. I toasted the pasta until it was dark and that was not a good idea... totally burnt taste. I had to keep adding a lot of liquid to cook the pasta... took awhile... I mean, it's a pound of pasta... it finally cooked... I added the cream and vegetables... broiled it... and it just tasted awful. Burnt and awful. I threw it all out. Michael, you may want to try to cook it again and revise this recipe. Sorry but this does not work. It's bad.",
      "parent": "0",
      "gravatar_hash": "7f9f53d962e1e72c2285c4576668e859"
    }
  ]
}