{
  "comment_count": 11,
  "comments": [
    {
      "id": "82081",
      "author": "CJ at Food Stories",
      "author_url": "http://www.foodstoriesblog.com",
      "date": "2012-11-18 06:59:17",
      "content": "Sounds great ... congrats on the new venture :-)",
      "parent": "0",
      "gravatar_hash": "71303ff3b22af2cbeb0fbf3610b1906d"
    },
    {
      "id": "82086",
      "author": "Marina@Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-11-18 07:25:13",
      "content": "Only in Seattle such thing is possible! The Modernist Cuisine project is fantastic, I am so happy for you Michael! And good luck hiring your team. It shouldn't be a problem. :)",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "82113",
      "author": "Betty Ann @Mango_Queen",
      "author_url": "http://www.asianinamericamag.com",
      "date": "2012-11-18 08:22:37",
      "content": "So happy for you, Michael! Congratulations for this great opportunity! Happy Thanksgiving to you and your family!",
      "parent": "0",
      "gravatar_hash": "2f47cf20944759bec2f5c79ae8ee733f"
    },
    {
      "id": "82121",
      "author": "Katherine Martinelli",
      "author_url": "http://www.katherinemartinelli.com",
      "date": "2012-11-18 08:52:08",
      "content": "Very cool - sounds absolutely amazing! I'm so happy for you that you've found such an incredible way to combine your passions.",
      "parent": "0",
      "gravatar_hash": "77cbf18926e13167a62ef95f9dc0f7cf"
    },
    {
      "id": "82130",
      "author": "Razzy 7",
      "author_url": "",
      "date": "2012-11-18 09:21:31",
      "content": "Thrilled for you Michael. What a dream job. I understand you'll be busy, but I hope you won't abandon Herbivoracious. I can imagine what you learn at ChefSteps helping you take your recipes up a notch. For example, I've told you before that your Umami Packed Vegetarian Broth is fabulous -- but what if it could be made even more delicious using what you learn at ChefSteps? \n\n I just purchased Modernist Cuisine - At Home and am loving it. I hope the work at ChefSteps won't focus solely on professional chefs and cooking at restaurants. People like me are interested in learning and trying things too. And who are \"people like me?\" I'm not a professional cook at all though do believe I'm an excellent home cook and always love learning new things, culinary. I'm old :-), retired, but still want to learn and better ways for improving what I cook in my home kitchen. I have a special interest in pressure cooking and will look for ways to make pressure cooked foods even better. \n\nIf I were younger and still in the working world, I'd consider working at ChefSteps a dream job. \n\nBest wishes to you Michael.",
      "parent": "0",
      "gravatar_hash": "1208f8137b244fb0b70078499336f898"
    },
    {
      "id": "82162",
      "author": "Kathy - Panini Happy",
      "author_url": "http://www.paninihappy.com",
      "date": "2012-11-18 10:23:28",
      "content": "That's so exciting, Michael - many congrats to you!! Can't wait to hear about your new projects (I'd love to visit that kitchen-office sometime, sounds incredibly cool).",
      "parent": "0",
      "gravatar_hash": "3173541fef2db6b40f403784d5c76724"
    },
    {
      "id": "82181",
      "author": "Cristin",
      "author_url": "http://willothewhisk.wordpress.com",
      "date": "2012-11-18 10:43:50",
      "content": "This is so cool, Michael! I'm in the middle of figuring out my own career transition, and I continue to admire your bravery and creativity. Congratulations!\n\nI don't know anything about web development, but if you ever needed an intern, I would be there in a second! I could help with writing or editorial work. I'm also pretty good at doing silly voices ... not terribly germane, I know. Unless you do a Cooking with Kids course someday :)",
      "parent": "0",
      "gravatar_hash": "7bd6c44072f6e27441963e5a7c9b7e45"
    },
    {
      "id": "82501",
      "author": "Maureen",
      "author_url": "http://www.orgasmicchef.com",
      "date": "2012-11-19 00:35:52",
      "content": "I'm jealous with a capital J.  Best of luck and know you're doing it for us all.  LOL",
      "parent": "0",
      "gravatar_hash": "3648105a666a70d5e02acb5cba6d5370"
    },
    {
      "id": "82627",
      "author": "Amanda",
      "author_url": "http://peacefulpantry.com/",
      "date": "2012-11-19 04:27:00",
      "content": "ChefSteps sounds incredible! Congratulations on the new job!",
      "parent": "0",
      "gravatar_hash": "5d9abe0e369333cf52e6cc3c7b82fdab"
    },
    {
      "id": "82804",
      "author": "Kirsi",
      "author_url": "http://lalahahanobodieshere.tumblr.com/",
      "date": "2012-11-19 11:55:29",
      "content": "This is terrible news! I want MORE herbivoracious posts, not fewer! I was hoping your new restaurant would be opening as soon as this coming weekend when I will be in town for the marathon, which, I know, is a lot to hope for, but still...",
      "parent": "0",
      "gravatar_hash": "8cd8ea7ec1545f618946ebde3a8869df"
    },
    {
      "id": "83813",
      "author": "Pamela Handy",
      "author_url": "",
      "date": "2012-11-21 05:19:46",
      "content": "Congratulations on ChefSteps. I'm now a subscriber, thanks to Google - and maybe a budding vegetarian as well!",
      "parent": "0",
      "gravatar_hash": "318c66b5996534511216886aefb4cb4e"
    }
  ]
}