{
  "comment_count": 13,
  "comments": [
    {
      "id": "1072",
      "author": "The Italian Dish",
      "author_url": "http://www.theitaliandishblog.com",
      "date": "2010-06-10 11:31:45",
      "content": "I am a confessed salt lover. I love the Meadow.  I bought so many goodies when I was there and had them shipped back to Michigan.  (In fact in my most recent post I show a beautiful little salt spoon I bought there).  Great interview. I wonder what salt is Bitterman's favorite?",
      "parent": "0",
      "gravatar_hash": "3e4e3826bf4c9300ffc14fd965fa8026"
    },
    {
      "id": "1073",
      "author": "922loren",
      "author_url": "http://profile.typepad.com/loren1",
      "date": "2010-06-10 11:40:34",
      "content": "Michael great article, I have been a fan of salts but have not been down to Meadow. Thanks for the heads up, I look forward to seeing at least part of your demo today at QA farmers market.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "1074",
      "author": "Fran",
      "author_url": "",
      "date": "2010-06-10 12:59:37",
      "content": "Hi, I live in England and near to where Maldon Sea Salt is produced.  This is the favourite salt of the top chefs (including the French). I have never heard of black salt but would love to try it.",
      "parent": "0",
      "gravatar_hash": "58b0cc10077cadad9d5f38646a3a07e4"
    },
    {
      "id": "1075",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-10 13:18:27",
      "content": "I&#39;m with you... Maldon would be my &quot;you can only take one to a desert island&quot; salt.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1076",
      "author": "Karen",
      "author_url": "",
      "date": "2010-06-11 04:34:21",
      "content": "Um... his name is Bittman - not Bitterman",
      "parent": "0",
      "gravatar_hash": "603ad598e385a3cbaf803bc5aa739c6b"
    },
    {
      "id": "1077",
      "author": "Heather",
      "author_url": "",
      "date": "2010-06-11 04:34:45",
      "content": "Aussie! Aussie! Aussie! (Just gearing up for the World Cup.) As an Australian ex-pat in Philadelphia, I was so happy to find Murray River pink salt from Australia at our local Whole Foods. Flaky like Maldon but the flakes are smaller and more delicate. Worth seeking out, for sure. Thanks for this interview. I found it very interesting and look forward to seeing some special salt recipes here.",
      "parent": "0",
      "gravatar_hash": "8e3d500fdb0ac3d8e2eabfc5fb8f6f17"
    },
    {
      "id": "1078",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-11 07:19:08",
      "content": "Hey Karen - nope, this is a different person. I could see why you would be confused though, very similar names!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1079",
      "author": "alessandra@clear.net.nz",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2010-06-11 08:47:45",
      "content": "Weeeee I don't have time to read this, will keep it for later...just a quick note to tell you that I linked you on a chain on <a href=\"http://alessandrazecchini.blogspot.com/\" rel=\"nofollow\">http://alessandrazecchini.blogspot.com/</a>\n\nmaybe fun...\n\nciao\nA",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "1080",
      "author": "Jan",
      "author_url": "",
      "date": "2010-06-15 09:29:51",
      "content": "Neat article!  I am obsessed with gourmet salts myself, and have been using them for years.  I've tried the Black Diamond, and it is very nice. From another of my most favorite salt shops, SaltTraders.com you can buy a Danish viking Smoked Salt from denmark - wow -- that takes salt to a WHOLE new level. Don't waste your time with other smoked salts - check this one out!",
      "parent": "0",
      "gravatar_hash": "5f68c824ffa349626b37bdecdc0c1b6d"
    },
    {
      "id": "1081",
      "author": "Atlanta personal injury lawyer",
      "author_url": "http://www.webb-firm.com",
      "date": "2010-06-17 12:14:08",
      "content": "Great interview, who knew that salt selections were so varied and that new salts were so sought after?",
      "parent": "0",
      "gravatar_hash": "c713226bf5d09672f2cc89c60236fe11"
    },
    {
      "id": "1082",
      "author": "Selah*",
      "author_url": "",
      "date": "2010-06-20 14:20:17",
      "content": "Thanks for the article, but I was disappointed that you didn't post information about the mineral content of different salts, and I didn't see a note about their varying degrees of goodness to the body.  Would you or Mark Bitterman comment about the nutritous value of your favorite salts?  For example, how many minerals are in your salts as compared to common sea-salt?  Where do your salts come from? Rocks or the sea/ocean? Are there salts that are more nutritious for the body than others?  Thanks so much for answering if you can.  And thanks for giving me the heads-up about The Meadow.  I plan to be in Portland tomorrow so I'll google The Meadow and try to find your brick and mortor store! :)",
      "parent": "0",
      "gravatar_hash": "1d3286488d3bf0dc1f33fcea212b9625"
    },
    {
      "id": "1083",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-21 20:21:12",
      "content": "Hey Selah - the detailed nutritional info is beyond the scope of my knowledge. Let me know how you like The Meadow if you go there! I think it is quite an amazing shop.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "49642",
      "author": "emmycooks",
      "author_url": "http://www.emmycooks.com",
      "date": "2012-09-10 11:06:13",
      "content": "I love The Meadow and usually go when I'm in Portland.  I'm sure you also know SugarPill right here in Seattle--her selection of salts is much smaller but also fun, and I love some of her infused and flavored salts (not the same thing, I know, but they're darn tasty). :)",
      "parent": "0",
      "gravatar_hash": "a61a30a9ebb08ca22bc83f8cda99f9e9"
    }
  ]
}