{
  "comment_count": 6,
  "comments": [
    {
      "id": "20774",
      "author": "John",
      "author_url": "",
      "date": "2012-03-05 04:51:05",
      "content": "I tried an A/B test of this against my old standby, the Joy of Cooking recipe. Pros: this recipe uses much less butter, and somewhat less soda, getting some \"rise\", I suppose, from including the egg. So: less fat, more protein. Cons: You're supposed to knead this one, which is messy and takes time. I can whip up the Joy recipe in no time at all by comparison. Neutral: They end up quite similar, although the flavor of the Joy verison is a little richer, and its texture is a little more fall-apart-ish. To get your recipe to a \"form a ball\" consistency, I had to add quite a bit more flour, which was awkward when my hands were all sticky from kneading. Summary: both loaves disappeared within a couple of hours in the house, so I think they're both just fine. But I'll probably go with the lower-mess, quicker-preparation Joy recipe in the future.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "59252",
      "author": "Venera@Veggykitchen.com",
      "author_url": "http://www.veggykitchen.com",
      "date": "2012-10-04 01:08:36",
      "content": "Thanks for another great recipe, Michael! I make bread for my family every day on a Sourdough starter. Tomorrow I'll try this recipe for a change. My hubby is Irish - he will appreciate that more than anyone)))",
      "parent": "0",
      "gravatar_hash": "fa24f1035ae22ade4cb815b45f6c4678"
    },
    {
      "id": "59681",
      "author": "Nancy",
      "author_url": "",
      "date": "2012-10-04 17:22:28",
      "content": "This recipe will definitely go into my \"to do\" file. How wonderful to treat guests with fresh bread for breakfast, or with a bowl of soup for lunch or dinner. Autumn is definitely here in Wisconsin.  Thanks, Nancy",
      "parent": "0",
      "gravatar_hash": "53fd506dfb6253bc15106e1997ff1826"
    },
    {
      "id": "114250",
      "author": "Moira",
      "author_url": "",
      "date": "2013-02-05 08:00:38",
      "content": "My sister and I have been playing with various soda bread recipes recently.  Some call for cream, some add baking powder along with the baking soda, some use no butter (the recipes with cream), and this is the first I've seen that uses an egg and buttermilk in combination.\n\nA light kneading, to pull the dough together is part of all the recipes we've tried, and certainly part of our mother's ritual,  baking either soda bread or the wheat loaf.  Michael's 9oz. of flour does seem on the \"light\" side ... will try it out !\n\nMy sister and I started this trial when we discovered last St.Patrick's day, that soda bread is one of our kids' favorite foods!  With Irish parents, we felt compelled to learn how to bake the best one.",
      "parent": "0",
      "gravatar_hash": "e14043d0b484489c08c4c6c496a215f7"
    },
    {
      "id": "149494",
      "author": "Don Modaro",
      "author_url": "",
      "date": "2013-05-20 08:04:51",
      "content": "Do you provide the nutritional value for you recipes somewhere?",
      "parent": "0",
      "gravatar_hash": "429df09dbe32ec0541db8a777c36ca40"
    },
    {
      "id": "149502",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-20 08:19:46",
      "content": "Hey Don - no, I'm sorry to say I don't. I believe there are some online calculators where you can plug them in fairly easily.",
      "parent": "149494",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}