{
  "comment_count": 11,
  "comments": [
    {
      "id": "195517",
      "author": "Moira",
      "author_url": "http://magdalenasmiles.wordpress.com",
      "date": "2013-09-11 09:31:47",
      "content": "Lovely. I'm making this with fresh garden figs this weekend and can't wait to use this cake formula.",
      "parent": "0",
      "gravatar_hash": "e14043d0b484489c08c4c6c496a215f7"
    },
    {
      "id": "195520",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-09-11 09:38:28",
      "content": "I suspect it is going to be terrific with figs!",
      "parent": "195517",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "195710",
      "author": "Megan",
      "author_url": "",
      "date": "2013-09-12 21:51:16",
      "content": "Things I learned:  \n\n1) you can, in fact, substitute coconut sugar for the brown sugar, but if you do, pour it into the cake pan immediately: it doesn't hold up well to cooling and reheating.\n\n2) if you discover too late that you don't have enough sour cream, but figure you can use yogurt to round out the cup, DON'T FORGET TO PUT IN THE YOGURT.  It's quite dry without.\n\n3) if you forgot the yogurt, soak the cake in whipping cream before serving.  Problem deliciously solved!\n\nSorry I screwed up your lovely recipe, Michael!  The foundations were strong, however, and we enjoyed it anyway!",
      "parent": "0",
      "gravatar_hash": "1212305a3cb02b9b1201846e8a16c0cc"
    },
    {
      "id": "195748",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-09-13 05:45:07",
      "content": "Funny! I'm glad you were able to salvage it and have something tasty :)",
      "parent": "195710",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "196293",
      "author": "Joel",
      "author_url": "",
      "date": "2013-09-16 06:58:07",
      "content": "This worked out really well, even after having to run out for more flour in the middle of mixing the batter.\n\nI used some California \"port\" as the liquor and wondered what the taste might have been with plum infused palinka.\n\nThanks for the advice about wrapping the bottom of the springform pan.  I just couldn't keep the butter totally bound in the sugar.  A happy mess.  I think this cake is coming out again for Canadian Thanksgiving.",
      "parent": "0",
      "gravatar_hash": "eebbc69650b9ed3317a7a8c606f9c040"
    },
    {
      "id": "197360",
      "author": "Kate",
      "author_url": "",
      "date": "2013-09-23 07:54:17",
      "content": "I could not get this to cook through! Didn't help that my husband thought putting a knife in the middle to check meant putting a knife in sideways from the outside toward the middle! I served my slightly gooey cake with sponge candy ice cream to cover the issues and it was still delicious. I'm going to try this one again and add a little more flour, a little less liquid, or turn on the convection feature on my oven to heat the cake more evenly.",
      "parent": "0",
      "gravatar_hash": "26dc84bbde4cb5dd196075983f90e15c"
    },
    {
      "id": "197816",
      "author": "Nithya",
      "author_url": "http://www.nithyasnalabagam.com",
      "date": "2013-09-26 20:00:09",
      "content": "Very inviting and delicious recipe.. I am going to try it this weekend..",
      "parent": "0",
      "gravatar_hash": "15d9f11813dfec87b5eba1cceb5adb45"
    },
    {
      "id": "493521",
      "author": "Lisa Murray",
      "author_url": "",
      "date": "2014-01-06 10:28:03",
      "content": "Hello Michael---LOVE your recipes.  Very creative and fun &amp; healthy to eat.\n\nI must  CRUNCH to be satisfied---Here's HOW I'd do and ENJOY your Upside Down Plum Cake!  To Step 8, when Cake is finished while very warm sprinkle top with Sugar In The Raw!  Also I'd substitute out 1/2 cup Flour with Almond Flour (for Protein).  Can't wait to make this!",
      "parent": "0",
      "gravatar_hash": "a71cdcfa3ba47ac748c9c61ff5085c61"
    },
    {
      "id": "675298",
      "author": "Melody",
      "author_url": "",
      "date": "2014-02-04 10:45:08",
      "content": "This looks delicious! I cant wait to try this recipe. This cake reminds me of an apple coffee cake I found on kimkushner.com/blog The fruits look so beautiful on the cake, making the cake not only delicious but beautiful! I cant wait to bake this cake!",
      "parent": "0",
      "gravatar_hash": "ab1b9911e900f49cd0b78a0633e0031f"
    },
    {
      "id": "1182279",
      "author": "Kelvin tan",
      "author_url": "http://www.tankelvin.com",
      "date": "2014-12-11 20:29:53",
      "content": "Looks delicious! Cannot wait to try this recipe...",
      "parent": "0",
      "gravatar_hash": "6395db0eb8af887a29ad7e22a33f3556"
    },
    {
      "id": "1314106",
      "author": "Dave",
      "author_url": "",
      "date": "2016-02-05 13:13:57",
      "content": "Medjool dates would be wonderful with this recipe. Soak them in a little bourbon before adding.",
      "parent": "0",
      "gravatar_hash": "96ed328c57671b40e9152a9cb81a0ebd"
    }
  ]
}