{
  "comment_count": 10,
  "comments": [
    {
      "id": "3806",
      "author": "bri",
      "author_url": "http://figswithbri.com",
      "date": "2007-12-26 11:42:38",
      "content": "Yum!  Your tamal fillings are great.  I love roasted poblanos, and the portabellas in red mole sound delish.  I've had trouble finding vegetarian mole.  It usually has some schmaltz (to use the Jewish term) in it.  Tamales are a big undertaking since they are labor intensive, but if you can make a bunch and have leftovers, they are such a treat.  Great idea!",
      "parent": "0",
      "gravatar_hash": "e1adf5ffb76e72da07429a38e8594186"
    },
    {
      "id": "3807",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2007-12-26 22:25:11",
      "content": "I usually make a mole from scratch, though I think that there is a brand named something like Dona Maria(?) that doesn't have animal fat. You can always do a \"quick and dirty\" version with Ibarra or other unsweetened chocolate, cinnamon, oregano, garlic, onions, canned chipotle and/or roasted and seeded dry chilis, broth, and roasted and ground pumpkin seeds - it doesn't have to be the full 23 ingredient affair.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3808",
      "author": "bri",
      "author_url": "http://figswithbri.com",
      "date": "2007-12-31 13:20:55",
      "content": "Thanks!  It seems so involved, but maybe I just need to step up to it and make it.  I made a dry Ethiopian seasoning mix once and we used it regularly for like 6 months.  So, I think mole is just something I need to add to my to-do list.  :)",
      "parent": "0",
      "gravatar_hash": "e1adf5ffb76e72da07429a38e8594186"
    },
    {
      "id": "3809",
      "author": "GG",
      "author_url": "http://www.fawnskinflyer.com",
      "date": "2007-12-31 15:48:38",
      "content": "Hmm, you cook like me--but try and give estimations next time so we can post a recipe! Thanks for stopping by the Fawnskin Flyer. So, instead of menudo, what are you doing for New Years?",
      "parent": "0",
      "gravatar_hash": "3ad48652d68cebecab8e55e2939afec3"
    },
    {
      "id": "3810",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-01-02 11:21:17",
      "content": "Funny you should <a href=\"https://herbivoracious.com//2008/01/new-years-feast.html\" rel=\"nofollow\">ask</a> :).",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3811",
      "author": "LaAmericanaMexicana",
      "author_url": "",
      "date": "2008-02-18 13:17:42",
      "content": "Mexicans dont bastardize jewish hannukah or passover dishes, we would appreciate you not bastardizing our traditions. Keep your matzo balls, we'll keep our tamales, you make a flavorless inauthentic mess anyway.",
      "parent": "0",
      "gravatar_hash": "80c5f5c484a94d2ed38f763b5ceb0c3b"
    },
    {
      "id": "3812",
      "author": "Gary",
      "author_url": "",
      "date": "2009-06-14 14:55:12",
      "content": "Are you kidding LaAmericanaMexicana. Most so called Mexican Restaurants across the US serve a \"bastardized\" version of traditional dishes or do you and your family usually sit down to the \"Speedy Gonzalez Combo #1\" for lunch. Lighten up. American cuisine is based upon borrowing from the ethnic cuisines of its residents' native countries. Celebrate it. (btw a little avacado in matzo ball soup is great)",
      "parent": "0",
      "gravatar_hash": "bd098431010dff752dacbefc6502aee7"
    },
    {
      "id": "3813",
      "author": "Ava",
      "author_url": "",
      "date": "2009-11-06 17:42:11",
      "content": "Wow. Really?\nNo offense, but you are stupid.\nI'm Jewish and Italian-Mexican, and to hear you say this really offends me. I love my matzo balls, but I also love my pipian.\nHow dare you say 'keep your matzo balls'? That is ethnocentric and obviously ignorant of you. Food is for everyone and for someone who is not Mexican but wants to try something out of my culture (forgive me if I do not say 'us', but by your words you do not sound like the warm and friendly people that inhabit my beautiful Mexico), it is a joy to see them enjoy something I grew up loving.\n\n\nAnyways, this sounds delish, my mom and grandma usually make sweet tamales: filling them up with pineapple or raisins is amazing!",
      "parent": "0",
      "gravatar_hash": "1934389d07ab40bbcc3ce23838d3c9bd"
    },
    {
      "id": "3814",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-11-06 20:02:58",
      "content": "Thanks for posting that Ava - I've been blogging 2.5 years now and LaAmericanaMexicana's comment is probably the single most irritating one I've received. The funny part is how ignorant she is of her own country's cuisine. As you say, tamales for example can be filled with hundreds of different things. Anyhow, I appreciate your commenting. And your family's sweet tamales sound great!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314561",
      "author": "JewishMama",
      "author_url": "",
      "date": "2019-01-02 13:39:01",
      "content": "Wow. Just wow. I am Jewish/Spanish and we don’t limit our palette. I would gladly put my kosher Jewish Texmex tamales up against an “authentic Mexican Tamale” any day.",
      "parent": "3811",
      "gravatar_hash": "eff7889df6d2bc4678f89b0a8944c0ab"
    }
  ]
}