{
  "comment_count": 30,
  "comments": [
    {
      "id": "17853",
      "author": "Presto Pressure Cooker",
      "author_url": "http://pressurecooker-outlet.com/prestocooker.htm",
      "date": "2012-01-25 07:40:01",
      "content": "Awesome sounding recipe and loved the intro to it. Very fun! My mom was definitely in the Take it or Leave it camp, so I can definitely relate to that. Can't wait to try this recipe!",
      "parent": "0",
      "gravatar_hash": "38ea6ac0db32954d95dc5217cb5bda1f"
    },
    {
      "id": "17855",
      "author": "Amanda Cruz",
      "author_url": "http://​www.re-discovering-me​.blogspot.com",
      "date": "2012-01-25 07:46:14",
      "content": "What a beautifully written piece.  Loved the story and can't wait to try the recipe!!",
      "parent": "0",
      "gravatar_hash": "741f86b51efd312c0b57baf3dd733d6e"
    },
    {
      "id": "17861",
      "author": "Phoebe",
      "author_url": "",
      "date": "2012-01-25 09:12:47",
      "content": "I'm a New England girl and I adore kala chana!  Keep a bag on hand always.  Such a nutritious and delectable snack.  A curry is not the only way:  my Rajasthani (indian) mother-in-law sautées warm cooked kala chana in cumin seeds, blk mustard seeds, curry leaves (key), and a teeny bit of oil, and then dresses them with cayenne pepper, and either fresh shredded green mango or tamarind sauce, and then salt and chopped tomato.  *Divine!!*\n\nRotLI (vs roti) and shaak (vs sabji) surprised me, Amee-- that's not Hindi, right?  Curious to hear what region in India your mom's cooking comes from!",
      "parent": "0",
      "gravatar_hash": "9abef0a5542cebbb31b8ecec750bb816"
    },
    {
      "id": "17871",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-25 09:36:36",
      "content": "Ooh, your mother's version sounds delicious!",
      "parent": "17861",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17879",
      "author": "Alissa - Not Just Apples",
      "author_url": "http://notjustapples.blogspot.com",
      "date": "2012-01-25 09:40:15",
      "content": "I've never heard of black chickpeas before...but this dish looks delicious!",
      "parent": "0",
      "gravatar_hash": "2d1ecfb86266ff2a56952035138a9c02"
    },
    {
      "id": "17880",
      "author": "amee",
      "author_url": "http://www.rabbitfoodrocks.blogspot.com",
      "date": "2012-01-25 09:50:39",
      "content": "Thanks Michael for allowing me to write \"boobs\" on your site.  :)  Thanks so much for the kind introduction and the opportunity.  Phoebe - We are from Gujarat.  And the version you mentioned is one of my favorites: a common way to serve it as Indian street-side chaat.  The best!",
      "parent": "0",
      "gravatar_hash": "22476a0ce17918636d3355926c514729"
    },
    {
      "id": "17881",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-25 09:56:38",
      "content": "Well I've been trying to up the rating to PG-13 anyhow! Thanks for guest posting. I love getting to introduce my readers to other folks that have a unique point of view on food.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17885",
      "author": "Marina",
      "author_url": "http://www.cowboycountryvegetarian.blogspot.com",
      "date": "2012-01-25 10:27:48",
      "content": "Thanks Michael, this looks and, i'm sure, tastes delicious. I've never heard of pre-soaking beans in baking soda though. What's that for?  Does it help to remove that oxalic acid?",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "17886",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-25 10:35:08",
      "content": "I believe it softens the skins, though I've never done it myself.",
      "parent": "17885",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17895",
      "author": "Jenny",
      "author_url": "http://vegetarianhatesvegetables.blogspot",
      "date": "2012-01-25 12:15:14",
      "content": "This sounds fantastic, and I love your writing style.  Heading over to check out your blog now :)",
      "parent": "0",
      "gravatar_hash": "efd63fa22c1a4cd1b5e1e7c8fc2b99bb"
    },
    {
      "id": "17902",
      "author": "Kalyn",
      "author_url": "http://www.kalynskitchen.com",
      "date": "2012-01-25 12:54:52",
      "content": "Oh how I wish I could have a taste of this.  I just got a bag of black chickpeas and have been excited to try cooking with them,",
      "parent": "0",
      "gravatar_hash": "d24156669d5962deb7fdc31688282e65"
    },
    {
      "id": "17907",
      "author": "Jenni",
      "author_url": "http://www.pastrychefonline.com/blog",
      "date": "2012-01-25 15:18:44",
      "content": "In my book, Indian spices are the warmest and most comforting. Ever. This sounds so great.  And, good luck w/the boobs, Amee. ;) lol",
      "parent": "0",
      "gravatar_hash": "b083e59b95eb8fe5d0bc611a0fcce438"
    },
    {
      "id": "17912",
      "author": "Jenné @ Sweet Potato Soul",
      "author_url": "http://www.sweetpotatosoul.com",
      "date": "2012-01-25 16:50:48",
      "content": "This looks so yummy. I've noticed the black chickpeas at Whole Foods lately, but haven't tried them yet. I wonder if they've got more antioxidants because of the color. I can't wait to pick them up now : )",
      "parent": "0",
      "gravatar_hash": "ecbfd7cf05cb8055f0de5ba4cac789db"
    },
    {
      "id": "18031",
      "author": "Jo",
      "author_url": "http://www.foodepix.com",
      "date": "2012-01-27 21:14:42",
      "content": "This looks absolutely delicious. Would love for you to share your gorgeous pictures with us at foodepix.com.",
      "parent": "0",
      "gravatar_hash": "b4b4048762dcfc15cf7607c921626fff"
    },
    {
      "id": "18213",
      "author": "Dave",
      "author_url": "",
      "date": "2012-01-30 09:51:47",
      "content": "Amee,  Love the recipe.  My family is really fond of the black chick peas.  I've come across Indian recipes where regular chickpeas (kabouli chana) are cooked with the addition of black tea.  I've tried it myself and, while it doesn't seem to add to the flavor, it turns the tan chickpeas a darker shade of brown.  I've often wondered whether the tea is added just so the kabouli channa will look like the more desirable kala chana.  Have you heard of this?",
      "parent": "0",
      "gravatar_hash": "953da7973a3db0abd30116b35503419d"
    },
    {
      "id": "18219",
      "author": "amee",
      "author_url": "http://www.rabbitfoodrocks.blogspot.com",
      "date": "2012-01-30 11:03:19",
      "content": "Dave - thanks for the comment..interesting.  I have never heard of adding tea in order to color/stain chickpeas, but that doesn't mean it doesn't happen.  Kala chana is actually a very common bean in Indian cuisine in India, just not common here in the States.  So if you can find it in an indian store, then go with it.  Otherwise, I would substitute with regular chickpeas.",
      "parent": "18213",
      "gravatar_hash": "22476a0ce17918636d3355926c514729"
    },
    {
      "id": "18221",
      "author": "amee",
      "author_url": "http://www.rabbitfoodrocks.blogspot.com",
      "date": "2012-01-30 11:04:58",
      "content": "Marina - I do it because my mommy told me to.  :)  But really, it's supposed to make the beans softer.  She also adds it before putting it in the pressure cooker too.  But not always.  We aren't very consistent or textbook cooks.  :)",
      "parent": "17885",
      "gravatar_hash": "22476a0ce17918636d3355926c514729"
    },
    {
      "id": "18818",
      "author": "John",
      "author_url": "",
      "date": "2012-02-08 05:21:49",
      "content": "My wife made this last night. It was pretty good. I can't detect any substantial flavor difference between regular chana and the black chana. There IS a texture difference -- the black chana's skins retain a slightly chewy texture. Aside from tripling the recipe (leftovers for lunches!), we followed it exactly. Despite the 18 hour soak and the 45-min cooldown, I still found the chana a little too chewy for my tastes, which surprised me a good deal. If you like your chickpeas as soft as the ones that come in a can, you'll need to cook this even longer.(!) If we were making it again, I might also go with a couple more tomatoes to increase the acidity of the dish a little bit. It's clearly the sort of recipe where small variations are not critical.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "19141",
      "author": "Sarah",
      "author_url": "http://www.sarahmelamed.com",
      "date": "2012-02-13 02:19:09",
      "content": "Great guest post and recipe. Black chickpeas are not usually found in most supermarkets but did locate some at the Indian grocery store in Ramle and at the Ethiopian Spice Store close by. Will need make ginger/garlic paste and I am ready to try this.",
      "parent": "0",
      "gravatar_hash": "7e37ba6c0e30dbfce4a8c30b0ffdae44"
    },
    {
      "id": "20321",
      "author": "Sumi",
      "author_url": "http://www.facebook.com/homeslicefoods",
      "date": "2012-02-28 19:16:27",
      "content": "I've actually heard and seen (thou never tried it myself) of adding tea bags while cooking chick peas. The tea bags help give it a darker color which is similar to the way the north indians cook it and the way it looks.",
      "parent": "0",
      "gravatar_hash": "3faaca42d0382bc9bcefb0dc1df0389a"
    },
    {
      "id": "41541",
      "author": "Aprille",
      "author_url": "http://www.myhydroponicskits.com/the-benefits-growing-hydroponic-plants/",
      "date": "2012-07-27 03:31:12",
      "content": "I just can't wipe the smile off my face upon reading your post. Not only that I'm becoming eager to try this dish (along with all the many mouth-watering recipes I've seen here) but I really had fun reading your witty post. I guess most moms are like yours. Too bad for those who have moms who are trying so hard to be a good cook, but they're really not. Thanks a lot for this! :)",
      "parent": "0",
      "gravatar_hash": "459dfc2af9300782860fe7b3a7591768"
    },
    {
      "id": "123180",
      "author": "Rio Thomas",
      "author_url": "",
      "date": "2013-03-02 19:41:33",
      "content": "I LOVE this dish, and can't wait to try this version. After our local Food Coop quit carrying black garbanzos, I panicked, then I felt SO fortunate to find the seed available from the lovely folks at Uprising Seeds. I fell in love with this fetching plant, esp the lovely flowers and its endearing,fuzzy little pods! http://uprisingorganics.com/vegetables/bean-phaseolis-vulgaris-/other-beans/black-kabouli-garbanzo/prod_158.html",
      "parent": "0",
      "gravatar_hash": "1a63b59404e62b015c117f9c31aab3d3"
    },
    {
      "id": "728481",
      "author": "Karthik",
      "author_url": "",
      "date": "2014-02-18 15:59:33",
      "content": "@marina I am not sure about oxalic but soaking black chickpeas with baking soda and hot water quickens the softening of beans. But i don't use baking soda, I soak the black chickpeas previous night in hot water and cook it for dinner next day. sometimes i drain the water and again fill with hot water just to quicken the softening process",
      "parent": "0",
      "gravatar_hash": "7fe1f779b41149d242bb7c3ec8d19416"
    },
    {
      "id": "1216983",
      "author": "lovelight",
      "author_url": "",
      "date": "2015-01-08 12:41:55",
      "content": "hehehh, I loved this post. I'm Gujarati &amp; totally relate. Good luck with all your cooking &amp; yumness.",
      "parent": "0",
      "gravatar_hash": "9320cf39ec2b98d05e7366a85007a1c4"
    },
    {
      "id": "1314118",
      "author": "Chris &amp; Emily",
      "author_url": "",
      "date": "2016-02-28 07:34:23",
      "content": "We made this great dish last night and definitely will again. \n\nWe had four observations that we thought might help others when preparing it. \n\nEverything we know about pressure cooking beans comes from the terrific cookbook, _Great Vegetarian Cooking Under Pressure_ by Lorna Sass (that cookbook and _Herbivoracious_ make up a good % of our thoughtfully prepared meals around here). Three observations come from her advice:\n\n1) Those of us who use 'jiggle top' pressure cookers should add 1 tablespoon of oil to the soaked peas and 4 cups of fresh water before bringing to high pressure. The oil helps control foaming. \n\n2) We added the salt *much* later in the recipe (midway through the final 20 minute simmer) because of her advice, \"adding salt or any acid to beans hardens their skins and prevents them from absorbing water properly. At best, cooking time will be retarded; at worst the beans will never become tender no matter how long you cook them.\" She goes on to point out some exceptions for beans with delicate skins, and in some soup/stews where tomatoes or salted stock has minimal impact. Her basic advice, however, \"add salt and acidic ingredients at the end of cooking.\" We wonder John if you tried adding the salt near the end of cooking, if you'd get a less chewy chickpea?\n\n3) That said, we did wind up returning our black chickpeas to high pressure for another 6 minutes after following the instructions above, because we weren't happy with the very chewy texture, and got a softer bean (though one still chewier than we would have expected if using regular dried chickpeas). \n\nFinally, when we got to the final 25 minutes of the recipe the dish was too dry and began sticking to the bottom of the pan. We added a touch more oil, but in a few minutes it was happening again. We wound up adding about 2/3 of a cup of a low sodium vegetable stock (it has tomato in it, and complemented the beautiful color palette of this dish nicely). That kept everything moist for the final simmer, and maybe added a bit more sauce for the rice.\n\nThanks Amee for sharing the recipe!",
      "parent": "0",
      "gravatar_hash": "83b679a30acc6cdbdf469c7086a75dc9"
    },
    {
      "id": "1314119",
      "author": "dave",
      "author_url": "",
      "date": "2016-02-28 08:58:08",
      "content": "Regarding the addition of salt, Steve Sando of Rancho Gordo had an interesting piece on his blog recently.  \n\nhttp://www.ranchogordoblog.com/2016/02/an-obvious-point-about-bean-cooking-not-everyone-knows.html\n\nHe regards it as a myth that salt toughens the beans and I tend to agree with him.  What does make a big difference is the pH of the cooking liquid.  Acid definitely makes the beans harder to cook to a creamy internal texture.  Conversely, a base will hasten the cooking. soften the beans and, in my opinion, improve the texture immensely.  I have started putting a small pinch of baking soda into my beans about midway through cooking with noticeable results.  \n\nDisclaimer 1:  I haven't actually tried this with kala channa.\n\nDisclaimer 2: I haven't tried adding the baking soda in a pressure cooker either, so I don't know whether it might promote high levels of foaming.  I might be tempted to do my pressure cook and then, if the beans are still hardish, continue the cooking conventionally with a pinch of baking soda till done.",
      "parent": "0",
      "gravatar_hash": "953da7973a3db0abd30116b35503419d"
    },
    {
      "id": "1314232",
      "author": "Nancy",
      "author_url": "",
      "date": "2016-11-04 14:26:50",
      "content": "Thanks for posting this. I soaked the black channa overnight with a bit of salt.drained and rinsed the next afternoon and cooked on the stove for about 1.5 hours. Near the end i randomly added baking soda to ensure softness.....voila these are the softest black channa i have ever made....the skin or inside is usually still hard after endless boiling.  So i dont know if it was the overnight salt or the baking soda that made a difference - but im happy with the results!",
      "parent": "0",
      "gravatar_hash": "ad89eece294087b24f61bf84d7fe9525"
    },
    {
      "id": "1314500",
      "author": "Sandya",
      "author_url": "",
      "date": "2018-02-17 02:17:14",
      "content": "Hi, tried the recipe and was too good. I have a query. Does the water change to dark brown color after pressure cooking the chana? Was concerned and so asking.",
      "parent": "0",
      "gravatar_hash": "d59af02d897131e796a20bc033950996"
    },
    {
      "id": "1314501",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2018-02-17 07:39:20",
      "content": "Hi Sandya - yes, the water will be dark after pressure cooking black chana.",
      "parent": "1314500",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314565",
      "author": "Divya",
      "author_url": "",
      "date": "2019-01-13 06:18:38",
      "content": "I absolutely love Kala Chana and this recipe looks a lot like one I’ve been making. \nRegarding the use of tea bags with kabuli chana I’ve seen that used when making it with the brown masala (using tamarind or dried mango powder - amchoor). It’s not used when making it with tomatoes. Hope that helps.\n(Brown masala kabuli chana is served with bhatura, a deep fried bread similar to sopapillas. Onions, ginger, garlic, amchoor or tamarind pulp. Garnished with fresh cilantro and/or mint leaves. Frozen bhaturas available in Indian grocery stores.)",
      "parent": "0",
      "gravatar_hash": "b45a2571956d50df7dc8504f03e71fae"
    }
  ]
}