{
  "comment_count": 13,
  "comments": [
    {
      "id": "17745",
      "author": "Marina",
      "author_url": "http://www.cowboycountryvegetarian.blogspot.com",
      "date": "2012-01-23 07:47:58",
      "content": "I've never used kasha in this combination.  Those cabbage rolls are so good, I can only imagine how tasty it was!",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "17746",
      "author": "John",
      "author_url": "",
      "date": "2012-01-23 08:28:02",
      "content": "I'm \"date negative\", to cadge an expression of yours. Any suggestions on a substitution? I was thinking that finely sliced dried apricots might work, but I'm so anti-date that I don't even have a good mental recollection of their flavor to use as a basis for the substitution.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "17747",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-23 09:11:55",
      "content": "Hah, yeah, I've noticed that dates are one of those polarizing foods that some folks just viscerally detest. Dried apricots don't taste anything like dates, but I think they would be a good replacement in this dish. What they would lack is some of the sweetness that the dates bring in, but they would add a tartness that would also be appealing.",
      "parent": "17746",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17748",
      "author": "zerrin",
      "author_url": "http://www.giverecipe.com",
      "date": "2012-01-23 10:43:13",
      "content": "Michael, this sounds so inspiring! I'm not familiar with kasha, but I do love nutty flavors, so I must search for it at the market. I love the addition of dates and pistachio. I often use currants and pinenuts, so yours will be a great alternative to me. For the sauce, I would use some tomato sauce with a little dried mint. Yum! BTW thank you for sharing the link to my cabbage rolls here.",
      "parent": "0",
      "gravatar_hash": "eed46d95dbe550b06a386c72c3242ebc"
    },
    {
      "id": "17749",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-23 10:57:03",
      "content": "Thanks! I agree, the tomato sauce would be good if you did this in cabbage rolls. I tried to get cute and make some sort of pomegranate molasses beurre blanc that just didn't quite get where I wanted it to be. Something to come back to maybe.",
      "parent": "17748",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17757",
      "author": "ben freedman",
      "author_url": "",
      "date": "2012-01-23 12:08:04",
      "content": "hi\n\nI'll be making this on friday night! can't wait. l love kasha (usually with mushrooms, onions and \nbow tie pasta ...) this will be a nice new taste treat.\n\nand of course i will be ordering your book soon ... i tried to the day you announced it but got some kind of error.\n\ni mentioned to my wife about you opening your own restaurant ..... we are i NH but will plan to fly out when the time comes! yummy\n\nthanks for all you share,\n\nben",
      "parent": "0",
      "gravatar_hash": "825a1e4c2a61919d1de8623b92eeed1d"
    },
    {
      "id": "17760",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-23 13:08:40",
      "content": "Thanks Ben! I really appreciate all your support during the writing process.",
      "parent": "17757",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17914",
      "author": "Sarah",
      "author_url": "http://www.wingedsnail99.blogspot.com",
      "date": "2012-01-25 17:24:58",
      "content": "Sounds amazing. I think I'll give it a try with freekeh. There should be more freekeh recipes in the world1",
      "parent": "0",
      "gravatar_hash": "24e48b8eb741f137642b390f00748c6b"
    },
    {
      "id": "17919",
      "author": "John",
      "author_url": "",
      "date": "2012-01-25 17:59:19",
      "content": "This came out very well. I made a double batch, and it served five with lots of leftovers. I used dried apricots instead of dates, which were fine, and I forgot to toast the pistachios, because I was flustered with other things like making some omelettes as well, and helping my daughter with a pie-crust and cooking some chard with caramelized onions. (We were kinda cross-cultureal tonight!) Anyhow, it's a winner. And it's good \"boat food\", too, in the sense that none of the ingredients except the butter need special handling like refrigeration. For a fluffy grain dish, it was surprisingly filling and warming. And it got high praise from my wife, for whom kasha is the ultimate comfort food for some reason. I skipped the cayenne, and held back on the baharat a bit, but everyone sprinkled some on their own plates, so it looks as if your amounts for that were right.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "17925",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-25 19:51:08",
      "content": "Sounds like a typically chaotic dinner scene at my house! I think the apricots are a smart choice if you don't like (or don't have) dates. Certainly keeps it in that same North African flavor group.",
      "parent": "17919",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17927",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-25 20:09:53",
      "content": "Here's one more if you are bustin' out the freekeh: https://herbivoracious.com/2011/10/pomegranate-glazed-freekeh-kofte-recipe.html",
      "parent": "17914",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "18028",
      "author": "ben",
      "author_url": "",
      "date": "2012-01-27 20:02:26",
      "content": "hi Michael,\n\nmade the kasha tonight. nice change of pace for kasha. all 7 of us enjoyed it. i'll make it again, maybe then i'll try it with ras el hanout\n\non a separate topic. i have been thinking of getting a pressure cooker. would you still go electric? didn't i read an entry you made about the electric ones? i looked but could not find it. seems like your cuisinart works! would you buy it again? opinion at this point?\n\nlooking forward to your book. maybe you'll promote it out here in boston or even NH.\n\ntake care, \n\nthanks,\n\nben",
      "parent": "0",
      "gravatar_hash": "825a1e4c2a61919d1de8623b92eeed1d"
    },
    {
      "id": "18038",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-27 22:59:49",
      "content": "Glad you liked the kasha! I have the Cuisinart CPC-600 (http://www.amazon.com/dp/B000MPA044/?tag=poeticlicen07-20) which I mostly love. I like that it is electric and has a built in timer and several useful modes, so you can pretty much set it and forget it. And it gets to a good level of heat in the saute mode when you want to, e.g., fry some onions before pressure cooking. The only negative is that apparently according to Dave Arnold's measurements, it doesn't get to the full 15 psi level that the stovetop models get to, which can be a problem for recipes where you are trying to achieve Maillard reactions at unusually low temperatures. If you want a stovetop one, everyone seems to love the Fagor and Kuhn Rikon models.",
      "parent": "18028",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}