{
  "comment_count": 27,
  "comments": [
    {
      "id": "40199",
      "author": "Anjali @ The Picky Eater",
      "author_url": "http://pickyeaterblog.com/",
      "date": "2012-07-23 07:34:20",
      "content": "I just came across your site this morning and I love it! As a fellow vegetarian, I'm really excited to try some of your recipes and meatless meals. This recipe in particular reminds me of a dish I had at a vegetarian restaurant in Sonoma a few months ago - and it was so interesting reading about where your inspiration behind this dish came from. Thanks for sharing and looking forward to trying your recipes soon!",
      "parent": "0",
      "gravatar_hash": "cbf7e2f632d66944d11f68eee5793c78"
    },
    {
      "id": "40221",
      "author": "Brigitte",
      "author_url": "",
      "date": "2012-07-23 10:07:14",
      "content": "Do not want to be at work now, would rather be running out right this minute to buy the ingredients to savor this delectable sounding treat, King Oyster Mushroom with Roasted Cherries and Sage. It has definitely made my list :). \n\ndemand, demand, demand,\n\nvegetalienne biologique,\nBrigitte",
      "parent": "0",
      "gravatar_hash": "cb04befa6901af927c165fe901e9d0ea"
    },
    {
      "id": "40560",
      "author": "Marc",
      "author_url": "",
      "date": "2012-07-24 13:58:38",
      "content": "Deffo need a recipe for this mate, I imagine this elaborated into \na dinner party main course maybe served with a mash for comfort \nand to mop up the juices.",
      "parent": "0",
      "gravatar_hash": "e19c325ac5cc184c834710e82a42c79f"
    },
    {
      "id": "40618",
      "author": "sasha",
      "author_url": "",
      "date": "2012-07-24 17:10:55",
      "content": "yes please, but do not know if i can find these-I live in the tropics so pls can i have an alternative!!!!",
      "parent": "0",
      "gravatar_hash": "f8a938b743826a43fe3be04f79728c21"
    },
    {
      "id": "40795",
      "author": "Dan Bartell",
      "author_url": "",
      "date": "2012-07-25 01:58:38",
      "content": "Michael!  It's so amazing that you discovered roasted cherries.  I was just doing a road/camp trip off the Oregon coast this past weekend and my lady brought along a metric f*ck ton of the tastiest rainier cherries from her parents tree.  We balanced the stems off the edge of a stick and roasted them off the campfire.  I loved the texture that was created, some how they \"tightened up\" and it resembled a texture of beef, and the flavor was so enriched.  They maintained the tartness, while developing an incredible sweetness.  I can't wait to try it with a coffee rubbed jackfruit (really should update you on my jackfruit experiences) and roast cherry  salsa.  BTW: Incredible work on your book, I'm proud to have it in my \"forever\" section of my cooking library.",
      "parent": "0",
      "gravatar_hash": "f5f75a93d3e3947100e50d0fa9f104c4"
    },
    {
      "id": "40797",
      "author": "Jennifer @ Delicieux",
      "author_url": "http://www.ledelicieux.com",
      "date": "2012-07-25 02:16:09",
      "content": "Wow, this looks absolutely fantastic. I would never have thought to combine cherries and mushrooms, but it looks amazing. I also love the sound of roasted cherries. I roast strawberries all the time, but never thought of roasted cherries. Fantastic.",
      "parent": "0",
      "gravatar_hash": "a41aacc5cc6f594d4dfbccf414e6137d"
    },
    {
      "id": "40807",
      "author": "erinwyso",
      "author_url": "http://www.olivesfordinner.com",
      "date": "2012-07-25 02:37:09",
      "content": "Simply gorgeous dish! (Just saw it on foodgawker and it made me do a double-take) -- Love how you shared your thought process for coming up with a new concept for a dish. I love King Oyster mushrooms fried or sliced and sauteed in some vegan butter and garlic, but will have to try your way -- these mushrooms look so pork-like!",
      "parent": "0",
      "gravatar_hash": "ae73d260a94027f9cad03ed129528964"
    },
    {
      "id": "40824",
      "author": "jrittel",
      "author_url": "",
      "date": "2012-07-25 03:20:20",
      "content": "Yes, recipe, please!     JUST discovered your blog, very readable and funny, and the pics are stunning. Can't wait to read the whole blog. Thanks, but yes, please consider posting the recipe...",
      "parent": "0",
      "gravatar_hash": "b44310c97884b1a4fa9c400c7e772412"
    },
    {
      "id": "40908",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-25 08:08:34",
      "content": "Hey Dan - I love your method of cooking the cherries on the campfire, would love to hear about your jackfruit experiments, and I'm delighted to hear the book has made it into your permanent collection!",
      "parent": "40795",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "41713",
      "author": "Marina@ Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-07-27 13:41:39",
      "content": "Interesting post, Michael! It brings bloggers closer when you read their stories, and it makes a person behind the blog the real person, to whom you want to come and hang out with (virtually).  \nKing mushrooms are one of my favorite fungi, I cooked with it a lot when we lived in Seattle (I don't see it here anywhere, well, I haven't seen fennel in a year either, and I thought it was a common vegetable). Cherries add an interesting flavor, although my family wouldn't eat it unless it's one of those European sour cherries. My husband believes that fruits and sweet additives belong only in desserts. :) \nI cooked those mushrooms with black currant when my currants were ripe (I had one on a patio), was really good.",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "42164",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-28 22:01:00",
      "content": "We get those sour cherries here for a few weeks each year, and man competition for them is tough!",
      "parent": "41713",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "43095",
      "author": "Mello",
      "author_url": "",
      "date": "2012-08-01 08:33:50",
      "content": "If only I could have the recipe right now...I have the cherries, I have the mushrooms (always do) and I also have guests for dinner tonight that I know would love this dish...if only...",
      "parent": "0",
      "gravatar_hash": "f2bdfd6b1c9002fdaf88cd2e993b0282"
    },
    {
      "id": "44275",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-07 13:55:01",
      "content": "Ok, I finally added the recipe - sorry it wasn't in time for your dinner :(.",
      "parent": "43095",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "44276",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-07 13:55:41",
      "content": "Finally added the recipe!",
      "parent": "40560",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "45205",
      "author": "sasha",
      "author_url": "",
      "date": "2012-08-13 13:33:06",
      "content": "Ok, I really want to do this ( and by the way thanks for making my TOFU better) there is no way here in the tropics of Australia I can get these mushrooms, what else could i use-thank you",
      "parent": "0",
      "gravatar_hash": "f8a938b743826a43fe3be04f79728c21"
    },
    {
      "id": "45208",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-13 14:06:32",
      "content": "Glad to hear about the tofu! Do you mean you can't get any wild mushrooms at all, or just not these particular ones? I think this dish would be good with say lobster mushroom if you could find it. Not sure I can think of a non-mushroom vegetable that is going to love the savory cherry sauce. Maybe you can find something interesting and local that would work with it. If so - please send pictures!",
      "parent": "45205",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "45238",
      "author": "sasha",
      "author_url": "",
      "date": "2012-08-13 17:33:13",
      "content": "Thanks, I can get Oyster, Shitake and that's about it-I live near the Great Barrier Reef.....I would so love to taste one of these mushrooms\n\nShall I give this a go with the Asian Mushrooms I can get-and yes I will send pictures\n\n\nI have been Veggie for most of the last 17 years and cook every day ( last night did a Cauliflower and Broccoli Curry with Brazil nuts) and recently I got my meat eating Hubby to read J Safran Foer's book ' Eating Animals' and bar one moment of 'I want meat 'in Bali, he is now a Veggie too.\n\n\nRe the tofu- I followed your instructions, I then coat the tofu in harrissa, Chinese 5 spice, cornflour, salt and pepper and then add sesame seeds..lovely. I usually then dip them with soy and pickled ginger",
      "parent": "0",
      "gravatar_hash": "f8a938b743826a43fe3be04f79728c21"
    },
    {
      "id": "45243",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-13 18:23:40",
      "content": "Of the two, I'd choose the shiitake over the oyster mushroom, since I think they are a little more flavorful to stand up to the cherries. Let me know how it goes!",
      "parent": "45238",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "54537",
      "author": "Lilly @ Table Matters",
      "author_url": "http://tablematters.com/category/viva-la-vegan/",
      "date": "2012-09-24 09:53:38",
      "content": "Hey Michael,\n\nI really love this idea; the roasted cherries combined with savory mushrooms is so unusual, but it's making my mouth water! The vegan substitution notes are much appreciated, by the way.\n\nThis post struck a note with me because it touches on a subject that I've struggled to explain to others: that you don't need meat, or huge amounts of pasta, etc., to create and enjoy a stand-alone dish. This recipe is exactly the kind of thing I'm talking about! Bravo!\n\nMuch thanks for the inspiration,\n\nLilly",
      "parent": "0",
      "gravatar_hash": "0de8de75e8a8de5f302930e782effd74"
    },
    {
      "id": "63776",
      "author": "Bob Engel",
      "author_url": "http://www.mycopia.com",
      "date": "2012-10-17 14:06:38",
      "content": "As a grower of king oyster, which we call Trumpet Royale, I think this recipe is fabulous. Really inventive trio of ingredients that are properly synergistic. One suggestion, cut the mushrooms before cooking, More surface area will make for richer flavor. Easier too.",
      "parent": "0",
      "gravatar_hash": "b57b8f83cbe9d90b74d25ebe3fd30aef"
    },
    {
      "id": "63777",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-17 14:11:11",
      "content": "Hey Bob - nice to hear from you, and I have indeed seen King Oyster under the Trumpet Royale or King Trumpet names. In general I agree with you about cutting them smaller, but in this case the idea of the dish is really to have something carveable at the table. I'm a big fan of those shrooms, here's another dish I use them in: https://herbivoracious.com/2012/05/korean-yakisoba-with-french-horn-mushroom-tofu-and-510-egg-recipe.html .",
      "parent": "63776",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "911753",
      "author": "Resa",
      "author_url": "",
      "date": "2014-05-19 08:20:02",
      "content": "How do you think this would be if I used tequila instead of red wine?",
      "parent": "0",
      "gravatar_hash": "63e8404b7a275cb0a2f92499feac372f"
    },
    {
      "id": "911912",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-05-19 12:10:45",
      "content": "That might be interesting; i've never mixed cherries and tequila but it sounds like an appealing combo.",
      "parent": "911753",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "914234",
      "author": "Resa",
      "author_url": "",
      "date": "2014-05-21 19:18:16",
      "content": "It was!!!  And the leftovers were even better today.\n\nI sometimes roast butternut squash with cinnamon, fennel seed, and fresh sage (part of a Michael Chiarello recipe) and I think a few cherries added after the squash cubes are half done would be a nice addition to that mix.  \n\nOne way or another - I will be roasting cherries with sage again. Soon.",
      "parent": "911912",
      "gravatar_hash": "63e8404b7a275cb0a2f92499feac372f"
    },
    {
      "id": "1314039",
      "author": "Jameson Fink",
      "author_url": "http://jamesonfink.com",
      "date": "2015-09-17 22:18:11",
      "content": "Michael,\n\nJust came across this post via Twitter and am having flashbacks (good ones) to that event at Emmer and Rye. This recipe sounds like it would be a great with a killer Pinot Noir or Cru Beaujolais.\n\nBest,\n\nJameson",
      "parent": "0",
      "gravatar_hash": "bb74c0422a199f6a02ed8379048056e3"
    },
    {
      "id": "1314137",
      "author": "Zyxomma",
      "author_url": "",
      "date": "2016-04-05 12:56:30",
      "content": "Vegan here, so no butter for me. I keep coconut oil in the fridge to substitute for cold butter. Just use less of it; it's so very rich. King oyster mushrooms are among my favorites, and this looks grand! Thank you from a first time visitor.",
      "parent": "0",
      "gravatar_hash": "de3be801369f25403e0d9e5cc87d3e9d"
    },
    {
      "id": "1314138",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2016-04-05 13:40:55",
      "content": "That was a good time!",
      "parent": "1314039",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}