{
  "comment_count": 16,
  "comments": [
    {
      "id": "23476",
      "author": "Ben G",
      "author_url": "",
      "date": "2012-05-02 07:16:02",
      "content": "Got the cookbook in the mail yesterday -- marvelous! Great job.",
      "parent": "0",
      "gravatar_hash": "d63b0c60a5de16ca3872b02c7abbc765"
    },
    {
      "id": "23481",
      "author": "John",
      "author_url": "",
      "date": "2012-05-02 09:27:17",
      "content": "Looks great. By the way, garlic chives are even easier to grow than regular chives. You start by taking a head of garlic from the grocery, breaking it into cloves, filling a small pot with dirt, and shoving each clove into the dirt about an inch deep so that its \"rough\" (i.e. less pointed) end is down. Add some water; wait a while. Soon (i.e., a few weeks) you'll have garlic chives.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "23486",
      "author": "Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-05-02 11:00:22",
      "content": "Is that what those mushrooms are called - French horn? Good to know. I've used it a lot in my cooking when we lived in Seattle and Uwajimaya was two blocks from us. Good times...  How is your tour going? Hope you have some fun too! :)",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "23497",
      "author": "raquel@eRecipe.com",
      "author_url": "http://www.erecipe.com",
      "date": "2012-05-02 13:35:15",
      "content": "Not yet tried Korean yakisoba. With mushrooms in it, this is going to be delicious. =)",
      "parent": "0",
      "gravatar_hash": "ebda16af4525821c706064fe9226303e"
    },
    {
      "id": "23502",
      "author": "Hanna",
      "author_url": "",
      "date": "2012-05-02 16:17:21",
      "content": "Hmm...I think Korean yakisoba (야끼소바) is as good a name as any. You'll see yakisoba on the menu if you go to an izakaya in Korea, and yakisoba is a pretty common find at Korean pubs as well.\n\nThanks for the recipe! It's a different take on my fallback meal--noodles with kimchi, tofu, and scallions.",
      "parent": "0",
      "gravatar_hash": "96ee9402ee836674eab5d50b60397c09"
    },
    {
      "id": "23503",
      "author": "Hayley",
      "author_url": "",
      "date": "2012-05-02 17:26:51",
      "content": "I love my soba noodles in their unadorned form, where they can showcase their clean buckwheat flavor.. but your take would work wonderfully using udon (or rice) noodles as well :D",
      "parent": "0",
      "gravatar_hash": "fcfe1b7fa00f4cd0e51c28757e7a4ab3"
    },
    {
      "id": "23510",
      "author": "Angie",
      "author_url": "",
      "date": "2012-05-03 01:20:41",
      "content": "Hey there!\nI'm not actually sure the exact dish like yakisoba exists in Korea. Of course there are many different noodle dishes but this yakisoba seems like a fusion, but I must say, a great one!\n\nMy mum makes me this cold noodle for a midnight snack when I'm back home in Korea. She boils Somen, rinses them cold. Then she mixes chopped kimchi with sesame, a bit of sugar, more chilli of you would like, a bit of soysauce, spring onion, and a spoonful or two of the kimchi juice. This mixture is mixed with noodle with an ice cube or two (if it's a very hot day) and a boiled egg on top. Voila! Midnight kimchi noodle!\nI also like simple gochujang sauce with the noodle too. (gochujang, vinegar, sugar, more chilli if you can take the heat, sesame seeds..). This goes well with julienned cucumber and a boiled egg. This is called Bibim-Guksu.\nHave fun on tour, and thanks for your great blog!",
      "parent": "0",
      "gravatar_hash": "498fbe64c9925fd3a85cc5305bdc7ddc"
    },
    {
      "id": "23517",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-03 05:50:10",
      "content": "Oh man, the cold midnight snack noodle sounds amazing!",
      "parent": "23510",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "23707",
      "author": "Christopher Kandrat",
      "author_url": "",
      "date": "2012-05-08 17:11:34",
      "content": "Excellent dish, I love Korean food, and this was excellent usually don't like tofu but I may of changed my mind.",
      "parent": "0",
      "gravatar_hash": "2dcfa9a0c3a96a38d24d5f698532bf4c"
    },
    {
      "id": "23815",
      "author": "Sandy",
      "author_url": "http://www.vacuumcookery.webs.com",
      "date": "2012-05-11 12:07:54",
      "content": "Your friendly gardening geek here:  @ John - that's garlic *greens* or leaves you're talking about - yes, very easy to grow and useful in the kitchen as well as a pest repellent, but not chives.\nRegular chives are \"allium schoenoprasum\" and garlic chives are \"allium tuberosum\" - both look rather grasslike, with much narrower leaves and milder flavor than, respectively, onions or garlic.\nI don't use garlic or hot peppers in cooking as my husband can't digest either (I just grow them as pest repellent) - buckwheat noodles with mushrooms sounds really good, though; I think I'll add some kind of greens and do this for supper.",
      "parent": "0",
      "gravatar_hash": "08b4d0e5fa36d027ffb36baf85fdf3e7"
    },
    {
      "id": "25098",
      "author": "Vegan",
      "author_url": "http://www.sevenpoint2.com/",
      "date": "2012-05-27 19:13:59",
      "content": "This is one unique yakisoba. Definitely gives me the idea on how I can enjoy and make my own yakisoba.I love fried noodle dishes- whats not to love about the combination of noodles and vegies? haha",
      "parent": "0",
      "gravatar_hash": "bda7603876252c69c15f63b58a0bf6f0"
    },
    {
      "id": "28686",
      "author": "Marcus",
      "author_url": "http://www.greenvegetarianrecipes.com",
      "date": "2012-06-20 06:56:01",
      "content": "It's amazing how much fantastic food you can find within these pages, and here's yet another one that can't wait to be tried :) Michael, thank you!",
      "parent": "0",
      "gravatar_hash": "edd1a44bcf80063e9461f259ddb778a0"
    },
    {
      "id": "31710",
      "author": "Dave Horvitz",
      "author_url": "",
      "date": "2012-06-29 18:01:36",
      "content": "Korean Yakisoba. That recipe is awesome! Simple, quick, easy, doesn't make a mess, and ingredients on hand. We live way far from town. Having something like this that we can throw together with whatever we have is perfect. \n\nThank you.",
      "parent": "0",
      "gravatar_hash": "6c9fc2920f9a604842b9aac37d4e66a7"
    },
    {
      "id": "50955",
      "author": "Carolina",
      "author_url": "",
      "date": "2012-09-14 15:31:10",
      "content": "I just found your blog an hour or two ago after Googling for some tofu recipes. Now, I not only want to try your tofu recipes but almost everything else you have offered up here! I'm copy/pasting several of them to my recipe file, and know I'll be back soon for more. My mouth is watering right now. I will be making a glazed tofu tonight, and use your plate suggestions to add brown rice and broccoli along with the sesame seed condiment. YUM. Luckily it won't take very long to make. I am STARVING. So, I am SO happy I found you. I forsee a LOT of good eating in my future.",
      "parent": "0",
      "gravatar_hash": "41f09ba6c525c0778908b93e5fd36715"
    },
    {
      "id": "51013",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-14 19:15:10",
      "content": "Hey Carolina - I'm delighted to have you aboard, and I hope you get lots of use out of the recipes!",
      "parent": "50955",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1262797",
      "author": "Johannes",
      "author_url": "http://www.JohannesPong.com",
      "date": "2015-02-26 12:00:36",
      "content": "You're a GENIUS, Michael! \nThank you for sharing your awesome recipes. \nThey make me feel like cooking more sattvic vegetarian dishes at home.\nYour Asian-inspired recipes are highly creative, yet firmly rooted in various Asian culinary traditions... enough for me to want to try cooking them all!\n(Sometimes I cringe when I see non-Asians suggesting \"innovative\" ways to use or combine Asian ingredients that don't make any sense... or the other way around, Asians suggesting European techniques or products in the most FOB manner :P )",
      "parent": "0",
      "gravatar_hash": "c1f268360cc1aec86ad2e9ba3f218d66"
    }
  ]
}