{
  "comment_count": 75,
  "comments": [
    {
      "id": "22405",
      "author": "Nupur",
      "author_url": "http://www.onehotstove.blogspot.com",
      "date": "2012-04-04 06:25:04",
      "content": "I love koftas of all kinds and a kofta with leeks and eggs is very new to me. The cabbage looks so versatile- would be delicious in any wrap or sandwich.",
      "parent": "0",
      "gravatar_hash": "95179f92bc425a19d1e150289341b67e"
    },
    {
      "id": "22406",
      "author": "Chana",
      "author_url": "",
      "date": "2012-04-04 06:29:34",
      "content": "This looks delicious! One of my go to weeknight vegetarian meals is soba noodles with a fried egg.",
      "parent": "0",
      "gravatar_hash": "5e0e21d541c7f815eb8d7cf51c759325"
    },
    {
      "id": "22408",
      "author": "Anne-Marie",
      "author_url": "",
      "date": "2012-04-04 06:36:13",
      "content": "My farmers' market opens this weekend and I was hoping for some spring leeks (although it'll probably take three of those to equal one of yours). Now I'm REALLY hoping for them.",
      "parent": "0",
      "gravatar_hash": "6c337c444bec0c062ea93c15b689d1bb"
    },
    {
      "id": "22409",
      "author": "Joni",
      "author_url": "",
      "date": "2012-04-04 06:42:35",
      "content": "Tacos. I use all sorts of fillings, but my favorite is probably black bean tacos with a light slaw topping.",
      "parent": "0",
      "gravatar_hash": "63c01457c9935d79573057984bce8a23"
    },
    {
      "id": "22410",
      "author": "tiffany",
      "author_url": "",
      "date": "2012-04-04 06:52:13",
      "content": "Staple weeknight meal is quinoa risotto, grilled veggies, and soup made of seasonal veggies.",
      "parent": "0",
      "gravatar_hash": "2ae3b7d06500fe3f79b9782c0d529093"
    },
    {
      "id": "22411",
      "author": "Noelle (@singerinkitchen)",
      "author_url": "http://www.singerskitchen.com",
      "date": "2012-04-04 06:53:16",
      "content": "WOW, this looks super tasty. I need to go to my Farmer's Market and buy some leeks ASAP!",
      "parent": "0",
      "gravatar_hash": "fda8f6f17686d72fe2fd5f04dd8972ac"
    },
    {
      "id": "22412",
      "author": "Lindsey",
      "author_url": "",
      "date": "2012-04-04 07:01:00",
      "content": "These look delicious!  I really appreciate that you don't rely solely on soy as a protein source for your blog... I have a soy allergy and it is so hard to find soy-free vegetarian meals online!\n\nFavorite weeknight veggie meal (for the contest!)... seasoned black beans, diced and sauteed bell peppers and onions, and spicy broccoli slaw, wrapped up in a taco shell.  Yummy!",
      "parent": "0",
      "gravatar_hash": "819ed984319e35f18f80a02f22f9b45f"
    },
    {
      "id": "22413",
      "author": "Rachele",
      "author_url": "",
      "date": "2012-04-04 07:04:26",
      "content": "I'm in the process of moving, so lately my favorite veggie meal is whatever is easiest.  Going by the number of times I've eaten in the past couple weeks, a baked sweet potato with baked beans is my current favorite.  Not exactly the most inspiring dinner...",
      "parent": "0",
      "gravatar_hash": "08d4c003bf9833f2c1c582c1f9668a47"
    },
    {
      "id": "22415",
      "author": "Jenn",
      "author_url": "http://Mylife-veganized.blogspot.com",
      "date": "2012-04-04 07:12:08",
      "content": "My favorite weeknight meal is any version of beans and greens. It is so easy to make, only requires one pot (if beans are pre-cooked), and is super versatile. I've thrown it inside a pizza roll, stuffed peppers, wraps, and my all time favorite - eaten it straight from the pan!",
      "parent": "0",
      "gravatar_hash": "e8ed9168a31a8709eb736d5cf9e44c91"
    },
    {
      "id": "22417",
      "author": "wendy",
      "author_url": "",
      "date": "2012-04-04 07:20:12",
      "content": "Boring & predictable my go to is salad. I have also been on a kick where I make a batch of bean \"taco\" filling and use it in tacos, nachos, quesidillas, buritoes etc for a quick meal..",
      "parent": "0",
      "gravatar_hash": "9a577634da4b43192214e7e82681d6a2"
    },
    {
      "id": "22418",
      "author": "Rachel",
      "author_url": "",
      "date": "2012-04-04 07:21:57",
      "content": "One of my easy mid-week meals is a Spanish tortilla",
      "parent": "0",
      "gravatar_hash": "573e99ea3a742f7c3a965389bfa2df6d"
    },
    {
      "id": "22419",
      "author": "Stephanie",
      "author_url": "",
      "date": "2012-04-04 07:44:14",
      "content": "I love making carrot ginger soup. Easy and tasty. Homemade bread goes perfectly with it!",
      "parent": "0",
      "gravatar_hash": "eba39edd5561e31a23ad20efd4744e78"
    },
    {
      "id": "22421",
      "author": "Melissa C.",
      "author_url": "",
      "date": "2012-04-04 08:17:00",
      "content": "Basmati rice with chickpea stew topped with cilantro, served with a bit of hot sauce",
      "parent": "0",
      "gravatar_hash": "d6497c1f186c84011c031f866768e0f5"
    },
    {
      "id": "22425",
      "author": "Jodi",
      "author_url": "",
      "date": "2012-04-04 08:43:15",
      "content": "I've never cooked leeks, but this looks like a great recipe for my first try.  In our house we make black bean or black-eyed pea burgers, so this would make an interesting variation.",
      "parent": "0",
      "gravatar_hash": "ceac36a7eb256306f16c5715d65dfbdc"
    },
    {
      "id": "22426",
      "author": "Marsha",
      "author_url": "",
      "date": "2012-04-04 08:48:07",
      "content": "I did all 3. my fav meal is vegan pad thai",
      "parent": "0",
      "gravatar_hash": "6428a19dafe8439e6636d33505660a39"
    },
    {
      "id": "22427",
      "author": "Gayathri",
      "author_url": "",
      "date": "2012-04-04 08:48:51",
      "content": "My fav week-night meal: Crispy dosa (Indian style crepe) with sambhar (lentil soup), Finish it in style with plain yogurt!",
      "parent": "0",
      "gravatar_hash": "f912cec84e0b52faf77995e68246f01c"
    },
    {
      "id": "22428",
      "author": "Katie T",
      "author_url": "",
      "date": "2012-04-04 08:53:05",
      "content": "One of my favorite week night vegetarian meals is wheat couscous with garbonzo beans, veggies, feta and a mustard-vinegar dressing. Quick, protein filled and lasts for lunches during the week too! Also love an easy stir-fry, sandwich and salad or quick pasta like tomato basil pasta.",
      "parent": "0",
      "gravatar_hash": "4472c8cb79a581ddda85741fb13144c1"
    },
    {
      "id": "22429",
      "author": "Jenni",
      "author_url": "http://www.pastrychefonline.com/blog",
      "date": "2012-04-04 08:54:25",
      "content": "I love the colors, flavors and textures that come together in this! One of our fave veggie meals is a veggie burger: chipotle black bean patty with fresh guacamole, salsa and sour cream. Sometimes, we use veggie patties chopped up w/stir-fried veggies over rice to up the protein content, too.",
      "parent": "0",
      "gravatar_hash": "b083e59b95eb8fe5d0bc611a0fcce438"
    },
    {
      "id": "22430",
      "author": "Theresa Cole",
      "author_url": "",
      "date": "2012-04-04 08:59:02",
      "content": "roasted or sauteed veggies with a grain or pasta is my go-to meal when I don't have the time or energy to be more creative. there are so many possibilities that the DH and I don't get tired of it.",
      "parent": "0",
      "gravatar_hash": "0241f89807633857bc80f05ca5efef06"
    },
    {
      "id": "22431",
      "author": "Kay",
      "author_url": "",
      "date": "2012-04-04 09:04:34",
      "content": "I've been pondering the delicious, lightly spicy pickled red cabbage that comes with my falafel recently. I can eat huge piles of it, but never really thought about making it until just now. I can't wait! \n\nFor a weeknight, I love poached eggs on top of things: sauteed greens with a poached egg on top and a dash of vinegar, an egg poached in spicy tomato sauce on a piece of thick toast, etc. So easy to scale up or down -- just poach another egg!",
      "parent": "0",
      "gravatar_hash": "a62ebe8e4067298e68ac3c9776c2f8de"
    },
    {
      "id": "22432",
      "author": "megan",
      "author_url": "http://none",
      "date": "2012-04-04 09:06:55",
      "content": "I really enjoyed the recipe with grits, an egg, and the fried leeks- I've made it several times already. \n\nMaybe this recipe will convince me to use my leeks for something new :)",
      "parent": "0",
      "gravatar_hash": "f2333617ae039ea15abf1fa4b8492331"
    },
    {
      "id": "22433",
      "author": "Lynda",
      "author_url": "",
      "date": "2012-04-04 09:07:26",
      "content": "My newest favorite meal is either a spicy bean soup using re-fried beans, black beans, Mexican spices and veggie broth or another new favorite is bean chalupas where I use re-fried beans, mixed with garlic, bell peppers, sauteed onions and hot enchilada sauce + Mexican spices on a crisp fried corn tortilla, with homemade guacamole, lettuce and tomatoes. YUM!",
      "parent": "0",
      "gravatar_hash": "7778f42c748dd728ccb1e4e139974b1e"
    },
    {
      "id": "22434",
      "author": "Becca @ Amuse Your Bouche",
      "author_url": "http://www.amuse-your-bouche.blogspot.com",
      "date": "2012-04-04 09:08:20",
      "content": "Leek fritters sound amazing! And I love the idea of wrapping them in a pita bread.",
      "parent": "0",
      "gravatar_hash": "3b9efc269735cb16a43c4048130219de"
    },
    {
      "id": "22436",
      "author": "Matt",
      "author_url": "",
      "date": "2012-04-04 09:35:10",
      "content": "Sounds like this will be on the menu this week!  My last night's dinner was tofu bahn mi with smoked onion jam (smoked onion idea poached from your frijoles recipe).\n\nLove all the recipes, thanks for the great eats!",
      "parent": "0",
      "gravatar_hash": "b26552146ae3303051b3336ab84e7e79"
    },
    {
      "id": "22437",
      "author": "John",
      "author_url": "",
      "date": "2012-04-04 09:39:19",
      "content": "These look great. You can't go too wrong with leeks and oil. :)\n\nCurrent favorite basic dinner: a curried potato and cauliflower with nigella seeds prominent in the mix, a dal made in the pressure cooker with misc veggies, and (if I'm feeling adventurous) some curried okra as well. It's not hard to have all three of these done in about a half-hour.\n\nBut as Spring approaches, I think that your mango salad, some kind of tofu stir-fry, and baby zucchini/squash sliced lengthwise and fried in olive oil, finished with some lemon juice that can kind of caramelize on them...THAT might move to the head of the list.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "22439",
      "author": "Debbie",
      "author_url": "",
      "date": "2012-04-04 09:58:08",
      "content": "Not a vegetarian but I love reading all your recipes, I try to go meatless atleast once a week.",
      "parent": "0",
      "gravatar_hash": "e587cdebdf1a2e606ca2b7156fa52e8a"
    },
    {
      "id": "22440",
      "author": "Anne Campbell",
      "author_url": "",
      "date": "2012-04-04 10:01:06",
      "content": "I love kofta, and Middle Eastern food in general, so I'm definitely going to try these leek ones. \n\nPasta + veggie + cheese has always been my staple weeknight combination, but lately my husband has gone more low-carb, so I'm trying to find \"flexitarian\" options that I can eat with a pasta/rice/grain and he can eat with chicken or fish. Not to suck up or anything....but recently we've had your VERY addictive Sicilian cauliflower dish, with pasta for me and fish for my husband; and last night I made your coconut rice with stir-fried green beans, fresh mint, chile peppers, and fried shallots (he had chicken with the green beans).",
      "parent": "0",
      "gravatar_hash": "5cdecc447861b205659b26b2585302fb"
    },
    {
      "id": "22441",
      "author": "Chelsea",
      "author_url": "http://chelseahollow.com",
      "date": "2012-04-04 10:09:00",
      "content": "Hi! These look amazing! Can't wait to add them to my recipe book. :)\n\nMy favorite weeknight comfort food is Whole Wheat Pasta with blanched zucchini, asparagus, and brussels sprouts topped with a little salt and pepper and a poached egg! mmm.....",
      "parent": "0",
      "gravatar_hash": "6d7046acb0699661a8698d0a24a2e755"
    },
    {
      "id": "22442",
      "author": "Sonia Chawdhary",
      "author_url": "",
      "date": "2012-04-04 10:51:12",
      "content": "Can't wait to get my hands on a signed copy of your book! If I don't win the raffle, I'm going to be in Seattle in June and would love to bring my own book to have you sign it! Yes, just a tad bit obsessed! :)",
      "parent": "0",
      "gravatar_hash": "29fa8af888ab4039e5533dc315a61cd5"
    },
    {
      "id": "22443",
      "author": "Monica",
      "author_url": "",
      "date": "2012-04-04 10:53:08",
      "content": "What kind of harissa do you use?",
      "parent": "0",
      "gravatar_hash": "631b5f89ddd499e0531acca82cf313bf"
    },
    {
      "id": "22444",
      "author": "Hester",
      "author_url": "",
      "date": "2012-04-04 11:34:39",
      "content": "I tested this recipe!! It was great!!",
      "parent": "0",
      "gravatar_hash": "2092f4f2ecd89e5bf0dfa0036f532cf0"
    },
    {
      "id": "22445",
      "author": "soula",
      "author_url": "",
      "date": "2012-04-04 11:40:43",
      "content": "Favorite weeknight comfort food....hmmm....if we are talking COMFORT food...it'd be pasta with peas, mushrooms, sundried tomatoes, and parsley in a light cream sauce. yum.",
      "parent": "0",
      "gravatar_hash": "28aabc7602d7d5a0c55253a1f454211f"
    },
    {
      "id": "22446",
      "author": "melyssa",
      "author_url": "",
      "date": "2012-04-04 11:47:18",
      "content": "my favorite weeknight meal is veggie fajitas with fresh home-made pico de gallo! yum....just can't beat the combination of sweet peppers, fresh tomatoes,onions and cilantro....love it.",
      "parent": "0",
      "gravatar_hash": "8b54109483eb4b5b419900a5da8a7dfa"
    },
    {
      "id": "22447",
      "author": "Jessi Peterson",
      "author_url": "",
      "date": "2012-04-04 11:48:56",
      "content": "I'm going to try this out on my family the next time my sister comes to visit - she's a vegetarian, while my husband and I are more flex-i-tarian.  He loves gyros, she does not, so this seems like a good compromise.\n\nMy favorite comfort food right now is asparagus.  I like it roasted in a little olive oil with balsamic vinegar drizzled on it.  And leftovers (ha!) made into cream of asparagus soup!",
      "parent": "0",
      "gravatar_hash": "13ab59fa71b3741139147282ce28ef83"
    },
    {
      "id": "22448",
      "author": "Kathleen",
      "author_url": "",
      "date": "2012-04-04 12:19:58",
      "content": "My favorite weeknight vegetarian meal is roasted vegetable enchiladas, homemade pizza or simple tacos with YOUR guacamole recipe.",
      "parent": "0",
      "gravatar_hash": "1ea4b5a6e347e926817bc6696a576065"
    },
    {
      "id": "22449",
      "author": "Mariah",
      "author_url": "",
      "date": "2012-04-04 12:30:24",
      "content": "My favorite fast vegetarian weeknight meal is a quinoa risotto! Quinoa is great because it never gets too mushy and cooks fairly quickly. Throw in loads of chopped up veggies and a little bit of goat cheese (if non-vegan), and it's a healthy, high-protein meal in half an hour or so!",
      "parent": "0",
      "gravatar_hash": "34bbc17597f650ceea93c4917482acf8"
    },
    {
      "id": "22450",
      "author": "Mae",
      "author_url": "",
      "date": "2012-04-04 13:57:02",
      "content": "I am a new vegetarian and I just started reading your blog. I really like the topics and recipes I've seen so far and enjoy your writing style. Thank you!!",
      "parent": "0",
      "gravatar_hash": "b24e1ae2f5b5414093fe3dedf68d2520"
    },
    {
      "id": "22453",
      "author": "Karen",
      "author_url": "http://www.karebou.com",
      "date": "2012-04-04 15:31:12",
      "content": "Favourite weeknight meal would have to be this Vietnamese noodle dish that I make with lots of fresh herbs, roasted peanuts and egg quickly cooked with sesame oil.",
      "parent": "0",
      "gravatar_hash": "54dde47ff81d00baa17f418f0728a3c8"
    },
    {
      "id": "22454",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-04 15:43:59",
      "content": "I've used Mustapha's before, but it seems like they might be out of production. Try this one from Zamouri: http://www.amazon.com/dp/B004AQDCPA/?tag=poeticlicen07-20",
      "parent": "22443",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22455",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-04 15:44:45",
      "content": "It was so cool to have you and everyone else help with the \"beta testing\" on these recipes. Thanks again!",
      "parent": "22444",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22456",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-04 15:45:49",
      "content": "Thanks, Sonia! Also check out https://herbivoracious.com/upcoming-events - maybe I'm coming to your city? If so I'd love to meet you.",
      "parent": "22442",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22458",
      "author": "eldan",
      "author_url": "http://eldan.co.uk/",
      "date": "2012-04-04 16:23:00",
      "content": "When I saw the headline, my first reaction was \"Doesn't he mean 'köfte' and 'pırasa'?\" (the Turkish names for the same things).  Then my wife emailed me this news story:\n\nhttp://www.theatlantic.com/international/archive/2012/04/the-white-house-dessert-that-sparked-a-minor-turkish-greek-conflict/255439/\n\nwhich reminded me how ridiculous I was being.",
      "parent": "0",
      "gravatar_hash": "546fdfb13d94fbabcda513cbe68c8fb3"
    },
    {
      "id": "22459",
      "author": "eldan",
      "author_url": "http://eldan.co.uk/",
      "date": "2012-04-04 16:26:25",
      "content": "As for favourite weeknight vegetarian meals, it would have to be one of a hundred variations on slow cooker beans, served with rice or sopes.  Cheap, delicious, easy, healthy and I can set it up before leaving the house in the morning, ready to eat the moment we get home.",
      "parent": "22458",
      "gravatar_hash": "546fdfb13d94fbabcda513cbe68c8fb3"
    },
    {
      "id": "22460",
      "author": "Elana @ The Inventive Vegetarian",
      "author_url": "http://theinventivevegetarian.blogspot.com",
      "date": "2012-04-04 16:40:30",
      "content": "Mmmmm, this looks so good!  I actually LOVE cabbage (one of the hazards of having a Hungarian mother, apparently), so this is totally something I'm going to have to try!\n\nMy go-to vegetarian meal is probably a grilled portobello \"burger\" (marinated in oil, garlic, and balsamic vinegar) on a sandwich with fresh mozzarella and avocado.  Delicious!",
      "parent": "0",
      "gravatar_hash": "eec6094145be5861ed0d8e9109ecddfb"
    },
    {
      "id": "22462",
      "author": "Hanna",
      "author_url": "",
      "date": "2012-04-04 17:20:51",
      "content": "The easiest, vegetarian meal that I tend to eat has to be a bowl of soba noodles. Along with some chopped kimchi, I'll toss the noodles with a splash of kimchi juice, a bit of sugar, and a drizzle of sesame oil. If available, I'll add some chopped tofu pieces and scallions. Yum and yum!",
      "parent": "0",
      "gravatar_hash": "96ee9402ee836674eab5d50b60397c09"
    },
    {
      "id": "22463",
      "author": "Kanchan",
      "author_url": "http://personaltadka.blogspot.com",
      "date": "2012-04-04 18:03:37",
      "content": "The marinated cabbage looks delicious, and I love koftas as you have mentioned these are quite common in indian curries, but your version of leeks and eggs is quite new. Will surely give it a try.",
      "parent": "0",
      "gravatar_hash": "70f089fcb9ea446013d15d3021d2e042"
    },
    {
      "id": "22466",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-04 18:29:30",
      "content": "Ok, that's hilarious!",
      "parent": "22458",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22468",
      "author": "Emma",
      "author_url": "",
      "date": "2012-04-04 21:18:41",
      "content": "I love your Peppery Red Wine Capellini!",
      "parent": "0",
      "gravatar_hash": "64e1db36aa3b7cda8d4e74777b433968"
    },
    {
      "id": "22473",
      "author": "Alec Lemaire",
      "author_url": "",
      "date": "2012-04-05 04:17:53",
      "content": "My favourite weekday meal is omelettes with some fresh bread. It's a quick and easy, yet nutritious, way to feel good after a day at work. It's great that you can change up the ingredients each night! Since I work quite late, having a relatively lighter meal is nice as it doesn't leave me feeling to full before going to bed.",
      "parent": "0",
      "gravatar_hash": "f7b281d5294d0c59a02c1eabf57e3ba1"
    },
    {
      "id": "22474",
      "author": "Caitlin Allan",
      "author_url": "",
      "date": "2012-04-05 04:19:14",
      "content": "My favourite vegetarian week night food is Indian curry! The simmering spices and vegetables certainly helps me unwind after a busy day. It's also great because you can put it in a tupperware for lunch the next day!",
      "parent": "0",
      "gravatar_hash": "c9439284bd21e7285d1638271bf6426d"
    },
    {
      "id": "22476",
      "author": "Charlene",
      "author_url": "",
      "date": "2012-04-05 05:25:51",
      "content": "My favorite vegetarian  meal is a falafel sandwich. Looking forward to your book for additional ideas",
      "parent": "0",
      "gravatar_hash": "667a7f867c11321289cab0f8cbef1d8e"
    },
    {
      "id": "22478",
      "author": "Jana",
      "author_url": "",
      "date": "2012-04-05 07:48:25",
      "content": "i love to make a couscous salad cos it's quick and easy and you can put in whatever you have in the fridge. my fave combo is roasted fennel, tofu, sundried tomatoes and raisins :P",
      "parent": "0",
      "gravatar_hash": "aaba877df9488ac90cc78dc3764e07a6"
    },
    {
      "id": "22485",
      "author": "Donna",
      "author_url": "",
      "date": "2012-04-05 14:49:25",
      "content": "oh man. the spicy pickled cabbage alone seems like it would be delicious with so many things!!",
      "parent": "0",
      "gravatar_hash": "8e924de97d0920c1377b347686d24bd6"
    },
    {
      "id": "22490",
      "author": "amee",
      "author_url": "http://www.rabbitfoodrocks.blogspot.com",
      "date": "2012-04-05 17:07:43",
      "content": "So um I need to move to Seattle to be a Beta tester!!  :)  I really love leeks and street food so this is going on my pinterest list.  I always admire the range and diversity of your palate/dishes.  No vegetable feels left out in your kitchen!  :)",
      "parent": "0",
      "gravatar_hash": "22476a0ce17918636d3355926c514729"
    },
    {
      "id": "22493",
      "author": "Rini",
      "author_url": "",
      "date": "2012-04-05 18:19:39",
      "content": "As I have been a vegetarian for all of my life... I guess I have to figure out what my favorite food is, EVERYTHING! I have to say though, khichadi (mung beans &amp; rice), roti &amp; veggie curries, Sandwiches  &amp; Soups!",
      "parent": "0",
      "gravatar_hash": "ab23db92a3ec450d10ac7002cea1e2b0"
    },
    {
      "id": "22498",
      "author": "Bonnie",
      "author_url": "http://facebook",
      "date": "2012-04-05 19:50:55",
      "content": "My favorite week night meal is pasta with pesto.  I blend basil, garlic, pine nuts, salt and Parmesan in the mini blender until crumbly and then top the pasta with the pesto mix and cherry tomatoes cut in half and then shave a bit more of the Parmesan on top. Good to Go!",
      "parent": "0",
      "gravatar_hash": "02a80718b05e7ad7b872124a7cc4bcee"
    },
    {
      "id": "22507",
      "author": "Liz",
      "author_url": "",
      "date": "2012-04-06 06:29:33",
      "content": "Favorite weeknight meal is bean burritos.",
      "parent": "0",
      "gravatar_hash": "00cf8b80388318a69edfd612f9afd0c2"
    },
    {
      "id": "22508",
      "author": "Kaitlin",
      "author_url": "http://www.aflockofneat.wordpress.com",
      "date": "2012-04-06 06:49:35",
      "content": "Avocado, black bean, and sweet potato tacos with a side of coconut rice and tostones (fried plantain medallions). Add a little bit of spice from a favorite salsa and it's a real winner!",
      "parent": "0",
      "gravatar_hash": "44e65640e1ba3b2f5bfb29b1b3e5ddbd"
    },
    {
      "id": "22509",
      "author": "Jessica",
      "author_url": "",
      "date": "2012-04-06 07:00:34",
      "content": "Baked tofu and roasted veggies",
      "parent": "0",
      "gravatar_hash": "0c30e92d97749d873cf1a6a416f79781"
    },
    {
      "id": "22512",
      "author": "Victoria",
      "author_url": "",
      "date": "2012-04-06 09:34:33",
      "content": "I love Collard Wraps with falafel!",
      "parent": "0",
      "gravatar_hash": "5844076a02003e32327a62ec15872775"
    },
    {
      "id": "22515",
      "author": "indigo",
      "author_url": "",
      "date": "2012-04-06 11:09:41",
      "content": "This time of year I like a veggie matzo ball soup with lots of chard in it.",
      "parent": "0",
      "gravatar_hash": "93002035ce03990e0ca081c6ceeff398"
    },
    {
      "id": "22518",
      "author": "s",
      "author_url": "",
      "date": "2012-04-06 15:05:54",
      "content": "Pasta with lots of veggies.",
      "parent": "0",
      "gravatar_hash": "e48b6a769d5830c12c4d0e7597e1c830"
    },
    {
      "id": "22520",
      "author": "Lisa @ Snappy Gourmet",
      "author_url": "http://www.snappygourmet.com",
      "date": "2012-04-06 16:54:39",
      "content": "Your cookbook looks beautiful!",
      "parent": "0",
      "gravatar_hash": "9e712c59ada7ec8b8c77b028a8561bac"
    },
    {
      "id": "22542",
      "author": "y",
      "author_url": "",
      "date": "2012-04-07 10:38:03",
      "content": "My favorite week night meal is roasted veggies with some delicious sauce, bread and fried tofu.",
      "parent": "0",
      "gravatar_hash": "11e912a0d30361a1482104739e2fb9f3"
    },
    {
      "id": "22553",
      "author": "Jimish",
      "author_url": "",
      "date": "2012-04-07 19:45:50",
      "content": "A quick meal adapted from Mark Bitman's receipe: brocoli rabe, garlic, vegan sausage, and red seedless grapes warmed in a skillet",
      "parent": "0",
      "gravatar_hash": "c29073a9a177b8637e7ed66f265835dc"
    },
    {
      "id": "22556",
      "author": "Brandon",
      "author_url": "",
      "date": "2012-04-08 01:28:20",
      "content": "Leek patties... never would have thought of that.  Every recipe increases the value of my CSA box!  Can't wait for the cookbook!",
      "parent": "0",
      "gravatar_hash": "7766e7c1f62fe031bb41a421635c9beb"
    },
    {
      "id": "22562",
      "author": "Dennis",
      "author_url": "http://hoodiabuzz.com/my-hoodia/the-best-hoodia-weight-loss-supplement-2/",
      "date": "2012-04-08 07:06:26",
      "content": "I'm from the south so I really have to check out those collard wraps.",
      "parent": "0",
      "gravatar_hash": "16d736eedec6dda0a5ad094e9cae41e3"
    },
    {
      "id": "22572",
      "author": "Craig",
      "author_url": "",
      "date": "2012-04-08 12:22:28",
      "content": "My favorite vegetarian dinner is a bowl of cereal.  I don't have a lot of time.  These recipes are helping.",
      "parent": "0",
      "gravatar_hash": "57526dd4ce3a46901edc08bf4c43d4b9"
    },
    {
      "id": "22573",
      "author": "Melanie",
      "author_url": "",
      "date": "2012-04-08 12:22:54",
      "content": "looks delicious! i'm going to put my homemade sauerkraut in it!",
      "parent": "0",
      "gravatar_hash": "5b5fa7bd103728ebd8aeea4a334f36ef"
    },
    {
      "id": "22595",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-09 12:50:03",
      "content": "We have a winner, and it is Melyssa. Thanks, everyone!",
      "parent": "22446",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22596",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-09 12:50:31",
      "content": "Thanks for entering, everybody! Melyssa, above, won the signed book.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22602",
      "author": "Northwest Herbivore",
      "author_url": "http://www.northwestherbivore.com",
      "date": "2012-04-09 16:03:13",
      "content": "These look like something I'd like to try to veganize (though they might have to get in line behind several other of your recipes that I've marked!). What consistency should I aim for in the batter and in the finished patties?",
      "parent": "0",
      "gravatar_hash": "fb1c2b81280b6364671ba460337470b3"
    },
    {
      "id": "22651",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-10 21:49:13",
      "content": "Leeks a pre-sauteed. Batter should be thick enough to form patties, and finished kouftike should be lighter than, say, falafel.",
      "parent": "22602",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "23488",
      "author": "laura winikow",
      "author_url": "http://thereareworseobsessions.blogspot.com",
      "date": "2012-05-02 11:34:58",
      "content": "These remind me of my favorite Sephardic Passover dish:  keftes de prasa.  My family is from the Isle of Rhodes (first when it was occupied by Turkey and also later under Italian rule before WW2) and this was a particular favorite....never occurred to me to put it into a sandwich.  Wow and thank you for a great idea.",
      "parent": "0",
      "gravatar_hash": "aea9f796d607360458ff09b445e87de5"
    },
    {
      "id": "23495",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-02 13:25:46",
      "content": "Yep, the exact same thing! Keftes, kouftikes, people just have idiosyncratic ways of calling them. We always have them at Passover as well (with matzoh flour of course).",
      "parent": "23488",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}