{
  "comment_count": 4,
  "comments": [
    {
      "id": "3716",
      "author": "radish",
      "author_url": "http://www.sassyradish.com",
      "date": "2008-03-05 08:29:47",
      "content": "Hmm, the macro biotic place sounds great -- but are beets ok in macro biotic diet? I read somewhere that they're not.. there's a great macro biotic place my bf and i like to go to in NYC and i noticed they didn't have beets, potatoes or tomatoes among other things... next time i'm in LA i'll have to check this place out - i LOVE beets!",
      "parent": "0",
      "gravatar_hash": "04341568a39187cf5897aaea878fb272"
    },
    {
      "id": "3717",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-03-05 08:48:42",
      "content": "Yeah, that is a good question. I had the sense that they didn't hew to a really strict macrobiotic diet, but more that they were sure to offer lots of whole grains and some solid macrobiotic choices. But then again, my last real exposure to macrobiotics was 23 years ago, so I probably have forgotten a lot! Search for \"Michio Kushi\" if you want to learn more about it...",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3718",
      "author": "alpa",
      "author_url": "http://www.thegreenpeacock.blogspot.com",
      "date": "2008-03-10 19:20:11",
      "content": "wow, that sounds like an amazing food adventure!  you must must must post a recipe for the Jallab... it sounds heavenly and i want some too :)\n\nglad you guys had an awesome time!",
      "parent": "0",
      "gravatar_hash": "e118b1dd945f895317a6e8d3d7507445"
    },
    {
      "id": "3719",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-03-10 19:37:26",
      "content": "Well, I just tried searching for a Jallab recipe and sorta struck out. Lots of people like it, but as far as I can tell most folks buy the syrup and then just add water, ice, and pine nuts. If you don't have a local middle eastern grocery, here's <a href=\"http://www.lebaneseproducts.com/product_info.php?products_id=84&osCsid=0ba4a67927322994f054c117fe084076\" rel=\"nofollow\">one online source</a>. I've never used them before, but for $5 you can't go too far wrong.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}