{
  "comment_count": 20,
  "comments": [
    {
      "id": "136",
      "author": "giri",
      "author_url": "http://brindavaninthebayarea.blogspot.com",
      "date": "2011-09-19 12:01:37",
      "content": "The Jackfruit has been called the vegetarians chicken for a long time among the Indian community. This is supposedly because the structure of the fruit is very similar to that of chicken. You can notice the strands (like the muscle fiber in the chicken)on the fruit as you get to the edible part of the fruit\n\nbtw....Which local market did you spot it ?",
      "parent": "0",
      "gravatar_hash": "8b5b5ab44c552a1e86ef0297e30a4f28"
    },
    {
      "id": "137",
      "author": "Dan",
      "author_url": "",
      "date": "2011-09-19 13:06:18",
      "content": "Oh man!  This is my dinner for tonight.  Thank you VERY much.",
      "parent": "0",
      "gravatar_hash": "6431639dd83e572fff009bb7afe6fc78"
    },
    {
      "id": "138",
      "author": "chadzilla",
      "author_url": "http://chadzilla.typepad.com",
      "date": "2011-09-19 19:06:19",
      "content": "Very nice, Michael.  Asian and Latin were definitely 2 of my intended directions with this.  I would also encourage you to work with the whole fruit.  Just finding a good base method of cooking it... possibly wrapped in foil in an oven with neutral liquid and rub, to portion and freeze for re-use later.  Sous-vide definitely, but you would have to break it down into several portions.  Someone commented on my post that the seeds are edible also (another plus to getting it fresh).  I was actually wondering that as I was digging into it.  This organism yields one hell of a giant fruit.  Not sure how many people it would take to eat just one.  It's gotta be equivalent to at least 4 whole chickens.  Better either store it and diversify the preparations as to not get bored or have a jackfruit party.\nAlways good stuff here.  Honored for the mention.",
      "parent": "0",
      "gravatar_hash": "79f522c2f0a4befdd2b0eb5340ebb677"
    },
    {
      "id": "139",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-19 22:08:33",
      "content": "Thanks, Chad! Yeah, I&#39;m screwing up the stones to take on a whole fresh one of those monsters. Someone just mentioned on my facebook page that frozen is sometimes available as well, so that could be yet a third option, but clearly I need to experience fresh to set a benchmark for whether the preserved products are acceptable or not. I have to say that final picture of yours just looks really flavorful.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "140",
      "author": "pb",
      "author_url": "http://kamalkitchen.blogspot.com",
      "date": "2011-09-20 06:12:46",
      "content": "Hey..this is a gr8 idea..jackfruit is made in several ways in Indian cuisine..and certainly also in a 'curry' or masala type fashion and it sorta tastes like mutton or chicken...\n\nYou should give ripe jackfruits a try.. They are bright yellow in color and very sweet naturally. Of course, I have only ever eaten the fresh kind. They have a distinct heady aroma, which is characteristic of the jackfruit, just as the passion fruit has a taste unique to the passion fruit e.g\n\nJackfruits are grown a lot in the coastal areas in India, so its very possible that some enthusiastic desi folks in the northwest might have planted a tree in their backyard..\n\nIndian grocery stores are also a good option for fresh jackfruit!\n\nthanks..",
      "parent": "0",
      "gravatar_hash": "2b2aeef3ee84e2dcb66ae609be627642"
    },
    {
      "id": "141",
      "author": "Akanksha",
      "author_url": "",
      "date": "2011-09-20 13:23:39",
      "content": "Very nice... I absolutely adore jackfruit and had been looking out for interesting recipes. You can find frozen jackfruit in Indian grocery stores in frozen veggies section. Frozen jackfruit knocks the pants off the canned variety. It seems to contain only the very unripe, tender bits (the way its supposed to be) as opposed to the big,fat,ugly, not-so-tender fruit in cans.",
      "parent": "0",
      "gravatar_hash": "8dbc1108ad6f8627a10283b5753a6ba0"
    },
    {
      "id": "142",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-20 13:44:00",
      "content": "Thanks, Akanksha - I&#39;m convinced, gotta go seek out the frozen version soon, as well as fresh.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "143",
      "author": "Akanksha",
      "author_url": "",
      "date": "2011-09-20 14:15:45",
      "content": "Michael, try Apna Bazaar at 148th St, Bellevue.",
      "parent": "0",
      "gravatar_hash": "8dbc1108ad6f8627a10283b5753a6ba0"
    },
    {
      "id": "144",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-20 20:42:33",
      "content": "Hey Sandhya - I found it at ABC Mart (2500 Beacon Ave. S. in Seattle). But I&#39;m sure it is at Uwajimaya too, and I wouln&#39;t be surprised if they have frozen as well.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "145",
      "author": "Joe Nelson",
      "author_url": "http://profile.typepad.com/joenelson1",
      "date": "2011-09-21 16:37:39",
      "content": "Holy Cow, Michael!\nI lived in Thailand for two years and larb gai was pretty high on my list of reasons not to become vegetarian. I have stopped eating meat recently and am SO excited to give this recipe a try! It looks delicious.\nOh, and just fyi - when the meat is ground, they call it larb. When sliced (like it looks in your picture), it's called Nam Tog (waterfall). Thanks for many a great recipe!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "146",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-21 16:58:18",
      "content": "Ah! Thanks for the info on the name. I realized that the texture was different than larb, but I didn't know that there was a correct name for what I made :).",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "147",
      "author": "leslie.rutkowski@gmail.com",
      "author_url": "",
      "date": "2011-09-22 08:36:59",
      "content": "I've also had larb/laap/larp with sliced cucumbers on the side and Thai basil as a garnish. So delicious!\n\nThanks for the recipe.",
      "parent": "0",
      "gravatar_hash": "a2d55860221bf9f28f8b9b88dbe3ce44"
    },
    {
      "id": "148",
      "author": "Meghna",
      "author_url": "",
      "date": "2011-09-26 00:12:46",
      "content": "Thanks for such nice and healthy recipe:) Would love to read more.",
      "parent": "0",
      "gravatar_hash": "b4e2eac79c81adebd10419b5eb6a0a79"
    },
    {
      "id": "27995",
      "author": "The Mistress of Spices",
      "author_url": "http://www.mistress-of-spices.com",
      "date": "2012-06-18 08:07:51",
      "content": "What a great idea to make larb with jackfruit! You should try it with crumbled tofu though. I'm a vegetarian living in Thailand, where I enjoy it often. It is like heaven on earth, trust me!",
      "parent": "0",
      "gravatar_hash": "0b0bd5f05e41e767570141f351c17fb0"
    },
    {
      "id": "143070",
      "author": "Steve",
      "author_url": "http://ruggeddepot.com",
      "date": "2013-04-30 21:59:42",
      "content": "My wife loves jackfruit for lunch while I don't but I think this is great if ripe and good for snack.",
      "parent": "0",
      "gravatar_hash": "be92211877b39ccfbbb0f5c4d0b26963"
    },
    {
      "id": "145407",
      "author": "chef irie",
      "author_url": "http://www.iriespice.com",
      "date": "2013-05-08 09:23:14",
      "content": "I might not be Thai or Indian but coming from the Caribbean ( Jamaica), Jackfruit (ripe) is loved there. Ate much of it when I was a kid and I absolutely don't find anything wrong with the canned ripened fruit. Just because it's in a syrup doesn't mean it's only good for dessert. I've used it in quite a few savory recipes myself. Pegs great for stuffing, works great with lobster, cod, goat, and also some other cool vegetarian options. Will try the larb recipe though.",
      "parent": "0",
      "gravatar_hash": "83da54f04591d8fc5ed0a07c6984232b"
    },
    {
      "id": "878661",
      "author": "Neno",
      "author_url": "http://www.webadvice.osvojito.com/tag/jackfruit-health-benefits/",
      "date": "2014-04-10 23:08:45",
      "content": "It looks delicious on the picture.\nHow to get jackfruit in Europe?\nI guess you can only buy it in cans.\n\nI wrote an article about jackfruit and i would love it if you could comment or add anything.",
      "parent": "0",
      "gravatar_hash": "c0a9669e1849d83f0d4cf95ab8ac29f4"
    },
    {
      "id": "1292111",
      "author": "Angie G",
      "author_url": "",
      "date": "2015-04-05 05:08:02",
      "content": "does anyone know if I can use the flesh (not fruit) from a fresh ripe jackfruit instead of the canned?  and if so, how do I process the fresh vs. the brined(canned)?  I am lucky enough to have several international markets near my home, and have access to the most amazing products, including fresh jackfruit.  thanks!",
      "parent": "0",
      "gravatar_hash": "a1cc6e59522f76669034e1b181800323"
    },
    {
      "id": "1314009",
      "author": "Cheryl",
      "author_url": "",
      "date": "2015-08-03 09:26:19",
      "content": "I just opened my first jackfruit.  It wasn't a true green, unripe jackfruit, but it wasn't completely ripe either.  I simply cut it open, pulled it apart section by section and separated the seeds from the \"pods\", then just cut the flesh from the skin and put it in a freezer bag.  The pieces I cut from the skin looked tubular.  The pieces I pulled off the pods were more flattened and meaty looking. I sauteed an onion, then added the jackfruit and some spices and made tacos.  I would imagine brining it first would be delicious.",
      "parent": "1292111",
      "gravatar_hash": "7251b59179bab161e6ef4823ab5eeef1"
    },
    {
      "id": "1314027",
      "author": "Annette",
      "author_url": "",
      "date": "2015-08-30 16:16:34",
      "content": "There are 2 different kinds of Jackfruit, one used for cooking and one to ripen en eat as delicious fruit. If you get a good one it's like fruit in champagne.\nIt's called Nangka in Indonesia.",
      "parent": "0",
      "gravatar_hash": "fb69c4b62dac7df786411c9f0c3d90b8"
    }
  ]
}