{
  "comment_count": 38,
  "comments": [
    {
      "id": "3058",
      "author": "d.m.",
      "author_url": "",
      "date": "2008-12-26 01:54:33",
      "content": "that's a great blog entry! even though it's pouring rain in phx, i want to run to the store right now and buy a bag of potatoes to make these. my family and i were just talking earlier tonight about how fun it would be to make latkes...if only we had a good recipe. great timing. thanks!",
      "parent": "0",
      "gravatar_hash": "facc932377d7fe09d7268f3d54558da6"
    },
    {
      "id": "3059",
      "author": "radish",
      "author_url": "http://www.sassyradish.com",
      "date": "2008-12-26 04:15:45",
      "content": "Michael, happy Hannukah to you and your family. I used a Martha recipe this year and her technique of adding starch BACK to the potatoes is ingenious - it produced the crispiest latke ever! (i have it on my blog too) I'm also a latke purist, but I prefer mine hand-grated and it only takes a few minutes longer.",
      "parent": "0",
      "gravatar_hash": "04341568a39187cf5897aaea878fb272"
    },
    {
      "id": "3060",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-12-26 07:32:54",
      "content": "Thanks for reminding me about the the potato starch trick! I've done that in\nyears past and it does indeed work well. I go back and forth on the grating\nissue. Certainly the hand-grating is more traditional, but the food\nprocessor does give a nice complexity to the texture. I suppose there have\nbeen more important ideological schisms :).",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3061",
      "author": "Jessie",
      "author_url": "http://thehungrymouse.com",
      "date": "2008-12-26 11:09:01",
      "content": "Oh. My. Goodness. Yum!\n\n+Jessie\na.k.a. The Hungry Mouse",
      "parent": "0",
      "gravatar_hash": "9cef9c388673aefcda43f6d3c888efb2"
    },
    {
      "id": "3062",
      "author": "Cheryl Sills",
      "author_url": "http://profile.typepad.com/6p010536964334970b",
      "date": "2008-12-26 16:19:11",
      "content": "Happy Hannukah,\nThis is a very well-written article. Clear and concise\ninstructions for the recipe. Would be easy to follow for a beginning cook.\nI do prefer using the food processor. Enjoy!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3063",
      "author": "Angela",
      "author_url": "http://www.alopecianmuse.com",
      "date": "2008-12-26 17:56:57",
      "content": "Happy Hanukkah!\n\nI was whisked back to the days of my latke making. Unfortunately we have a grand daughter with multiple food allergies, and this year I was unable to successfully make latkes without eggs or flour! I've tried substitution flours and egg substitutes, but they don't work! LOL\nI enjoyed your post very much and in the spirit of Hanukkah, eat one with you in the virtual world.",
      "parent": "0",
      "gravatar_hash": "54e91142ee1219b01ebc40b20d0d28d8"
    },
    {
      "id": "3064",
      "author": "thepinkpeppercorn",
      "author_url": "http://thepinkpeppercorn.blogspot.com",
      "date": "2008-12-26 19:07:03",
      "content": "my favourite is step 7.   mmmmmmm!!!!!",
      "parent": "0",
      "gravatar_hash": "0145f8dcbe06da53cbda0bb3145f268f"
    },
    {
      "id": "3065",
      "author": "Sara",
      "author_url": "http://iliketocook.blogspot.com",
      "date": "2008-12-27 07:54:37",
      "content": "These sound so great.  I wish I had some potatos in the house!  Might have to go shopping later....",
      "parent": "0",
      "gravatar_hash": "d8c824ad01062f71d3a6f9109f80baf8"
    },
    {
      "id": "3066",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-12-27 21:23:28",
      "content": "You know, I gotta check to see if anyone read that far :)",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3067",
      "author": "Erica",
      "author_url": "http://talesfromthetracks.com",
      "date": "2008-12-27 21:37:24",
      "content": "These look amazing. I'm planning on making some latkes on the last night of Hannukkah - I'll be making them the pure way as well!",
      "parent": "0",
      "gravatar_hash": "8a943df68f07fae3d5ea02931d7ee71f"
    },
    {
      "id": "3068",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-12-30 15:37:35",
      "content": "Thanks for the comment Angela! Food allergies are a big issue in my family\nas well, so I sure understand. One thing you might try collecting the\nsqueezed out water and straining it to retrieve the potato starch, and using\nthat instead of flour. Not sure what the best egg substitute for latkes\nwould be though. Maybe Ener-G egg replacer? Not sure if it is gluten-free or\nnot though. Good luck!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3069",
      "author": "Kathy",
      "author_url": "",
      "date": "2009-01-01 13:56:40",
      "content": "YUM! I've had the russets sitting here for 4 days. Just made the latkes. YUM YUM YUM!",
      "parent": "0",
      "gravatar_hash": "bce072ef9070e75c7cd92574c23fe24f"
    },
    {
      "id": "3071",
      "author": "Ben Sherman",
      "author_url": "",
      "date": "2010-11-29 10:03:21",
      "content": "I would like to try yours!  When I make them, I get all the water out of the potatoes by putting them in my ricer.  Raw potatoes won't go through the holes but that thing has some SERIOUS leverage to squeeze the water out.",
      "parent": "0",
      "gravatar_hash": "8e94897d8bec178b14145d1f3d7b0d93"
    },
    {
      "id": "3072",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-11-29 10:25:31",
      "content": "Good call! When I wrote this article, I didn&#39;t have a ricer, but I&#39;ve acquired once since and I use it to extract water from spinach, so I can easily image it works well for this too.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3073",
      "author": "Rich R",
      "author_url": "",
      "date": "2010-12-12 12:08:59",
      "content": "The only Latkes I've ever had was at a Jewish deli in the suburbs of Cleveland, Oh.  They are awesome.  My wife and I had a hankering' for latkes today, unlike the \"potato pancakes\" that my mom used to make, and driving 1+ hours each direction just didn't sit well with us today.\n\nI immediately searched for a recipe and found yours.  My wife and I currently have full bellies.  You know the food was excellent when you're full up to your eyeballs and you still want to go back for more.\n\nThank you so much for the recipe.  While the basic ingredients are not rocket science, the preparation tricks make all the difference in the world.",
      "parent": "0",
      "gravatar_hash": "836abf52bce0df5192991500d788cabd"
    },
    {
      "id": "3074",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-12-12 13:45:22",
      "content": "Rich - that makes my day that these are your first homemade latkes! So glad you liked them and I appreciate you taking the time to comment.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3075",
      "author": "FARBROOKBOUVIER@AOL.COM",
      "author_url": "",
      "date": "2010-12-25 08:40:08",
      "content": "Thank you so much for bringing back a flood of wonderful childhood memories. I am making your recipe this evening with Christmas (we are a blended religious family)dinner. The meaning and tradition will not go unspoken. Christmas is an opportunity for us to gather as a family and show our love and appreciation for each other. God bless you and be with you and your family this holiday time and into the new year.",
      "parent": "0",
      "gravatar_hash": "db9f5af881810a08e86596d57f92b152"
    },
    {
      "id": "3076",
      "author": "Jeffrey Lemkin",
      "author_url": "http://profile.typepad.com/jeffle",
      "date": "2011-03-31 19:38:10",
      "content": "Michael, I just happened across your recipe via Swallowing Seattle and I heartily concur! Respect for the ingredients. No Crispy Pumpkin and Zucchini latkes for me either. I wrote a similar post about this (\"My Father's Latkes\") on my Calorie Factory blog. I also noted that squeezing the very last drop of water out of those potatoes was *critical* to making a latke so crispy and good you just want to. . .smack  somebody (in a good way of course!) when you eat one. :)\n\n<a href=\"http://taste.caloriefactory.com/2011/02/08/my-fathers-latkes/\" rel=\"nofollow\">http://taste.caloriefactory.com/2011/02/08/my-fathers-latkes/</a>",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "11135",
      "author": "Living The sweet Life",
      "author_url": "http://livingthesweetlifeblog.wordpress.com/",
      "date": "2011-12-12 18:35:47",
      "content": "OH MY GOODNESS - - you have no idea how happy I am you posted this recipe. When I was a lot younger, I had the best latkes ever and I've since tried endless times to copy the recipe. I've never come remotely close. \n\nI think this recipe will be the one!! :) Thanks.",
      "parent": "0",
      "gravatar_hash": "c276027428a5224091f7c518cd242a40"
    },
    {
      "id": "11278",
      "author": "Tikva",
      "author_url": "http://aliyahlift.com",
      "date": "2011-12-12 23:45:21",
      "content": "I make mine without eggs.  I just squeeze out the water well and incorporate the potato starch. They turn out great! I can't wait to make them!",
      "parent": "0",
      "gravatar_hash": "d5ead74e4b63c842d634ea7b3a06f534"
    },
    {
      "id": "12810",
      "author": "cecilia G. Haupt",
      "author_url": "http://none",
      "date": "2011-12-17 15:02:54",
      "content": "I am Catholic, but a good latke is hard to beat. I shred the potato, put into ice water for a while, wring  dry and I mean dry. Onion, garlic, flour, kosher salt, small amt of pepper, egg or not,  BUT staying white.  I add LEMON JUICE to the water and do not worry about discoloration. The same with scalloped potatoes made 'ready' to go when desired. Dry the potato slices either on paper towels or cloth  spread over slices then continue with recipe.",
      "parent": "0",
      "gravatar_hash": "b6e71b95e5602cefe31928c39b52142e"
    },
    {
      "id": "22866",
      "author": "Meredith",
      "author_url": "",
      "date": "2012-04-15 16:16:13",
      "content": "I followed this recipe to a 't' and....fabulous. Instruction #8 was a tough one!",
      "parent": "0",
      "gravatar_hash": "a5117c05e8019309b237841fbc6a50d1"
    },
    {
      "id": "22868",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-15 16:56:11",
      "content": "That one gets me every time!",
      "parent": "22866",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "52019",
      "author": "Nathan",
      "author_url": "",
      "date": "2012-09-16 17:21:10",
      "content": "Too salty; I scaled it up to 6 potatoes with 6-7 teaspoons salt, but still too salty so i added more flour.\n\nI think 4 teaspoons is perfect.",
      "parent": "0",
      "gravatar_hash": "0911a735d6162ab6dd5db80b638a8f3b"
    },
    {
      "id": "52266",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-17 18:47:48",
      "content": "Hey Nathan - One issue, which I need to be better about indicating, is that I use Diamond Crystal brand kosher salt, which weighs less (and is therefore less salty) per teaspoon than Morton's or typical iodized salt. And of course always follow your own palate.",
      "parent": "52019",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "72431",
      "author": "the jew",
      "author_url": "",
      "date": "2012-11-01 17:01:54",
      "content": "why do you use flour instead of matzo meal?",
      "parent": "0",
      "gravatar_hash": "43764706d0f17eda0395f1b77f26dad8"
    },
    {
      "id": "72571",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-11-01 22:58:25",
      "content": "I don't typically have matzo meal in the house except at Passover time... if you have it on hand, it will work just fine.",
      "parent": "72431",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "92203",
      "author": "Jr",
      "author_url": "",
      "date": "2012-12-03 13:56:21",
      "content": "A friend of mine will be alone this year as her parents will be out of town.  She adores latkes and what better present than to share this coming Hanukkah with her favorite latkes and applesauce. \n\nThank you so much, Michael!  These sound delicious!  I got 4 days to get it right ... lol\n\nI'll let you know!",
      "parent": "0",
      "gravatar_hash": "e96b1dacb779042d2dde8ad1719352ca"
    },
    {
      "id": "96472",
      "author": "Natalie",
      "author_url": "http://www.knatolee.blogspot.com",
      "date": "2012-12-09 09:24:25",
      "content": "Jewish food is the BEST! (says the ex-Catholic! :) ) My English Mum used to pass these off as \"potato pancakes\" but they were still delicious. Happy Chanukah!",
      "parent": "0",
      "gravatar_hash": "6480bf00f7641b0bc4c60e0688bafe89"
    },
    {
      "id": "96728",
      "author": "Running Betty",
      "author_url": "http://www.runningbetty.com",
      "date": "2012-12-09 17:13:55",
      "content": "These were delicious! I too am an old-school latke lover. Sure, I'll try a sweet potato maple pancake, but I probably won't go through the patzke of making them on chanukah. Your recipe hit the spot, and the additional squeezing is the tip I was missing all of these years.",
      "parent": "0",
      "gravatar_hash": "a86d8ec544dc83b7cb1176cc3fb8a1c6"
    },
    {
      "id": "99961",
      "author": "Shey",
      "author_url": "",
      "date": "2012-12-14 15:19:17",
      "content": "I have made these with flour for my husband and used gluten free flour for my daughter. Both times they have turned out awesome! I don't use the salt amount listed,I use less and coconut oil to fry them in. I would recommend a ricer to get as much water out as you can. Thank you for sharing this recipe!",
      "parent": "0",
      "gravatar_hash": "18d93ff7ce330ef4fb9d5470f04b1e75"
    },
    {
      "id": "99962",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-12-14 15:23:34",
      "content": "I use the ricer these days too. Works great. I'm planning on experimenting with potato starch instead of flour this week, will update the recipe if it works well.",
      "parent": "99961",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "100198",
      "author": "JT",
      "author_url": "",
      "date": "2012-12-15 15:09:26",
      "content": "Made them, loved them, will definitely make again.",
      "parent": "0",
      "gravatar_hash": "af15fb9ed74d3c38e2d4c16a17bac640"
    },
    {
      "id": "100212",
      "author": "Terri",
      "author_url": "http://www.knitandnosh.typepad.com",
      "date": "2012-12-15 16:18:46",
      "content": "This is exactly how I make latkes, and I have been making them more years than I care to say. I stand at the stove while the family decides who gets the next batch out of the pan.",
      "parent": "0",
      "gravatar_hash": "9cb00a064d2341d265560ef70b33ef69"
    },
    {
      "id": "100474",
      "author": "Dave Horvitz",
      "author_url": "",
      "date": "2012-12-16 20:12:29",
      "content": "Great latkes! Even my grandmother and dad would approve. That is hard to do.\n\nThanks.",
      "parent": "3060",
      "gravatar_hash": "546f90b8cef23641e270ae2955503331"
    },
    {
      "id": "469555",
      "author": "Louisa F. Wadleigh",
      "author_url": "http://Google",
      "date": "2014-01-03 09:52:45",
      "content": "My Jewish Mother would fry Potato Pancakes until we were all full. I would\nlook forward to eating them but after I got my fill I could wait until the next\ntime. We didn't use Sour Cream or Apple Sauce, just the Pancakes. I make\nthem now, they taste good but I think they tasted better when I was a child.\nOne day on a cooking show on TV they had a hint about making Pancakes.\nThey said if you use a Plastic Grater the Potatoes would not turn black as\nquickly when using a Aluminum Grater. I tried it and it works, I wanted to\ncall my Mother and tell her but sadly she had died years ago.",
      "parent": "0",
      "gravatar_hash": "423247dc6d26e623714aaeccf53be737"
    },
    {
      "id": "1314081",
      "author": "Michael Weiner",
      "author_url": "",
      "date": "2015-12-06 21:04:36",
      "content": "Thank you for posting a potato latke recipe without flour.  My family tradition has never used flour and they come out just fine, in fact way better than just fine.  Your recipe is similar to how I make latkes, though I don't use a recipe, I just make them.  We had some tonight, and will have more before Chanukah is over this year.",
      "parent": "0",
      "gravatar_hash": "7af8ecf6db82d535b797c345b9163523"
    },
    {
      "id": "1314479",
      "author": "Fran Goldman",
      "author_url": "",
      "date": "2017-12-16 20:50:36",
      "content": "I have an addition to your recipe. I add a teaspoon of baking powder  to  each 2 cups of grated potatoes after they have been squeezed dry.  Guarantees crispness.",
      "parent": "0",
      "gravatar_hash": "1a5531a3e1aee98bdd01fac6f5faedf2"
    }
  ]
}