{
  "comment_count": 29,
  "comments": [
    {
      "id": "153480",
      "author": "Elizabeth",
      "author_url": "",
      "date": "2013-05-30 07:19:12",
      "content": "Any readily available kosher substitute for that chili powder? What might be an equivalent chili if I were to dry and grind? Or find readily available with a hechsher?",
      "parent": "0",
      "gravatar_hash": "092b0bbf27d85dd63e97707b9569fc45"
    },
    {
      "id": "153491",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-30 08:13:54",
      "content": "Yep, I imagine it will be darn hard to find gochugaru that is kosher stamped. I've never tried any substitutions, but my inclination would probably be a mix of ancho for the fruitiness and something like chili de arbol for the heat.",
      "parent": "153480",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "153524",
      "author": "Moira",
      "author_url": "",
      "date": "2013-05-30 10:55:18",
      "content": "Grams ???\n\nAny down-home Rube-Goldberg suggestions for the vented cover, while fermenting ? Or is it simple enough to keep a pot lid tilted off a bit ?\n\nThanks, Michael. I've been putting this process off myself.",
      "parent": "0",
      "gravatar_hash": "e14043d0b484489c08c4c6c496a215f7"
    },
    {
      "id": "153529",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-30 10:59:49",
      "content": "Some folks even just use cheesecloth. I think even a tilted pot lid would be fine. The main thing is to keep the vegetables submerged so you don't get a layer of mold on top.",
      "parent": "153524",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "153535",
      "author": "Janie",
      "author_url": "http://hedgecombers.com/",
      "date": "2013-05-30 11:30:16",
      "content": "This looks very interesting. Shall bookmark for later in teh year when we have cabbages galore!\nJanie x",
      "parent": "0",
      "gravatar_hash": "0ffd67cb46ced44d17550366333e91a1"
    },
    {
      "id": "153537",
      "author": "Stacey",
      "author_url": "http://allergictosalad.com/blog/",
      "date": "2013-05-30 11:35:38",
      "content": "Love Sandor's books, especially Wild Fermentation. Love this kimchi recipe. So simple and delicious way to spice things up.",
      "parent": "0",
      "gravatar_hash": "a3fc978e4a39dd267ba2654d5f1207ac"
    },
    {
      "id": "153567",
      "author": "Marina@Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2013-05-30 14:23:03",
      "content": "Hi Michael, with all the moving/graduations/etc in my life have not had a chance to leave a comment here in a long time. But I am reading every post (big thanks to the e-mail subscription!). \nThis post came in a perfect time. I few weeks ago I was teaching people in the area the \"arts of fermentation\", and we made sauerkraut, kimchi, and some other fermented foods. I came up with the vegetarian kimchi recipe with soy sauce. We couldn't find gochugaru in the area, so I decided to use just plain chili pepper flakes. Also I didn't use any rice flour, only pear and pineapple puree. I need to tell you that my students were very happy, and kimchi was delicious (even though it was made out of 10 kilograms of napa cabbage it's all gone by now!) Later I received a gift from one of m friends book on kimchi where I found out that there are over 300 (!) kimchi recipes. Each region has it's own secret ingredient. Wow, I want to taste them all! :) Isn't fermenting fun?!\nThanks for giving your recipe in metric system! Although fermenting is not that precise when it comes to ingredients, it is good to have it in familiar numbers. :)",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "153572",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-30 14:32:36",
      "content": "So true! It is almost like opening a whole 'nother door on cooking, with endless possibilities to explore. I have the feeling there are going to be a lot of fermented posts on here over the next few months. You are very right, it isn't necessary to be as precise as all that, I just like to record everything as accurately as possible to make it easier to judge future variations.",
      "parent": "153567",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "153583",
      "author": "Kari@Loaves n Dishes",
      "author_url": "http://www.loavesndishes.com",
      "date": "2013-05-30 15:47:45",
      "content": "I am so thrilled for a vegetarian Kimchi, and I love all the variations that you mentioned too!!!!",
      "parent": "0",
      "gravatar_hash": "3353f69e9e0e2db51355fb2c84cb9c75"
    },
    {
      "id": "153739",
      "author": "Vaishali",
      "author_url": "http://www.holycowvegan.net",
      "date": "2013-05-31 08:31:42",
      "content": "I've been wanting to make my own kimchi, but haven't worked up the courage yet. This looks  amazing -- I am going to give this a try!",
      "parent": "0",
      "gravatar_hash": "070a784d7a3c8473e187a483bab58343"
    },
    {
      "id": "153796",
      "author": "Rebekah",
      "author_url": "http://pdxfoodlove.com",
      "date": "2013-05-31 12:30:57",
      "content": "Michael, I was just at Smallwares in PDX and they had a lovely dish that used kimchi in a broth with clams! Might be fun to try in a veggie version :)",
      "parent": "0",
      "gravatar_hash": "b58f62ab4aca511d5f820c656c5f8460"
    },
    {
      "id": "153798",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-31 12:32:16",
      "content": "Yeah! I'm all excited about kimchi purees, broths, chips, powders... so many fun things to try.",
      "parent": "153796",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "153799",
      "author": "Rebekah",
      "author_url": "http://pdxfoodlove.com",
      "date": "2013-05-31 12:32:59",
      "content": "Chips!! Omg...",
      "parent": "0",
      "gravatar_hash": "b58f62ab4aca511d5f820c656c5f8460"
    },
    {
      "id": "154005",
      "author": "Christina Peterson",
      "author_url": "",
      "date": "2013-06-01 06:53:38",
      "content": "Excited to try it!  but could you please convert the measurements from grams to actual amounts?  I have no idea how much 28 grams of garlic is, or 100 grams of onions...",
      "parent": "0",
      "gravatar_hash": "6f23f58ec5baab3e32eb7d45971d5318"
    },
    {
      "id": "154036",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-06-01 09:16:32",
      "content": "I've added in some approximate volume measurements.. that said, I've switched to working by weight most of the time and I love it - not just for accuracy. It is so much faster, cleaner, and there are fewer dishes to do. Here's a video about it: http://www.chefsteps.com/activities/weight-vs-volume-speed",
      "parent": "154005",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "154824",
      "author": "Hanna",
      "author_url": "",
      "date": "2013-06-03 23:43:42",
      "content": "Great recipe for vegetarian kimchi. I'm glad that you're interested in trying out all the different possibilities--like you said, kimchi is easy to make. Most of the time is wait time!\n\nI've been told by older relatives that ketchup kimchi was actually a thing in the past. When ketchup was first introduced to Korea, one of the advertised ways of using it was in a ketchup kimchi recipe. :)",
      "parent": "0",
      "gravatar_hash": "1354c4643728d8601e2957f755b68e50"
    },
    {
      "id": "154889",
      "author": "Moira",
      "author_url": "",
      "date": "2013-06-04 03:52:37",
      "content": "Hanna ~ you brought up my thought, regarding ketchup, which is actually an Asian recipe called Catsap.  A fermented, spicy tomato condiment.  I forget which culture it's originally attributed to, but it was a British colony. As catsap made its way to England, it became \"streamlined\" and marketed as ketchup; which is to say, it lost its spice and found more sugar along the way.\n\nHaving lived in the British Isles, I was always surprised at the higher vinegar content of ketchup there (even if it was the Heinz label I was used to in the US). Later, I met my chef Steve \"Scallion\", who made his own 'catsap-sambal' and introduced an ancient recipe to a whorl of diners in the Boston area culture.  His first restaurant recipe with this was a grilled catfish sandwich with a light, sweet slaw.  We used to eat them for breakfast, setting up for busy days at the bistro.\n\nI find it entertaining that we're here a few hundred years later getting back to the original via whole foods, international foods and vegetarian recipes.",
      "parent": "0",
      "gravatar_hash": "e14043d0b484489c08c4c6c496a215f7"
    },
    {
      "id": "154891",
      "author": "Moira",
      "author_url": "",
      "date": "2013-06-04 04:06:24",
      "content": "Michael ~ thanks for the gram to ounces conversion. The video is hysterical, and true enough!  Thinking through a recipe so it batches into single bowls for efficiency's sake is a modern approach, which I've been teaching my kids ~ because I hate washing dishes, too!\n\nHere's a link to a conversion table we'll need to have on hand if you're going to continue \"gramming\" your recipes.  If you have a better one, send it on over !!!  This is a good topic for a longer, dedicated blog article, actually.\n\nhttp://www.metric-conversions.org/weight/grams-to-ounces.htm\n\nLove your work.",
      "parent": "0",
      "gravatar_hash": "e14043d0b484489c08c4c6c496a215f7"
    },
    {
      "id": "154961",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-06-04 08:10:08",
      "content": "Thanks, Moira! So the issue with a converter like that is it is converting grams to ounce weights, not ounce volumes (which is yet another confusing thing about English measurements. So it is close enough for water or things with a similar density to water, but useless for oil or flour or sugar or vegetables etc. (Unless you are still working by weight but for some reason have a scale that doesn't do grams.)\n\nIf you want to convert non-water-like ingredients from weight to volume, sometimes you can google things like \"50 grams of sugar in tablespoons\" and get a reasonable answer, or try wolframalpha.com. But far and away the easiest thing to do is pick up an inexpensive scale - one like this works great: http://www.amazon.com/dp/B001N0D7GA/?tag=poeticlicen07-20",
      "parent": "154891",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "155061",
      "author": "Moira",
      "author_url": "",
      "date": "2013-06-04 15:27:23",
      "content": "Oooh, the kids are out of school and Mom's back in math class !   The wolframalpha link is educating enough.  Birthday's this month ~ maybe someone will profer the scale my way! I'll trade for kimchee.  ;-)\n\nThanks, Moira",
      "parent": "0",
      "gravatar_hash": "e14043d0b484489c08c4c6c496a215f7"
    },
    {
      "id": "159974",
      "author": "Marylee",
      "author_url": "",
      "date": "2013-06-15 20:34:17",
      "content": "What a coincidence, I just made a batch of kimchi.  I have been trying to get it so the nappa cabbage doesn't taste too salty after the brine soak.  The last batch I made was too salty even after I thought I had sufficiently rinsed off enough salt from the brine soaking process.  After researching several recipes I found one recommendation to soak the nappa cabbage leaves whole and then to cut them afterwards and in this way they will soak up less salt.  I soaked my nappa cabbage overnight in a brine of 1/2 cup kosher salt (non-iodized) in a large stainless bowl with enough water to cover.  I submerged the cabbage leaves by weighing them down with a dinner plate and a large beach cobble.  To make sure the batch wasn't too salty, I tasted some of the cabbage after I rinsed off the brine.  I also omitted the salt from the seasonings that are added after the initial brine soak.  I figured I could always add salt later after the counter-top fermentation process and before I put the kimchi in jars in the refrigerator.  I've always omitted the MSG from my recipe as I have had some uncomfortable and weird side effects from MSG (namely a hot sensation on the back of my neck after eating MSG).  I do like the idea of using Kombu as I keep that on hand to flavor sushi rice.  I can't draw any conclusions about my latest batch of kimchi as it's still not done but hopefully I've solved the salt problem.  I look forward to hearing how your first batch comes out.",
      "parent": "0",
      "gravatar_hash": "b702e35724a889b00ee2bbb8234c2df7"
    },
    {
      "id": "160116",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-06-16 08:37:03",
      "content": "Yes, I didn't find that I needed any additional salt after the brining step. To my taste, after brining the cabbage was seasoned just right. You do want to make sure to have enough salt in there during fermentation as it (along with temperature) controls the rate of fermentation, so I wouldn't necessarily do a lot of rinsing after the brine, just try to squeeze out the excess brine so the cabbage isn't too watery.",
      "parent": "159974",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "191566",
      "author": "JMC",
      "author_url": "",
      "date": "2013-08-27 06:01:15",
      "content": "I'm late to this posting, but am excited to see it. One quick question: approximately what volume container do you need at the end? A quart jar? Half gallon?\n\nJust want to get the pieces lined up before I make it!\n\nthanks",
      "parent": "0",
      "gravatar_hash": "8a4aca5fc9e20b4c79556fd3d86c530d"
    },
    {
      "id": "191579",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-08-27 07:08:29",
      "content": "This should fit nicely in a 2-quart (half-gallon) jar.",
      "parent": "191566",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "191977",
      "author": "Jen",
      "author_url": "",
      "date": "2013-08-28 17:48:56",
      "content": "Sounds great! On another site someone added powdered nori seaweed for that umami flavor.",
      "parent": "0",
      "gravatar_hash": "fe030a4548d54ddac69cb95e72651218"
    },
    {
      "id": "191983",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-08-28 18:20:07",
      "content": "Sounds like a good call; I use powdered nori on popcorn and it is delicious.",
      "parent": "191977",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "237095",
      "author": "devorah",
      "author_url": "",
      "date": "2013-11-18 13:05:29",
      "content": "Single ground spice are fine without kosher supervision.  Just read package to check that is just pepper without additives.",
      "parent": "153480",
      "gravatar_hash": "43b86105c86d19122f672dea93ac267b"
    },
    {
      "id": "1314028",
      "author": "Sarah | Well and Full",
      "author_url": "http://wellandfull.com",
      "date": "2015-09-01 07:41:02",
      "content": "This recipe looks great! I wonder if adding miso would contribute to the umami flavor?",
      "parent": "0",
      "gravatar_hash": "8cb4b1bf34c5f82bc7c225a65832bd1e"
    },
    {
      "id": "1314284",
      "author": "Hanna Ziffer",
      "author_url": "http://realfood-project.com",
      "date": "2017-03-12 07:12:20",
      "content": "Has anyone had success using liquid sugar, i.e. coconut nectar, unsulphured molasses, or honey?",
      "parent": "0",
      "gravatar_hash": "ae1542635e2cf843bade2eb731026569"
    }
  ]
}