{
  "comment_count": 3,
  "comments": [
    {
      "id": "2192",
      "author": "Norm",
      "author_url": "",
      "date": "2010-07-14 11:24:44",
      "content": "Is there any nutritional information on the Marination menu. That is fat content, and calories per item.\nIt helps with choices.\n\nThanks,\nNorm",
      "parent": "0",
      "gravatar_hash": "a70d935dda15adde9057513f882ef714"
    },
    {
      "id": "2193",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-07-14 11:33:42",
      "content": "I tend to doubt it, but you can contact them over at marinationmobile.com.\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2194",
      "author": "Mike Spike",
      "author_url": "http://www.fizzgiz.com",
      "date": "2010-09-28 16:39:33",
      "content": "Could not find email or phone info on their site. I wanted to contact them directly. I got tired of having to soak whole muscle parts in teriyaki marinade sauce for days on end to get adequate penetration for flavor infusion. So I started using a technique known as pressure infusion marination to speed up the flavor infusion side of the marination equation. Google for “pressure infusion marination” now, if you like.\n\nI have no clue how to contact the chefs on the truck. If I could, I would ask them “Hey guyz – do any of your recipes utilize “pressure infusion marination” technique?” Surely someone reading this post can give me a site I can post to that these guys read on some frequency basis – or an eMail address I can hook up with someone on the truck – a cell phone might be asking a bit much. But I’ll take anything. Heck, U can mail me if you want – MrFizz [aat] Geee Mail [daught] com. Or heck, buzz me up at (409)FIZZ-GIZ. Many thx!\n\nCan anyone tell me if pressure infusion marination is one of their techniques?",
      "parent": "0",
      "gravatar_hash": "a546547dbf88dfc8c9f0bfb379133818"
    }
  ]
}