{
  "comment_count": 22,
  "comments": [
    {
      "id": "1430",
      "author": "Vegetable Matter",
      "author_url": "",
      "date": "2010-02-11 07:46:39",
      "content": "We love red lentils, but I wouldn't have thought to use them for an Ethiopian dish.  Your photo is beautiful -- it looks like the perfect vegetarian meal.",
      "parent": "0",
      "gravatar_hash": "1c0ae6549dfe1532c0f8ff9ef63fec56"
    },
    {
      "id": "1431",
      "author": "Alessandra",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2010-02-11 23:33:31",
      "content": "Nice!",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "1432",
      "author": "eldan",
      "author_url": "",
      "date": "2010-02-13 21:14:13",
      "content": "Another hit!  I've also loved Ethiopian food for years (not coincidentally, since shortly after I moved to Seattle), but never had a clue how to make similar dishes at home.  I used half green lentils because I was running out of red, and that works reasonably well except that I should have increased the quantities of flavouring ingredients because a cup of dry green lentils translates to that much more cooked food.",
      "parent": "0",
      "gravatar_hash": "2361948bbc21b21352643a1a097dffce"
    },
    {
      "id": "1433",
      "author": "TEB",
      "author_url": "http://veggielove.wordpress.com",
      "date": "2010-02-13 22:42:26",
      "content": "Looks great-- what's the white dish to the side?",
      "parent": "0",
      "gravatar_hash": "daf13c57aa1f40808b3979a7a76f4a53"
    },
    {
      "id": "1434",
      "author": "Charlottes Vegetarian Blog",
      "author_url": "http://www.charlotteconley.com",
      "date": "2010-02-14 15:34:09",
      "content": "I love love love the look of this meal! I have never had the opportunity to get into Ethiopian food but this looks like a great start! Anything with lentils is a winner for me.",
      "parent": "0",
      "gravatar_hash": "77a7e6c7152bdfadb6f2e2a2a8d19d86"
    },
    {
      "id": "1435",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-02-15 23:24:02",
      "content": "Nice! I bet it is good with green lentils too. Check out Amy&#39;s Merkato on Cherry for a good supply of all the Ethio stuff.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1436",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-02-15 23:26:12",
      "content": "It was something I just sorta made up on the spot. Injera torn up, mixed with thick yogurt and cucumbers and green onions. AFAIK, not traditional anywhere. I rather liked it, but it could easily be considered too soggy.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1437",
      "author": "Sarah @ cooking pretty",
      "author_url": "http://cookingpretty.wordpress.com",
      "date": "2011-01-31 11:29:04",
      "content": "Thanks for the recipe - I tried these the other day and they were so good.  I loved the technique used with the spices...pulverize them with the onion, garlic, and ginger and then sautee till dry & lightly browned.  Delicious! :)",
      "parent": "0",
      "gravatar_hash": "79a8f47404800313d0b593a68922b070"
    },
    {
      "id": "1438",
      "author": "Sarah",
      "author_url": "",
      "date": "2011-11-06 19:53:01",
      "content": "I've made this recipe twice now for my fiance and I, and we really enjoy it. We are OBSESSED with the Ethiopian restaurant in our neighborhood, so I had wanted to try some recipes at home. One question, I feel like the amount of lentils turns out to be too much for the amount of spices and onion, ginger, garlic mixture.  I'm used to this dish being very dark in color with a denser (sometimes spicier) flavor.  I'm using two cups of dried split red lentils.  Does that sound right?  Any suggestions of how I could modify it to get the deeper color and taste.  I find myself just adding more spice but not necessarily getting the result I want.",
      "parent": "0",
      "gravatar_hash": "0f53c04168e2ec40e3e39499f6e8ee5a"
    },
    {
      "id": "1439",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-11-06 21:14:29",
      "content": "Hey Sarah - thanks for your note! I think if you want it spicier and darker (1) make sure you get a deep, dark color at step 3, (2) increase the paprika, or (3) increase the entire onion/garlic/ginger to lentil ratio. If you try those ideas, let me know if you find a result that you like. Also, may I recommend this recipe for Ethiopian-style ful mudammas - <a href=\"https://herbivoracious.com//2010/08/ethiopian-ful-mudammas-recipe.html?\" rel=\"nofollow\">https://herbivoracious.com//2010/08/ethiopian-ful-mudammas-recipe.html?</a> Depending on where you live, you might not be able to find it at a restaurant but it is delicious.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "16935",
      "author": "OR Suz",
      "author_url": "http://www.peta.org",
      "date": "2012-01-13 12:00:24",
      "content": "Having LEFT Seattle, I now find myself making my own exotic/ethnic foodstuffs and again turn to you. \n(Case in point, banh mi has now been perfected to superior status over any store-bought offerings. However, though my pho has yet to meet Than Bros. standards, it's a worthy contender.)\nThanks!",
      "parent": "0",
      "gravatar_hash": "2aa61eec7343141145f60243771593a7"
    },
    {
      "id": "22958",
      "author": "Allison",
      "author_url": "",
      "date": "2012-04-17 17:08:58",
      "content": "I do live in Seattle, and googled red lentil sauce because I just bought some from an Ethiopian Deli on Rainier (Chicken Express) and didn't know what to serve with them. Thanks for the ideas!\n\nIf you're in Seattle, they make a vegan spagetti sauce too that's a dream, better than Borracchini's.",
      "parent": "0",
      "gravatar_hash": "ea1cc8c39922570d33638c520dbf99e6"
    },
    {
      "id": "58868",
      "author": "Tara O'Dowd",
      "author_url": "",
      "date": "2012-10-03 11:12:25",
      "content": "I've been experimenting with Ethiopian recipes for a couple of years now, and I think this one is a little off (although I liked your ful recipe). I recommend using about 1/4 cup of berbere powder instead of paprika and cayenne. I also use a couple tablespoons of tomato paste, red wine, and about 3/4 cup of oil (seems like a lot, but LOTS of oil seems to be the secret to Ethiopian cooking). And I cook this dish for about 90 minutes. A note on the berbere powder - the stuff from Amazon does not taste at all like the stuff sold in Ethiopian markets. It is not even the same color. Also, ginger-garlic paste (found in Indian and Ethiopian markets) will make your Ethiopian cooking experiments much easier.",
      "parent": "0",
      "gravatar_hash": "a86b35718d66619807d27172c2a8f68b"
    },
    {
      "id": "58872",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-03 11:21:24",
      "content": "Hey Tara - I totally agree with you; this recipe is quite old. I've made a lot more Ethiopian food since then, and it is well worth finding berbere. I get mine locally, so I haven't had the ones from Amazon to compare, though I don't see why there shouldn't be a good one on there. Personally, not a big fan of the pre-made ginger-garlic paste. Garlic has a ton of active enzymes that get to work the moment the cells are broken, so the flavor changes quite a bit. Although it is more work, I prefer to do it as close to cooking as possible.",
      "parent": "58868",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "151363",
      "author": "Mick",
      "author_url": "",
      "date": "2013-05-24 20:36:59",
      "content": "Hi Michael-\n\nFirstly, I think its awesome that you are cooking Ethiopian food, most people are unaware of this cuisine, unfortunately. The picture you've provided, however, is of the yellow lentil dish called Kik Alicha. If you'd like some authentic Ethiopian recipes please let me know, I was raised on the stuff and don't mind sharing! :) In any case, keep up the Ethiopian cooking and spreading the good word!",
      "parent": "0",
      "gravatar_hash": "f3ce259559b0f054d59085a344f9fd7d"
    },
    {
      "id": "151369",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-24 21:23:54",
      "content": "Hi Mick - I appreciate the comment, but that is definitely mesir wat - I made it myself (and took the photo), with red lentils, not yellow split peas. It is just a bit pale because I kept the spice level low for kids.",
      "parent": "151363",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "271000",
      "author": "Tutu",
      "author_url": "",
      "date": "2013-12-05 09:07:36",
      "content": "Hi Michael,\n\nI am an Ethiopian and landed on this site while searching for Ethiopian recipes online to share it to my coworkers who fancy the food. From the picture it looks like you Misir wat turned out perfect and your kosta too. A friend of mine tried the \"key misir wot\" with the berbere and it turned out awesome. You should try making \"doro wot\" - chicken stew and \"tikil gomen\" cabbage. Let me know if you need tips.",
      "parent": "0",
      "gravatar_hash": "d41996e4bb7c36fc67f23fa1a2575916"
    },
    {
      "id": "284193",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-12-08 20:45:12",
      "content": "Thanks so much, Tutu! I'd love to hear you tikil gomen recipe if you'd like to share it.",
      "parent": "271000",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "479868",
      "author": "Yvonne Brown",
      "author_url": "http://www.Yvonne-Brown.com",
      "date": "2014-01-04 14:40:51",
      "content": "Great recipe!  Question: Can I substitute the fresh ginger with powdered ginger and get the same taste?  Thanks!",
      "parent": "0",
      "gravatar_hash": "ebef02a89f6efb23be2a91158083a4c2"
    },
    {
      "id": "480000",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-01-04 15:04:39",
      "content": "Hey Yvonne - no, I wouldn't recommend that - the taste is very different, you might end up with pumpkin-pie flavored lentils :)",
      "parent": "479868",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "526008",
      "author": "Edom",
      "author_url": "",
      "date": "2014-01-09 22:06:25",
      "content": "Hi everyone,  I am also Ethiopian I had a potluck with my American friends. I was trying to get them some Ethiopian recipes. The recipes I mad was Red lentils and cabbage dish also known as Tikil Gomen. I will share the Tikil Gomez one.\n\n1/2 cup Olive oil\n4 carrots thinly Sliced\n1 onion thinly sliced\n1/2 head cabbage shredded\n3 potatoes peeled and cut into cubes\n1/4 teaspoon ground cumin\nsalt as needed\n1/4 teaspoon turmeric\n3 cloves fresh garlic\n\nSautee onions and oil over medium heat. Cook the carrots with onions in the hot oil about 5 minutes.  Stir in salt, cumin, turmeric and cabbage cook another 15 minutes.  Add the potatoes cover and reduce heat to medium low and cook until potatoes are soft. Don't put any water the cabbage will produce enough.",
      "parent": "0",
      "gravatar_hash": "92621d2dc11d77cd7ad9784e793bfcec"
    },
    {
      "id": "1314077",
      "author": "Barbara J",
      "author_url": "",
      "date": "2015-11-25 10:48:05",
      "content": "I Love your recipe.  I always loved Ethiopian food but recently started making it in my home using berbere spice I purchased from fassica.com.  I'm now in love with the process of cooking it and the aroma it creates in the house. I will just add berbere (hot chili blend) to add extra flavor.",
      "parent": "0",
      "gravatar_hash": "7be32dd7e399183457d8934c540a38c8"
    }
  ]
}