{
  "comment_count": 21,
  "comments": [
    {
      "id": "1862",
      "author": "Isaiah",
      "author_url": "",
      "date": "2009-10-22 13:58:01",
      "content": "Trying this tonight. Will get back to you with results!",
      "parent": "0",
      "gravatar_hash": "a33bf6985bfa07423137d73757731ed2"
    },
    {
      "id": "1863",
      "author": "Anne",
      "author_url": "",
      "date": "2009-10-22 14:43:45",
      "content": "This recipe has been a staple of my winter menu for years - Marcella is a goddess.  I've made it with plain water as well as veggie stock.  It's richer with the stock but it's pretty darn good even with just water.  However I don't discard the parmesan rind after the soup is cooked - I eat it!\n\nThis soup also serves as a really good base for a poached egg.",
      "parent": "0",
      "gravatar_hash": "080dd48230b0b4a373094a81abf5ee5a"
    },
    {
      "id": "1864",
      "author": "Ellen",
      "author_url": "http://www.ellenp1214.wordpress.com",
      "date": "2009-10-22 16:15:57",
      "content": "the florentine woman that recently taught me how to properly make minestrone would balk at the addition of water and broth powder to this soup (her technique is on my blog).\n\ni, on the other hand, think this sounds pretty tasty!",
      "parent": "0",
      "gravatar_hash": "458ac01b003f1a3d7211aae8e16a9b16"
    },
    {
      "id": "1865",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-22 16:28:38",
      "content": "Looks like you were doing some pretty incredible eating there! I gather that version of minestrone is quite a bit drier then, closer to a stew?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1866",
      "author": "tramadol",
      "author_url": "http://www.tramadol.gs/",
      "date": "2009-10-23 02:18:00",
      "content": "Oohhh.... How sad! My sister will be on out of town for 4 days! She's the only one here in the house that loves to cook! I really want to taste this one! Honestly, I love vegetables and this looks really yummy!",
      "parent": "0",
      "gravatar_hash": "65f4eec77c9cccfe807a31fb11335cbf"
    },
    {
      "id": "1867",
      "author": "Pam",
      "author_url": "http://www.alovefornewrecipes.blogspot.com",
      "date": "2009-10-23 05:01:12",
      "content": "Your soup looks wonderful and you have a very nice blog!\n\nEnjoy!",
      "parent": "0",
      "gravatar_hash": "7ebfaa35c577d5a2223627d3d5d95bcc"
    },
    {
      "id": "1868",
      "author": "John Hughes",
      "author_url": "",
      "date": "2009-10-23 06:48:17",
      "content": "I'm interested in your claim that tomato-based stuff (or other food) tastes better a day later. I instinctively agreed, but I also have some doubts. Maybe it tastes better because it's already prepared and you don't have to do all that work, for instance. Maybe (for lasagna) it tastes better because the re-heating makes the surface just a tiny bit crispier, etc. I'd like to figure out a reasonable way to do an A/B test of this. Any thoughts?",
      "parent": "0",
      "gravatar_hash": "69b08dc9a36ac7631243969b19c9ea5f"
    },
    {
      "id": "1869",
      "author": "Ivy Manning",
      "author_url": "http://blog.ivymanning.com",
      "date": "2009-10-23 11:09:59",
      "content": "I think that most things that are stewed or simmered taste better the next day. The flavors meld and have time to think about being together, which makes for better eating.\n\nI am fighting a nasty virus and don't have the energy to cook. I LOATHE canned soup. Would you be so kind as to put some of this minestrone in an envelope and send it to me? Thanks!",
      "parent": "0",
      "gravatar_hash": "398d9a223280b1350d4db253ecccefe3"
    },
    {
      "id": "1870",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-23 11:26:17",
      "content": "I&#39;m slapping my head and saying &quot;doh!&quot;, because of course you are right - if I can&#39;t find the science, I can do the science. So I guess we&#39;ll get two can of the same brand of tomato sauce and make 3 samples:\n\n\n\n\n(1) Open on day 1, aerate, refrigerate\n\n(2) Open on day 1, heat, aerate, refrigerate\n\n(3) Leave unopened in refrigerator\n\n\n\nSeasoning them all with the same amount of salt. Then on day 2, we&#39;ll open can 3 and taste them all blind and see if we can determine a difference. If there is a difference, then we&#39;d have to dive deeper to determine the chemistry. I gotta try this.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1871",
      "author": "Alisa@Foodista",
      "author_url": "http://www.foodista.com",
      "date": "2009-10-24 08:56:52",
      "content": "It looks delicious! Food for me always tastes better when their flavor has more time to mingle. We also have more time to enjoy the food the following day because we dont need to spend hours slaving in the kitchen :P",
      "parent": "0",
      "gravatar_hash": "1649ab500162043960e758985acb6b8c"
    },
    {
      "id": "1872",
      "author": "Alessandra",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2009-10-24 23:14:13",
      "content": "Somehow I always thought that minestrone was vegetarian...is there any other type? :-)\n\nI eat all types of cheeses and do put my crusts in soups, but if I cook for a vegetarian who only eats cheese made with vegetarian rennet I cannot use parmigiano, but have to opt for a vegetarian parmesan.",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "1873",
      "author": "Alice",
      "author_url": "http://www.cottoecrudo.com/en",
      "date": "2009-10-26 10:06:08",
      "content": "I'm from Romagna, the place evoked by Marcella in the title of this recipe. I omit the beef broth as well as the parmesan rind!",
      "parent": "0",
      "gravatar_hash": "002c66a2c7f6a51723fe15f3410982fe"
    },
    {
      "id": "1874",
      "author": "Bajs Britney Lydén",
      "author_url": "http://profile.typepad.com/bajsbritney",
      "date": "2009-11-26 07:53:51",
      "content": "Extremely easy to make and tastes great! The cheese really does add that deliciously brothy flavour. This is great for poor students too, nutritious and cheap ingredients and perfect for making a large batch and just freeze it. Thanks!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "1875",
      "author": "Amy Clay",
      "author_url": "",
      "date": "2010-02-02 14:26:04",
      "content": "I found that tip about the parmesan rind in cooks a couple months ago and love it.  Man does that add some flavor!  New to your site and am preachin to the masses about how great it is.  Thank you for new exciting recipes and ideas!",
      "parent": "0",
      "gravatar_hash": "aabb2a83715edb2ded796c4e1bc41b38"
    },
    {
      "id": "1876",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-02-02 14:36:51",
      "content": "Thanks Amy! I really appreciate you spreading the word, too. I&#39;ve got a new Facebook fan page which I think is a great way to share and communicate as well. Here&#39;s the link: <a href=\"http://bit.ly/cESTDT\" rel=\"nofollow\">http://bit.ly/cESTDT</a>",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1877",
      "author": "Nisha",
      "author_url": "",
      "date": "2011-02-26 22:10:47",
      "content": "Hi, a question about the vegetables used to make the soup. Do you drain the veges after you've boiled the soup for 2.5 hours? Or would you recommend discarding the veges and adding in a new batch, simmering for 10 mins before eating so that they retain their crunch. Thanks!",
      "parent": "0",
      "gravatar_hash": "6540c32f5a9d8d502424795903c77b3d"
    },
    {
      "id": "1878",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-02-26 22:18:00",
      "content": "Hey Nisha - for a traditional minestrone like this, you want the vegetables fully &quot;hammered&quot;. You could certainly do what you are suggesting for a more modern take. It will be quite different but no reason it couldn&#39;t be good.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1879",
      "author": "Charlene",
      "author_url": "",
      "date": "2011-04-11 21:23:50",
      "content": "Just made this for dinner, it was absolutely delicious! The garlic bread added a surprising amount.",
      "parent": "0",
      "gravatar_hash": "d6898072331d8796b4fdab899403d5b6"
    },
    {
      "id": "67513",
      "author": "Pamela Drake",
      "author_url": "",
      "date": "2012-10-23 14:54:14",
      "content": "Gee whiz, the joys of having knee-jerk vegan daughters.  Now I have to make TWO versions of the same soup so my husband and I can enjoy the umami of parmesan rind! :D",
      "parent": "0",
      "gravatar_hash": "1cdf1555a2308bd8b4bca37deb9e71f6"
    },
    {
      "id": "109250",
      "author": "Dan Brook, Ph.D.",
      "author_url": "https://justicecookbook.wordpress.com/",
      "date": "2013-01-21 21:50:46",
      "content": "I've just edited a vegetarian cookbook with a foreword by Rabbi Rami Shapiro for my temple, containing delicious recipes, fascinating stories, useful resources, and more. \n\nThere's a minestrone soup in there as well. :)\n\nJustice in the Kitchen\nhttps://justicecookbook.wordpress.com\n\nAll proceeds support Or Shalom Jewish Community and will be well used and much appreciated.",
      "parent": "0",
      "gravatar_hash": "f222cf940c7d4333115f5a5f3d6dd82d"
    },
    {
      "id": "111163",
      "author": "Jogalog",
      "author_url": "http://www.squidoo.com/pumpkin-and-black-bean-soup",
      "date": "2013-01-28 01:20:19",
      "content": "The soup sounds delicious.  I also like to save the parmesan rinds for soups and stews.   They add a  lovely richness.",
      "parent": "0",
      "gravatar_hash": "ca26e3009db47c5d91644f4011d1ec64"
    }
  ]
}