{
  "comment_count": 10,
  "comments": [
    {
      "id": "3335",
      "author": "The Gastrognome",
      "author_url": "http://www.thegastrognome.wordpress.com",
      "date": "2008-08-26 22:27:34",
      "content": "Amen, brother! I have my tivo on season pass for this show. In fact (hush whispers) the first tv food show I ever saw was his show on carbonara, and it inspired me to cook it. My first real cooking project. I've been hoping for the whole year since I first got tivo that I would get to see that episode...but alas....",
      "parent": "0",
      "gravatar_hash": "52922ce305f3d307ea02bd727e43d26e"
    },
    {
      "id": "3336",
      "author": "[eatingclub] vancouver || js",
      "author_url": "http://www.eatingclubvancouver.com",
      "date": "2008-08-26 22:39:46",
      "content": "I wish the Food Network would just rerun these old shows instead of showing these newer -- and quite frankly gaddawful -- shows.",
      "parent": "0",
      "gravatar_hash": "42b70c6dff6ac61c95301855b02bb636"
    },
    {
      "id": "3337",
      "author": "Maggie",
      "author_url": "http://doghillkitchen.blogspot.com",
      "date": "2008-08-27 02:39:30",
      "content": "Have you seen Jamie Oliver's \"Jamie at Home\" show yet?  I really like the style of food he's doing now and the gardening information, while not extensive is good.",
      "parent": "0",
      "gravatar_hash": "0e135e68740f32d56b94538034bcd94d"
    },
    {
      "id": "3338",
      "author": "redman",
      "author_url": "http://www.winewall.blogspot.com",
      "date": "2008-08-27 07:32:23",
      "content": "I agree that Mario is the best cook on tv.  I also used to love the Japanese version of Iron Chef",
      "parent": "0",
      "gravatar_hash": "70ef388fbf05eb453271997925a8d650"
    },
    {
      "id": "3339",
      "author": "Joanna",
      "author_url": "http://scalloped-edge.blogspot.com",
      "date": "2008-08-27 07:48:15",
      "content": "Hmm... I agree that Molto Mario is a great source of recipes and food inspiration, and I do like Batali, but on the show I feel like he condescends to his guests at times.  Maybe it's just me.  I can't hold anything against him, though, cause I live above one of his restaurants and the stairway in my building always smells amaaaaaaaazing.\n\nHave you seen Anne Burrell's new show?  I love her enthusiasm, and she has the knowledge and experience to back it up. (Although the amount of salt she uses scares me a little!)  She's someone I'd love to be in the kitchen with.",
      "parent": "0",
      "gravatar_hash": "162fb33db8c91df1cb51af7780965c65"
    },
    {
      "id": "3340",
      "author": "Buttered Lips",
      "author_url": "http://www.passionate-psyche.blogspot.com",
      "date": "2008-08-27 13:02:10",
      "content": "I agree wholeheartedly. Especially the no-nonsense part. I was up in Seattle the other day and went to Salumi, Mario's father's shop. As an avowed meat lover, I was in heaven. But...I love veg dishes, too, so long as they have good depth of flavor. Thanks for the reminder to tune in to Mario!",
      "parent": "0",
      "gravatar_hash": "8792226f837a0cd79cf0b5c48f96a196"
    },
    {
      "id": "3341",
      "author": "iVY",
      "author_url": "http://kopiaste.org",
      "date": "2008-08-28 04:28:33",
      "content": "Pity we don't get to see food shows of this standard in Greece.  Really, who knew about female and male fennel, that's great.  I also learned in your post about caciocavallo, which I had to look up in wiki, but evidently is a cheese we have in Cyprus called cascavalli, probably remnant during the Venetian rule in Cyprus.  However, the example given by wiki that caciocavallo is similar to the Greek kaseri is absolutely wrong.  I would say with the Greek graviera.",
      "parent": "0",
      "gravatar_hash": "06546570235265d56a008a385d959e5f"
    },
    {
      "id": "3342",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-08-29 21:42:45",
      "content": "Gnome - I've still yet to master carbonara, I need to see that episode too.\n\njs - yep, it seems most of the new shows except Top Chef are lame.\n\nMaggie - nope! I'd like to catch it. He's goofy but he can cook.\n\nRedman - yeah, the J. Iron Chef is awesome, love the voiceovers.\n\nButter - is there anything veg to eat at Salumi? I've never been in there but I should drop by just for the brush with celebrity.\n\niVY - thanks for the tip, I'll be sure not to sub kaseri!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3343",
      "author": "Tracy",
      "author_url": "http://www.tracyfood.com",
      "date": "2008-09-06 16:38:35",
      "content": "I remain a sucker for America's Test Kitchen, because science rules and they test the ever-loving heck out of all their recipes.  Also I could watch Bridget or Julia cut onions all day --- competence is dead sexy.  Their equipment ratings are always worth a look, Jack's tastings are charming, and Chris provides comic relief... it all adds up to good geeky fun for me.  The later seasons may be trying for a flashier look and feel, but there's plenty of archives left for me to watch and enjoy.",
      "parent": "0",
      "gravatar_hash": "ec4ee57bf1dbee11d6fa8f212eaf2f13"
    },
    {
      "id": "3344",
      "author": "Jason Truesdell",
      "author_url": "http://blog.jagaimo.com/",
      "date": "2008-09-12 11:04:04",
      "content": "Salumi does have one or two token veg dishes, but they're usually pretty good. I've gotten an eggplant sandwich with their homemade mozzarella a few times before, and occasionally they have a polenta or gnocchi thing.\n\nI usually don't want to brave the lines unless I'm with someone who's going to get more out of it, but it's worth stopping in with a more carnivorous friend.",
      "parent": "0",
      "gravatar_hash": "22658ed19bd58bd096f2928284e92332"
    }
  ]
}