{
  "comment_count": 55,
  "comments": [
    {
      "id": "1674",
      "author": "Todd Kopriva",
      "author_url": "",
      "date": "2009-11-16 08:04:59",
      "content": "I could have written most of this post verbatim to apply to our own cast-iron skillet. It got used three times yesterday alone.",
      "parent": "0",
      "gravatar_hash": "27bd056e35804d96f436eb622b7941a9"
    },
    {
      "id": "1675",
      "author": "Holly",
      "author_url": "",
      "date": "2009-11-16 08:26:53",
      "content": "Years ago I bought a cast iron dutch oven for cooking in the campfire. It's perfect for wowing friends, who eat better in the woods with me than they do at home! The problem is, I love it so much in the kitchen that I don't want to pack it! And now it lives full-time in the oven, ready for another loaf of no-knead! =)",
      "parent": "0",
      "gravatar_hash": "37ceceeb12f2d03e3f0dbed3f919e666"
    },
    {
      "id": "1676",
      "author": "c",
      "author_url": "",
      "date": "2009-11-16 10:50:46",
      "content": "my 12-inch lodge is a beast.  I love it but I'm trying to get pancakes to release when flipping.  i probably need to do a few more rounds of butter/oven seasoning.  Also, I will take your advice and get a metal spatula.\n\nI have a 10-inch inheritance that I am just getting around to seasoning.  Can you believe I used to steam vegetables with it?  The bamboo steamer fit on top of it perfectly.  Needless to say, it had a few layers of rust.  I didn't understand the glory of the skillet back then so it sat for a year or two in the back of the cupboard. I just rubbed it down with sandpaper the other day and now I think it will be fine.  It's  a lot lighter than the Lodge so I may end up using it more.",
      "parent": "0",
      "gravatar_hash": "45d42aefb9a576dbc10611bb452b1066"
    },
    {
      "id": "1677",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-11-16 11:12:16",
      "content": "Here is some good info on how to reseason properly, right from the horse&#39;s mouth; <a href=\"http://www.lodgemfg.com/use-care-seasoned-cast-iron.asp#3\" rel=\"nofollow\">http://www.lodgemfg.com/use-care-seasoned-cast-iron.asp#3</a>",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1678",
      "author": "hollynoel001h\\",
      "author_url": "",
      "date": "2009-11-16 11:47:36",
      "content": "cast iron pots were a staple in my family growing up passed down from grandparents and great grandparents used daily and and in fire pits for camping and just cooking outdoors yes they may take a little more upkeep than telon but well worth it!!!!!  glad to see i'm not just an old fashion person!!",
      "parent": "0",
      "gravatar_hash": "47e54682a32916590695e6ce7ac29504"
    },
    {
      "id": "1679",
      "author": "Cajun Chef Ryan",
      "author_url": "http://cajunchefryan.rymocs.com/blog2/",
      "date": "2009-11-16 12:00:16",
      "content": "Your cast iron skillet looks like the exact one my parents have, been in use for 40+ years too. Made to last forever. I love my cast iron griddle, Dutch oven and skillet too. Perfect for blackened catfish on the outdoor grill.",
      "parent": "0",
      "gravatar_hash": "9f3b5ef4294bafb575b419690b0d278d"
    },
    {
      "id": "1680",
      "author": "John",
      "author_url": "",
      "date": "2009-11-16 14:18:46",
      "content": "The whole \"distributes heat evenly\" stuff is, of course, a crock, as you point out. The heat equation applies, even if the pot came from your grandma. :)\n\nBut the good news is that the heat equation is your friend: if you want a nearly uniformly hot skillet (or \"more nearly uniformly hot than you'll get with anything else\"), you can do wonders with cast iron. One trick is to heat it over a low-to-moderate heat, and keep moving it around on the burner. The good news is that the already-hot bits will lose heat in proportion to their surface area and the coolness of adjacent bits, but will RETAIN heat in proportion to their (thermal) mass, which is large. That means that by preheating different bits sequentially, you can get a pretty uniformly hot skillet. Yay!\n\nWe have about 4 nesting skillets, and the big one stays on the stove at all times. Some of them have very smooth bottoms, and others have not-so-smooth bottom surfaces. I keep wanting to take one of these to the machine shop at work and just run an end-mill over it to try to smooth it out (perhaps using canola oil rather than cutting oil as the lubricant). Has anyone ever tried this? Or am I better off just paying for a new 8\" pan? I might do it just for the delight of seeing the guys in the machine shop stare at me. :)",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "1681",
      "author": "Kim",
      "author_url": "",
      "date": "2009-11-16 15:03:07",
      "content": "I've never heard of anything about acidic sauces darkening in iron pans, but I do know that the more acidic a food is, the more iron it will absorb. It's a great way to add iron to your diet.",
      "parent": "0",
      "gravatar_hash": "485077e0b46f65e723e878b6e78453ce"
    },
    {
      "id": "1682",
      "author": "Chris",
      "author_url": "http://pieofthetiger.com",
      "date": "2009-11-16 16:06:52",
      "content": "I've insisted for years that the cast iron pan is supposed to live on the stove at all times.  To keep my wife happy, I borrowed a glass lid from another pan to hide the \"dirt\" (she prefers the kitchen to be spotless) and keep the dust off of the cooking surface.  No other pan is as versatile, and I think that I'd rate mine as the #1 \"must have\" tool for any kitchen (even above a good knife).\n\nI've heard rumors about highly acidic foods damaging the patina/season of cast iron cookware, but I haven't had any trouble with it, and I still think it's the best pan for my wife's balsamic mustard greens.",
      "parent": "0",
      "gravatar_hash": "471243e2f99c010d7c5d5a2e8b4195b8"
    },
    {
      "id": "1683",
      "author": "JMom",
      "author_url": "http://kitchen.amoores.com",
      "date": "2009-11-16 16:28:00",
      "content": "I can't live without my cast iron skillet either!",
      "parent": "0",
      "gravatar_hash": "60006c4849bbb477b14eb84bbd4c1340"
    },
    {
      "id": "1684",
      "author": "A&amp;N",
      "author_url": "http://reluctantchefs.blogspot.com",
      "date": "2009-11-16 17:34:12",
      "content": "Me too! I love mine and it stays over the stove. I've cooked eerything in it, I think!",
      "parent": "0",
      "gravatar_hash": "50de5463f411bb5bad4710eb70af07f3"
    },
    {
      "id": "1685",
      "author": "jennifer",
      "author_url": "",
      "date": "2009-11-16 21:21:50",
      "content": "i bought a carbon steel pan about five years ago that is my absolute kitchen staple- it's lighter than cast iron, has nice rounded sides, and looks just as much the ugly duckling as my cast iron pans! needs to be seasoned just the same, and i can't imagine cooking without it.",
      "parent": "0",
      "gravatar_hash": "3ca5698853bc02f850d8012c461f0978"
    },
    {
      "id": "1686",
      "author": "John - Mormon Foodie",
      "author_url": "http://mormonfoodie.blogspot.com",
      "date": "2009-11-16 23:52:36",
      "content": "Cast iron skillets are amazing. I can't imagine making good cornbread without one. My 10 inch doesn't live on my stove, but it's certainly my favorite for certain dishes.\n\nI used to have a 12 inch, as well, but I never really liked it. I could never get it properly seasoned for some reason. I broke it, believe it or not. I suspect there was a flaw in the casting.  I left it on a hot burner by accident. I heard a huge pop, turned around, and there it was, cracked right in half. It's one of the weirdest things I've seen in the kitchen.\n\nJohn, (What a great name.) ;-)\nI don't know that I'd bother trying to smooth out the bottom surface. The roughness is an artifact of the casting process. I doubt it would help even out the heat distribution. If you're worried it's scratching the inner seasoned surface of the other pans, do what you should be doing anyway. Put a paper plate or something like that in between them when stacking.",
      "parent": "0",
      "gravatar_hash": "0750826129ee44caebb3eba7010ade18"
    },
    {
      "id": "1687",
      "author": "Annalisa",
      "author_url": "",
      "date": "2009-11-18 12:09:17",
      "content": "I love my lodge cast iron 12\" pan.  I too keep it on the stove because 5 days out of 6 (I don't cook on Fridays) I'm going to be using it for stomething.  I also have a 5 or 6\" (never measured it, its not lodge though) that I use just as often to toast chiles and onions in for salsas, carmelize toppings like leeks or onions or just fry up eggs on saturday mornings.  Finally I have my huge dutch oven with legs.  That thing is so effin heavy, but nothing compares when you want a good stew.  I've contemplated buying a power saw to cut those damn obtrusive legs off though!\n\nThe only other things I need are my knives. I can't live without my knifes. I HATE cooking at anyone else's house without my knives, so much so that I'm known to BMOK(bring my own knife)!",
      "parent": "0",
      "gravatar_hash": "f3ae3e086c1e94791f0251e3ba970aa4"
    },
    {
      "id": "1688",
      "author": "Annalisa",
      "author_url": "",
      "date": "2009-11-18 12:16:39",
      "content": "Sorry, I know I talk too much but...I haven't had trouble with acidic foods coloring my cast iron, however once in a great while it will leave a slight metallic taste to the food.  I guess its not that bad cuz it hasn't stopped me from making my lemon-garlic chicken.  But, you're not supposed to use soap in it, EVER.  So I'm told anyway.  I use salt to clean it... and very hot water.  If something gets stuck on I'll boil a little water in it. If foods starts to stick I'll re-grease it and bake for an hour.  Works everytime.  Another trick to not stick, make sure whatever you're cooking isn't too cold. ;o)",
      "parent": "0",
      "gravatar_hash": "f3ae3e086c1e94791f0251e3ba970aa4"
    },
    {
      "id": "1689",
      "author": "chocolate shavings",
      "author_url": "http://www.chocolateshavings.ca",
      "date": "2009-11-19 05:26:21",
      "content": "I agree, there's nothing like a cast iron skillet in the kitchen!",
      "parent": "0",
      "gravatar_hash": "f55976994877188be218f8e52e5ac56c"
    },
    {
      "id": "1690",
      "author": "Diana",
      "author_url": "http://spaininiowa.blogspot.com",
      "date": "2009-11-19 06:05:40",
      "content": "I absolutely adore my cast iron skillet!  It also lives on my stove and I use it everyday!  I bought my baby at an antique store for a grand total of $5! It was used, abused and perfectly seasoned!",
      "parent": "0",
      "gravatar_hash": "c93876d32f42d725af440701d2e000ff"
    },
    {
      "id": "1691",
      "author": "Adelina",
      "author_url": "",
      "date": "2009-11-19 06:32:20",
      "content": "Between my 12\" cast iron skillet and my wok....I don't know which is my favorite, really!  I love them both equally because they both do different things and interesting enough, I can't have one without the other!\n\nI'm saving up to get a Dutch oven....It just seems like my \"wish\" list for kitchen items is infinite, every year....!\n\nLove this post!",
      "parent": "0",
      "gravatar_hash": "429b6ecf5327db7f2180b93142743b58"
    },
    {
      "id": "1692",
      "author": "The Wind Attack",
      "author_url": "http://www.windattack.com/",
      "date": "2009-11-19 07:19:05",
      "content": "The only piece of cookware in my kitchen that gets more use than my 12\" cast iron is my 6\" cast iron, but that is only because I am usually cooking for one.  I also keep both of them on my stove and simply love how they mean business.  No messing around cooking, they say \"let's play with fire!\"  And it's the only vessel I could ever think of making cornbread in.",
      "parent": "0",
      "gravatar_hash": "b47fd9a187bf4ac7b09afa0fdf99d41d"
    },
    {
      "id": "1693",
      "author": "DocChuck",
      "author_url": "http://www.myspace.com/docchuck",
      "date": "2009-11-19 07:50:15",
      "content": "Go here: <a href=\"http://www.myspace.com/docchuck\" rel=\"nofollow\">http://www.myspace.com/docchuck</a>\n\nThen scroll down to \"DocChuck’s Tribute to Heavy Metal (Cast Iron Utensils)\"  for photos and stories about my inherited collection of cast iron skillets.  This particular blog of mine has had over 3000 hits since I originally post it last spring.",
      "parent": "0",
      "gravatar_hash": "09efaed3dcf2c90c67947627d96a524d"
    },
    {
      "id": "1694",
      "author": "Cast Iron Foodie",
      "author_url": "http://www.castironfoodie.blogspot.com/",
      "date": "2009-11-19 07:57:51",
      "content": "I totally love my 12\" lodge my in-laws gave me for xmas last year.  I have since added a 4\" for single serving/small jobs, and a beautiful 2-burner grill/griddle piece I got for $0.50 at a garage sale.  I didn't really buy the hype that tomato sauces and cast iron didn't mix, until all the seasoning from my pan went bye-bye after a few meals of spaghetti.  We made a huge batch of homemade marinara from our tomato garden this year, and I figure all my other cast iron meals are so yummy, why not right?  Wrong.  I was almost heart-broken when I saw that silver after getting so used to the lovely black.  But, ce la vie!  It gives me the excuse to cook that much more and reseason my pan again and again.",
      "parent": "0",
      "gravatar_hash": "9136d105501bb6c044404c89f5f65783"
    },
    {
      "id": "1695",
      "author": "incrediblecrunchyflavor",
      "author_url": "http://incrediblecrunchyflavor.com",
      "date": "2009-11-19 10:56:03",
      "content": "love this post. thank you! i have a cast iron skillet, as well, but we are in the early stages of our relationship. i know it will be a good relationship eventually, but we're still getting to know each other. i am excited for our future.\n\nin my kitchen, my shun knife and my trusty wooden cutting board made by my dad are the two things i could never be without.",
      "parent": "0",
      "gravatar_hash": "99fb234ef9956296c17afe672af46444"
    },
    {
      "id": "1696",
      "author": "Savory Tv",
      "author_url": "http://www.savory.tv",
      "date": "2009-11-22 00:37:53",
      "content": "Love mine too.  Yes it's heavy and awkward, and it seems that some over zealous party cleaner upper always ruins it with soap, but I can always bring it back with foodie cpr.  I do not use it for flipping eggs, but it is wonderful for fritattas, and any dish that needs to be finished in the oven.",
      "parent": "0",
      "gravatar_hash": "fd51c52f966705863d77d8559c508a32"
    },
    {
      "id": "1697",
      "author": "Aggie",
      "author_url": "http://www.aggieskitchen.com",
      "date": "2009-12-04 11:05:43",
      "content": "I have a new found love for my cast iron skillet too...I have recently been making fish in it, in the oven and it's turned out awesome!",
      "parent": "0",
      "gravatar_hash": "05118c90e57734620b8f1548ce482b67"
    },
    {
      "id": "1698",
      "author": "angela",
      "author_url": "",
      "date": "2009-12-16 03:25:45",
      "content": "hello!\nI'm a long time vegan ... who has never had a cast iron skillet! (for shame!!) Not my parents or my grandparents either (at least not anymore).\n\nSimple question... in looking for one to buy, other than size, are there features I should steer away from or things I should look for? Or are they all the same?\nthanks so much!",
      "parent": "0",
      "gravatar_hash": "21326b2c9191ee2f151774de66332447"
    },
    {
      "id": "1699",
      "author": "angela",
      "author_url": "",
      "date": "2009-12-16 03:34:32",
      "content": "I'm back... I was thinking I should be more specific. Whats the deal with:\n- enamel coated on the outside (just to look pretty?)\n- \"pre seasoned\" pans?\n\nThanks!",
      "parent": "0",
      "gravatar_hash": "21326b2c9191ee2f151774de66332447"
    },
    {
      "id": "1700",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-12-16 07:17:31",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\nHi Angela - the enamel ones are nice but serve a different purpose, because they aren&#39;t really non stick. Love my enameled dutch oven for soups etc though. Pre-seasoned is fine - totally natural. I&#39;d recommend the Lodge brand; they have been at it a long time and do it right.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1701",
      "author": "Ariella",
      "author_url": "http://aricooks.wordpress.com",
      "date": "2009-12-27 16:46:04",
      "content": "Do you want to hear what a cooking nerd I am? I have been contemplating this question since you posted it and I am having trouble coming up with just one tool, so here's my top..several:\nMy wooden spoon, I love the way it feels in my hand and how it has changed color, darkening over time and changed shape too. I like to use it for both sauteing and for mixing up a batch of muffins.\nMy cuisinart food processor. I make a TON of falafel, hummus, and other spreads plus I use it to grate and finely chop nuts. I love that thing.\nMy handheld citrus juicer- the lemon juice for the aforementioned hummus!\nMy little microplanes, zesting, grating, etc, can't live without 'em.\nand yes, I do love my cast iron skillet :)\nThanks for asking, I loved reading this post and continue to enjoy your blog!",
      "parent": "0",
      "gravatar_hash": "722c5b76bc7cdb8b9091cf091bb33d26"
    },
    {
      "id": "1702",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-12-27 20:04:22",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\nThanks for the thoughtful answer! I love all of those things too.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1703",
      "author": "Barkcookware",
      "author_url": "http://www.barkcookware.com/",
      "date": "2010-02-03 21:08:38",
      "content": "I think that it is the most durable and long lasting cookware out there even when it has been abused it can be brought back to life with a little tender loving care. Try abusing a non stick, enamel coated, all clad or stainless steel cookware and you might as well chuck it. I know of cast iron skillets and Dutch ovens that have been passed down through 2 generations and are know in the hands of the 3 generation and are still a pleasure to cook in.",
      "parent": "0",
      "gravatar_hash": "b7af8e667e6e74f5344c4dcd2b909fb2"
    },
    {
      "id": "1704",
      "author": "Mary",
      "author_url": "",
      "date": "2010-06-28 15:06:19",
      "content": "What oil do you use to season your skillet? I read that the usual cooking oil actually makes the cast iron sticky. Is it true?",
      "parent": "0",
      "gravatar_hash": "31e69724bbd9c5b13be1f571f18a1729"
    },
    {
      "id": "1705",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-28 15:41:21",
      "content": "Hi Mary - any neutral vegetable oil that can handle high heat is fine. You want a refined oil that doesn&#39;t have any particulate in it. I tend to use Spectrum High Heat Safflower Oil as my generic neutral oil, so that gets wiped on the pan for seasoning as well. Works fine, with no stickiness at all.\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1706",
      "author": "kitchen equipment",
      "author_url": "http://www.armorica.co.uk",
      "date": "2010-09-01 04:01:34",
      "content": "I've seen quite a few posts on Iron cookware of late and I hear the same things, everyone seems to 'bond' with their pan. Then again I guess that's true of any implement you spend years with. One thing that I'm not too sure about is the even heating, some say it's really even, others like yourself notice hotspots... Is this just down to the nature of the pan? Or is this down to the date and style of manufacture? I only ask because I'm looking to buy my own.\n\nThanks for sharing!\nJohn.",
      "parent": "0",
      "gravatar_hash": "ed365fda8bc59df811b5c290d28429cd"
    },
    {
      "id": "1707",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-09-04 10:56:11",
      "content": "Hi John - yep, it is in the nature of plain cast iron (not sandwiched with anything else) to have hot and cold spots. I find the other benefits greatly outweigh that issue, you just develop a feel for how to work with it.\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1708",
      "author": "Jamie",
      "author_url": "",
      "date": "2011-01-12 15:55:32",
      "content": "this is an awesome link i stumbled upon:\n\n<a href=\"http://sherylcanter.com/wordpress/2010/01/a-science-based-technique-for-seasoning-cast-iron/\" rel=\"nofollow\">http://sherylcanter.com/wordpress/2010/01/a-science-based-technique-for-seasoning-cast-iron/</a>",
      "parent": "0",
      "gravatar_hash": "5269936542f15ef26a1a3346a026aa14"
    },
    {
      "id": "1709",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-01-12 19:13:08",
      "content": "That&#39;s fantastic, thanks for passing it along!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1710",
      "author": "qewr",
      "author_url": "",
      "date": "2011-01-20 11:28:31",
      "content": "Hi - I'm a jerk for putting this comment up top in an unrelated reply, but I have something somewhat important for readers about the skillet:\n\nI too love my cast iron skillet. Everyone should get one. But please, DO NOT GET A PRETREATED SKILLET. Pretreated skillets are made that way with particularly noxious chemicals (the kind you might imagine it would take to render iron forever non-stick).\n\nALTERNATIVE SOLUTION:\n\nI bought mine used on ebay from some diner in tennessee. cheap. treated. great. Or, buy a new one and treat the skillet yourself - there is a particularly clear and useful article by Alton Brown on the process (and why to avoid pretreated skillets) on foodtv.com",
      "parent": "0",
      "gravatar_hash": "21f8aabce58f3f33fec2523791a06aa7"
    },
    {
      "id": "1711",
      "author": "meggyloops",
      "author_url": "",
      "date": "2011-10-28 05:08:38",
      "content": "i just got a skillet a few weeks back after 2 years of wanting one but not being able to afford it - mother came to the rescue! i have used it so many times! it is the best thing ever in the world",
      "parent": "0",
      "gravatar_hash": "3ec17836bfd380ad674f6c0ded64b646"
    },
    {
      "id": "21972",
      "author": "SJ",
      "author_url": "",
      "date": "2012-03-24 11:10:44",
      "content": "I'm vegetarian. My boyfriend is not. \n\nI wanted to have my own cast iron so that I don't have to wipe out bacon grease before making myself a veg. meal. He claims that a cast iron pan will be destroyed / won't last if you don't cook meat on it in order to season it with the grease / animal fat. \n\nThoughts? Related experience?",
      "parent": "0",
      "gravatar_hash": "a09d46db5c71f2f439ce8342fd7366ef"
    },
    {
      "id": "21974",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-24 11:26:08",
      "content": "Ha ha, that's funny. He's wrong. I've been using my skillet for I dunno, 20+ years with nary a speck of meat in it. It is perfectly seasoned and works amazing. After you use it, heat it up on the stove to dry, then wipe it with a thin coat of vegetable oil.",
      "parent": "21972",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21975",
      "author": "SJ",
      "author_url": "",
      "date": "2012-03-24 11:40:49",
      "content": "THANK YOU MICHAEL! I now have evidence to support having my own vegetarian skillet!!!",
      "parent": "0",
      "gravatar_hash": "a09d46db5c71f2f439ce8342fd7366ef"
    },
    {
      "id": "33755",
      "author": "Alison Lambert",
      "author_url": "",
      "date": "2012-07-04 00:02:44",
      "content": "I bought my little skillet cheap from a disposal store cheap years ago, with my last few dollars. I lived on a small boat (alone) on the Brisbane River for two years and cooked most of my meals in that skillet, over a metho (methylated spirits) burner. Later I found a camp oven with a lid that also fits the skillet. I'm now exploring Far North Queensland, a little old lady :) solo in a campervan and again, the skillet is fine for most meals. Re another favourite utensil, it's a pair of Asian poultry shears bought cheap at a Vietnamese shop. With huge handles and an obviously handcrafted look, they get used for everything but cutting poultry. They hang beside my late mother's zester, the ancestral nut cracker, and an antique nutmeg grater complete with niche for nutmeg.",
      "parent": "0",
      "gravatar_hash": "05e2349133bf6e78dd742985d040c8cf"
    },
    {
      "id": "38732",
      "author": "Anna K.",
      "author_url": "",
      "date": "2012-07-18 04:33:47",
      "content": "That's what my husband (also non-veg) says too! I try to keep an eye on it, but I know he sneaks bacon and other meat in there sometimes and then just rubs the grease right in. One time he seared a lamb leg in there--the smell was revolting and lingered for days. At least bacon smells good.",
      "parent": "21972",
      "gravatar_hash": "32b0b1e026ece93bbd8fba0a8abf2799"
    },
    {
      "id": "38735",
      "author": "Anna K.",
      "author_url": "",
      "date": "2012-07-18 04:38:23",
      "content": "I'm in very sterile corporate temp housing this summer, and I could only bring a very few of my kitchen items. I opted to bring my Le Creuset (enameled cast iron) dutch oven instead of my 12\" cast iron skillet, thinking that most things I would do in the cast iron I could do in the dutch oven. Turns out I had been overestimating the non-stick powers of my Le Creuset. It's an amazing vessel, but it's really really not as good on the stir-frying, sauteing, pan-frying front. Live and learn!",
      "parent": "0",
      "gravatar_hash": "32b0b1e026ece93bbd8fba0a8abf2799"
    },
    {
      "id": "39762",
      "author": "Shirley Kiernan",
      "author_url": "http://VeganAutismMom",
      "date": "2012-07-21 09:04:22",
      "content": "Great article on a must-have for every kitchen!",
      "parent": "0",
      "gravatar_hash": "f0f10db9de24204aee258db453ea3299"
    },
    {
      "id": "53658",
      "author": "Lotte",
      "author_url": "http://www.abitastudio.com",
      "date": "2012-09-21 09:49:00",
      "content": "I love my two iron frying pans made in France by de Buyer.  I saw my German friend's iron pan in action some years ago, and was amazed by its being completely non-stick without any chemical coatings. I looked everywhere for iron pans because they are lighter than cast iron pans but otherwise have all the same qualities it seems, and needs to be treated and seasoned just the same.    I first saw de Buyer pans in a market in Copenhagen where they are sold to professional cooks, but they were out of the smaller sizes I needed, so I was very excited to find a nice selection at Williams Sonoma in the U. village in Seattle.  I now have two, and one of them is quite small and perfect as a second pan.  No more throwing $60-$80 dollar teflon etc. pans out every couple of years because we yet again managed to destroy their non-stick coating with excessive heat or the wrong utensils.",
      "parent": "0",
      "gravatar_hash": "c96142386811a26264cd0b7b3603e874"
    },
    {
      "id": "60899",
      "author": "Paula Thomas",
      "author_url": "http://gapey.blogspot.com",
      "date": "2012-10-08 08:52:16",
      "content": "I have 3 sizes of cast iron skillet and the largest one always stays on my stove top too. I've been using it a lot more the last couple of years.",
      "parent": "0",
      "gravatar_hash": "8d077df87cc0181ca418b6676f321d8a"
    },
    {
      "id": "64965",
      "author": "Eitan",
      "author_url": "",
      "date": "2012-10-19 10:59:19",
      "content": "Definitely agree with everyone here about the wonders of a good cast-iron skillet. I use mine for everything (except for dishes that have a lot of volume, like a big bunch of Swiss chard). I never had a problem with acidic foods (I do use it for pan sauces with tomatoes or citrus) or with the poor distribution of heat - I just move the pan around a bit on the burner. However, I'm pretty lazy about caring for it: I wash it with soap and I don't oil it every day. But still, it treats me just fine.\n\nOther loves:\n\nI'm glad that someone mentioned their affection for their wooden spoons. I have two that are darkened, nicked, burnt in spots, and I use them nonstop. Recently I've been using tongs a lot more, much more than a spatula. I never found a spatula that I really bonded with, and I tend to break them.\n\nAbout a year ago, I bought a really nice ceramic pie dish for my wife, who likes to bake. She doesn't use it that much - I commandeered it for roasting small amounts of vegetables, quiches, and things like Mark Bittman's awesome Autumn Millet Bake (http://www.101cookbooks.com/archives/mark-bittmans-autumn-millet-bake-recipe.html).\n\nFinally, I have a lot of affection for my wooden chopping block, which takes up a lot of space but a big chopping block is pretty essential when you are cutting lots of vegetables all the time. \n\nBy the way: great blog, Michael!",
      "parent": "0",
      "gravatar_hash": "1d72fc9cd1d8cbef569838dc424e7106"
    },
    {
      "id": "64993",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-19 12:01:11",
      "content": "Thanks, Eitan! And I've always loved my big chopping block too, though lately I've been starting to think it encourages disorganization and it might be better to use a somewhat smaller board, making room for more containers and sheet pans on either side to hold input, output and compost.",
      "parent": "64965",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "135134",
      "author": "mel mccarthy",
      "author_url": "http://melstampz.blogspot.ca/",
      "date": "2013-04-09 11:09:46",
      "content": "Loved this post. I do have a favourite pot &amp; it looks exactly like yours. Nothing like cast iron!",
      "parent": "0",
      "gravatar_hash": "bdd0f6718cd1d34ef2377b705546bdc2"
    },
    {
      "id": "282793",
      "author": "Mary B",
      "author_url": "",
      "date": "2013-12-08 10:07:54",
      "content": "I have the 12 inch Lodge.  Several years ago it was marked $12 at a thrift store and everything was 1/2 off.  Sooo...best $6 I've ever spent.  It lives on my stove too.  I have a stack of cast iron including two 10 inchers I've had for 25 years, but the 12 inch is the bomb.",
      "parent": "0",
      "gravatar_hash": "a3277c85721baeffd3a38b85104bb13e"
    },
    {
      "id": "653553",
      "author": "Myong",
      "author_url": "",
      "date": "2014-01-28 15:30:20",
      "content": "Thank you for posting this.  I almost think you read my mind because I've thinking about a way to sear the prefrozen tofu.  I read a recipe from somewhere that if you want a crispy tofu, freeze tofu, and defrost, remove the water with paper towels, then fry it in a very hot pan.  The problem was that my regular frying pan was not hot enough to make tofu crispy.  It came out not crispy.  I've tried so many times, but every time it came out not crispy.\n\nI have a cast iron skillet for many years in closet, and I used to  use it to make pancakes.  I  even learned how to season it very good using flex seed oil.   I don't eat pancakes anymore, so I've forgotten about it.   I'm going to use it to fry tofu this weekend.  \n\nMyong",
      "parent": "0",
      "gravatar_hash": "4e3275bc15f42f1874f8c1e12d3a59ca"
    },
    {
      "id": "1104730",
      "author": "Linda Stokas",
      "author_url": "",
      "date": "2014-10-09 12:34:17",
      "content": "I used my friends cast iron pan to cook sausages. Unbeknownst to me, her boyfriend is a vegetarian. How long does the meat residue remain in the pores of the pan? Have I ruined the pan for vegetarian cooking? Do you have any helpful info regarding this dilemma? I'd appreciate any input or links addressing this concern. Thanks!",
      "parent": "0",
      "gravatar_hash": "818788a4449b7192a1a854cb9d3d5674"
    },
    {
      "id": "1104735",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-10-09 12:41:57",
      "content": "I don't think there is any definitive answer to this. For me personally I'd give it a good scrub and move on with my life, but others may feel differently. You should just ask them.",
      "parent": "1104730",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314190",
      "author": "Mark Baty",
      "author_url": "http://none",
      "date": "2016-07-26 08:41:09",
      "content": "I to also have several cast iron cook pieces and my favorite is my grand mothers flat skillet, have made hundreds if not thousands of pancakes for the gals,",
      "parent": "0",
      "gravatar_hash": "641d0dfc9df467f77be36df973c4f362"
    }
  ]
}