{
  "comment_count": 15,
  "comments": [
    {
      "id": "3502",
      "author": "KathyF",
      "author_url": "http://whatdoiknow.typepad.com",
      "date": "2008-05-22 16:38:56",
      "content": "I was fine up until the \"I have no issue, fundamentally with vegetarians.\" I have no issue, fundamentally, with gay people. Or brown people. Or Jews.\n\nGee. Thanks. Glad we're allowed to live. Or something.",
      "parent": "0",
      "gravatar_hash": "2a280efad60cb1fc8e12fb2d54be21b6"
    },
    {
      "id": "3503",
      "author": "The GastroGnome",
      "author_url": "http://thegastrognome.wordpress.com",
      "date": "2008-05-23 09:13:14",
      "content": "Oh come on, now, that is not at all how I meant it! I was clearly trying to differentiate my nitpicking from an overall dislike of the concept of vegetarianism.\n\nAnd I won't even touch with a ten-foot pole the difference between being gay or black or born with a tail and choosing not to eat animals. Judiasm, depending on if your Hitler or if you are a Jewish kid trying to marry a non-jew and convience your Jewish mother it's okay, falls somewhere in between those.\n\nOut of respect for Michael, if you feel the need to respond to this please do so on my blog so as not to clutter his blog with our bickering.",
      "parent": "0",
      "gravatar_hash": "52922ce305f3d307ea02bd727e43d26e"
    },
    {
      "id": "3504",
      "author": "Hank",
      "author_url": "",
      "date": "2008-05-23 17:06:02",
      "content": "re: egotistical bullshit.\n\nThis is exactly how a true artist should be; so proud of his product that he will not have it altered lest it compromises his vision. Granted there are varying levels of restaurants. If you want to hold the ham on your moons-over-my-hammy, it's probably not a big deal. But chefs at fine dining establishments  are artists just the same as painters, writers, film-makers, architects, sculptors, etc. When a diner asks the chef to alter his/her creation to appease you own personal culinary restriction, you are asking someone to make a compromise to their vision, and you should recognize it as such. It is the equivalent of asking Van Gogh to change the color of the sky in starry night because it clashes with your sofa. Or the christian group that cuts the bad stuff out of feature films because it offends them. Sure it may not be a big deal for you to make the request, but it sure would be a big deal to the artist who created the work.\n\nMost successful dishes at a fine dining establishment attain a perfect level of balance between its ingredients that can be easily be upset if any one element is added or removed. What you think is an insignificant request, can actually be quite significant to a trained chef and should not be taken so lightly by one who claims to have an appreciation for great food.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3505",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-05-23 19:23:26",
      "content": "Oh, I understand the argument. I just don't agree with it.\n\nIt is pretty much every cook's fantasy (including mine some of the time) to have the \"sit down, shut up, and eat\" restaurant. The idea that you can execute this absolutely pure vision of good food, which only you and your select few can appreciate. The customers should be so lucky as to kiss your ring, much less think they can ask for a substitution in your dishes.\n\nI suppose there is a place for this sort of thing at a tiny handful of restaurants. In fact, I love them.\n\nBut the vast majority of restaurant food is so far compromised that a comparison to Van Gogh is absurd. The choice of ingredients is compromised by availability and cost. The choice of preparations are compromised by the skill of the team and the cost of labor. Virtually every restaurant menu includes at least one \"bail out\" dish (hint: look for the chicken) that is meant to offer a safe choice to less adventurous diners. And guess what: at most of your high end restaurants, Van Gogh isn't even in the kitchen. He (or she) is off in Las Vegas, plotting how to build a 400 seat version of their vision which they can somehow convince themselves isn't compromised.\n\nActually, I think the Van Gogh analogy is flawed in another way. A better comparison would be an architect. What would you do if your architect absolutely refused to use the door hardware you want? Not discuss it, try to convince you of an alternative or anything else, but just 100% insist that it was their way or the highway? You'd fire them on the spot and laugh as the door hit them on the way out.\n\nEven El Bulli, arguably the most influential restaurant of our time is willing to do a completely off-menu vegetarian dinner. Of course they can afford it, with one cook per customer, but they aren't too proud to do it.\n\nSo ok, if I walk into a 30-seat (or less) place with top-notch food and a chef who actually makes it, and they feel strongly that they only want to serve the dishes the way they designed them, I can totally respect that. I might not be back if they won't serve me something I can eat, but that's life.\n\nBut for all of the other normal places that refuses substitutions not because of possibility but for the purity of their vision, I still say: BS.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3506",
      "author": "Marissa",
      "author_url": "http://www.sybariticinseattle.typepad.com/siren223",
      "date": "2008-05-23 21:30:12",
      "content": "Michael, I am SO with you.\nI am not a particularly picky eater in general, except that I am a pescetarian, and there are a few strong flavors that are not to my taste (I am a super taster).\n\nMore recently I have made some dietary changes that restrict certain other ingredients, and so now I *seem* like a picky eater.\n\nI am also an artist, and a chef (albeit self taught). When I have a dinner party I do make sure to ask if people have specific dietary needs including religious, health, or ethical needs. I see no problem with this at all. I also have no problem if someone doesn't want to eat my food for one reason or another. I try to accommodate as much as possible, I would never not invite someone based on their beliefs or food allergies (unless it is so strong that the scent would be dangerous of course).\n\nI also agree that it is egotistical bullshit, and I am an artist in the non foodie sense as well. Many artists who are working and actually get paid, do so because they are creating something that their customer wants. They get hired to do statues of certain people, to photograph certain places for patrons, to paint murals with a theme. Yes, their artistry is involved, but the one who is paying ultimately makes the decision about what goes on. A chef who cooks food that never gets eaten is not a success. And a chef who insists on using avocado or wasabi in a dish without compromise, will not be feeding me. Eventually a painting might be purchased, but only by someone who appreciates it. Chefs do not have the luxury of being so picky, their art will go bad, it will not get better after they die. They cannot search around for a buyer. There are those who would trust a chef, even though they don't like a particular ingredient. But I promise you, no matter how you disguise it, I hate avocado. So leave it outta my food.",
      "parent": "0",
      "gravatar_hash": "854e183101d0af80461e76c6889e7879"
    },
    {
      "id": "3507",
      "author": "Hank",
      "author_url": "",
      "date": "2008-05-24 01:55:44",
      "content": "It is amazing to me how little respect you have for Chefs and Architects. I think what we have is a fundamental different in what an artist actually is. To me chefs, as in architects, do not merely provide a service as directed by the client. They are artists; and artists create. They create based on years of training and life experiences. This is the privilege you are paying for. To experience the creations of another. Not to have someone execute your own personal vision as the client.\n\nTo take your architect analogy one step further; if you want your architect to spec the door hardware that you select; you should never have hired an architect in the first place, a contractor would do just fine. A contractor's job is to execute your vision. An architect is hired to provide his years of training and experience to design a product for  the client. With this process comes an element of trust. Trust that the architect you hired can accomplish all the elements that the client is looking for in the final design (including the door hardware.) If you do not have that trust in your architect, you should never have hired him in the first place.\n\nOne need not go to a restaurant that serves the kind of food you do not enjoy eating; only to request that the artist change his product to satisfy your needs. Ferran Adria, to take your example, offers a vegetarian menu. A menu that is entirely orchestrated as a multicourse meal that celebrates the meatless ingredients. thomas keller does so also. These menus are for from proof that these chefs are bending to the will of the client. They are, in fact, creating using other materials that they enjoy using.\n\nThe actual comparison would be to order the normal (meat-included) degustation at el Bulli and request that the egg yolk in the golden egg be substituted with tofu. This act might make you stop and think, but you probably would not think twice about asking for them to hold the pork belly in some dish at Sitka and Spruce. Why would Matt Dillon not deserve the same respect you give Ferran Adria?\n\nSo where do you draw the line between the places of esteem that deserve your respect for their vision and the \"normal\" places? One would think that if you chose to dine there, then you have hired that particular artist for the night. Does it matter if the artist is Jean Georges or the kid working the line at the Olive Garden?\n\nYour insistence to go to a restaurant that serves food you do not wish to eat and ask for substitutions would be the equivalent of hiring Tadao Ando and telling him that you hate concrete, and love Northwest Craftsman style.\n\nImagine the response I would get if I ordered a dish at Carmelita and requested that the portabello be replaced with kobe flatiron. Yet you vegetarians are horrified when restaurants don't bend at your whim.\n\nBTW, as anyone familiar with the restaurant world knows, Ferran Adria, Thomas Keller, Guy Savoy, Alain Ducass, and the rest of the Van Goghs of the culinary world are not cooking on the line. Just as Rem Koohaus was not sanding drywall at the library. But their vision is present in the product created.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3508",
      "author": "",
      "author_url": "",
      "date": "2008-05-24 07:33:05",
      "content": "Well, I don't think we have to beat this into the ground, but you raise interesting points so let's look at them.\n\nMy understanding is that El Bulli doesn't officially offer a vegetarian menu, but will make one if you ask. Maybe I'm wrong. I didn't cite Thomas Keller as an example because I know that is on their normal menu.\n\nI can't imagine hiring an architect for a house I was going to live in that didn't want any input from me at all. If I hired an architect, I'd be hiring someone as a partner to take my vague, ill-formed ideas about a space and apply their expertise in partnership to make it perfect.\n\nSitka and Spruce is exactly what I had in mind when I said I respect this argument from a 30-seat (or less in this case), relatively uncompromised place with the chef on the line. They don't make subs, and that means that generally have very few vegetarian items, which means I don't go there often. But that's cool. I like it when I do go.\n\nYes, I think it *absolutely* matters whether it is Jean George or the kid at Olive Garden. The kid at Olive Garden is not an artist, he's a craftsman (on a good day). Even if he takes some pride in putting his Fettucini in Mortar Paste on the plate, I'm really not worried about hurting his feelings by asking him to leave off the ham.\n\nThe Carmelita argument is totally specious. In the original post, I clearly specified that subs have to be within reason of possibility. I would never expect a restaurant to, say, add asparagus to a dish if they didn't have it in the house, and I'm pretty sure Carmelita doesn't stock flatiron steak.\n\nThe \"you vegetarians\" arguments is bogus too. Believe me, I routinely check menus and don't go to places that probably aren't going to make something good for me. If I look a menu online and see: filet, chop, whole fish, and nothing else - I'm giving it a miss. The exception is if on say a business trip I need to go to that kind of a place with a group. Then I'm going to go there, and ask for a vegetarian dish, and be thrilled if I get anything better than a sad primavera.\n\nBy the way, my favorite way to get a vegetarian dish in a restaurant that doesn't offer one is to say \"can you ask the chef to make me a great vegetarian entree, whatever they think will be delicious?\". So if anything the chef has the option to exercise their creativity more than usual. Sadly, a lot of waiters are scared to take that message to the kitchen, so they just want me to come up with a specific request.\n\nIn many cases these days, Keller, Savoy etc.'s vision isn't even directly present in the product. They fly in for a day a month to see what their executive sous chef has designed. That's cool by me. But to think that it somehow hurts them if for the ten minutes between when it goes from being mise en place to down the hatch, \"their\" dish that they have never seen is altered is silly to me. They won't even ever know it happened.\n\nSo bottom line to me is, you wanna go around letting other folks tell you exactly what to eat, drink, and live in, that's your privilege. You can be my best customer someday. In the meantime, I'm going to ask for what I want.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3509",
      "author": "Hank",
      "author_url": "",
      "date": "2008-05-24 09:07:49",
      "content": "The bottom line is, it seems to me, about the basic issue of respect. You respect certain chefs like Matt Dillon enough to not attempt to compromise their product, but lack that same respect for the kid at the Olive Garden, Frank Savoy, Cory Lee, and countless others. So (as I asked before) where do you draw the line? Maybe the Jean Georges/Olive Garden example is too polar for you. Does it lie somewhere between Restaurant Zoe and Coastal Kitchen?\n\nI ask you, what is more egotistical: not wanting to compromise your vision to create that which your were trained and hired to create; or the lay-person directing a trained professional to alter his creation for your own personal gain.\n\nAlso, just to be clear, \"Trust that the architect you hired can accomplish all the elements that the client is looking for in the final design\" is not the same as, \"didn't want any input from me at all.\"  You also have very little respect for what an architect does, but that is a whole other argument for a different website.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3510",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-05-24 09:38:15",
      "content": "Well, I think we've probably beat our respective arguments into the ground at this point. We can agree to disagree.\n\nDarn, ok, I can't resist a parting shot. Does a hair stylist fit your definition of an artist too? They do mine. But that won't stop me from asking for a little more off the top if it doesn't look right to me when they are done. Do you walk around with a bowl cut if that is what your stylist thinks is your best look?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3511",
      "author": "",
      "author_url": "",
      "date": "2008-05-24 09:56:43",
      "content": "The key is to hire artists that you trust. Just as I won't hire micheal graves because I hate postmodern crap, I also wouldn't go to the green zebra if I was craving meat, or choose a hair stylist that would have me walking around in a bowl cut.\n\nLet's not forget that it is you who chooses to be picky with what you eat. Why should your choices be forced onto others who do not agree with your vision, only to be called egotistical when they do not accept your demands? That's what I call egotistical bullshit.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3512",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-05-24 10:29:43",
      "content": "Oh well, I think we've both had our say. Thanks for the entertaining debate. If anyone else manages to read through all this, I'd love to hear your comments. (Or you too Hank, if you have more).",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3513",
      "author": "",
      "author_url": "",
      "date": "2008-05-24 10:46:43",
      "content": "Just the parting concurring remark that I also enjoyed this debate. I didn't want to come off as insulting (in your home no less),but just wanted to voice a differing opinion, albeit in strong voice.\n\nthanks!\n\nFor the record, my numerous vegetarians also take your side.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3514",
      "author": "",
      "author_url": "",
      "date": "2008-05-24 10:47:04",
      "content": "Just the parting concurring remark that I also enjoyed this debate. I didn't want to come off as insulting (in your home no less),but just wanted to voice a differing opinion, albeit in strong voice.\n\nthanks!\n\nFor the record, my numerous vegetarian friends also take your side.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3515",
      "author": "Silver",
      "author_url": "",
      "date": "2008-05-31 22:49:12",
      "content": "Oh gosh, a chef is an \"artist\" (apparently even at Olive Garden) and can't be asked nor expected to compromise at all but a vegetarian is making a choice which deserves no respect no matter the reasons for it (and there are plenty), doesn't need to be one (according to some people), so should just deny who they are and shovel down whatever crap someone else put together from a \"vision\"?\n\nI should have to travel to Chicago and spend a $100 a plate to indulge because a chef can't/won't be bothered?\n\nMore like can't be thoughtful or respectful, believing that only goes one-way (their way).\n\nNot only is that pompous, pompous, pompous but it shows how limited they are that they can't manage to actually create outside the social bounds they insist in perpetrating which they then blame on those who have diets too \"difficult\" for them to tackle. That's why we get the moniker isn't it? To cover for the restrictive inadequacies of the chef.\n\nIt's not as if one has to be a vegetarian or vegan to enjoy meals without animal products. Lots of people are limiting their intake for a plethora of reasons that are hard to mock into compliance with Europeanistic crowd dominance, and those (paying) customers would love to be inspired.\n\nWe wouldn't need to make special requests if there were choices available for us to make.\n\nI'm sorry but I should have to stay home (or worse, in the car) while my buds go in and enjoy a meal? Or do I need to do as I did before being true to myself in taking on the full designation of \"vegetarian\" and order a meal with flesh that was then scraped off at the table onto my companions' plates as I begged them to give me their veggies? That's a vision?\n\nLong, dark, narrow, tunnel vision... a chef wearing an apron, toque, and blinders.\n\nOr maybe it's a good thing if your guests are reduced to sitting at a table in your place chewing only on dry bread (or nothing if gluten-intolerant) while most everyone else is eating (even if they aren't happy either)? Is that really hospitality success?\n\nExclusion is something to aspire to?\n\nNo, that's just narcissistic idiocy and a gastro-megalomaniac need for control that requires the customers to do the actual catering; adjusting to the abusive dogma of the narrow-minded, stubborn hosts who think way too much of themselves essentially demanding their customers go elsewhere to find something better.\n\nMight want to remember too that Van Gogh was suffering from a mental illness who committed suicide after living off his brother for many years. What kind of spectacular dish could you make with your left ear?\n\nMaybe we'll all finally see your incredible vision decades after you are dead too. :]\n\n====\n\nThanks Michael, I do appreciate the thought provoking reads and proof that Taylor Clark's article is indeed still relevant despite our modern \"progressive\" times.",
      "parent": "0",
      "gravatar_hash": "0525deaf6782ea3c6e5e05b8342f6963"
    },
    {
      "id": "3516",
      "author": "",
      "author_url": "",
      "date": "2008-06-02 15:46:12",
      "content": "Wow! Such misplaced vitriol I have not seen in some time. Let's not forget who the restrictive one is in this relationship. It is YOU who has chosen certain dietary restrictions. It is YOU who has chosen to dine at certain eating establishments. Yet it is YOU who has the audacity to call out chefs for not saluting at your command. Far be it for me to go into your place of business and tell YOU how to do YOUR job, based on MY narrow system of beliefs. There are plenty of restaurants that will bend to your every whim, (I'd say 90% of the restaurants in Seattle). But single out the one whose vision of good food does not parallel yours, and it's \"narcissistic idiocy\"? How \"progressive\" is that? How thoughtful and respectful are you being?\n\nLet's be perfectly clear here; no one is telling you what you can or cannot eat. It is you who is attempting to tell someone else how to do their job.\n\nDoes reading any of this actually provoke any thought in you, or just reinforce your narrow beliefs that everyone should bend to your will?",
      "parent": "0",
      "gravatar_hash": ""
    }
  ]
}