{
  "comment_count": 7,
  "comments": [
    {
      "id": "15839",
      "author": "The Italian Dish",
      "author_url": "http://theitaliandishblog.com",
      "date": "2012-01-02 08:49:20",
      "content": "I think for 2012 I'm going to experiment with tofu and get to know it, something I need to do and never have done.",
      "parent": "0",
      "gravatar_hash": "3e4e3826bf4c9300ffc14fd965fa8026"
    },
    {
      "id": "15957",
      "author": "Magic of Spice",
      "author_url": "http://www.theardentepicure.com/",
      "date": "2012-01-03 10:42:02",
      "content": "What a refreshing and delightful recipe!\nHappy 2012!",
      "parent": "0",
      "gravatar_hash": "3556f431797ca0cd049b93420013ed80"
    },
    {
      "id": "15969",
      "author": "Spectra",
      "author_url": "http://salad-a-day.blogspot.com",
      "date": "2012-01-03 12:50:33",
      "content": "Michael, this looks wonderful! I had just seen pomegranates yesterday while produce shopping but failed to pick them up. Also, I need to find the champage vinegar locally. What I will try with the firm tofu I just bought is pressing it with weight in cheese cloth over a sieve; that may help dry my store-bought, packaged variety out to achieve the desired consistency.\n\nWhen I make it I will let you know, and if I post it to my salad blog, I will leave a link back here :D",
      "parent": "0",
      "gravatar_hash": "d05eb78cda7ce54515f848f848d696bf"
    },
    {
      "id": "15971",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-03 13:04:35",
      "content": "Great! Let me know how it works out. If you don't find the champagne vinegar, sherry vin would probably be good too.",
      "parent": "15969",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17155",
      "author": "Anne Campbell",
      "author_url": "",
      "date": "2012-01-16 10:06:27",
      "content": "I almost always press my tofu - I learned the technique from the book _The Flexitarian Table_ by Peter Berley, and had a \"Why didn't I think of that?\" moment. Now I just cut the tofu into slices or cubes, spread them out between the layers of a folded dish towel, put a cutting board on top, and pile on a couple of cast-iron pans. After 15 or 20 minutes, it's nicely pressed and ready for whatever marinade or flavors I want to add, and there's no excess water in the tofu to water down the sauce. It also makes it easier to fry tofu without as much crazy spitting and hissing. \n\nAs a matter of fact, that _Flexitarian_ book really opened my eyes to using tofu with flavors *other* than Asian ones. He has a great marinade with lemon, garlic and mint, and another with lemon, fresh thyme or rosemary, olive oil, and soy sauce that's very savory. It made me realize that I don't have to be envious of the sauces and marinades that people put on, say, plain chicken breasts. I often make Jamaican jerk tofu (which I serve with your island-style sweet and spicy cabbage!), Korean barbecue tofu, Moroccan charmoula tofu, etc. It works out great, and you can put the same sauce on some chicken or fish or other meat if you're sharing with omnivores. \n\nThanks for this post and also for the one about \"where do you get your protein?\"! I wish more Americans knew that the amount of protein they eat is really excessive, not the norm.",
      "parent": "0",
      "gravatar_hash": "5cdecc447861b205659b26b2585302fb"
    },
    {
      "id": "17452",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-19 10:43:08",
      "content": "You know, I've always resisted using tofu in non-Asian recipes. This one you commented on is about as far as I've ever gone in that direction. But maybe I need to open my mind more on that topic. I definitely relate  to what you are saying about having something to put a sauce *on*.",
      "parent": "17155",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "18747",
      "author": "Katie",
      "author_url": "http://www.katiescookingtips.com",
      "date": "2012-02-07 06:31:57",
      "content": "I have been looking for a good tofu recipe for ages now. I am so sick of the same old soy sauce/teriyaki sauce pan fry.\n\nThis looks divine! Thank you!",
      "parent": "0",
      "gravatar_hash": "d5d3266be5656d0739e501585450b2a6"
    }
  ]
}