{
  "comment_count": 20,
  "comments": [
    {
      "id": "193781",
      "author": "Anne-Marie",
      "author_url": "",
      "date": "2013-09-03 06:48:22",
      "content": "Yep, this is how I do them, too! (And home fries for Sunday brunch, and grilled broccoli, and browned carrots, and browned corn kernels, cauliflower, zucchini...) For snappier beans, subtract ~45 seconds from the bright green done-time before putting them in the hot skillet.\n\nI got a mess of beans at the farmers' market this weekend - I think I'll make them again this way tonight for dinner!",
      "parent": "0",
      "gravatar_hash": "6c337c444bec0c062ea93c15b689d1bb"
    },
    {
      "id": "193812",
      "author": "Aseem Agarwala",
      "author_url": "",
      "date": "2013-09-03 08:11:31",
      "content": "What do you use for a \"microwave-safe bowl with lid\"? Everything that I've seen involves plastic, and microwave-heated plastic in contact with food concerns me.",
      "parent": "0",
      "gravatar_hash": "d6c2bcaebe90a7b0aa901f41ccb03c5e"
    },
    {
      "id": "193814",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-09-03 08:22:39",
      "content": "I usually use a glass or pyrex bowl and cover it with a ceramic plate. They do get hot as hell though, be sure to use towels or potholders to handle them if you go that route.",
      "parent": "193812",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "193827",
      "author": "Sandra Holt",
      "author_url": "",
      "date": "2013-09-03 09:00:23",
      "content": "http://curezone.com/art/read.asp?ID=112&amp;db=7&amp;C0=1\n\nAre you on the payroll of a microwave oven company?\nAre you a scientist?\n\nPlease don't take on the flippant reviews of microwave energy produced by vested interests.\n\nDo your homework.  Do you really want to be responsible for harming the life of anyone by giving your unscientific appraisal of microwave energy?\n\nRead the entire article, above, by Prevention.  Take a few more minutes to search for more REAL scientific studies. \n\nAnd don't tell a scientist or anyone that microwave energy is benign.",
      "parent": "0",
      "gravatar_hash": "6a2fddd3abf0783b84741171c82eae0c"
    },
    {
      "id": "193835",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-09-03 09:19:46",
      "content": "There it is.",
      "parent": "193827",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "193888",
      "author": "Moira",
      "author_url": "http://magdalenasmiles.wordpress.com",
      "date": "2013-09-03 12:18:00",
      "content": "Michael ~ I asked your opinion about the \"nuke\" about 6 months ago, when you confirmed you use it willy-nilly and without heebee-jeebies.  I find it's my purest vegetarian friends who live in horror of the contraption, so your feedback was most worthwhile.\n\nSince then, I've read several articles regarding the very low electromagnetic output of microwaves; the security of their construction so that even this is not emitted outside of the unit itself; and a pre-caution that your nuke may be emitting if the door gasket is breaking down.  This goes to how much sensitivity to light-bulb emissions one is willing to endure. In my researched opinion, the microwave is no more dangerous than the streetlights out at the curb.  Grapple your own way, regarding.\n\nI use the nuke in preparations precisely like this recipe, and also bake bread puddings, pre-cook onions, garlic and mushrooms, casserole molten dips, cook pastas and potatoes and quick scratch soups.  With this, and the crock-pot, I've literally cut the gas bill for my oven out of my budget.\n\nAs to containers: yes to the ceramics and glass.  The potholders now live over the nuke instead of next to the stove.",
      "parent": "0",
      "gravatar_hash": "e14043d0b484489c08c4c6c496a215f7"
    },
    {
      "id": "193944",
      "author": "Michelle",
      "author_url": "",
      "date": "2013-09-03 15:26:31",
      "content": "Do you think a glass plate would work as a lid? Thanks!",
      "parent": "0",
      "gravatar_hash": "1c28107dcb40e5251ddf6817a47e98ed"
    },
    {
      "id": "193951",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-09-03 15:48:37",
      "content": "Seems like it should be fine, as long as it is heat tolerant. Just be careful not to burn yourself.",
      "parent": "193944",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "193952",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-09-03 15:49:56",
      "content": "Glad to hear it! Agree, the one real risk that I know of is if you have a microwave that doesn't actually seal, then you could be lightly cooking yourself, which isn't good. If you are still using a 1973 Amana Radar-range, you sure might want to think about replacing it...",
      "parent": "193888",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "194045",
      "author": "Robyn",
      "author_url": "",
      "date": "2013-09-03 21:15:42",
      "content": "Broad beans grilled/broiled are delicious when popped out of their blackened pods - try next spring!",
      "parent": "0",
      "gravatar_hash": "74817ed271115086b6460cb329205742"
    },
    {
      "id": "194377",
      "author": "alex clarkson",
      "author_url": "http://www.foodonclick.com",
      "date": "2013-09-05 09:43:37",
      "content": "i could never roast beans so well..thanks for the tips",
      "parent": "0",
      "gravatar_hash": "15be980d54dd8f1f1efd5a9d3f6f8f49"
    },
    {
      "id": "194390",
      "author": "Beth",
      "author_url": "",
      "date": "2013-09-05 12:32:40",
      "content": "The microwave-pan sear is perfect for brussels sprouts. Yum!",
      "parent": "0",
      "gravatar_hash": "5abb643cf34f6a83f53556feb7ee8094"
    },
    {
      "id": "195209",
      "author": "tea-time365.blogspot.com",
      "author_url": "http://tea-time365.blogspot.com",
      "date": "2013-09-10 02:20:18",
      "content": "Now i know the secret!",
      "parent": "0",
      "gravatar_hash": "73bb69493dd8e86441134fd5947290ff"
    },
    {
      "id": "196155",
      "author": "Kelly",
      "author_url": "",
      "date": "2013-09-15 07:22:21",
      "content": "What do you recommend if a person doesn't <i>have</i> a microwave? I've lived without one for almost 6 years now and even though these look delicious, I'm not likely to buy one for a single side dish recipe.\n\n(Love all these recipes, by the way!  You have helped me become a vegetarian with your To Fu recipes! )",
      "parent": "0",
      "gravatar_hash": "cd20da471151e88eea37885d97bafe8c"
    },
    {
      "id": "196157",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-09-15 07:34:32",
      "content": "Thanks, Kelly! If you don't have a microwave, some things you can try:\n\n- steaming\n- parboil\n- steaming in the saute pan with a small amount of water and a lid, then remove the lid, let them dry off on the heat and and oil\n\nThe reason I prefer the microwave is it uses fewer pots than steaming, doesn't require you to wait for water to boil, and is easier to control than the last method. But they all work.",
      "parent": "196155",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "197285",
      "author": "Stefan Rusek",
      "author_url": "",
      "date": "2013-09-22 18:06:49",
      "content": "I use a variation of this for perfect hash browns. I grate the potatoes and press as much liquid out of them as possible. Salt and pepper then, then microwave them with some stirring them every 30 seconds or so. When they are almost done enough to eat throw them into a skillet to brown.",
      "parent": "0",
      "gravatar_hash": "f7a108b02c5e522e1a4c64ff7fc33b7a"
    },
    {
      "id": "199350",
      "author": "Thailand Breeze",
      "author_url": "http://www.thailandbreeze.com/vegetarian-festival-in-thailand.html",
      "date": "2013-10-07 01:30:58",
      "content": "The green beans look delicious!   \n \nMany times simple recipes are the best. :)  \n\nRight now, there is a vegetarian festival all over Thailand. It's a great way to sample Thai vegetarian dishes.",
      "parent": "0",
      "gravatar_hash": "24ca6863264d10e7ee1d1fa3bad04af4"
    },
    {
      "id": "199385",
      "author": "Moira",
      "author_url": "http://magdalenasmiles.wordpress.com",
      "date": "2013-10-07 09:20:56",
      "content": "Thailand Breeze ~ can you send up a link ?",
      "parent": "199350",
      "gravatar_hash": "e14043d0b484489c08c4c6c496a215f7"
    },
    {
      "id": "1202136",
      "author": "Belinda",
      "author_url": "",
      "date": "2014-12-26 12:35:24",
      "content": "Finally! This works perfectly - I have been looking for a process that gives that result for years. Thank you so much!",
      "parent": "0",
      "gravatar_hash": "02f90b4a00327c5cd81693e0d2ea3886"
    },
    {
      "id": "1290485",
      "author": "Susan Z",
      "author_url": "",
      "date": "2015-04-02 04:19:59",
      "content": "For microwave use for those concerned about plastic or those who want something simple. Use a smooth silicone potholder as a cover for a glass bowl for single portion cooking or re-heating. It is clean, high heat resistant, and dishwasher easy. It also makes a great trivia for a hot container.",
      "parent": "0",
      "gravatar_hash": "937609abbd1d76a75c0c0fe2e8a7837c"
    }
  ]
}