{
  "comment_count": 4,
  "comments": [
    {
      "id": "3480",
      "author": "Miss Scarlett",
      "author_url": "http://nevergohungryagain.blogspot.com",
      "date": "2008-06-04 15:19:05",
      "content": "I *just* made this very thing last weekend to go w/ shrimp tacos.  Alongside some Pico de Gallo and some Avocado Crema sauce, the pickled onions were a nice hit of tartness.  I let mine pickle a little longer till they are completely purple and there's no trace of white left.  Yummy.",
      "parent": "0",
      "gravatar_hash": "2be4c1a6f83a487e36f52739c4c7f712"
    },
    {
      "id": "3481",
      "author": "Kat",
      "author_url": "",
      "date": "2008-06-04 21:43:19",
      "content": "so..... how do you make adobo tofu?? sounds wicked!",
      "parent": "0",
      "gravatar_hash": "94c0def1e18ac2f1b4bd4474c54738ed"
    },
    {
      "id": "3482",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-06-04 22:42:48",
      "content": "Hah! I was afraid someone was going to ask me that. I can't reveal what was in that particular adobo tofu, because it is so heinous I'm embarassed - though it actually tasted pretty good. But a reasonable fast way would be to start with some of the adobo sauce that chipotle peppers come packed in (which will be quite spicy), and then dilute that with tomato puree and add orange zest and oregano and cumin. Fry the tofu, then add that sauce and reduce it right onto the tofu until a bit thick.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3483",
      "author": "Cassie",
      "author_url": "http://www.veggiemealplans.com",
      "date": "2008-06-06 09:23:56",
      "content": "Hi Michael, I love your tip about making pickles with leftover onion.  Very useful!\n\nI was recently eyeing up a recipe for adobo tacos with pickled onions, something I've never tried before.  Now your post has me even more intrigued.  Looks and sounds great!",
      "parent": "0",
      "gravatar_hash": "2f4000514924cb1b9a9e7d0ab1fd53e4"
    }
  ]
}