{
  "comment_count": 19,
  "comments": [
    {
      "id": "21433",
      "author": "Jenny",
      "author_url": "http://vegetarianhatesvegetables.blogspot.com/",
      "date": "2012-03-14 08:31:59",
      "content": "How neat!  I will have to try this.",
      "parent": "0",
      "gravatar_hash": "efd63fa22c1a4cd1b5e1e7c8fc2b99bb"
    },
    {
      "id": "21435",
      "author": "Nilam",
      "author_url": "http://khavanu.blogspot.com",
      "date": "2012-03-14 13:58:22",
      "content": "I love that you tried this! You can always add cooked potatoes to it as well.",
      "parent": "0",
      "gravatar_hash": "39a80437f59150fc64ae46179001398a"
    },
    {
      "id": "21482",
      "author": "happily pensive",
      "author_url": "http://happilypensive.blogspot.in/",
      "date": "2012-03-15 00:43:05",
      "content": "Hey,\nIve been  a silent reader of your blog for a while now. It feels so good to know someone who doesnt punish me for being vegetarian, instead helps me celebrate it!.\nPoha is one of my absolute favorite breakfast/snack items. Its light, fluffy and flavourful! Also I love to squeeze a little fresh lime juice over my poha. It gives a fresher and better taste than lime pickle.",
      "parent": "0",
      "gravatar_hash": "fe85013325ac46c0e4654ab266a9a306"
    },
    {
      "id": "21539",
      "author": "Amanda",
      "author_url": "http://peacefulpantry.com/",
      "date": "2012-03-16 08:43:12",
      "content": "This looks incredible! I'm definitely going to give it a try.",
      "parent": "0",
      "gravatar_hash": "5d9abe0e369333cf52e6cc3c7b82fdab"
    },
    {
      "id": "21551",
      "author": "Rachel Anne Manning",
      "author_url": "http://www.connectabite.com",
      "date": "2012-03-16 10:54:10",
      "content": "Hello,\n\nI just wanted to stop by and say how delicious this recipe looks, and say I'm quite thrilled to try it.  Additionally I read your 'why I'm vegetarian, damn it' and I found it very compelling and thought provoking.  I recently began a blog, and I'm vegan, so it's wonderful to read other people's perspective.\n\nI look forward to your cookbook.\n\nHealthy Regards,\n\n~RAM~",
      "parent": "0",
      "gravatar_hash": "e3cc0be230b112aeba3fd07ca171cb85"
    },
    {
      "id": "21631",
      "author": "almostveg",
      "author_url": "http://omnivore-almostveg.blogspot.com",
      "date": "2012-03-18 10:48:37",
      "content": "We also add frozen peas and tiny cubes of boiled potato to the onions once it is light brown. Adds texture and makes a good lunch dish.",
      "parent": "0",
      "gravatar_hash": "470c236b3357f7fb086a4be8c7e2573e"
    },
    {
      "id": "21635",
      "author": "The Cozy Herbivore",
      "author_url": "http://thecozyherbivore.blogspot.com",
      "date": "2012-03-18 17:52:33",
      "content": "Yum! This looks great! Now when you say \"lime pickle\", are you referring to salt-preserved limes? Because I have an OBSESSION with salt-preserved citrus. So delicious! I can't wait to try this recipe... I'm a sucker for coconut and rice dishes with cashews.",
      "parent": "0",
      "gravatar_hash": "1d5985d7cc6f6858b98242094ff0124d"
    },
    {
      "id": "21636",
      "author": "Mathew",
      "author_url": "http://www.gardeningasseenontv.com/upsy-downsy-tomato-planter/",
      "date": "2012-03-18 18:45:20",
      "content": "I can’t remember the last time that I had a meal with cashews.  I think it was at a Tai restaurant. Always like to add an ingredient that will add texture to the meal. I can’t wait to try out this dish. Thanks!",
      "parent": "0",
      "gravatar_hash": "2a5d6355d9317a89d388eeff3e4fabbb"
    },
    {
      "id": "21637",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-18 19:25:21",
      "content": "Salt-preserved lime is delicious, but Indian lime pickle is something different. Here's a brand you can often find: http://www.amazon.com/dp/B000JSSOCY/?tag=poeticlicen07-20",
      "parent": "21635",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21702",
      "author": "Carolyn",
      "author_url": "http://www.whatsthemuck.blogspot.com/",
      "date": "2012-03-20 14:18:07",
      "content": "Oh no, you made me go out and buy more fun new ingredients! The Asian grocer I go to from time to time had poha so I snatched some up, but I don't remember ever seeing it there before. Think I'm going to love your recipe, but I'm also thinking poha could be a great  'pantry' staple at work, sort of like couscous. Just rehydrate, add some seasonings, dried fruit and nuts? Instant pilaf when you forgot to bring lunch!",
      "parent": "0",
      "gravatar_hash": "380d699e3ae9d44fa2e6dac67339e153"
    },
    {
      "id": "21706",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-20 15:21:48",
      "content": "Agreed, yes, it is very neutral and very quick, so I think you could use it that way. Let me know (really) your experiences as you play with it.",
      "parent": "21702",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21855",
      "author": "Danielle",
      "author_url": "",
      "date": "2012-03-22 17:59:30",
      "content": "My first foray into cooking with Indian spices/foods and I LOVE it! My only problem is that the poha ended up pretty dry for me ... should I have left it soaking in the water a bit longer? I still have half of the dish left for dinner tomorrow night ... I'm thinking I might throw it into a skillet with some broth to reheat/moisten it a bit. A good idea?",
      "parent": "0",
      "gravatar_hash": "ed0f3fa75b42c19631aff98748129f2c"
    },
    {
      "id": "21856",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-22 18:03:51",
      "content": "Sounds like it might need just a bit more moisture or less squeezing out, yes. I wouldn't be surprised if different brands and thicknesses respond slightly differently. I suspect rewarming it with a bit more liquid will be fine. I could actually see the microwave with a couple tablespoons of water in a covered dish working well.",
      "parent": "21855",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22081",
      "author": "Kathryn",
      "author_url": "http://chachasgfkitchen.blogspot.com",
      "date": "2012-03-27 05:49:13",
      "content": "It's been a while since I've visited your site to find something wonderful and vegetarian for our Easter celebration. I was so happy to find this recipe - not for Easter but for tonight's dinner. I'll stop by my favorite Indian market today so I can make this for my family right away. Your  enfrijoladas de espinaca became a family favorite and I think this one will, too.",
      "parent": "0",
      "gravatar_hash": "33395e12b44ec9a40bb32295bd0a1039"
    },
    {
      "id": "22085",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-27 06:18:02",
      "content": "Thanks, Kathryn. I saw your note on the nut allergy post as well. Nice to hear from you!",
      "parent": "22081",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22142",
      "author": "ChicagoCook",
      "author_url": "",
      "date": "2012-03-28 08:19:42",
      "content": "Yum! One of my favorite breakfasts! I usually stick to just onion, peas and maybe potatoes for the veggies. The best thing about poha is that it's so forgiving--even if you don't have any vegetables, it's still delicious!  Although, I don't soak my poha--too much of a chance of it falling apart. Instead, I just put it in a colander and \"rinse\" it thoroughly. Once in the tawa, I add a little more water and cover it to let it steam.",
      "parent": "0",
      "gravatar_hash": "572bc11cf507aeb623dbaf2aa958ec90"
    },
    {
      "id": "22143",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-28 08:27:50",
      "content": "You know, that makes a ton of sense to me. I saw recipes telling people to soak it even for 30 minutes, and I found that it was plenty moist after just a few, so I don't really understand that. I'll try your rinse and steam method too.",
      "parent": "22142",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "61829",
      "author": "Vipasha Adlakha",
      "author_url": "",
      "date": "2012-10-11 08:57:48",
      "content": "Poha is a staple breakfast item for most Indians and there are different versions of it. I love the way Gujaratis make their Poha by adding a little sugar, mustard seeds, very little turmeric and no veggies but I never get it quite right. \nSo i stick to my version with lots of onion, coriander, tomatoes and potatoes. While tempering,  curry leaves and green chillies can also be added if you can handle the heat! And I like to garnish it sometimes with raw onions too. \nHowever I like my Poha very mushy because otherwise it becomes too dry for my taste.",
      "parent": "0",
      "gravatar_hash": "8bbed214f39abb6cc797ff91b7bd9f6a"
    },
    {
      "id": "96446",
      "author": "Clara",
      "author_url": "",
      "date": "2012-12-09 08:38:03",
      "content": "I have to tell you that I make this recipe all the time and I think it's my absolute favorite meal (I serve it with Dal and Rotis). Thank you :)",
      "parent": "0",
      "gravatar_hash": "1608b85e973767bda9d3e807c02545df"
    }
  ]
}