{
  "comment_count": 23,
  "comments": [
    {
      "id": "21719",
      "author": "sweet road",
      "author_url": "http://www.asweetroad.com",
      "date": "2012-03-21 09:01:08",
      "content": "I had a lot of dished that used sofrito in Cuba over the winter... I had never made it or even really consciously knew what it was. When I came home and started trying my hand at some Cuban recipes I figured it out. They didn't have polenta in Cuba, so I am curious to try out these two flavors together!",
      "parent": "0",
      "gravatar_hash": "eec3e0e058b7a2779222b9720b26acd7"
    },
    {
      "id": "21726",
      "author": "Jenni",
      "author_url": "http://www.pastrychefonline.com/blog",
      "date": "2012-03-21 12:48:26",
      "content": "What a versatile sauce! I can picture it used for any number of applications. And they all sound mouthwatering. I don't own polenta, but grits by any other name... :)",
      "parent": "0",
      "gravatar_hash": "b083e59b95eb8fe5d0bc611a0fcce438"
    },
    {
      "id": "21828",
      "author": "Trish",
      "author_url": "http://dishbytrish.com",
      "date": "2012-03-22 07:27:04",
      "content": "Sounds amazing. I'll have to make this... I can't believe I haven't made it yet. Love all the ingredients.",
      "parent": "0",
      "gravatar_hash": "16e51cda924ff46d16434264b60eb17f"
    },
    {
      "id": "22089",
      "author": "Jennifer",
      "author_url": "",
      "date": "2012-03-27 08:27:06",
      "content": "What happened?? I made this and something went terribly wrong.  When I blended the onion and garlic(I used yellow onion, not white) and added it to the olive oil, it looked fine.  But after a few minutes of cooking, it turned green!  I continued cooking it until it turned brown, then proceeded with the recipe.  When done, it tasted bitter, really inedible.  I should have stopped when I saw green, instead of wasting all the peppers I had prepared.  Now I think I'd better chuck the whole mess.  Any ideas of what went wrong?",
      "parent": "0",
      "gravatar_hash": "f5e34b6855f822cb50d913c4e0319e9a"
    },
    {
      "id": "22090",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-27 08:50:56",
      "content": "My first guess is that you cooked it in a cast iron pan? You never want to cook anything acidic like tomatoes in cast iron, it will react and I believe turning green is the classic sign. I'll add that note to my post, and sorry I didn't think to mention it before! Stainless steel or enamel coated cast iron is the way to go for this kind of thing.",
      "parent": "22089",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22091",
      "author": "Jennifer",
      "author_url": "",
      "date": "2012-03-27 09:08:34",
      "content": "No, I used a Le Creuset enameled braiser....",
      "parent": "0",
      "gravatar_hash": "f5e34b6855f822cb50d913c4e0319e9a"
    },
    {
      "id": "22093",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-27 09:27:29",
      "content": "Hmm. Well it shouldn't be that then, unless the enamel is heavily scratched allowing a lot of iron in. I haven't seen this happen myself. I did find these references: http://chowhound.chow.com/topics/471608, http://cooking.stackexchange.com/questions/14105/does-aged-onion-garlic-turn-green-when-frying but they only address the color, not an unusual bitterness. Anyone else have other ideas for Jennifer? I guess my next thought is that maybe the color and the bitterness were unrelated, and the garlic simply burned creating the bitterness. Looking at the recipe I called for medium-high heat but I think maybe medium would be a more appropriate recommendation. I'll change it, and sorry for the inconvenience!",
      "parent": "22091",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22362",
      "author": "Kelly",
      "author_url": "",
      "date": "2012-04-02 08:00:38",
      "content": "If we don't want to use tomato paste, would canned tomatoes like San Marzanos be usable? I have an entire case of them. How much would you recommend using? Thanks!",
      "parent": "0",
      "gravatar_hash": "1de91be2af7b5ca673590e23c16d956b"
    },
    {
      "id": "22363",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-02 08:05:43",
      "content": "Absolutely! I'd use a 15 ounce can for a single recipe, breaking them up well if they are whole tomatoes, and expect the cooking to take significantly longer since there is more liquid to cook off.",
      "parent": "22362",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22525",
      "author": "Joann",
      "author_url": "http://www.chickypea.com",
      "date": "2012-04-06 20:36:35",
      "content": "This recipe is calling for me to make it. Looks delish. How do you come up with your recipes? Experimentation or starting from a recipe and improvising?",
      "parent": "0",
      "gravatar_hash": "d7e286970563c303c60149c0682adac3"
    },
    {
      "id": "22527",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-06 23:04:09",
      "content": "Hey Joann - I think it is a little bit of all of the above! I've been in love with food for so long, and I'm always reading about it, thinking about it, shopping for it, eating it... so I think there are always ideas to mash-up, remix, and occasionally a spark of something different. And of course lots of things don't work, or don't work well enough to be worth writing about.",
      "parent": "22525",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "23973",
      "author": "Nicholas Sloanhoffer",
      "author_url": "http://www.sunyrockland.edu/Members/nsloanho",
      "date": "2012-05-15 09:57:03",
      "content": "Thanks for the polenta recipe. It seems the changes you made didn't affect the final outcome too much.",
      "parent": "0",
      "gravatar_hash": "a79331ffbf6122469e20f0410b70ef02"
    },
    {
      "id": "55663",
      "author": "PS",
      "author_url": "",
      "date": "2012-09-28 13:46:11",
      "content": "Hello Jennifer, I am not much of cook, but from all indian cooking I have done, basic is never puree raw onion, they tend to be bitter. My all inidan curry taste improved with that simple change(pureeing onion after sauteeing) I loved the receipe, but that was the only change I was planning to make",
      "parent": "22091",
      "gravatar_hash": "88eaddc1d51fac5cd61411ad98614c04"
    },
    {
      "id": "101722",
      "author": "emili",
      "author_url": "",
      "date": "2012-12-21 13:22:26",
      "content": "ok, im in the process of doing this now, my peppers have not rendered any precious liquid into the baking pan tho. ???",
      "parent": "0",
      "gravatar_hash": "538ef601e53fa6bdae30e54998754b83"
    },
    {
      "id": "101723",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-12-21 13:40:13",
      "content": "How long have they been roasting for? In any case, it isn't a problem if you don't end up with any roasting juices, I just want you to save and use any you do get since they are delicious.",
      "parent": "101722",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "101732",
      "author": "Emili",
      "author_url": "",
      "date": "2012-12-21 15:52:29",
      "content": "I think they were in for about an hour. The sauce turned out amazing, but the red onions stayed quite raw. I had them in for more than ten minutes, maybe I needed to slice them thinner? Also, do u have any suggestions for the polenta without all the delicious cheese &amp; butter? My husband can't do cheese :( I put some on top of my serving but I'm afraid it's going to be bland when he gets home and eats it without :(",
      "parent": "0",
      "gravatar_hash": "538ef601e53fa6bdae30e54998754b83"
    },
    {
      "id": "101783",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-12-21 20:48:25",
      "content": "I think if the red onions were a bit raw, then yes you either needed to slice them thinner, turn the heat up a bit higher, or cook them longer. As far as polenta without the cheese and butter, it will still be pretty tasty as long as you make sure it is piping hot with enough water whisked in to avoid it being too thick or lumpy. Maybe add some olive oi.",
      "parent": "101732",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "433920",
      "author": "Alana",
      "author_url": "",
      "date": "2013-12-28 18:44:36",
      "content": "Happy new year, Michael! Oddly enough, I also got the bitter and green reaction when I cooked the pureed onions and garlic, and I was using a stainless steel frying pan.  I started again, and took PS's advice and sauteed minced garlic and onion before pureeing it, which worked out fine.  Very mysterious! The end result was delicious though, and I am excited to have polenta in the repertoire now.",
      "parent": "0",
      "gravatar_hash": "688f27e683e418bf82073fba81b0f095"
    },
    {
      "id": "434065",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-12-28 19:28:09",
      "content": "Interesting! Well, to me that means it must be an enzymatic reaction then, and the pre-heating step is inactivating the enzyme. I'll ask Chris Young, he'll know.",
      "parent": "433920",
      "gravatar_hash": "98c10d2d92fe38bf3eb8cdd3eeb4cc7c"
    },
    {
      "id": "857713",
      "author": "Marsha",
      "author_url": "",
      "date": "2014-03-24 15:04:39",
      "content": "I'm a bit late to the  party, but... I also used yellow onion, garlic, and olive oil. When I started cooking it, on medium, it also turned green but I ignored it. When I started smelling the odor of overcooked garlic, I turned the heat way down to low. Took forever to cook up the sofrito but nothing burned and no bitter taste.",
      "parent": "0",
      "gravatar_hash": "a72279280f3779a9ca26b78e73a9d9af"
    },
    {
      "id": "905870",
      "author": "Jessica",
      "author_url": "",
      "date": "2014-05-12 13:29:56",
      "content": "First off, let me tell you how much I love your blog. So many of your recipes are exactly the way I love to cook! I have a question for you about this recipe (it looks soooo good, btw). I am catering my sisters vegetarian wedding in a few months and because  its in a private back yard Im only going to have one oven to feed 60 people. My plan is to round up an arsenal of crockpots, and pick 2 or 3 recipes that can be prepared ahead of time and then reheated with them, or cooked entirely in them. (there will also be lots of cold and room temperature dishes) After the ceremony (im also a bridesmaid, so I cant be in the kitchen the whole time) Everything is going to be served family style, so with some help, I want to beautifully plate up straight out of the crockpots and sent out to the tables within a relatively short amount of time. I really want people to be impressed with the quality, taste and originality of the food. Okay now after that lengthy explanation, the question. Do you think this recipe could be made the day before, up to the final simmer, refrigerated, and then returned to the the crock pot an hour or two before service to warm up? I already know polenta can be made fairly easily in a crockpot. Thank You!",
      "parent": "0",
      "gravatar_hash": "fc55034d7af430dee54a9fb015197888"
    },
    {
      "id": "905895",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-05-12 14:31:46",
      "content": "Wow, you are a good friend to have at a wedding! Yep, the peperonata will reheat just fine, I wouldn't worry about that at all. Do read through the comment thread though, we've had a couple of people run into some odd chemical reaction where it got a greenish tint, probably related to the garlic. For the polenta, if you want to precook it and reheat in the crockpot, just be prepared to thin it out and break up lumps, that's biggest problem you'll run into.",
      "parent": "905870",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314475",
      "author": "Angela",
      "author_url": "",
      "date": "2017-12-07 10:03:18",
      "content": "How about using another large pan made of something different just to see if there is a change and let us know how it turns out. I'd appreciate knowing if it makes a difference.  Good luck!",
      "parent": "22091",
      "gravatar_hash": "02818d9ad389cd4ec4987541a4210215"
    }
  ]
}