{
  "comment_count": 7,
  "comments": [
    {
      "id": "38",
      "author": "Jerry Ko",
      "author_url": "http://www.simplygoodeating.com",
      "date": "2011-10-31 10:11:28",
      "content": "The polenta presentation looks great and I'm sure it taste as good as it looks.",
      "parent": "0",
      "gravatar_hash": "bdf35bb28018804082f848e2ae3ea03b"
    },
    {
      "id": "39",
      "author": "Alissa",
      "author_url": "http://notjustapples.blogspot.com",
      "date": "2011-10-31 12:12:18",
      "content": "Delicious! I love any mushroom that's more interesting than chestnut or button... seems like it would go beautifully with polenta.",
      "parent": "0",
      "gravatar_hash": "2d1ecfb86266ff2a56952035138a9c02"
    },
    {
      "id": "40",
      "author": "angela@spinachtiger",
      "author_url": "http://www.spinachtiger.com",
      "date": "2011-10-31 20:11:38",
      "content": "This dish has all the qualities I look for. Personal touch, earthiness, one dish, rustic yet still well thought out.",
      "parent": "0",
      "gravatar_hash": "813dc67a9d1df4ad31a84c463c10c4af"
    },
    {
      "id": "41",
      "author": "amee",
      "author_url": "http://www.rabbitfoodrocks.blogspot.com",
      "date": "2011-11-01 20:33:04",
      "content": "fancy!...although, that is what i have come to expect when i visit here.  always leaving impressed.  i like how the \"toppings\" break up the color.  i do like chevre dotted in savory dishes.  however i have an issue with french words like chevre.  louvre...lots of extra letters that we don't actually say.  hmph..",
      "parent": "0",
      "gravatar_hash": "22476a0ce17918636d3355926c514729"
    },
    {
      "id": "42",
      "author": "John",
      "author_url": "",
      "date": "2011-11-02 18:25:44",
      "content": "I made a modified version tonight. Replaced \"Porcini\" with a \"three-mushroom mix\" -- crimini, oyster, and shiitake, and I didn't make the confit...just used some sun-dried-tomatoes-in-oil that I had in the house already. And I used grits instead of cornmeal for the polenta. The results were great -- not a real BLENDING of flavors, but a bunch of distinct flavors and textures that complemented each other and worked well. On the side, I made the Persian Zucchini recipe, which was a big hit as well (although your notion of \"medium\" zucchini and mine must be different, because 6 of mine covered my largest baking dish about 1.5 layers deep, and 8 would have overflowed).",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "43",
      "author": "vincent",
      "author_url": "http://en.petitchef.com/",
      "date": "2011-11-08 10:33:45",
      "content": "Hello,\n\n\nWe bumped into your blog and we really liked it.\nWe would like to add it to the Petitchef.com.\n\nWe would be delighted if you could add your blog to Petitchef so that our users can, as us,\nenjoy your recipes.\n\nPetitchef is a french based Cooking recipes Portal. Several hundred Blogs are already members\nand benefit from their exposure on Petitchef.com.\n\nTo add your site to the Petitchef family you can use <a href=\"http://en.petitchef.com/?obj=front&action=site_ajout_form\" rel=\"nofollow\">http://en.petitchef.com/?obj=front&action=site_ajout_form</a> or just go to Petitchef.com and click on \"Add your site\"\n\nBest regards,\n\npetitchef.com",
      "parent": "0",
      "gravatar_hash": "e85ea82557f4cb13f847c65b01c17b62"
    },
    {
      "id": "44",
      "author": "Christine",
      "author_url": "http://www.knapkins.com",
      "date": "2011-11-12 20:49:05",
      "content": "Hey Foodies, Michael's Pan Roasted recipe has been selected by Knapkins to be featured in a Recipe Guessing Game. Invite fans to play: <a href=\"http://knapkins.com/guess_games/607?source=blog\" rel=\"nofollow\">http://knapkins.com/guess_games/607?source=blog</a>",
      "parent": "0",
      "gravatar_hash": "6ccb65b37d2335df6fb0d9977d874a2c"
    }
  ]
}