{
  "comment_count": 18,
  "comments": [
    {
      "id": "63607",
      "author": "Anjali @ The Picky Eater",
      "author_url": "http://pickyeaterblog.com/",
      "date": "2012-10-17 06:30:34",
      "content": "I love using curry leaves in Indian recipes!! You are right that they are incredibly aromatic - I especially like them in lentil stews or \"dal\" - they add a wonderful depth of flavor to the dish. I love the simplicity of this recipe - will definitely be trying it soon!",
      "parent": "0",
      "gravatar_hash": "cbf7e2f632d66944d11f68eee5793c78"
    },
    {
      "id": "63613",
      "author": "Betty Ann @Mango_Queen",
      "author_url": "http://www.asianinamericamag.com",
      "date": "2012-10-17 06:56:13",
      "content": "What a delightful recipe for curry leaves! I must try this for my son who loves to put curry in a lot of dishes he cooks. Thanks for sharing this helpful info and great recipe idea, Michael!",
      "parent": "0",
      "gravatar_hash": "2f47cf20944759bec2f5c79ae8ee733f"
    },
    {
      "id": "63636",
      "author": "Marina@Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-10-17 07:59:24",
      "content": "Michael, that is the most fantastic meals ever: I love simplicity in the food, and especially I love purple potatoes... I have to admit though: I've never tried curry leaves... Will look for it in the stores... Where is the best place to look for it?",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "63641",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-17 08:11:59",
      "content": "In Seattle, I see them at Asian and Indian groceries, like Uwajimaya, HT at Oaktree Plaza, or Apna Bazaar in Bellevue. I assume the same would be true in other cities. It may be worth calling around first, as it could be hit and miss - ask if they have *fresh* curry leaves. And don't forget you can freeze them, so once you find a pack they can last awhile.",
      "parent": "63636",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "63653",
      "author": "Marina@Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-10-17 08:45:35",
      "content": "Thanks Michael! Well, Uwajimaya would be the perfect place to start as we are moving back to Seattle and probably will rent something in Crossroads area for the time being.  I am driving and taking with me my kaffir lime tree... :)",
      "parent": "63641",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "63655",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-17 08:50:00",
      "content": "Oh good, well I look forward to meeting you when you get back and settled into Seattle!",
      "parent": "63653",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "63677",
      "author": "Laura",
      "author_url": "",
      "date": "2012-10-17 10:01:56",
      "content": "I can't wait to try this.  Also inspires me to try to locate a curry plant.  I used to ride the bus to work and the bus driver who was an Indian from Singapore taught me about curry leaves.  He told me about a plant that was growing wild in a vacant lot...no idea how it got there.  Now torn down so I am on the hunt to buy my own.  Kudos  to the lady moving and taking here Kaffir lime tree with her.  Mine sits on my front porch where it is protected from strong winds and the gardener and mail man who seemed to have a go-round with it last year.  This year I have fruit too!",
      "parent": "0",
      "gravatar_hash": "eb9730ec28517427db4072a17e9097b5"
    },
    {
      "id": "63858",
      "author": "Marina@Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-10-17 18:16:22",
      "content": "Sounds good, then talk to you in Seattle! :)",
      "parent": "63655",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "68115",
      "author": "Charu",
      "author_url": "",
      "date": "2012-10-24 10:35:03",
      "content": "Michael, so delighted to see you using the staple of many Tamil dishes. Love 'karuvepilai', cannot cook most dishes without it. It is so heartening to see South Indian dishes and spices getting their due recognition ;-)",
      "parent": "0",
      "gravatar_hash": "dd3e3e276811a7f09a7b36fdd2d1a5cf"
    },
    {
      "id": "68631",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-25 06:27:47",
      "content": "Hey Charu - Absolutely! I love South Indian cuisine and am always sorry it isn't better known in the US.",
      "parent": "68115",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "70729",
      "author": "Bryan R. Clarey",
      "author_url": "",
      "date": "2012-10-29 14:56:35",
      "content": "Hi - I used Helichrysum angustifolia `Tall Curry` and although it was delicious the curry leaves \"clumped\" together\" in several little clumps.  Is that normal or would a different kind of fresh curry work better next time?  \n\nThank you!\n\nBryan",
      "parent": "0",
      "gravatar_hash": "8bef9f6482d2e0c645f2efae3eb2dd9b"
    },
    {
      "id": "70731",
      "author": "Bryan R. Clarey",
      "author_url": "",
      "date": "2012-10-29 14:58:45",
      "content": "It is a perfect combination of flavors BTW....",
      "parent": "0",
      "gravatar_hash": "8bef9f6482d2e0c645f2efae3eb2dd9b"
    },
    {
      "id": "70976",
      "author": "Bvira.com",
      "author_url": "http://www.bvira.com/Small-Kitchen-Appliances/",
      "date": "2012-10-30 03:08:48",
      "content": "This recipe looks great and I’m definitely going to try it.",
      "parent": "0",
      "gravatar_hash": "15fb1aef58f2f36d661e4d46370b4d7c"
    },
    {
      "id": "71047",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-30 06:12:59",
      "content": "Hmm, I haven't had that problem. Oh, I just googled the plant you are talking about - never heard of it before but it looks completely different. Sounds interesting, but very different. The curry leaf we are looking for looks like this: http://ninecooks.typepad.com/.a/6a00d83451fa5069e20167613e9dfc970b-800wi",
      "parent": "70729",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "101430",
      "author": "Teju",
      "author_url": "",
      "date": "2012-12-20 07:30:41",
      "content": "Hi, \nA less confusing way to spell the name of these leaves would be : kadhi leaves. \nCurry in India more or less just means \"sauce\" and it has nothing to do with the word \"kadhi\" (no r, but a deep d). Kadhi leaves are ubiquitous in the cuisine of the state of Maharashtra and in southern India. \nThey are two completely different words- hence, no confusion!!\nBtw, I just discovered your site and am loving it. Thanks for the great vegetarian recipes from around the world.",
      "parent": "0",
      "gravatar_hash": "b9a695c797d06b639088a7cfa3ef6da3"
    },
    {
      "id": "101466",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-12-20 09:04:37",
      "content": "Hey Teju - totally true, but if you go to look for these leaves in a grocery store in the US, they are always labeled \"curry leaves\". One of the hazards of cross-cultural translation. Glad to have you aboard!",
      "parent": "101430",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "902102",
      "author": "chandra",
      "author_url": "",
      "date": "2014-05-07 22:46:47",
      "content": "fabulous and simple recipe. In north India they are called \"meetha neem\" leaves. They are also called curry patta (patta means leaves). All Indian grocery stores in US will carry them.Thanks Michael, being a vegetarian, I have found your recipes to be amazing.",
      "parent": "0",
      "gravatar_hash": "2e4496f1b719a11299308f2885bb6c97"
    },
    {
      "id": "1314139",
      "author": "Laura",
      "author_url": "",
      "date": "2016-04-11 18:38:59",
      "content": "I have had a plant that I bought at a local herb nursery for a few years. I keep it potted an protect from freezing and it does very well here in Austin.  Thanks for the recipe - I love potatoes and curry leaves!",
      "parent": "0",
      "gravatar_hash": "c44bfa5f31e4095d85ae3c516b9cef20"
    }
  ]
}