{
  "comment_count": 17,
  "comments": [
    {
      "id": "17147",
      "author": "Emer from EverydayVegetarianRecipes",
      "author_url": "http://www.everyday-vegetarian-recipes.com/",
      "date": "2012-01-16 07:36:32",
      "content": "Lovely idea and very pretty too. I've done something quite similar with a lemon based dressing in the past but orange does sound - and look - really good.",
      "parent": "0",
      "gravatar_hash": "a03b38103ebcd1cd685aa8ff9df8fa89"
    },
    {
      "id": "17151",
      "author": "Kalyn",
      "author_url": "http://www.kalynskitchen.com",
      "date": "2012-01-16 08:22:31",
      "content": "So many flavors that I love in this!",
      "parent": "0",
      "gravatar_hash": "d24156669d5962deb7fdc31688282e65"
    },
    {
      "id": "17156",
      "author": "melinda",
      "author_url": "",
      "date": "2012-01-16 10:09:41",
      "content": "Oh! I didn't know the English name for that until now! We have a ton of it at home- from Turkey, where it's called 'pul biber'. I am hopelessly addicted to it.",
      "parent": "0",
      "gravatar_hash": "d27f1a4f054f4aab9612a229dab90ee1"
    },
    {
      "id": "17158",
      "author": "Marina",
      "author_url": "http://www.cowboycountryvegetarian.blogspot.com",
      "date": "2012-01-16 10:19:57",
      "content": "How easy and quick! Saving the recipe. Pacific Food Importers is a great place to shop, agree.  Can't wait for our return to Seattle. Until then your blog keeps me somewhat in the area. Thank you!",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "17205",
      "author": "melinda",
      "author_url": "",
      "date": "2012-01-16 22:44:59",
      "content": "I made this tonight. The only change for me was to add a little orange juice from the orange that I zested. It was a little too bitter for me without it, and the smell of the mint made the prospect of a little orange juice somehow irresistible.\n\nIt was fantastic!",
      "parent": "0",
      "gravatar_hash": "d27f1a4f054f4aab9612a229dab90ee1"
    },
    {
      "id": "17214",
      "author": "Debba",
      "author_url": "",
      "date": "2012-01-17 00:20:30",
      "content": "Just wanted to note you can find aleppo pepper at penzey's, either in a local shop or online, here:   http://www.penzeys.com/cgi-bin/penzeys/p-penzeysaleppopepper.html\n\nNot affiliated, just a happy customer.\n\nThanks for the lovely recipe!",
      "parent": "0",
      "gravatar_hash": "c9144bd47fd3cfaa9c2d1e823b55e4c2"
    },
    {
      "id": "17238",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-17 08:47:18",
      "content": "That sounds like an interesting variation!",
      "parent": "17205",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17648",
      "author": "John",
      "author_url": "",
      "date": "2012-01-21 07:42:39",
      "content": "I made this last night for a last-minute get-together with friends. Folks loved it. My only critiques are (a) it needed more mint, at least more \"mint of the kind you can get in New England in January.\" If I made it again, I'd double the amount. The mint was fresh and good and had a nice flavor when I tasted the leaves, but it was almost lost among the other flavors, and (b) I'd make double the marinade. The amount speficied covered the block of feta nicely, but then people cut off pieces and by the time we reached the middle, there was almost no marinade left. A bit more, swimming around the edge of the block, and small spoon with which to \"baste\" the block, would have been a good addition. \n\nThe leftovers from a second block are still good (and lovely) the next day, but need a bit more liquid -- it's all been absorbed into the cheese while it sat in the fridge overnight.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "17657",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-21 09:32:19",
      "content": "Thanks Spike! Great feedback as always.",
      "parent": "17648",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17827",
      "author": "Sarah",
      "author_url": "http://www.vegetariantapas.com",
      "date": "2012-01-24 18:44:48",
      "content": "Sounds like a lovely little appetizer for a dinner party. Looks good and easy to make too.",
      "parent": "0",
      "gravatar_hash": "02bb8b64956b76b2eecbdf52cb71940e"
    },
    {
      "id": "23114",
      "author": "Kelly",
      "author_url": "",
      "date": "2012-04-21 19:16:59",
      "content": "Made this tonight with the Mt. Vikos feta and it was hands down one of the best things I've ever tasted.  I will make this again and again!  Thank you!",
      "parent": "0",
      "gravatar_hash": "23675d08f05bd509b13783226e8a722a"
    },
    {
      "id": "173870",
      "author": "Diana",
      "author_url": "",
      "date": "2013-07-15 10:39:57",
      "content": "I agree with John - mine needed more mint. I made the marinade the night before and dressed the cheese the day of the party. The flavor was predominantly orange - I couldn't taste the garlic much, or the mint at all (used fresh). I was conservative with the Aleppo as I wasn't sure whether everyone coming liked heat. I would love to have a more specific measurement for the mint and pepper, because I definitely want to make it again, as everyone enjoyed it. Do you think it works better not making the marinade ahead of time?",
      "parent": "0",
      "gravatar_hash": "fbc38f6e8786144470ef574ff7ad5803"
    },
    {
      "id": "173873",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-07-15 10:48:28",
      "content": "When I've been making this lately, I've been doing sort \"more everything\" ... more olive oil, more herbs... fresh oregano & honey is really great too. Don't be shy, just pile on what you feel. I don't know about doing it ahead, it never lasts that long :)",
      "parent": "173870",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1313999",
      "author": "Diana",
      "author_url": "",
      "date": "2015-07-14 11:37:20",
      "content": "this has become my go-to app for summer pool parties, and I have used other citruses and herbs, even cheeses. Lime and cilantro work well together, of course and lemon and thyme are beautiful with the other ingredients on goat cheese.",
      "parent": "0",
      "gravatar_hash": "fbc38f6e8786144470ef574ff7ad5803"
    },
    {
      "id": "1314053",
      "author": "Cordelia",
      "author_url": "",
      "date": "2015-10-19 13:42:34",
      "content": "We make this all the time as part of our \"Mediterranean Feast.\" Crispy roasted cauliflower, Lebanese roasted potatoes, pudla besan (chickpea flour flatbreads; no pita since we're GF), baba ganoush, preserved lemon hummus, zhoug, tahini-yogurt sauce, and this dressed feta, served with olives and zesty pickled vegetables.\n\nIt is all so good, it is hard to pick a favorite, but having the feta dressed instead of plain really adds a lot to the flavor combinations present in the dish.",
      "parent": "0",
      "gravatar_hash": "2ad9127c3ff76dd9346fdc045559555d"
    },
    {
      "id": "1314060",
      "author": "John",
      "author_url": "",
      "date": "2015-10-26 07:53:34",
      "content": "This is one of our family's go-to recipes, and my son makes it for friends at college now. He wrote me today and said this: \"You know how the marinated feta is always a little lacking because the feta doesn't actually soak anything up? \n\n\"I found that if you juice the orange from which you got the zest, then cook it down with the garlic (and some zest) to about half the original volume, and the marinate the feta in it when the liquid is still a little warm, you get much more powerful (and slightly sweet) orange flavor that balances the bite of the feta really really nicely.\"\n\nI'm trying this the next time I make it!",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "1314061",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2015-10-26 07:58:05",
      "content": "Nice call!",
      "parent": "1314060",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}