{
  "comment_count": 30,
  "comments": [
    {
      "id": "2004",
      "author": "chocolate shavings",
      "author_url": "http://www.chocolateshavings.ca",
      "date": "2009-09-14 07:29:39",
      "content": "That has to be the ultimate comfort food!",
      "parent": "0",
      "gravatar_hash": "f55976994877188be218f8e52e5ac56c"
    },
    {
      "id": "2005",
      "author": "Sarah",
      "author_url": "http://www.sarahmelamed.com",
      "date": "2009-09-14 10:51:30",
      "content": "that looks delicious and I need to try making it again. I once tried it using dried chana chickpeas also called black chickpeas (small and brown) and they never got soft, like eating pebbles.",
      "parent": "0",
      "gravatar_hash": "7e37ba6c0e30dbfce4a8c30b0ffdae44"
    },
    {
      "id": "2006",
      "author": "kamalkitchen@gmail.com",
      "author_url": "http://kamalkitchen.blogspot.com",
      "date": "2009-09-14 11:54:42",
      "content": "Hey Mike,\nThis looks yummy. I have never tried this combination - chana and mushrooms, but it looks good. I mostly make chicpeas and spinach. I think mushrooms will give a similar earthy flavour.\n\nAlso havent added fennel seeds, but it sounds about right since they use fennel in north indian cuisine.\n\nThanks,\npb",
      "parent": "0",
      "gravatar_hash": "2b2aeef3ee84e2dcb66ae609be627642"
    },
    {
      "id": "2007",
      "author": "Dana",
      "author_url": "http://www.danatreat.com",
      "date": "2009-09-14 13:55:35",
      "content": "I love this kind of dish but have never made it with mushrooms.  Good idea!",
      "parent": "0",
      "gravatar_hash": "7e044150f12fee222a380d0d5f8b717e"
    },
    {
      "id": "2008",
      "author": "A&amp;N",
      "author_url": "http://reluctantchefs.blogspot.com",
      "date": "2009-09-14 17:55:08",
      "content": "Chana, choley - I could sing now :D Try adding potatoes to the same. Its just blissful. But I'm so going to try the mushroom version next time we have choley!",
      "parent": "0",
      "gravatar_hash": "50de5463f411bb5bad4710eb70af07f3"
    },
    {
      "id": "2009",
      "author": "thepinkpeppercorn",
      "author_url": "http://thepinkpeppercorn.blogspot.com",
      "date": "2009-09-14 19:32:50",
      "content": "Oooh, fantastic!  I am definitely trying this recipe!!",
      "parent": "0",
      "gravatar_hash": "0145f8dcbe06da53cbda0bb3145f268f"
    },
    {
      "id": "2010",
      "author": "The Italian Dish",
      "author_url": "http://www.theitaliandishblog.com",
      "date": "2009-09-15 07:16:22",
      "content": "I love masala!  I saw this dish on Twitter yesterday and had to check it out.  I wanted to see what your version was.  It looks delicious!  It's going in my \"to make\" folder.",
      "parent": "0",
      "gravatar_hash": "3e4e3826bf4c9300ffc14fd965fa8026"
    },
    {
      "id": "2011",
      "author": "piile",
      "author_url": "",
      "date": "2009-09-15 13:12:00",
      "content": "you must have felt my vibrations: i have been looking for a trustworthy masala recipe. i will be making this tomorrow! om nom nom! :)",
      "parent": "0",
      "gravatar_hash": "bff16c0e4def5dd7080a6e3fc696b425"
    },
    {
      "id": "2012",
      "author": "downtoeat.blogspot.com",
      "author_url": "http://profile.typepad.com/6p0120a5c89c32970c",
      "date": "2009-09-15 13:54:04",
      "content": "I just made this for lunch and it was super good.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2013",
      "author": "lovesquickneasyrecipes.blogspot.com",
      "author_url": "http://profile.typepad.com/6p0120a5737c54970b",
      "date": "2009-09-16 00:06:52",
      "content": "I have never tried this recipe. I would love to try your recipe. It looks good and yummy.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2014",
      "author": "cookingforaveganlover.com",
      "author_url": "http://profile.typepad.com/6p0120a57415bd970b",
      "date": "2009-09-16 05:02:20",
      "content": "I am drooling over this",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2015",
      "author": "Weekend Carnivore",
      "author_url": "http://weekendcarnivore.com",
      "date": "2009-09-18 12:58:13",
      "content": "Beautiful photo and I love that you just used normal white mushrooms. It feels like they are out of fashion now with wild mushrooms pushing them out. I know I am going to have to try this recipe.",
      "parent": "0",
      "gravatar_hash": "e8a83dd957fd3384a6163f530920ce51"
    },
    {
      "id": "2016",
      "author": "Jen",
      "author_url": "",
      "date": "2009-10-08 13:25:33",
      "content": "Just discovered your blog (yay) and made this last night. Yummy! I used your technique of extra simmering for my canned garbonzos, and I'm sure it helped but I think I'll cook my own next time (never done that before) since they never really softened. Also added more water for more sauce. Loved it. Looking forward to trying more!",
      "parent": "0",
      "gravatar_hash": "332f9fc8f277e1107d7cd9406b3ee8f0"
    },
    {
      "id": "2017",
      "author": "Ellen",
      "author_url": "http://www.cheapcooking.com/blog",
      "date": "2009-10-27 20:14:26",
      "content": "Thanks for this! Just made it the other night, minus the mustard seeds and chili pepper because I had none. Very good!  I was lazy about pans and just simmered everything together in one pan longer till the chickpeas were soft.  Served it with butter chicken, rice, and a lentil and potato curry. Mmm.",
      "parent": "0",
      "gravatar_hash": "c33e97b228c40102c1d6767fe42d7bff"
    },
    {
      "id": "2018",
      "author": "Tracy",
      "author_url": "http://www.tracyfood.com",
      "date": "2009-11-14 18:26:24",
      "content": "Made this for dinner tonight along with three tried-and-true veg*n favorites from Madhur Jaffrey's <i>Indian Cooking</i>, and count it a fabulous success.  Forgot the last bit of tempering mustard seeds, so I'm sure my next attempt will be even more delicious (and I also look forward to testing my intuition that this might be one of those recipes that makes excellent leftovers).  Thank you!",
      "parent": "0",
      "gravatar_hash": "ec4ee57bf1dbee11d6fa8f212eaf2f13"
    },
    {
      "id": "2019",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-11-14 21:58:53",
      "content": "So glad you liked it! You are right, it will only taste better tmw... and you could still add the tempering then if you have time.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2020",
      "author": "indian food",
      "author_url": "http://www.food-india.com",
      "date": "2010-02-05 08:20:47",
      "content": "Nice channa masala recipe with mushroom. A regular channa masala at <a href=\"http://www.food-india.com/recipe/R001_025/R007.htm\" rel=\"nofollow\">Channa Masala</a>",
      "parent": "0",
      "gravatar_hash": "5cacbd5b5f6a9bf6195595797ab1c130"
    },
    {
      "id": "2021",
      "author": "dillydoodle333@yahoo.com",
      "author_url": "",
      "date": "2011-05-07 15:41:14",
      "content": "Thanks for the wonderful recipe! I'm living in Buenos Aires right now and can't find any decent Indian food here. Happily I was able to find all the ingredients I needed, except the black mustard seeds, so I used a teaspoon of curry powder that contained mustard. I even got lucky and found some spicy little peppers at the local produce stand, which are not easy to find here because people generally don't eat spicy food. I also added a little more mushrooms and a little more water so I could simmer it longer. It was amazing, really hit the spot for a girl craving the comfort of Indian cooking!",
      "parent": "0",
      "gravatar_hash": "012cfaec123602e917a395dcc910c81c"
    },
    {
      "id": "2022",
      "author": "Tracey",
      "author_url": "",
      "date": "2011-05-10 02:56:42",
      "content": "Thanks Michael\nThis is the first recipe of yours that I have tried, it's really lovely. Like dillydoodle I added more mushrooms (and an extra tomato) and simmered for longer before putting the chickpeas in. I was also lucky enough to have some homemade stock in the freezer so I put that in instead of the water.\nI look forward to trying more or your recipes!\n:-)",
      "parent": "0",
      "gravatar_hash": "0694ee8e4f1ffceff55320928bcbe278"
    },
    {
      "id": "18397",
      "author": "Chihana Schiffer",
      "author_url": "",
      "date": "2012-02-02 07:38:11",
      "content": "Michael- this recipe was SO great. I also made it using vegetable oil and substituted brown mustard seed for black. If I used ghee and the black mustard seed, does it make a huge difference? I am making a bigger batch tonight with ghee and bl. mustard seeds which I plan to go get today!",
      "parent": "0",
      "gravatar_hash": "365daeeb7ed325a1a33b70c950496303"
    },
    {
      "id": "18398",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-02-02 07:50:25",
      "content": "Glad you liked it! Yes, I think you will taste some difference with the ghee and black mustard seed. The ghee of course tastes a bit richer, and the black mustard seed has a bit different flavor and texture.",
      "parent": "18397",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21410",
      "author": "Alpna",
      "author_url": "",
      "date": "2012-03-13 20:43:26",
      "content": "Looks great! I have not used fennel seeds before while cooking chickpea curry. Will give it a try. \n\nCouple of suggestions, in step 4. perhaps add the dry spices like turmeric before adding chickpeas &amp; mushroom and roast for say 30 seconds. This will mean that the curry will not have the pungent taste of uncooked turmeric. Also, if using dry turmeric, reduce the quantity to 1/2 - 1 tsp.",
      "parent": "0",
      "gravatar_hash": "c347478a8ef079597954d0b851e6de25"
    },
    {
      "id": "45265",
      "author": "sheebah",
      "author_url": "",
      "date": "2012-08-13 21:47:59",
      "content": "You are great at what you do. I am a novice cook and even I was able to follow the steps and make a delicious dinner. I loved the use of whole seeds in this - I've tried to cook Indian before using mostly powdered spices and I thought this version had a more intense flavor. Thanks for sharing your work with us!",
      "parent": "0",
      "gravatar_hash": "40e3c0e5de5fe685ab5a4545d5ecf038"
    },
    {
      "id": "45266",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-13 22:07:26",
      "content": "I'm glad it came out well for you, Sheebah, and thanks for taking the time to come back and leave a comment!",
      "parent": "45265",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "48092",
      "author": "mustardseed",
      "author_url": "http://themustardseedmeadow.blogspot.com",
      "date": "2012-08-31 15:34:25",
      "content": "Glad to have found your space. I love chana masala and love the idea of tempering it at the end. I have never tried that before with this dish, can't wait to give it a try!",
      "parent": "0",
      "gravatar_hash": "b1fe770d2973068670cb0e24dc91dbab"
    },
    {
      "id": "200582",
      "author": "Virginie",
      "author_url": "",
      "date": "2013-10-11 07:02:38",
      "content": "I was looking for vegan recipes and I'm happy to have found your website. I prepared this recipe yesterday and it was delicious! Thank you Michael!",
      "parent": "0",
      "gravatar_hash": "05630277cb479a85a31a609765a82e5a"
    },
    {
      "id": "1045614",
      "author": "LindaH",
      "author_url": "",
      "date": "2014-08-23 14:32:41",
      "content": "I am not vegan but am trying to learn to cook some vegan dishes since my daughter is.  Just wanted to tell you what a delicious dish this is.  I will definitely make it again. Thanks for a great recipe!! :-)",
      "parent": "0",
      "gravatar_hash": "b1b353ce04707f9ea373c2c3f3c363ac"
    },
    {
      "id": "1314010",
      "author": "Patricia",
      "author_url": "",
      "date": "2015-08-05 17:20:32",
      "content": "I just tried this recipe for dinner...It was my first time using all these Indian spices, which smelled marvelous. I ate it on it's own, but for me it felt like something was missing. I didn't want to eat meat today, but it seemed to me like it would have tasted complete with the taste of meat in it. I hope to get over that feeling. I'd like to eat less and less meat until I can stick with being a vegetarian. Does anyone know what I'm taking about? Or how I can get over the meat taste syndrome?",
      "parent": "0",
      "gravatar_hash": "4fe5e0e8bf416e222b71c4acf86fae4a"
    },
    {
      "id": "1314485",
      "author": "Dave",
      "author_url": "",
      "date": "2018-01-04 09:46:21",
      "content": "I have to disagree with most of the reviewers; this recipe is somewhat confused- it's almost as if the writer just decided to throw nearly every Indian type spice he had in his cupboard at the dish and as such it's just a bit of a mess really. It's not horrible to eat and is edible but it really needs stripped back form loads of things that it really doesn't need. So, cloves, cinnamon... far too overpowering and unnecessary...omit them.... mustard seeds at the end? It's true, thi said may work but only if it's tripped back... cayenne pepper and chilli too? Not required here... maybe just chilli eh? And lemon juice? Yeah that's. Nice idea but it makes it really sour and alongside all the other crazy choices of spices it's just too much... so yeah, it's tastes far too busy so strip it back a bit... (and I've been cooking quality, authentic regional curry dishes for years)",
      "parent": "0",
      "gravatar_hash": "820d0e4ee14e986a44d33782ca852f51"
    },
    {
      "id": "1314539",
      "author": "Barb",
      "author_url": "",
      "date": "2018-08-18 06:21:52",
      "content": "Been making this for years... there's a careful balance in acid and the roundness of the spice that is tricky. I agree it's better if you roast the powdered spices a little before adding the peas- and a much longer simmer once everything's in the pan improves it too. Thanks for this one!",
      "parent": "0",
      "gravatar_hash": "6a5e59e926dee1a09cbfee6096d12abd"
    }
  ]
}