{
  "comment_count": 17,
  "comments": [
    {
      "id": "2180",
      "author": "zoe",
      "author_url": "http://thezoeblog.blogspot.com",
      "date": "2009-07-13 13:31:56",
      "content": "Yum, looks awesome!",
      "parent": "0",
      "gravatar_hash": "da95b6426c43d00947a19567a7b28d12"
    },
    {
      "id": "2181",
      "author": "Cookie",
      "author_url": "http://workout-then-cook.blogspot.com",
      "date": "2009-07-13 17:24:51",
      "content": "Healthy and delicious!  What a beautiful dish too!",
      "parent": "0",
      "gravatar_hash": "2369d33a76b464e49855167b70a5ff45"
    },
    {
      "id": "2182",
      "author": "Aaron Averbuch",
      "author_url": "http://www.averbuch.net",
      "date": "2009-07-13 20:11:24",
      "content": "This was fantastic - it was great timing for you to post this today, as I wanted to make something with quinoa anyway. So a quick stop at Pike Place on my way home, and Joelle and I were quite happy with the results!\n\nQuinoa is such an interesting grain; I would love to see some of your other uses you recommend.",
      "parent": "0",
      "gravatar_hash": "dbc4b26aeb0b4d003ddcaea81e104f12"
    },
    {
      "id": "2183",
      "author": "Vicki",
      "author_url": "http://profile.typepad.com/6p011572028274970b",
      "date": "2009-07-14 03:55:17",
      "content": "Thanks for the recipe! We've just discovered quinoa and are looking for various ways to prepare it. This looks delicious.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2184",
      "author": "malinky",
      "author_url": "http://www.karebou.com",
      "date": "2009-07-17 01:44:34",
      "content": "This was absolutely delicious!!! My husband and I thoroughly enjoyed it and ate way too much of it. I think it might be addictive. ;-)",
      "parent": "0",
      "gravatar_hash": "54dde47ff81d00baa17f418f0728a3c8"
    },
    {
      "id": "2185",
      "author": "Matt (No Meat Athlete)",
      "author_url": "http://www.NoMeatAthlete.com",
      "date": "2009-07-20 04:55:42",
      "content": "Molecular gastronomy sounds fascinating!  But I'm glad you didn't deface the farmers market food :)  I've never heard of quinoa cakes, but it sounds like a great way to use up the leftovers.",
      "parent": "0",
      "gravatar_hash": "dc7bb7b81981e31d2eca6d8651a6185a"
    },
    {
      "id": "2186",
      "author": "thepinkpeppercorn",
      "author_url": "http://thepinkpeppercorn.blogspot.com",
      "date": "2009-08-01 05:37:20",
      "content": "Cute preface!  Looks gorgeous, as always!  I'm looking forward to catching up with your blog after being away for a month - love it  :)",
      "parent": "0",
      "gravatar_hash": "0145f8dcbe06da53cbda0bb3145f268f"
    },
    {
      "id": "2187",
      "author": "Lauren",
      "author_url": "",
      "date": "2010-06-03 11:35:01",
      "content": "I am only getting to this now but I LOVE the idea of quinoa cakes - what a revelation! Quinoa is one of my favorite grain protein sources, but I've always felt a little limited with the texture and types of dishes I could make with it. This opens up a whole new world. Thank you, thank you.",
      "parent": "0",
      "gravatar_hash": "74b2e830c8f34fa5cb8f54c1a5fe5de8"
    },
    {
      "id": "2188",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-03 11:41:37",
      "content": "Thanks, Lauren! It turns out just about any grain, and even pasta, is amenable to be turned into pan-fried cakes just by binding them with a little egg. I make them all the time because they are just so tasty and you can use up leftovers. You can vary them by including herbs, spices, onions, garlic, cheese and so forth.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2189",
      "author": "Katie",
      "author_url": "",
      "date": "2010-07-27 09:10:42",
      "content": "My favorite variation of quinoa cakes is by adding goat cheese into the cakes themselves. Top with oven roasted tomatoes and it's heaven!\nKatie",
      "parent": "0",
      "gravatar_hash": "db01dc3faaa78b7e6d16e48a73d3bf86"
    },
    {
      "id": "2190",
      "author": "Theresa",
      "author_url": "",
      "date": "2010-09-05 14:37:41",
      "content": "These are great!! First time I made them I did and had trouble keeping them from falling apart. This time I formed the cake, spritzed with EVOO and used the broiler on high for 6 minute on each side. It worked AWESOME!!!",
      "parent": "0",
      "gravatar_hash": "cb3b41c013e6a33266c7f5a97859ebeb"
    },
    {
      "id": "2191",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-09-05 15:15:34",
      "content": "Thanks Theresa! Interesting variation on how to cook them. Another option if they aren&#39;t quite holding up is to add a bit of flour, rice flour, or breadcrumbs to provide a little more binding. There is enough egg in there that they should hold up well, so another problem can be if you don&#39;t give them enough time on the first side for the egg to set. But as always, the main thing is that you figured out the best way to troubleshoot for your particular ingredients!\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17985",
      "author": "Jennifer",
      "author_url": "http://www.spotlightonhealthyliving.com",
      "date": "2012-01-26 18:40:03",
      "content": "Made a vegan version of the quinoa cakes for dinner tonight. I used Ener-G egg replacer instead of egg and that worked pretty well to bind things together. The smoked paprika added an awesome (although a little bit overpowering) flavor. Mine were bright red, wondering why the ones in the photo aren't...? Really liked these overall though, thanks for a great recipe!",
      "parent": "0",
      "gravatar_hash": "f72330d577142ad78ccd8a61f4fbcb3b"
    },
    {
      "id": "18011",
      "author": "John",
      "author_url": "",
      "date": "2012-01-27 08:33:33",
      "content": "Gotta try these. Re the Zucchini: a great variant is to get small ones -- about 5 inches long -- cut them in half so you have two 5\" strips, and pan-fry them, hot, in a little olive oil, finishing with a squeeze of lemon, which caramelizes on the hot pan and does wonderful things to the flavor. If your zucchini are bigger, you can pre-cook the slices for a minute or so in the microwave, avoiding the nicely-browned-and-caramelized-outside-but-raw-inside problem.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "18012",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-27 08:54:01",
      "content": "Yes! Cooking zucchini that way almost makes into a completely different vegetable, and so delicious.",
      "parent": "18011",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "25382",
      "author": "Theresa",
      "author_url": "",
      "date": "2012-05-29 12:32:39",
      "content": "We had people over for dinner Saturday, so I made these quinoa cakes to ensure that I had some protein in the meal (My husband made pork tenderloin.)  I deviated slightly in the making of the cakes, and used rosemary, parsley, and lemon to give the cakes some flavor.  I served one large cake on top of a bed of fresh spinach, and then topped it with a sauteed mixture of mushrooms, roasted red pepper, and garlic, seasoned with more rosemary, lavender and sea salt.  It turned out splendid and looked amazing on the plates as well. \n\nMichael, this is a great way to use quinoa in something other than a \"Quinoa Salad.\"  Thanks for the idea!!",
      "parent": "0",
      "gravatar_hash": "d4b345f33610b127bc91379f8b2cf2cf"
    },
    {
      "id": "25384",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-29 12:40:09",
      "content": "Thanks, Theresa! Glad you liked it - and you can apply that same approach to just about any leftover grain, from freekeh to millet.",
      "parent": "25382",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}