{
  "comment_count": 16,
  "comments": [
    {
      "id": "3941",
      "author": "Steamy Kitchen",
      "author_url": "http://www.steamykitchen.com",
      "date": "2007-10-09 18:00:31",
      "content": "What a great recipe! In my 'to try' folder",
      "parent": "0",
      "gravatar_hash": "6804a36eb4d9fae2fbe3cb08fc057bca"
    },
    {
      "id": "3942",
      "author": "Jen Yu",
      "author_url": "http://jenyu.net/blog/",
      "date": "2007-10-09 21:08:09",
      "content": "Mmm, this looks so good!  I'll have to make this some time (just wish I had this in my arsenal this summer - it'd be perfect).",
      "parent": "0",
      "gravatar_hash": "aaee74c0b115c548067e5a12fb15ab69"
    },
    {
      "id": "3943",
      "author": "radish",
      "author_url": "http://www.sassyradish.com",
      "date": "2007-10-12 11:55:36",
      "content": "This looks terrific - and healthy! I love the idea of serving it with cucumber!!",
      "parent": "0",
      "gravatar_hash": "04341568a39187cf5897aaea878fb272"
    },
    {
      "id": "3944",
      "author": "Coffee &amp; Vanilla",
      "author_url": "http://www.coffeeandvanilla.com",
      "date": "2007-10-29 01:43:42",
      "content": "Hi,\n\nThank you for your beautiful entry.\n\nGreetings, Margot",
      "parent": "0",
      "gravatar_hash": "a37d8668624a8f1c5eff111454ca6c83"
    },
    {
      "id": "3945",
      "author": "eileen",
      "author_url": "http://hampiesandwiches.blogspot.com",
      "date": "2007-11-05 20:03:00",
      "content": "those do look great!  and with EGGPLANT.  i must try it.",
      "parent": "0",
      "gravatar_hash": "87f60ea777b0d9395d5d4ad7ea4be745"
    },
    {
      "id": "3946",
      "author": "Johanna",
      "author_url": "",
      "date": "2008-02-17 17:13:10",
      "content": "Yum, yum, YUM!  This is a fabulous recipe!  I loved it, my husband loved it...even my one year old daughter loved it.  The sweetness of the eggplant, the crisp cucumber, the whole thing just works really well together.  Perfect.\n\nAnd I am enjoying your website.  I stumbled across it while googling abu-gosh hummous, and am happy that I did.  Loved your Israel postings.  I used to live there and pine for the hummous and falafel.  I just made Israeli style falafel this past weekend, and it was pretty good, but not as good as the real thing.  I will have to visit there some time soon.\n\nAnyhow, thanks for a truly enjoyable site (and I'm not even a vegetarian), and a great recipe.  I'll be tuning in too see what else you're up to.\n\nBest,\nJohanna",
      "parent": "0",
      "gravatar_hash": "167b731ea6006c1d79913cbc08948f6e"
    },
    {
      "id": "3947",
      "author": "smita",
      "author_url": "http://smitaservesyouright.blogspot.com",
      "date": "2008-07-18 12:24:45",
      "content": "You are a frickin' genius! Love the addition / combination of tahini and sriracha. Plus I like your version of banh mi too.\n\nSmita",
      "parent": "0",
      "gravatar_hash": "2776a9b6c7821834544d45bd4fb026d7"
    },
    {
      "id": "3948",
      "author": "Jamie",
      "author_url": "http://jamiesstomach.blogspot.com",
      "date": "2008-08-04 09:34:59",
      "content": "Ooh la la...I like how you have some nutty (sesame) flavor without turning this into \"sesame noodles\" per se.",
      "parent": "0",
      "gravatar_hash": "e1631c799417b4b6fba8c48c3c6f8110"
    },
    {
      "id": "3949",
      "author": "Nancie Rowe-Janitz",
      "author_url": "http://profile.typepad.com/1230840561s520",
      "date": "2009-01-19 14:41:46",
      "content": "Oh Wow! Does this look DELICIOUS! I love that you added eggplant...I will have to try this!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3950",
      "author": "Heather",
      "author_url": "",
      "date": "2009-06-11 20:19:38",
      "content": "Just tried a version inspired by this - absolutely fantastic.\n\nThank you!  I will be back to try your other recipes - really, really good.",
      "parent": "0",
      "gravatar_hash": "4957dd379f0165b72c4388bb6c724045"
    },
    {
      "id": "3951",
      "author": "Bill",
      "author_url": "http://www.geektrap.com/bill",
      "date": "2009-06-23 12:09:47",
      "content": "They didn't have eggplant at the local natural foods store, so I ended up substituting zucchini and yellow squash for it, and that turned out okay.  It was a little mushy, though, after I broiled it.  I don't know if eggplant would have done the same thing or not; it seems like this dish could use something crunchy instead.  Also, didn't know what Balinese long pepper was, so I grated and threw in half a jalapeno.  Only later did I look it up and realize they're nothing alike.  It was still very tasty, though, and both my housemates really liked it.",
      "parent": "0",
      "gravatar_hash": "f12a1fdb09c8f6d7873d3d5ee6759e88"
    },
    {
      "id": "3952",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-06-23 15:37:57",
      "content": "Hey Bill - I&#39;m glad you tried and liked the Otsu noodles. Ideally the crunch in this dish would come from the cukes and green onions, so it would be ok if the other vegetables are cooked until tender (though not mush of course). You want to make sure not to overcook the noodles as well. Long pepper isn&#39;t the easiest item to find all the time. It has an interesting floral/spicy kick I like a lot, but failing that, another source of heat makes good sense. Thanks for commenting, I really appreciate hearing from you.<br />",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3953",
      "author": "Anne-Marie",
      "author_url": "",
      "date": "2010-08-28 14:57:52",
      "content": "This was just amazing. The sauce has it all going on without being \"cluttered\" - nutty but bright and tart, salty-sweet, and creamy, but it doesn't disappear into the noodles and tofu. I made it precisely as written the first time (drives me crazy when people modify everything and then review, as if it's the same). I found out after the fact that my soba noodles had salt added - this affected soy sauce addition, etc. I've made this recipe several (5?) times since, varying the vegetables. I really like julienned carrots for crunch and shiitake mushrooms for udami combined. Once, I had only Napa cabbage and white-bread mushrooms, and it still turned out smashingly. So, I like the rock-solid reliability, innovation, and the flexibility of this recipe.",
      "parent": "0",
      "gravatar_hash": "6c337c444bec0c062ea93c15b689d1bb"
    },
    {
      "id": "3954",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-09-01 10:40:06",
      "content": "Thanks Anne-Marie!  I&#39;m glad to hear the original was solid for you, and that you&#39;ve made so many variations. I&#39;m a big believe in using recipes as a jumping off point, not a set formula.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "72976",
      "author": "sheebah",
      "author_url": "",
      "date": "2012-11-02 14:33:59",
      "content": "The flavor of this was wonderful, but I couldn't figure out how to get the sauce to thin while still remaining sesame-like. The tahini was what was thickening my sauce - I guess I was using a particularly thick tahini - so to thin the sauce I had to keep adding soy sauce and lemon juice, which gave it a more shallow flavor. (I don't have a blender.) Ultimately I just went with a clogging sauce because I like the nutty flavor.\n\nI think this is also a challenging recipe because tofu and eggplant are both kind of tricky ingredients. If you use an offish eggplant or a mediocre tofu product, the dish fails. \n\nAlso - the soba noodles I used turn from \"just right\" to \"overdone\" very abruptly. There was maybe about a three second time frame to take them out of a pot. So, just a warning! I think you want to take them out when they're almost slightly underdone because they soften further in the sauce.\n\nThis dish probably would've been supreme in better hands, but I'm a novice cook and definitely messed it up.",
      "parent": "0",
      "gravatar_hash": "40e3c0e5de5fe685ab5a4545d5ecf038"
    },
    {
      "id": "73007",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-11-02 16:06:28",
      "content": "A couple of thoughts: (1) be sure you don't have raw sesame tahini, as that is low in flavor (2) when you open the jar/can, be sure to mix in the oil that normally separates from the tahini - otherwise, indeed, the paste itself will be much too thick.",
      "parent": "72976",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}