{
  "comment_count": 6,
  "comments": [
    {
      "id": "3746",
      "author": "tiddleywink",
      "author_url": "http://tiddleywink.wordpress.com",
      "date": "2008-02-10 11:35:50",
      "content": "What a coincidence... I blogged about matzo(h) brei the other day, and a reader commented that he'd never seen a post about it before. And then lookee here! We must be anxious for Spring to arrive.",
      "parent": "0",
      "gravatar_hash": "5efe8e3e2ab4f87498267725e70f50d4"
    },
    {
      "id": "3747",
      "author": "Steve",
      "author_url": "http://www.ProgressivePortal.org/store",
      "date": "2008-11-14 11:21:13",
      "content": "I just made a delicious tortilla brei using flour tortillas. Here's what I did:\n\n(1) Poke a few holes in the flour tortillas so they don't balloon up in the toaster, then toast in toaster oven until lightly browned and crispy.\n\n(2) Rinse quickly with water on both sides of each tortilla, just so it's moist (to absorb egg).\n\n(3) Break into pieces of your desired size, then mix in with scrambled egg, some garlic powder, and some seasonings (I used Mrs. Dash table blend), and salt if desired (I didn't find it necessary).\n\n(4) Place into a skillet (I used cast iron) and cook on medium heat until browned on the bottom, then turn over and cook until browned on the other side. Watch closely to avoid burning (d'oh!).\n\n(5) Enjoy!",
      "parent": "0",
      "gravatar_hash": "0e67b1c9ceeb9050873a22cca3a0307e"
    },
    {
      "id": "3748",
      "author": "Eve",
      "author_url": "",
      "date": "2010-03-25 13:01:07",
      "content": "I'm going to try to make these with matzoh for Passover.",
      "parent": "0",
      "gravatar_hash": "c948da12d6eb6e843bcf666f6712a35b"
    },
    {
      "id": "524129",
      "author": "Kristen",
      "author_url": "",
      "date": "2014-01-09 16:43:29",
      "content": "I love the title of this post! I've always thought of Matzo Brei as a sort of Chilaquiles, Jewish-style. I will definitely give this a try - thanks for the post!",
      "parent": "0",
      "gravatar_hash": "eb21377f4581ace5c571b3b1793e7b94"
    },
    {
      "id": "954220",
      "author": "Tony",
      "author_url": "",
      "date": "2014-07-01 10:00:19",
      "content": "No disrespect or offense intended.. a Correction to what you call chilaquiles, Actually is the recipe of migas con huevo or migas Nortenas, typical in the border towns around Mexico and Us border.  the Salsa is optional after they are cooked, chilaquiles are more like a chopped enchilada. The totopos or tortilla chips are drowned in salsa verde (green) or roja (red).\nThe above recipe of migas Nortenas can be taken another step up by adding \"Pico de Gallo\"\nMinced onion (or to taste), tomato and Chile (Serrano, Jalaapeno, or verde \"Long Green\"} they can be dry or wet by adding tomato sauce. (Cheese of your choice optional)",
      "parent": "0",
      "gravatar_hash": "f19b859f921dabdd56da921791c34308"
    },
    {
      "id": "1314149",
      "author": "Mark Camacho",
      "author_url": "",
      "date": "2016-04-28 08:25:03",
      "content": "Technically, because it's made with eggs, it should more properly called Jewish *Migas* -- though only those in the Texas area or Southwest might know what those are. I was looking up this recipe because I had an idea to use green enchilada sauce instead.",
      "parent": "0",
      "gravatar_hash": "f0cf0d22fd82b3a278bddba1017be54a"
    }
  ]
}