{
  "comment_count": 6,
  "comments": [
    {
      "id": "3749",
      "author": "d.m.",
      "author_url": "",
      "date": "2008-02-02 23:34:45",
      "content": "you make it all sound so easy...if only!  i must return to my prior comment.  (yikes, at what point does a comment become a mantra?)  you truly have a gift for photographing your culinary creations, and this photo is another great shot.  btw, i miss the delicious meals...is it new years yet?",
      "parent": "0",
      "gravatar_hash": "facc932377d7fe09d7268f3d54558da6"
    },
    {
      "id": "3750",
      "author": "tara",
      "author_url": "http://www.sevenspoons.net",
      "date": "2008-02-03 14:41:26",
      "content": "Gorgeous. Simply gorgeous. Not only is the photograph a beautiful thing, but the recipe sounds even better. A Canadian of Indian descent, who is currently pregnant to boot, I have to say I have SUCH cravings for bhel puri and all those other savory sweet plates of crunchy goodness; that's the thing about chaats, they offer such wonderful contrasts!",
      "parent": "0",
      "gravatar_hash": "9f34c3125bd14a5f9442a5216cc847b1"
    },
    {
      "id": "3751",
      "author": "Anticiplate",
      "author_url": "http://www.anticiplate.com",
      "date": "2008-02-04 17:01:52",
      "content": "This looks delicious! I love Indian flavors. I will have to try this one!",
      "parent": "0",
      "gravatar_hash": "95dc86ca41258f2f67c9ce0c12ea79a3"
    },
    {
      "id": "3752",
      "author": "alpa",
      "author_url": "http://www.thegreenpeacock.blogspot.com",
      "date": "2008-02-06 08:08:21",
      "content": "When eating chaats in a cafe/bistro type restaurant you get used to getting them without any fanfare, so i adore the way you presented this. it's nice to see how people put different takes on the same cuisine you grew up with.  Your picture is so gorgeous!",
      "parent": "0",
      "gravatar_hash": "e118b1dd945f895317a6e8d3d7507445"
    },
    {
      "id": "3753",
      "author": "pb",
      "author_url": "http://kamalkitchen.blogspot.com",
      "date": "2009-08-21 22:51:05",
      "content": "HI there..very fancy presentation..chaat is mainly a north indian or bombay style thing, although in the US you mostly see it on Udupi menus.\n\nWhen I was in the Bay area, esp san jose, sunnyvale etc., there was a 'chaat house' almost every block that served delicious chaat and other snacks. It was a pleasant surprise to see shops dedicated to chaat, since I was more accustomed to driving a 100 miles to even get to an Indian restaurant.( I lived in the american heartlands).\n\nThanks!",
      "parent": "0",
      "gravatar_hash": "2b2aeef3ee84e2dcb66ae609be627642"
    },
    {
      "id": "106173",
      "author": "Becky",
      "author_url": "",
      "date": "2013-01-11 23:33:57",
      "content": "This looks sooo good! I've heard Big Johns Pacific Food Importers in sodo (Seattle) carries all kinds of goodies (bulk spices, cheeses, olives, crackers, flours, etc.) and at really good prices.\n\nHappy eating!",
      "parent": "0",
      "gravatar_hash": "0547b28329bba4128856fd1fd24dc206"
    }
  ]
}