{
  "comment_count": 8,
  "comments": [
    {
      "id": "3846",
      "author": "Anastasia",
      "author_url": "http://www.geneticmaize.com",
      "date": "2008-10-27 20:50:36",
      "content": "This sounds awesome. I was looking for images of purple veggies for a <a href=\"http://www.geneticmaize.com/2008/10/purple-tomatoespurple-tomatoes\" rel=\"nofollow\">post</a> and happened upon this deliciousness. I can't wait to try it!",
      "parent": "0",
      "gravatar_hash": "4c0b812c2c7f5e1af652dc6030d89d72"
    },
    {
      "id": "3847",
      "author": "Robyn",
      "author_url": "",
      "date": "2010-02-20 01:07:16",
      "content": "Thank you so much for this recipe!  I too grabbed the purple cauliflower when I saw it for the first time.  I then searched the Web looking for a recipe that was designed especially for it.  What I found were lots of recipes that just seemed to substitute purple cauliflower in dishes designed for white cauliflower.  This one was the only exception.  I had everything on hand to make it (including a fresh red bell pepper to roast), so it was show time.  It came out fabulous!  I've been in that market several times since then, hoping to get some more of the purple cauliflower, but they didn't have it.  I even asked about it, and they said it was a special purchase their buyer had made and they might not have it again.  That was some months ago, and I never saw the purple cauliflower there again until 2 days ago.  I bought it, made the recipe again, and was just as thrilled with it.  It is so suited to the purple cauliflower that I will never make it with anything but.  I think the rich vinaigrette with sherry vinegar would overwhelm the blander white cauliflower and conflict with the orange cauliflower and the green broccoflower that the same market periodically has.  Besides, this special purple cauliflower deserves a recipe all to itself.  Thank you again for providing it!",
      "parent": "0",
      "gravatar_hash": "0c205c582a4d2a731b5bf3712f2b570c"
    },
    {
      "id": "3848",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-02-24 09:50:55",
      "content": "Hey Robyn - thanks for the note! I appreciate that you are noticing the details of what individual vegetable varieties want, not just giving them a &quot;one-size fits all&quot; treatment.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3849",
      "author": "charlotte",
      "author_url": "",
      "date": "2010-10-02 20:22:50",
      "content": "Another winner!  Thanks for adding color and flavor to the table!",
      "parent": "0",
      "gravatar_hash": "c26f7a10c51c27f2397c29a0ecb2c7b0"
    },
    {
      "id": "3850",
      "author": "John",
      "author_url": "",
      "date": "2011-11-14 13:43:29",
      "content": "As is so often the case, I set out with good intentions...and fail. There was no purple cauliflower at the store(s). I forgot to get sherry vinegar. We didn't have as many breadcrumbs as I thought. But the dish, even with white cauliflower, fewer breadcrumbs, and a mix of wine-vinegar with a LITTLE balsamic, was a big hit. I have one suggestion, though: anyone making this should make 3x the capers. Why? Because people will walk by, grab one fried caper to try, say, \"WOW!\" and then find a reason to walk by another 20 times, leaving you with just one caper to put on your cauliflower. They're amazing!",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "3851",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-11-14 14:22:57",
      "content": "Ah yes, the dreaded &quot;caper shrinkage&quot;. That was always an issue when I was working the pantry station at Cafe Flora :).",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "19977",
      "author": "ryanthegirl",
      "author_url": "http://chezchickenandwaffles.tumblr.com",
      "date": "2012-02-25 19:30:23",
      "content": "hi Michael,\n\nhope all is well--I googled purple cauliflower after it arrived in my CSA today, and this amazing post popped right up. Just what I had been looking for.\n\nNot sure if you remember me from Foodbuzz, but it was great to see all the changes to the blog and the BOOK! Congrats.\n\nHope all is well..\n\nCheers,\nRyan",
      "parent": "0",
      "gravatar_hash": "13d2764cc0f90589dd873e06515e97f0"
    },
    {
      "id": "19979",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-02-25 19:46:35",
      "content": "How could I forget you with a handle of \"Ryan the Girl\"? Nice to hear from you!",
      "parent": "19977",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}