{
  "comment_count": 17,
  "comments": [
    {
      "id": "3547",
      "author": "Coffee &amp; Vanilla",
      "author_url": "http://www.coffeeandvanilla.com",
      "date": "2008-04-29 00:42:41",
      "content": "I use recently a lot of avocados in my sandwiches... avocado and tofu sounds like a very good combination, thank you for sharing :)\nMargot",
      "parent": "0",
      "gravatar_hash": "06142dc19a9dd145324aca1e74c980bf"
    },
    {
      "id": "3548",
      "author": "Chef Erik",
      "author_url": "http://cheferikjl.blogspot.com",
      "date": "2008-04-30 18:38:46",
      "content": "Shizam! That's a heck of a sandwich. I bet the daikon is a great addition.",
      "parent": "0",
      "gravatar_hash": "eca307cc5c4f4886e3bc2356db35ab4b"
    },
    {
      "id": "3549",
      "author": "Deborah Dowd",
      "author_url": "http://play-with-food.blogspot.com",
      "date": "2008-05-01 19:18:59",
      "content": "I love Banh mi sandwiches but have only had the ones with meat. Your version sounds great and makes me want to experiment on my own.",
      "parent": "0",
      "gravatar_hash": "91fce4e5cd581b1b015cf7c85b7c44c4"
    },
    {
      "id": "3550",
      "author": "Foodeater",
      "author_url": "http://www.toliveandeatinla.com",
      "date": "2008-05-05 16:37:13",
      "content": "Yum... this looks and sounds fantastic. We are blessed here in L.A. to have an amazing all vegan Vietnamese restaurant in the area (<a href=\"http://www.toliveandeatinla.com/2007/vegetarian-vietnamese-banh-mi/\" rel=\"nofollow\">Vinh Loi Tofu</a> in Reseda) so I always get to satisfy my Banh Mi cravings with his delicious versions. Your recipe is spot on though, so if I ever get the craving after they've closed (as often happens!), this will come in handy :) Whoever thought a sandwich could be so addicting?",
      "parent": "0",
      "gravatar_hash": "799b6f2d64f2b3520049ccff01bc0f97"
    },
    {
      "id": "3551",
      "author": "OR Suz",
      "author_url": "http://www.yelp.com/biz/the-aves-deli-licious-vietnamese-sandwiches-and-subs-seattle",
      "date": "2008-11-24 11:55:56",
      "content": "Thanks for posting this recipe, tho' I'm sad to have to make them myself now.  Just prior to relocating to Eugene (where my Banh Mi search has been fruitless) I finally found THE place in Seattle for these delights, after much research:\nhttp://www.yelp.com/biz/the-aves-deli-licious-vietnamese-sandwiches-and-subs-seattle",
      "parent": "0",
      "gravatar_hash": "584e05273d3ed08dfb95d1b158c84dc9"
    },
    {
      "id": "3552",
      "author": "Tom Bombadil",
      "author_url": "",
      "date": "2009-05-07 00:46:38",
      "content": "It would be a lot more flavourful if you made it the proper way, with two or three kinds of meat.",
      "parent": "0",
      "gravatar_hash": "799410860a1719e75b42a82d91a0b276"
    },
    {
      "id": "3553",
      "author": "MarilynInCA",
      "author_url": "",
      "date": "2009-08-17 13:53:28",
      "content": "Can't wait to try this!  It's also vegan if you use a vegan \"mayo\" such as Vegenaise (it actually tastes better than regular mayo IMHO).  Thanks for sharing this recipe!",
      "parent": "0",
      "gravatar_hash": "724daf1401d0d224b7af1ac6458ad79e"
    },
    {
      "id": "3554",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-08-17 14:10:32",
      "content": "I keep hearing how great Vegenaise is. I'll have to try it... I like to make\nmy own, and I like Hellman's / Best Foods when I don't have time, but I\ndon't like to buy them because the eggs are presumably from badly treated\nhens... and the organic brand of egg-based mayo I've bought before has a\ndistinctly unpleasant flavor.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3555",
      "author": "Calista",
      "author_url": "",
      "date": "2010-10-04 10:20:32",
      "content": "Ok, I like the concept but don't fry the tofu without seasoning!!!!!\n\nTOFU+NO SEASONING=GROSS\n\n\nMarinate the tofu for at least an hour with the following:\n\n\nonion powder\nsoy sauce\ngarlic powder\nsalt\npepper\ngarlic (fresh mashed through a press if possible and slathered on tofu)\nthai hot chili sauce or sriracha\n\n\nWhile tofu is marinating, make the pickled daikon and carrots (it would be better if you make this the day before.)---the pickle is what gives the sandwich its kick.\n\n\nBefore soaking them in the sugar, vinegar , water mix---pour salt over them and knead them for a few minutes to release excess water (which should collect at the bottom)\n\nRinse veggies. Mix vinegar and sugar and a little lukewarm water and pour over to cover veggies. Allow to sit at least for an hr. If you have mason jars, you can put in there and it will last 4 wks.\n\n\nYou can follow rest of recipe from here. Pan fry tofu. TOAST THE BAGUETTE-IT WILL TASTE MUCH BETTER\n\nSlather on mayo, cucumbers cut into matchsticks, carrot/daikon pickle, tofu and cilantro.\n\nVOILA Bon Appetite!",
      "parent": "0",
      "gravatar_hash": "13f3bd249086fc844cee87a932dc4a08"
    },
    {
      "id": "3556",
      "author": "Calista",
      "author_url": "",
      "date": "2010-10-04 10:24:18",
      "content": "Well yea thats possible considering that this is a vegetarian recipe site lol!\n\n\nTry my marinade for the tofu in the comment I left below. Go easy on the salt if you use more soy sauce.",
      "parent": "0",
      "gravatar_hash": "13f3bd249086fc844cee87a932dc4a08"
    },
    {
      "id": "3557",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-10-04 10:42:47",
      "content": "Thanks for the comment, Calista! For what it is worth, I disagree with you about the tofu. Good quality firm tofu, patted dry and pan fried in a sufficient quantity of oil to brown nicely and develop a crust is delicious without any additional season except salt or soy sauce. This is especially true if you seek out a locally made tofu that is very fresh. But to each their own! There is nothing wrong with additional seasonings if you prefer it that way. I find that they don&#39;t really penetrate the tofu and can be added to the finished dish just as sucessfully.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3558",
      "author": "luci - traductor jurado ingles",
      "author_url": "http://www.traductorjuradoingles.org/",
      "date": "2010-10-05 13:53:52",
      "content": "I love tofu! but i am  not very good at cooking :( however i will do my best to prepare this delicious sandwich!",
      "parent": "0",
      "gravatar_hash": "a74d197d3d8ee22582b4724b56b0f58d"
    },
    {
      "id": "3559",
      "author": "Mia (foodie)",
      "author_url": "",
      "date": "2011-10-20 09:35:16",
      "content": "I dust my tofu with salt, garlic powder, and onion powder before frying.  It gives it enough flavor without having to go through the marinade process and then drying it before frying.",
      "parent": "0",
      "gravatar_hash": "88634aa09bc1ec546b1c51d43fb13879"
    },
    {
      "id": "24119",
      "author": "Stephanie",
      "author_url": "",
      "date": "2012-05-19 19:05:47",
      "content": "Michael, do you know how they do the very thin, chewy, seasoned tofu that is on a bought bahn mi like I've had in Chicago?  Its texture is not at all like regular tofu, it has a much \"meatier\" quality, and a nice lemongrass flavor.  I've been making bahn mi with regular firm tofu (marinated a little with soy, garlic and lemongrass), and I like it, but the ones I've had in chicago from vietnamese restaurants in my sister's neighborhood are even more flavorful.  Here in Louisville where I've found tofu bahn mi they use regular tofu like me.  I just wondered if you were familiar with the \"tofu\" I'm talking about.  I love the avocado idea by the way, we've made our last few batches with it and we love it :)",
      "parent": "0",
      "gravatar_hash": "18112fefe795ff5109254e3866db1b66"
    },
    {
      "id": "24122",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-19 19:31:59",
      "content": "Hey Stephanie - I think I know what you mean, yes, though I've never tried to recreate it exactly. I'm not a big believer in marinating tofu, I don't think the flavor really penetrates. I'd rather just cook the tofu plain and then glaze it with something flavorful. I think if I was going to try and make the texture you are describing, I'd get the firmest tofu I could, pat it really dry, fry it in plenty of oil, then glaze it with soy sauce / sugar / lemongrass and put it back in a hot skillet to caramelize. That might be close at least.",
      "parent": "24119",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "118061",
      "author": "Victoria",
      "author_url": "",
      "date": "2013-02-15 20:47:34",
      "content": "Dear Tom,\n\nMany of us are vegetarians, I'm one for the past 45 years.  Believe me, it's possible to eat well and flavorfully without killing animals.",
      "parent": "3552",
      "gravatar_hash": "09779344a48423fdbd0b41e20a1085c3"
    },
    {
      "id": "150715",
      "author": "Deb",
      "author_url": "",
      "date": "2013-05-23 11:02:07",
      "content": "Just fyi, I think the secret wonderful ingredient they add at the sandwich shop in Philly is an assortment of sauteed mushrooms. It is soooo good!",
      "parent": "0",
      "gravatar_hash": "97ba6dea525cba03d3a8aa54ee639aad"
    }
  ]
}