{
  "comment_count": 10,
  "comments": [
    {
      "id": "3532",
      "author": "MariannaF",
      "author_url": "http://swirlandscramble.blogspot.com",
      "date": "2008-05-09 00:32:30",
      "content": "The first time I see Foold Mudammas featured on a blog!! My dad is Egyptian, so I'm totally familiar with this dish- a big breakfast favourite for Egyptians...although I personally find it a bit \"heavy\" for bfast, I wouldnt mind having it for lunch instead!",
      "parent": "0",
      "gravatar_hash": "c7960eecd671a3ac8a1700445631b74a"
    },
    {
      "id": "3533",
      "author": "jd",
      "author_url": "http://veggie-terrain.blogspot.com",
      "date": "2008-05-09 09:33:58",
      "content": "That looks delish!\n\nI love radishes, so this picture definitely caught my eye. Also, I've never used cranberry beans before either! This sounds like an excellent recipe to try them (even for breakfast!).\n\nGreat pic, too!",
      "parent": "0",
      "gravatar_hash": "8b9b8b076895cb86afd040429ac5bc38"
    },
    {
      "id": "3534",
      "author": "Niamh",
      "author_url": "http://www.eatlikeagirl.com",
      "date": "2008-05-14 08:17:07",
      "content": "I adore foul moudammes. I had to try so many different spellings to gather recipes!\nWhilst one of my favourites, it's something I have yet to blog.\n\nGood idea to try with borlottis, although I do love putting them in soups and stews, especially when I find them fresh.",
      "parent": "0",
      "gravatar_hash": "6be58aa1945a3812dd092bd5ccbfa0e6"
    },
    {
      "id": "3535",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-05-14 08:19:47",
      "content": "I've never worked with fresh borlotti beans, I bet they are delicious. Not for this recipe of course, Foul definitely wants a dried bean that you \"mush\".",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3536",
      "author": "Kaykat",
      "author_url": "http://cookingfromatoz.blogspot.com",
      "date": "2008-08-06 17:03:24",
      "content": "Mmm ... love foul, I've only had it with fava beans. And topped with some fresh feta or goat cheese :)",
      "parent": "0",
      "gravatar_hash": "4c8439d943ade1169cc1e0f811736f34"
    },
    {
      "id": "99905",
      "author": "Diana Boeke",
      "author_url": "http://www.gleanacres.com",
      "date": "2012-12-14 08:16:52",
      "content": "Oh, thank you for this insight. We adore fuul, but live in rural Virginia where favas are hard to come by. (We failed twice at growing them ourselves, even though we're pretty decent farmers of veggies, including Molokhiya, another Egyptian favorite!) So knowing I can use cranberry beans and get a decent rendition of our favorite dish, morning, noon, or night, is terrific.",
      "parent": "0",
      "gravatar_hash": "7374ca59d6ea7e2656f8abe9ce775c0d"
    },
    {
      "id": "105725",
      "author": "Eitan",
      "author_url": "",
      "date": "2013-01-10 10:36:58",
      "content": "Hi Michael,\nI'd like to ask your opinion about something, namely, cooking beans. We cook a lot of beans here, and we've always done it the traditional way (soak, simmer on the stovetop, no salt till they're cooked). Today I tried the Parsons method (basically, salt from the beginning and baking in the oven), two kinds: black beans and gigandes. It was really surprising - definitely the best beans I've ever made, with much more complex flavors. Have you ever tried this? Or are you a pressure cooker type?",
      "parent": "0",
      "gravatar_hash": "1d72fc9cd1d8cbef569838dc424e7106"
    },
    {
      "id": "105729",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-01-10 10:45:19",
      "content": "First I've heard of the Parsons method, sounds interesting. I'm definitely a pressure cooker guy, as I often don't plan enough ahead to soak. I find it makes great, tender beans with no presoak. Another interesting option is sous vide, with a soak. The beans come out all perfect, none burst.",
      "parent": "105725",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "105732",
      "author": "Eitan",
      "author_url": "",
      "date": "2013-01-10 10:47:12",
      "content": "I don't have a pressure cooker, but it sounds like it's worth getting one, given the amount of legumes we eat. Do you have a recommendation for a particular pressure cooker?",
      "parent": "0",
      "gravatar_hash": "1d72fc9cd1d8cbef569838dc424e7106"
    },
    {
      "id": "105755",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-01-10 11:22:35",
      "content": "I have this electric one and love it: http://www.amazon.com/dp/B000MPA044/?tag=poeticlicen07-20 - with maybe one concern that the pressure might be under 15 psi and therefore not perfect for some advanced applications like trying to get Maillard reactions - but in practice it has worked fine for me. If you prefer stovetop, people love their Kuhn Rikon's - choose your price point and features: http://amzn.to/UZhZ7E",
      "parent": "105732",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}