{
  "comment_count": 6,
  "comments": [
    {
      "id": "3484",
      "author": "Lucas",
      "author_url": "",
      "date": "2008-05-28 23:39:30",
      "content": "It's interesting, because I frequently crave both eggs and very spicy food when I'm sick.  I mostly crave very salty broth, so sometimes combine these into a simple soup:\nI take 2 cups vegetable broth, a dash of rice vinegar and gently poach two eggs in the broth.  Then I add Sriracha hot sauce, and generous amounts of either salt or soy sauce.  Maybe some cilantro or chives and lime if I've got them on hand.  This is actually surprisingly good, and I sometimes eat it as a quick snack when I'm not sick (though usually with a lot less salt).\n\nIt really helps with congestion, and I've found that salt seems to help make mucus easier to cough up.  For this reason, I sometimes eat pickles, olives, or even straight salt water when I'm sick.  Sometimes I mix salt into lemonade to make a \"virgin margarita.\"  It's weird, I know, but it seems to help counteract the enormous amount of water I drink when I'm sick.",
      "parent": "0",
      "gravatar_hash": "a9e4f07d0a64294640efc6a1a47e9963"
    },
    {
      "id": "3485",
      "author": "Fairly Odd Tofu Mom",
      "author_url": "http://tofu-n-sproutz.blogspot.com/",
      "date": "2008-05-28 23:47:20",
      "content": "I find myself craving salty broth too... I wonder why that is. But since I am not a world-class chef nor do I have an evil twin to cook for me when I'm sick, (and PLATE MY FOOD ALL FANCY-LIKE, no less! Sheesh!) well, I usually end up with ..... Top Ramen.\n\nYes.\n\nSad really. But we always have it in the house and it's so bad anyway, it's one of the few things I think won't be harmed or trnasformed by microwaving... so there you have my confessional of the weirdest and worst food that I sometimes consume. Fortunately I'm rarely sick.",
      "parent": "0",
      "gravatar_hash": "1a0b4a32e20aa0dec8b1491f2bea1ad6"
    },
    {
      "id": "3486",
      "author": "radish",
      "author_url": "http://www.sassyradish.com",
      "date": "2008-05-29 07:43:00",
      "content": "Feel better - i'm sorry about pneumonia - sounds terrible. I have the nastiest sinus infection and it's been dragging me down for the last 2 weeks. Hope you get better soon!",
      "parent": "0",
      "gravatar_hash": "04341568a39187cf5897aaea878fb272"
    },
    {
      "id": "3487",
      "author": "frantic foodie",
      "author_url": "http://www.franticfoodie.blogspot.com",
      "date": "2008-06-02 11:27:26",
      "content": "I am sorry your sick. I crave pretzels when I am sick, pretzels dipped in hot tea.",
      "parent": "0",
      "gravatar_hash": "e0605e1425a24bf59d6c35d9c87fae44"
    },
    {
      "id": "3488",
      "author": "Meg",
      "author_url": "http://dolcenutella.blogspot.com/",
      "date": "2008-06-04 22:51:39",
      "content": "When I get pneumonia and bronchitis, I craave spicy soups. Tortilla soup and pho are both cravings. Otherwise I mostly subsist on tea and some chocolate.\nI hope your pneumonia is short-lived, and that you recover from it quickly. And that you have cough medicine with codeine (because there's nothing like something that deals with the aching ribs and the cough in one fell swoop).",
      "parent": "0",
      "gravatar_hash": "d3d50c40e69a0417a9c75b622da34f62"
    },
    {
      "id": "3489",
      "author": "Cassie",
      "author_url": "http://www.veggiemealplans.com",
      "date": "2008-06-06 10:13:36",
      "content": "Miso soup is my comfort food when I'm sick.  Spicy stuff, too.  Your gorgeous meal and mention of gochujang reminded me of one of my favorite things I used to eat: cucumber sticks dipped in gochujang mixed with soy sauce.  Nothing else.  And I gasp at the amount of sodium that must have been, but I did love it.  And like some of your other readers, I too, crave salty food when I'm sick.\n\nMy mom is Korean and always made her own gochujang, which was really wonderful.  I haven't had it *years* and still crave it.  Can't find ready-made stuff anywhere I'm living and make my own inspired concoction which is good, but not nearly close to being the real deal.  I should see if I can find some online.  If you happen to know of a good brand, I would love if you could pass that along to me.\n\nHope you're all better now.  :)",
      "parent": "0",
      "gravatar_hash": "2f4000514924cb1b9a9e7d0ab1fd53e4"
    }
  ]
}