{
  "comment_count": 16,
  "comments": [
    {
      "id": "3611",
      "author": "Aaron Averbuch",
      "author_url": "http://averbuch.net",
      "date": "2008-04-17 07:48:08",
      "content": "Having eaten this from Michael, it was a fantastic appetizer. On my list to try at home!",
      "parent": "0",
      "gravatar_hash": "dbc4b26aeb0b4d003ddcaea81e104f12"
    },
    {
      "id": "3612",
      "author": "candyce",
      "author_url": "http://a-good-eye.blogspot.com",
      "date": "2008-04-17 12:00:45",
      "content": "lovely photo! this looks like such a delicious snack. you're very brave! :)",
      "parent": "0",
      "gravatar_hash": "95ac3b42263f640438590911a56135d6"
    },
    {
      "id": "3613",
      "author": "CJ",
      "author_url": "",
      "date": "2008-04-17 12:54:44",
      "content": "Please don't refer to this dish as \"Syrian style\", there's nothing Syrian about it. Recipes such as this have been around the Mediterranean world for over 4000 years. You're just insulting a whole lot of people this way.",
      "parent": "0",
      "gravatar_hash": "fe725f7dae56d4927d112152f7fd2e86"
    },
    {
      "id": "3614",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-04-17 13:19:46",
      "content": "I disagree. It is Syrian style because of the choice of spices. Aleppo pepper is quite clearly Syrian, and it is the flavor choices of a woman deeply rooted in the cuisine of the Aleppan Jews. So yes, Labneh is all over the Middle East, but this version of it is specifically Syrian, more specifically Aleppan.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3615",
      "author": "Hannah",
      "author_url": "http://iheartkale.blogspot.com",
      "date": "2008-04-17 16:03:49",
      "content": "Mmm!  I like labneh with za'atar as the spice mix.  (Za'atar, as well as labneh, baklava and other dishes show up all over the Middle East, including Syria, so when a Syrian cookbook comes out, it's only natural that it should include these pan-Middle-Eastern dishes as well as uniquely Syrian ones.  I don't think it insults anyone to show how widespread a certain dish is throughout a region--rather, I think it's fascinating to look at the very subtle variations that occur when you follow that dish across borders).",
      "parent": "0",
      "gravatar_hash": "bd1d5c38a95426994aa2235bf3f2558a"
    },
    {
      "id": "3616",
      "author": "david Goldbeck",
      "author_url": "http://HealthyHighways.com",
      "date": "2008-04-17 17:22:17",
      "content": "Wonderful to see you writing about yogurt cheese. We like it so much we wrote a cookbook and guide to expand its uses. We even paid to have yogurt cheese analyzed in a lab for nutritional content. Yogurt cheese (or YoChee as we call it) is a wonderful versatile ingredient you can make at home to improve your own yogurt. It has substantial health and taste benefits (a creamy food which is low or no fat plus high protein and calcium). I hope you will take a look at,” Eat Well the YoChee Way” our guide and cookbook to this important food. It really increases the use of yogurt cheese to main courses, soups, sauces, desserts, and much more. (Nutritional content included). Our website YoChee.com contains a free yogurt cheese how - to slide show, nutrition information and free recipes.",
      "parent": "0",
      "gravatar_hash": "931c54e87f5f49127f2e6f4dd5d526dc"
    },
    {
      "id": "3617",
      "author": "Marc @ NoRecipes",
      "author_url": "http://www.norecipes.com",
      "date": "2008-04-17 21:47:01",
      "content": "This is the 3rd time this week I've seen some reference to yogurt cheese. It's a sign! Now I just need to remember to pick up some cheese cloth.",
      "parent": "0",
      "gravatar_hash": "20e4649ca2ef740a27900361bed76654"
    },
    {
      "id": "3618",
      "author": "david Goldbeck",
      "author_url": "http://HealthyHighways.com",
      "date": "2008-04-19 04:33:31",
      "content": "I suggest if you really want to get into yogurt cheese you get one of the inexpensive yogurt cheese strainers. They really ease the process. We have two of the best ones at YoChee.com",
      "parent": "0",
      "gravatar_hash": "931c54e87f5f49127f2e6f4dd5d526dc"
    },
    {
      "id": "3619",
      "author": "alpa",
      "author_url": "http://www.thegreenpeacock.blogspot.com",
      "date": "2008-05-06 11:41:27",
      "content": "This would make a killer appetizer!  I'm so glad you provided the recipe with the spices.  I'll have to find the aleppo pepper next time i'm the middle eastern store.\n\nI'm so conditioned to eating a sweet version of this growing up.  In India, they call it shrikhand and it's flavored with saffron & pistachios & sometimes fruit.",
      "parent": "0",
      "gravatar_hash": "e118b1dd945f895317a6e8d3d7507445"
    },
    {
      "id": "3620",
      "author": "",
      "author_url": "",
      "date": "2008-05-26 17:52:12",
      "content": "Just wondering if it would be okay to add fresh chives, basil, etc. to the yogurt itself, and then let the whey drain off.  Seems likeit would be a good way to get teh flavors of the herbs to release more into the cheese.  What do you think??",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3621",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-05-26 17:55:16",
      "content": "I've never tried it that way, but I don't think there would be anything fundamentally wrong with it. My guess is that the herb flavor would be more evenly distributed (which could be good or bad depending on your preference), and more intense, but possibly less fresh. The volatile oils in fresh herbs release their top notes pretty quickly. If you try it both ways, please let us know which you like!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3622",
      "author": "Neely",
      "author_url": "http://friedgreentomatoes.wordpress.com/",
      "date": "2009-10-13 08:46:26",
      "content": "I love this stuff.  I did try and make it with fat free yogurt and it did not turn out very good.  I will just stick with the full fat and work out!",
      "parent": "0",
      "gravatar_hash": "1941778cada964444be450bfcc0a3e61"
    },
    {
      "id": "3623",
      "author": "Shannen",
      "author_url": "",
      "date": "2009-12-12 09:49:30",
      "content": "I made this with fat free yoghurt in a cheesecloth, which I pressed every 2-3 hours over a 12 hour period, and ended up with a very firm yoghurt cheese I could cut into portions quite neatly, albeit if stirred, I could make it more like a cream consistency.\n\nI preferred it with full fat yoghurt but the healthy option worked just fine for me too!",
      "parent": "0",
      "gravatar_hash": "962873c303aae6186e6a68a1b41fceed"
    },
    {
      "id": "13327",
      "author": "Bernard",
      "author_url": "",
      "date": "2011-12-19 08:07:11",
      "content": "Too much salt!  Quarter that amount and add to taste.",
      "parent": "0",
      "gravatar_hash": "e26e6f3e4cc80c3f4d952afae8661ab6"
    },
    {
      "id": "1042739",
      "author": "Chris",
      "author_url": "",
      "date": "2014-08-22 10:00:53",
      "content": "I agree with Hanna. And FOOD is for people all over the world. We can learn and eat and laugh and enjoy all contributions from everywhere- There is no food new under the sun it is just how we combine the ingredients and enjoy each others company.",
      "parent": "3615",
      "gravatar_hash": "a9cfce1df19f04371117f343c09162ff"
    },
    {
      "id": "1225827",
      "author": "Lucy",
      "author_url": "",
      "date": "2015-01-15 16:53:47",
      "content": "I made with no-fat yoghurt, hung in the fridge overnight, no pressing. It was still firm enough to roll but you'd need to press it I think to get a really firm one. It's great. Full fat is obviously even richer. But with no-fat I can eat more everyday!",
      "parent": "0",
      "gravatar_hash": "cc04063b1d65c0875a7023c0b202cd57"
    }
  ]
}