{
  "comment_count": 19,
  "comments": [
    {
      "id": "3852",
      "author": "Alpa",
      "author_url": "http://www.thegreenpeacock.blogspot.com",
      "date": "2007-11-26 08:24:18",
      "content": "This looks fabulous and so festive!  I  have a ton of couscous I need to use up, do you think this could work as a substitute for the orzo?",
      "parent": "0",
      "gravatar_hash": "e118b1dd945f895317a6e8d3d7507445"
    },
    {
      "id": "3853",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2007-11-26 13:59:59",
      "content": "For sure! See <a href=\"https://herbivoracious.com//2007/11/recipe-how-to-m.html\" rel=\"nofollow\">this post</a> for a tip on how to make the couscous come out fluffy, not heavy.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3854",
      "author": "res",
      "author_url": "",
      "date": "2007-11-27 16:26:54",
      "content": "This looks fantastic! I am going to try it this weekend. What a clever use of orzo.\n\nThanks.",
      "parent": "0",
      "gravatar_hash": "35765d931c780fc0d1b8adfa090fd5d5"
    },
    {
      "id": "3855",
      "author": "Susan Chan",
      "author_url": "",
      "date": "2009-11-11 22:14:54",
      "content": "Hi Michael\n\nInstead of delicata squash which I wont be able to get in Thailand, is it possible to substitute pumpkin instead??  I would love to try this receipe for thanksgiving.\n\nThanks...",
      "parent": "0",
      "gravatar_hash": "0870cd75de68cdb29aae9f9299552f06"
    },
    {
      "id": "3856",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-11-11 22:21:47",
      "content": "Absolutely, I think it would be great with pumpkin! You&#39;ll just need to adjust the cooking time to get it tender.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3857",
      "author": "j.cro",
      "author_url": "http://i8pixistix.blogspot.com/",
      "date": "2009-11-18 10:44:54",
      "content": "Actually to make this completely gluten-free you'd need to use something other than orzo, since that's generally a pasta made with wheat flour.  You can probably Quinoa for the orzo - that would also up your protein count.\n\nOtherwise, this sounds delicious and I might make it this weekend.  Thanks for posting this recipe!",
      "parent": "0",
      "gravatar_hash": "d9bf534084d601287f69e3d9b4836d0b"
    },
    {
      "id": "3858",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-11-18 10:59:52",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\nYou are absolutely right... I must have been completely out of it when I wrote that, as of course orzo is normally made from wheat. I&#39;ve updated the comment at the beginning of the recipe to indicate what changes would be needed. Thanks for catching that.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3859",
      "author": "Ellen",
      "author_url": "http://www.californiariceoil.com",
      "date": "2009-11-24 12:18:31",
      "content": "sounds great-i needed something like this.",
      "parent": "0",
      "gravatar_hash": "6c9c49e0a927f8f17d23257faa83df11"
    },
    {
      "id": "3860",
      "author": "Jayn Swartz",
      "author_url": "http://profile.typepad.com/jaynswartz",
      "date": "2010-04-24 17:14:30",
      "content": "I bet this would go over at our Thanksgiving a lot better than the tofu turkey the vegetarians brought last year.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3861",
      "author": "John",
      "author_url": "",
      "date": "2010-09-24 09:28:13",
      "content": "It's not thanksgiving, but it was the first day of Autumn, and the local farmers' market had delicata, and I had sage and parsley in the garden, and most of the other ingredients in the pantry, so I tried this yesterday. Hint for others: cooking my delicatas took about 20 min at 375. Placing them cut-side-down on a teflon cookie sheet gave a nice browned surface to the cut edges.\n\nI didn't have enough dried cranberries, and my pomegranate was not very fresh, and without the proper balance of these flavors, the dish was disappointing. Not BAD by any means, just not as GOOD as it had sounded at first. So while Michael may have approximated the amounts, I recommend that you don't vary his amounts by more than about 30%. Also, everyone in my household requested that I cut back on the breadcrumbs next time.\n\nOn the other hand, the meal-in-one nature of the dish provided a nice opportunity for silly plating: I put one half-squash at the side of a 10\" white plate, and opposite it, for balance, one \"segment\" of mandarin orange. A case of \"et juste la, un petit geranium\" (for Asterix fans). The kids loved it.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "3862",
      "author": "charlotte",
      "author_url": "",
      "date": "2010-10-02 10:33:04",
      "content": "Wonderful.  I already posted on facebbok.  Cannot find the area to print just the recipe.\nThanks.",
      "parent": "0",
      "gravatar_hash": "c26f7a10c51c27f2397c29a0ecb2c7b0"
    },
    {
      "id": "3863",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-10-02 15:22:27",
      "content": "Hi Charlotte - unforunately, I don&#39;t have a good print function on the site; it is on my long to-do list but for now you just have to print the whole page. Thanks for sharing on facebook!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3864",
      "author": "charlotte",
      "author_url": "",
      "date": "2010-10-02 20:18:00",
      "content": "Thanks for the response.  I will go to the farmers marker in LA tomorrow to look for Delicata squash but I feel it is a few weeks to early here?!",
      "parent": "0",
      "gravatar_hash": "c26f7a10c51c27f2397c29a0ecb2c7b0"
    },
    {
      "id": "3865",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-10-03 22:32:46",
      "content": "Mmm, I&#39;m not too sure about the produce timing in the LA area. I bet one of your local farmer&#39;s markets has a produce calendar online? Can anyone help Charlotte out?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3866",
      "author": "Teresa",
      "author_url": "",
      "date": "2011-11-07 12:56:16",
      "content": "I tried this recipe over the weekend and it really was amazing.  Each element in the dish complicated the delicata squash and the flavor of the squash was wonderful.  The only thing I didn't add was the bread crumbs on the top. The parsley and pomegranate on top were perfect.  This dish got rave reviews from my guests.",
      "parent": "0",
      "gravatar_hash": "e71c1e2bda749d1e2ccd9878e1ba84d4"
    },
    {
      "id": "3867",
      "author": "Ivy Bagnall",
      "author_url": "http://profile.typepad.com/ivybagnall",
      "date": "2011-11-14 11:22:25",
      "content": "I'm assuming you could use Earth Balance or organic Smart Balance, both vegan, as an alternative to olive oil if you were trying to keep it vegan but wanted the essence of butter, no?",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3868",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-11-14 11:45:39",
      "content": "Hey Ivy - yes, you can definitely use a vegan butter substitute. You&#39;d want to skip the browning of the butter in that case, since I don&#39;t believe it will make the brown butter flavor. Maybe you would want to add something like porcini mushroom powder to bring in a different deep flavor.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "5395",
      "author": "John",
      "author_url": "",
      "date": "2011-11-28 09:20:54",
      "content": "I made this again for thanksgiving, using acorn squash instead of delicata, and skipping the breadcrumbs, because I knew that it wouldn't be served immediately, and I didn't want them to get soggy, etc. I used a few more pomegranate seeds than shown in the pictures here -- perhaps 12-15 per quarter-squash. Definitely a success. I think I like the recipe better overall without the breadcrumbs. Side benefit: the leftovers reheat really nicely in the microwave.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "84870",
      "author": "ann",
      "author_url": "",
      "date": "2012-11-23 03:49:27",
      "content": "I made this for our TG feast yesterday and it was yummy.  Adjustments:  half the butter, and more pomengranate seeds.  Big hit with everybody.  The flavor tip of the century:  browning the butter!\nThank you, Michael.  I hope you had a great Thanksgiving yourself.",
      "parent": "0",
      "gravatar_hash": "a03c4b7ca635b4db4127b7ae8a0907be"
    }
  ]
}