{
  "comment_count": 40,
  "comments": [
    {
      "id": "3624",
      "author": "monica",
      "author_url": "http://www.smarterfitter.com/blog",
      "date": "2008-04-14 00:48:51",
      "content": "Hey you're right - this does look good.  And simple!  I will definitely give this a try.",
      "parent": "0",
      "gravatar_hash": "2fa7ad08ec362bdc5ea514dd659a8a17"
    },
    {
      "id": "3625",
      "author": "Kitchen Goddess",
      "author_url": "http://culinarytravelsofakitchengoddess.wordpress.com",
      "date": "2008-04-14 08:13:34",
      "content": "Oh my word, that looks scrumptious.  I have Aroma's of Aleppo too and so far I've only cooked Friday Night Chicken; this will have to be next - it looks that good.",
      "parent": "0",
      "gravatar_hash": "6df0a01b31e711387a4bf33249de65b1"
    },
    {
      "id": "3626",
      "author": "Niamh",
      "author_url": "http://www.eatlikeagirl.com",
      "date": "2008-04-14 08:50:10",
      "content": "Oh - this looks lovely and very similar to one I make already. I'll have to try this combination. Thanks!",
      "parent": "0",
      "gravatar_hash": "6be58aa1945a3812dd092bd5ccbfa0e6"
    },
    {
      "id": "3627",
      "author": "Leah Koenig",
      "author_url": "http://www.jcarrot.org",
      "date": "2008-04-14 08:53:40",
      "content": "Looks like a great recipe - and thanks for the tip to not substitute with other types of lentils!  (I generally think a lentil is a lentil is a lentil - but it seems like not in this case).\n\nLeah\nThe Jew & The Carrot blog",
      "parent": "0",
      "gravatar_hash": "1ff23f2cc7e0331edb31f8a6b8e9adb6"
    },
    {
      "id": "3628",
      "author": "Diana Caspi",
      "author_url": "http://testedrecipes.blogspot.com/",
      "date": "2008-04-14 09:07:51",
      "content": "Lentils and coriander seeds? Hmm, interesting, and it sounds yummy:) I have to give this a try. And it seems so easy to make. I wonder how it would be if I mixed and matched with my recipe of red lentil soup. Maybe I'll skip the mint and use bulgur and see how the outcome is. I'll let you know. Thank you for a great recipe Michael:)",
      "parent": "0",
      "gravatar_hash": "6d2fa01d157a6ce8b99526b36abb5df3"
    },
    {
      "id": "3629",
      "author": "Hannah",
      "author_url": "http://iheartkale.blogspot.com",
      "date": "2008-04-14 09:18:27",
      "content": "Wow, what a thrill to see someone else blogging Syrian food!  Shurbat addes is so delicious, especially when you squeeze both lemon and orange wedges over the top.  Also, Diana, a delicious protein-rich cousin of shurbat addes  is kolkeh, which is bulked up with a little bulgur wheat: http://iheartkale.blogspot.com/2008/03/bulgur-and-red-lentil-soup-with-browned.html",
      "parent": "0",
      "gravatar_hash": "bd1d5c38a95426994aa2235bf3f2558a"
    },
    {
      "id": "3630",
      "author": "Chuck",
      "author_url": "http://www.thekneadforbread.com",
      "date": "2008-04-14 10:05:47",
      "content": "I have become a huge fan of Middle Eastern spices and food. Lentil soup and Dal are some of my favorites. Well done!",
      "parent": "0",
      "gravatar_hash": "46ab016c1b4b20ddc1ff922dfce5651d"
    },
    {
      "id": "3631",
      "author": "Maureen",
      "author_url": "http://cookingmylife.blogspot.com/",
      "date": "2008-04-14 10:39:51",
      "content": "This sounds pretty good. My recollection of food like this was that the dash of fresh lemon really set it off.\n\nLOL I feel that whatever recipe I feel like making usually calls for whatever lentil color I DON'T have. ;-) Hopefully, this time I have red.",
      "parent": "0",
      "gravatar_hash": "f8d076b2962a60ec5afa821ffa376bd9"
    },
    {
      "id": "3632",
      "author": "edamame",
      "author_url": "http://food-soybean.blogspot.com/",
      "date": "2008-04-18 20:22:47",
      "content": "I am interested in the food culture of your country. And I support your site. If there is time, please come in my site.\nFrom Japan\nhttp://food-soybean.blogspot.com/",
      "parent": "0",
      "gravatar_hash": "55bd561ad862c36e684652688549bf6a"
    },
    {
      "id": "3633",
      "author": "Cassie",
      "author_url": "http://www.veggiemealplans.com",
      "date": "2008-04-24 10:12:10",
      "content": "Michael, I like the simplicity of this recipe and it does sound wonderful, too.  Just lovely!",
      "parent": "0",
      "gravatar_hash": "2f4000514924cb1b9a9e7d0ab1fd53e4"
    },
    {
      "id": "3634",
      "author": "Katie B.",
      "author_url": "http://otherpeoplesfood.blogspot.com",
      "date": "2008-05-09 10:53:05",
      "content": "We had this for dinner last night and I have to tell you - it was delicious!! Thanks so much for sharing with us!!",
      "parent": "0",
      "gravatar_hash": "fcff4aa065f04069d3c4678b274968a9"
    },
    {
      "id": "3635",
      "author": "Ellen",
      "author_url": "",
      "date": "2008-10-08 09:27:45",
      "content": "I just stopped by your site to get this recipe out for the second time! I made it for the family a few weeks back and everyone loved it. I've been passing it on to friends ever since, and now I'm back for a second round myself. Really simple to make, and a tasty break from \"regular\" lentil soup. The fresh cilantro and lemon at the end really make the dish! Thanks.",
      "parent": "0",
      "gravatar_hash": "39bd6d495ebcc2422a3a769cbf250c40"
    },
    {
      "id": "3636",
      "author": "susrith",
      "author_url": "",
      "date": "2008-11-17 16:19:12",
      "content": "Hi\ni love to experiment with food......being a strict vegetarian does drw a lot of curious questions..........the soup u have posted is very close to Indian version of dal or simple \"pappu\"......we are all the same with our food after all!\n\n\ngreat going!",
      "parent": "0",
      "gravatar_hash": "ef8bc0fe33a51c05156e98f15b463d86"
    },
    {
      "id": "3637",
      "author": "Jessica",
      "author_url": "http://hartleyconfections.com",
      "date": "2009-04-20 11:21:20",
      "content": "This recipe looks great! I've come up with a similar Red Lentil Soup recipe which incorporates similar spices on my blog Hartley Confections:\n\n<a href=\"http://hartleyconfections.com/2009/04/20/cooking-lights-nepalese-red-lentil-soup/\" rel=\"nofollow\">http://hartleyconfections.com/2009/04/20/cooking-lights-nepalese-red-lentil-soup/</a>",
      "parent": "0",
      "gravatar_hash": "46213f0986bad157d6b6afeb21293eaf"
    },
    {
      "id": "3638",
      "author": "Jen",
      "author_url": "",
      "date": "2009-10-21 13:13:28",
      "content": "I made this last night and, while I loved the simplicity and the spices, I found 1 tablespoon of salt to be a heck of a lot for my taste--maybe I didn't add as much water as the recipe called for, not sure. I added more lemon and some yoghurt and it was still good.",
      "parent": "0",
      "gravatar_hash": "332f9fc8f277e1107d7cd9406b3ee8f0"
    },
    {
      "id": "3639",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-21 13:44:13",
      "content": "@Jen - Thanks for the feedback! I&#39;ve reduced the listed amount to 1.5 teaspoons and emphasized that you should taste and adjust it at the end.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3640",
      "author": "Joe",
      "author_url": "",
      "date": "2009-12-16 15:36:58",
      "content": "<b>Daughter Amazed at Dad's Kitchen Skill.</b><br>I tried this and it's great! I love lentil soup and used to make it with tomatoes, carrots and onions, nasturtium leaves, etc., to give it flavor. My daughter tasted one of my richest creations and said, \"Where's the flavor?\" Then I tried this soup. The lentils smelled good as they boiled, but when I added the spices, I suddenly had the intense flavor and hearty aroma I love. And my daughter was amazed that her old Dad could make something so delicious--and with so very few ingredients.",
      "parent": "0",
      "gravatar_hash": "830abb026bf562fdf87318bea1d07776"
    },
    {
      "id": "3641",
      "author": "KARA",
      "author_url": "",
      "date": "2010-01-22 04:43:59",
      "content": "This is not jewish recipes. It is Syrian food recipes. I don't know why you are puting it is jewish food if it is not.",
      "parent": "0",
      "gravatar_hash": "1f6519aecee6532dabfbd34de7400d5c"
    },
    {
      "id": "3642",
      "author": "Julia",
      "author_url": "",
      "date": "2010-02-10 12:28:01",
      "content": "Probably because it came from a cookbook called \"Aromas of Aleppo, The Legendary Cuisine of Syrian Jews.\" So therefor, it is Jewish food.",
      "parent": "0",
      "gravatar_hash": "d558e9b4384733ab8ac4f3a9c15dd8f2"
    },
    {
      "id": "3643",
      "author": "Julia",
      "author_url": "",
      "date": "2010-02-10 12:38:17",
      "content": "Oh, and thank you Michael for this recipe. Like the dad above I usually just cook lentils with the normal veggies, but I will definitely be making this one as soon as i can get a hold of some coriander seeds.",
      "parent": "0",
      "gravatar_hash": "d558e9b4384733ab8ac4f3a9c15dd8f2"
    },
    {
      "id": "3644",
      "author": "Leslie @LaMamaNaturale",
      "author_url": "http://www.recycleyourday.com",
      "date": "2010-02-23 21:38:39",
      "content": "This soup is fantastic! I made it tonight and loved it! Yum. It's definitely going to get put in the monthly recipe collection. Mmm! :)Super simple, super savory! thanks.",
      "parent": "0",
      "gravatar_hash": "86824398b32dd682a325505d95a7cb25"
    },
    {
      "id": "3645",
      "author": "Kelly Parr",
      "author_url": "http://kellyparr.org",
      "date": "2010-02-23 21:48:35",
      "content": "I love lentil soup and this version looks very inviting! Simple,easy and nutritious - just how I like it! Thanks for sharing..",
      "parent": "0",
      "gravatar_hash": "d9f04d2fb42a4bef362d1627ff75df20"
    },
    {
      "id": "3646",
      "author": "Nadima",
      "author_url": "",
      "date": "2010-04-17 16:16:24",
      "content": "I remember those days when my mom was in the kitchen on a cool autumn or window day making a delicious dish made up of brown and red lentils and I think there was wheat in it, and lots of cumin....  (onions and garlic)??\n\nI never learned how to cook this and unfortunately this receipe is buried with mom ... does anyone from Haleb (Aleppo) Syria know how to make this receipe.  She used to have dried pita bread and I think cook sliced onion to put on top of this food.........they make a soupish soup at the soup plantation that reminds me of my mom's meal.  forevermine007 us at yahoo dot com\n\nhemdela el saleme",
      "parent": "0",
      "gravatar_hash": "d594dfcb3ddf99d303d633be1b4b3750"
    },
    {
      "id": "3647",
      "author": "Novarrt",
      "author_url": "",
      "date": "2010-04-17 16:19:36",
      "content": "What is the difference if a Syrian Jew or a Syrian Christian put this receipe in.....\n\nThank you whom ever it may be...\n\nshooklon!",
      "parent": "0",
      "gravatar_hash": "cef682c3a37764e257f5af7d335e701e"
    },
    {
      "id": "3648",
      "author": "rbiton",
      "author_url": "http://profile.typepad.com/rutbiton",
      "date": "2010-04-19 03:07:42",
      "content": "Well, I'll try answering that, as a Jew living in Israel where we get bombed frequently by our not-so-nice Arab residents and neighbors. We've always been a distinct people, with dietary laws from the Torah that have been kept alive until today. For that reason, our food, no matter where we've lived over the past 2K years, has reflected the tastes of the local population, but with twists and blends not found in non-Jewish cooking. For example, a soup like this might make use of meat or chicken (by both Jews and non-Jews) but we could not use butter as the oil, or top with a dairy product as non-Jews would very likely do.\n\nBut more than that, this recipe and others by the author, are relics of a place and time: Jewish living in Syria \"back in the olden days.\" Today, the Jews have been effectively made refugees from most Muslim countries since the establishment of Israel. There simply aren't many left in Syria and other middle eastern countries. Just a few months ago the remaining Jewish community in Yemen was sent to Israel under threat of death by the surrounding community after living there continuously for more than 2K years. So, there food and tradtions have not yet undergone such modernizing as many other immigrant Jewish communities in say the US, Israel, etc. So, yes, what difference does it make if it's a JEwish recipe or a Christian (or I'll add Muslim)? It sure makes a difference to us Jews, and it's historically made, and currently make a difference to non-Jews. Thanks for your inquiry. I hope I did it justice.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3649",
      "author": "Joel Natkin",
      "author_url": "",
      "date": "2010-06-11 21:52:23",
      "content": "This is the best and easiest red lentil soup I've tried. So much flavor, no stock added. Thanks Michael Natkin",
      "parent": "0",
      "gravatar_hash": "9f1d5f09526fa08ecaf297bcd41dea9f"
    },
    {
      "id": "3650",
      "author": "Jackie Ewing",
      "author_url": "http://www.g2.com",
      "date": "2010-08-25 13:00:26",
      "content": "Hey I’m not sure if you have a lot of healthy recipes of your own that you make, but if you do, you should send them into this contest I know of. I noticed your blog online and I think I have something you will be interested in. You could get great exposure for your recipes and meet celebrity cooks (Bobby Flay, Sunny Anderson, Sara Moulton, or Cat Cora). All you have to do is go to <a href=\"http://www.healthyfoodfight.com/\" rel=\"nofollow\">http://www.healthyfoodfight.com/</a> to submit one of your healthy recipes. It kicks off on September 4th at the Rockaway Mall in New Jersey. Thank you for your time and good luck with the competition if you decide to enter!",
      "parent": "0",
      "gravatar_hash": "9b3036c6ded71c364e270292bfda0f4b"
    },
    {
      "id": "3651",
      "author": "Homeshuling",
      "author_url": "http://blog.beliefnet.com/homeshuling",
      "date": "2011-01-24 12:54:43",
      "content": "I made this soup with my kindergarten class after reading the story of Esau and Jacob. Even most of the five year olds recognized it was delicious.",
      "parent": "0",
      "gravatar_hash": "b432c2f0ab4d98954004bd3ab69e377e"
    },
    {
      "id": "3652",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-01-24 13:10:37",
      "content": "Thanks for sharing! And I&#39;m glad to know about your blog, great fun. We&#39;ve gotten some of the books you mention from PJ Library and they have been real favorites at our house.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3653",
      "author": "Jonquil",
      "author_url": "",
      "date": "2011-03-06 18:27:06",
      "content": "Awesome, another dish to help me with my love of garlic! I think I will try the garlic paste with some green beans. It reminded me so much of the garlic they put on the green beans at the White House Grill in Post Falls :)",
      "parent": "0",
      "gravatar_hash": "da658e16bbaa62dc1b391624b3878f96"
    },
    {
      "id": "3654",
      "author": "js",
      "author_url": "",
      "date": "2011-06-29 04:17:58",
      "content": "At first I was kind of disappointed with the soup because it hadn't turned out as flavorful as I had hoped.  But when I tasted it, having left it sit for about 15-20 minutes, the flavor was amazing! So subtle and yet so flavorful. I sprinkled it with cumin, chopped corriander and a squeeze of lemon and it was wonderful. I also added about 1/2 tsp more of kosher salt to the whole pot. What a great, easy soup. And the aroma of the garlic and corriander seeds as I pounded them with the mortar and pestle was so fragrant! (BTW I only used 1 TBS of olive oil to fry the paste).",
      "parent": "0",
      "gravatar_hash": "aceb77a20e4eacdc0129a1d9af56f762"
    },
    {
      "id": "68284",
      "author": "Liz",
      "author_url": "",
      "date": "2012-10-24 16:47:34",
      "content": "I made this yesterday and it was fantastic.  I usually do stock, potatoes, carrots, celery, etc in with the lentils and was surprised how much flavor it had with just the spices.  The entire family (7 year old, 5 year old, and 20 month old kids) all loved it.  Just so you know, our Central Market grocery store carries Aleppo pepper in bulk.  I would love more recipes to use this fantastic pepper.",
      "parent": "0",
      "gravatar_hash": "00cf8b80388318a69edfd612f9afd0c2"
    },
    {
      "id": "69156",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-26 07:15:15",
      "content": "Thanks, Liz! Glad you liked it, and here are some more recipes that make use of Aleppo pepper: https://herbivoracious.com/?s=aleppo+pepper",
      "parent": "68284",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "92540",
      "author": "Megan",
      "author_url": "",
      "date": "2012-12-04 00:40:59",
      "content": "Just made this and love it. I've never made red lentil soup and I'm not always great in the kitchen, but this was super easy and so delicious. I made a small addition and let the lentils simmer with a few bay leaves. I only had the cumin and lemon as a garnish, but boy, did they help! So savory. I was a little suspicious about adding lemon to this dish, but I'm glad I trusted the pro and the culture, it was a glorious combination.",
      "parent": "0",
      "gravatar_hash": "853a69b7d44b10d5aab200256eecb3f5"
    },
    {
      "id": "198902",
      "author": "bruisedlee",
      "author_url": "",
      "date": "2013-10-03 22:27:17",
      "content": "I just made this and wow! This recipe is spot-on. It's almost as good as my local Middle Eastern restaurant's lentil soup. Thanks for posting this.",
      "parent": "0",
      "gravatar_hash": "d3aa1de722bf191b2ed455c2b624e691"
    },
    {
      "id": "304160",
      "author": "Erika",
      "author_url": "http://paleoburnreviewer.com",
      "date": "2013-12-12 11:08:50",
      "content": "OOO looks delicious, Im a big fan of lental soup, reminds me of when my mother used to cook it me when I was little. Thanks for sharing the recipe.",
      "parent": "0",
      "gravatar_hash": "5744b04c84b6399da85061f0fdbcd3f5"
    },
    {
      "id": "1141128",
      "author": "Erin",
      "author_url": "",
      "date": "2014-11-09 06:30:43",
      "content": "This looks delicious - thank you for posting it! I'm only about four years late with this suggestion, but Penzey's Spices also carries Aleppo. Mmmm, I can't wait to try the recipe!",
      "parent": "0",
      "gravatar_hash": "35b20af9247fac8ad845716d8cdeb0de"
    },
    {
      "id": "1314270",
      "author": "William Nemecek",
      "author_url": "",
      "date": "2017-01-29 15:27:34",
      "content": "Why the ? mark on Lentils and coriander seeds? Very common.",
      "parent": "3628",
      "gravatar_hash": "d2651ca3ba0d54e1c19fa8ee8d1d1e5f"
    },
    {
      "id": "1314508",
      "author": "Glory",
      "author_url": "",
      "date": "2018-03-20 05:36:11",
      "content": "Marhaba Nadima ,\nIt sounds like mjedderah, but made with wheat. My dad is from Aleppo and we have mad it with rice or the large burghol. Cook the same way as with rice, just add the wheat instead. When it’s done fry up your pile of onions and pour on top. We also have mint, yogurt and fléflé for accompanying. \nHope this is what you were thinking about! \nMa salame",
      "parent": "3646",
      "gravatar_hash": "f6b578dff55845bef56fc03816b7cc21"
    },
    {
      "id": "1314597",
      "author": "Hanna",
      "author_url": "",
      "date": "2019-06-23 18:30:58",
      "content": "This is one of my favorite lentil recipes; I pass it along to everyone. If you're thinking of making it, add all the olive oil; it really makes the soup rich and delicious.",
      "parent": "0",
      "gravatar_hash": "63402dd7fc128fc71fbd6e3ec584bb3c"
    }
  ]
}