{
  "comment_count": 15,
  "comments": [
    {
      "id": "19233",
      "author": "Kale Crusaders",
      "author_url": "http://kalecrusaders.com",
      "date": "2012-02-15 07:45:31",
      "content": "Kabocha squash is great--roasts nicely without falling apart too.  This soup is a beautiful departure from the standard autumnal squash soup.",
      "parent": "0",
      "gravatar_hash": "90af8ecc23bee322ca57dc781bedd896"
    },
    {
      "id": "19241",
      "author": "Justin",
      "author_url": "http://www.thechubbyvegetarian.com",
      "date": "2012-02-15 08:53:34",
      "content": "Kabocha squash is so wonderful and sweet!. I an only imagine how good it is mixed with lentils and harissa. I'm going to give this one a shot. Here is a roasted squash soup with ras-al-hanout that turned out beautifully: http://chubbyvegetarian.blogspot.com/2010/12/roasted-kuri-squash-soup-ras-el-hanout.html",
      "parent": "0",
      "gravatar_hash": "0eed4dafa745a0739bf786861e36cccb"
    },
    {
      "id": "19242",
      "author": "Jenny@vegetarianhatesvegetables",
      "author_url": "http://vegetarianhatesvegetables.blogspot",
      "date": "2012-02-15 08:54:47",
      "content": "I love lentils and the sound of that harissa oil.  I still haven't yet overcome my distaste for squash and I think that this soup would be a good way to start.  Looks great!",
      "parent": "0",
      "gravatar_hash": "efd63fa22c1a4cd1b5e1e7c8fc2b99bb"
    },
    {
      "id": "19361",
      "author": "Chris",
      "author_url": "http://vegonline.org/",
      "date": "2012-02-17 14:36:00",
      "content": "Mmm...that just sounds delicious. I can't get enough soup when the weather's cold, especially when it comes to lentils!",
      "parent": "0",
      "gravatar_hash": "58f3ad6103e7eb454837ad6480e168f7"
    },
    {
      "id": "19568",
      "author": "Amber Shea @Almost Vegan",
      "author_url": "http://almostveganchef.com",
      "date": "2012-02-20 13:57:26",
      "content": "Lentils + squash + harissa = I'm sold.  :)",
      "parent": "0",
      "gravatar_hash": "9f37c09407eb798284f3308348968daa"
    },
    {
      "id": "19967",
      "author": "John",
      "author_url": "",
      "date": "2012-02-25 17:18:46",
      "content": "Absolutely great. I made about a 1.5x recipe, but with about 2x squash, because my squash turned out to be larger than I thought. Lacking the sumac, my harissa wasn't as red as yours. I found the soup a little thick (comparable to \"soft peaks\" egg whites in its form-holding ability), but everyone else in the family said \"No...this is really good. Don't thin it out.\" We used more cilantro leaves than you did because everyone here loves the stuff. Clearly it's a recipe where exact quantities aren't all that critical. But I know than in a week or two I'm gonna hear \"Dad, you remember that soup that I liked? Could you make that again?\"",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "21519",
      "author": "Peter Maxson",
      "author_url": "http://www.messagesolicitors.com/conveyancing-solicitors-london",
      "date": "2012-03-16 03:29:55",
      "content": "I like that soup. Were can i buy the cookbook?",
      "parent": "0",
      "gravatar_hash": "3c8659651ba6832d4690b7cad7899fe0"
    },
    {
      "id": "21520",
      "author": "Morgan sam",
      "author_url": "http://der-pokerseiten-vergleich.de",
      "date": "2012-03-16 03:32:24",
      "content": "Hello Peter, Do you want to buy this cookbook really? Please contact blog author for the purpose.",
      "parent": "0",
      "gravatar_hash": "ecccf500231d7a6f37592f221ddadf57"
    },
    {
      "id": "21530",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-16 06:10:31",
      "content": "Thanks! You'll find order links for the cookbook here: https://herbivoracious.com/get-the-herbivoracious-cookbook",
      "parent": "21519",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22931",
      "author": "Cheeku Bhasin",
      "author_url": "",
      "date": "2012-04-17 06:07:13",
      "content": "Love the soup and harissa oil recipe and love your website. Your style reminds me of my favourite chef Yottam Ottolenghi. I won't be able to get your book in Kenya at the moment but I have friends coming over from the US later this summer and will order it from them, though there will be lots of improvising as we don't get a lot of ingredients here.\nHere is a red lentil soup from my website\nhttp://cook2jhoom.wordpress.com/2011/11/03/post-diwali-round-up-and-a-successful-thaiindian-soup-experiment/",
      "parent": "0",
      "gravatar_hash": "73af38517086b8dd1beecf48fa6c56e4"
    },
    {
      "id": "68790",
      "author": "Mag",
      "author_url": "",
      "date": "2012-10-25 11:28:37",
      "content": "Just made the outrageously wonderful kabocha/redlentil soup. The texture is heavenly and it is the creamiest soup  - and, there's no cream in it! Enormous depth of flavor. Next time I will toast the coriander seeds in a pan, then grind them before adding to the soup as my stick blender didn't puree them up really well. Probably more of a comment on my pureeing talents than a fault of the recipe. Like John, we had a lot of squash and so did 2 1/2 times the amount. We will can three pints for winter and eat the rest!",
      "parent": "0",
      "gravatar_hash": "f2594c807a9878e602b36a5acad8e4bb"
    },
    {
      "id": "610600",
      "author": "Mirna",
      "author_url": "",
      "date": "2014-01-20 10:29:05",
      "content": "Love all your recipes.  I'm moms caregiver, she has AZ, and therefore don't have much time to view internet much.  But your emails are my must.  Love all the great recipes you present, am not always able to find all the goodies you present.  But I make adjustments for mom and because of availability.  Thank you so very much for being so generous with your talents.\n\nMirna:)",
      "parent": "0",
      "gravatar_hash": "36b89467bcfc8a90ebc28adf32be8a65"
    },
    {
      "id": "965554",
      "author": "Keith Larson",
      "author_url": "",
      "date": "2014-07-14 22:28:42",
      "content": "Made this recipe and I still cannot stop thinking about it. I used a whole butternut squash with great success. Rather than using electric blender, I used a hand mashing tool that yielded terrific results. I served the delicious creamy soup with sesame flatbread. We cannot wait to make this meal again, although it might be a while as I am working my way through Michael's amazing cookbook. So far, I can honestly say this is one of the best veggie cookbooks in my kitchen!",
      "parent": "0",
      "gravatar_hash": "f20422b54b2fd29cc368480319ddd621"
    },
    {
      "id": "1314267",
      "author": "John",
      "author_url": "",
      "date": "2017-01-24 17:34:57",
      "content": "This is on our winter \"short rotation\", and I've optimized a bit. Here are some tips for those who have enthusiasm but less time: 1. Halve and seed squash; microwave about 4 min, cut-side down.  2. While it's microwaving, set up a pressure cooker, pour in some oil and start heating, measure out all other ingredients, with garlic, coriander, &amp; red pepper all in one bowl, and salt and water in a large measuring cup or something. 3. Slice squash into half-rings, perhaps 1.5\" wide, and then slice off skin. Toss a few half-rings into the pressure cooker to brown while you're cutting peels off the next few. Brown all rings on the top and bottom sides; you may have to remove some from the pressure cooker to make room for the others. 4. Add the garlic and coriander, and then the remaining squash half-rings. You can cut them in pieces if you like, but there's no need. Cook garlic-mix for 30 sec, then pour in the salted water. Let things settle, and pour the red lentils over the top, so that they mostly rest atop the squash rather than on the hot bottom surface of the pressure cooker. Close the pressure cooker and cook about 7 minutes. Cool under a cold-water tap until you can safely open the cooker, and test that the lentils are done; if not, re-seal and reheat for a couple more minutes.  5. While that's cooking, mix the spices and oil and garlic and sriracha in a bowl and microwave for about 30sec to a minute. The sriracha will \"boil\" beneath the oil. Don't bother straining -- the seedy crunchy stuff at the bottom is a wonderful addition. 6. Let soup cool a bit, and then process it in a food processor or blender until smooth.  7. Serve, with a spoonful of the harissa-mix atop, and cilantro if you have it, and perhaps a tablespoon of Dukkah as well, if you're feeling enthusiastic. Start-to-finish time for me: about 25 minutes, tops.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "1314268",
      "author": "Michael",
      "author_url": "",
      "date": "2017-01-24 17:38:42",
      "content": "Love me some pressure cooker action. Thanks, John!",
      "parent": "1314267",
      "gravatar_hash": "98c10d2d92fe38bf3eb8cdd3eeb4cc7c"
    }
  ]
}