{
  "comment_count": 6,
  "comments": [
    {
      "id": "14",
      "author": "torviewtoronto",
      "author_url": "http://torviewtoronto.blogspot.com",
      "date": "2011-11-10 17:11:19",
      "content": "this looks wonderful",
      "parent": "0",
      "gravatar_hash": "9aed5bdc3bf679b2795113a7f73f74b6"
    },
    {
      "id": "15",
      "author": "Shuvo",
      "author_url": "http://food-shuvo.blogspot.com",
      "date": "2011-11-14 05:13:07",
      "content": "this is so nice but do it so good and awesome. please update because i am one of your fan. i want to see it.\n\n<a href=”food-shuvo.blogspot.com” rel=\"nofollow\"> Good food and drinks of our world </a>\n<a href=”wonder-shuvo.blogspot.com” rel=\"nofollow\"> Wonder of my world </a>\n<a href=”physicaltheraphy.blogspot.com” rel=\"nofollow\"> Physical theraphy Blogspot </a>\nAmazon.com/wonderworld20-20",
      "parent": "0",
      "gravatar_hash": "b30d3cb2a931dc1894265fec487a5cbe"
    },
    {
      "id": "16",
      "author": "Heather",
      "author_url": "",
      "date": "2011-11-16 08:52:32",
      "content": "I am not sure that I am up to making the tamales themselves (but oh, how I love them) but I'm marking the sauce recipe for the next time I made enchiladas.\n\nAlso... I just love your logo. Is the guy on the right a cucumber? Did you make these wonderful people?",
      "parent": "0",
      "gravatar_hash": "dcf6065a6243151019f2c5a50e14acf8"
    },
    {
      "id": "17",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-11-16 09:29:34",
      "content": "Hey Heather - that sauce will definitely be good with enchiladas, you just might need to thin it out a bit. My brother did the site design, and I think he bought those little guys somewhere, but I don&#39;t know where ;).\n\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "23402",
      "author": "Kathryn",
      "author_url": "http://chachasgfkitchen.blogspot.com",
      "date": "2012-04-30 08:40:07",
      "content": "Because my mom grew up in Santa Barbara we visited family frequently.  Trips to the beautiful mission were taken less often and I certainly don't remember a gift shop there decades ago. How perfect that a tamale cookbook would be in stock, though! La Tolteca was our favorite tamale stop on the way home. We filled a Styrofoam cooler full and it squeaked the entire drive and the aroma would make us so hungry.  As soon as we got home the cooler was opened and the still hot tamales were our dinner. Such happy memories.\n\nBut I digress! Your Red Chili Sauce sounds delicious.  Probably as close as they come to the wonderful \"gravy\" from La Tolteca we ladled over our tamales.  I can't wait to make a batch tamales and try your sauce.",
      "parent": "0",
      "gravatar_hash": "33395e12b44ec9a40bb32295bd0a1039"
    },
    {
      "id": "1129578",
      "author": "Carmen B.",
      "author_url": "",
      "date": "2014-10-28 15:35:13",
      "content": "Hi I just read your post about La Tolteca tamales in Santa Barbara CA. I grew up eating these tamales and have been looking for the recipe. I just read that the wife of the original owner (Federico Claveria his wife was Bertha) died in 2011 how sad that without her the restaurant closed. I have been looking through the internet hoping to find the recipe for these delicious tamales and stumbled upon the one listed on this site. I would be very interested in finding the original La Tolteca tamale recipe. Thanks",
      "parent": "23402",
      "gravatar_hash": "f724dbd730ac6c4d67deb01e77c1742c"
    }
  ]
}