{
  "comment_count": 16,
  "comments": [
    {
      "id": "4126",
      "author": "blogreader",
      "author_url": "",
      "date": "2007-08-07 12:42:39",
      "content": "It would be nice if future themes reflect awareness of the fact that we eat in the context of 854 million people in the world who are currently experiencing hunger and that hunger persists even in the United States (34 million people are hungry including 16.9 percent of all children in the U.S.).  Too many food blogs exude over-abundance, over-consumption and self-indulgence.  I will continue to read your blog because I am interested in vegetarian food, the history and culture of food, can always use your insightful tips on preparation, and enjoy your writing style.  How about 'Vegetarian Envy' for a name?",
      "parent": "0",
      "gravatar_hash": "ae8126f94479f0afffb7b9b4ed7e4f88"
    },
    {
      "id": "4127",
      "author": "jen",
      "author_url": "",
      "date": "2007-08-07 13:26:41",
      "content": "how about 'get your veggie on?' or 'spank the pea'? might increase traffic.",
      "parent": "0",
      "gravatar_hash": "b6a7410d826a9e5fa1f9a77c394d0fda"
    },
    {
      "id": "4128",
      "author": "Joel Natkin",
      "author_url": "",
      "date": "2007-08-07 15:42:01",
      "content": "Here are a couple of suggestions that may have merit, or at least make you smile:\n\nJoie de Veggie\n\nVegito Ergo Sum (not sure exactly what this might mean : )",
      "parent": "0",
      "gravatar_hash": "eff75dbe559f7499b660b9fe0fdc1eff"
    },
    {
      "id": "4129",
      "author": "Joel Natkin",
      "author_url": "",
      "date": "2007-08-07 17:13:48",
      "content": "Ooh, Ooh, I have one:\n\nVegeTable\n\nYou might need a hyphen in the URL but the word will look good typographically.",
      "parent": "0",
      "gravatar_hash": "eff75dbe559f7499b660b9fe0fdc1eff"
    },
    {
      "id": "4130",
      "author": "Tofu Mom",
      "author_url": "http://tofu-n-sproutz.blogspot.com/",
      "date": "2007-08-07 20:51:44",
      "content": "Wow, I'm no help. I like the \"foodie\" title but that's just me... You're so eloquent when talking about food I think you'll come up with something...",
      "parent": "0",
      "gravatar_hash": "1a0b4a32e20aa0dec8b1491f2bea1ad6"
    },
    {
      "id": "4131",
      "author": "Steve Kilisky",
      "author_url": "",
      "date": "2007-08-08 20:46:02",
      "content": "Amazing who and what you'll discover wandering aimlessly around the food related blogosphere. Look forward to following your cooking adventures. I can relate to the turn-off aspect of the term \"foodie\". I also find \"vegetarian\" an ambigous term. Never can be sure if that mean dairy and eggs are are in or out. The first name that came to mind when I read your \"mission statement\" was: Meatless TLC. But I think the other suggestions are better and I just realized that \"meatless\" presumes one considers fish a meat.\n\nWhat about \"Vegicurious\" (a twist on epicurious) or \"Vegimand\"?  Vegetarian Virtue (could do interesting things with a VV logo). OK I can tell my creative zeitgeist is waning... Hey there you go, Veggie Zeitgeist...\n\nCheers",
      "parent": "0",
      "gravatar_hash": "5635764b3d5fd743dba7c45a9c37c548"
    },
    {
      "id": "4132",
      "author": "d.m.",
      "author_url": "",
      "date": "2007-08-08 23:51:22",
      "content": "I just stumbled upon an article entitled \"Fessin' Up to the F Word\" which is all about the term foodie.  (http://www.metroactive.com/papers/sonoma/07.28.04/foodies-0431.html)\nHere's the most relevant quote:  \"Being a foodie is about a passion for wonderful food in any sort of package and for those who care passionately about their craft.\"\nI think your title is perfect.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "4133",
      "author": "Colleen",
      "author_url": "",
      "date": "2007-08-09 10:40:02",
      "content": "I think it depends where you plan to take the blog.  Brainstorming:  \"Lovin' Vegetarian Food\".  Or \"The Compulsive Vegetarian Cook\".  So far it looks like you love to cook and bake and you love the tastes of this food you make - so something that reflects that would be nice.",
      "parent": "0",
      "gravatar_hash": "13731271bc450f97a19b7939973aef07"
    },
    {
      "id": "4134",
      "author": "anotherfoodie",
      "author_url": "",
      "date": "2007-08-09 12:39:31",
      "content": "From Wikipedia, the free encyclopedia\n\nFoodie is an informal term for a particular class of aficionado of food and drink. The word was coined in 1984 by Paul Levy and Ann Barr for their book, The Official Foodie Handbook.\n\nCall it what you are",
      "parent": "0",
      "gravatar_hash": "8c04aa2e13159216b54325b7d41084a4"
    },
    {
      "id": "4135",
      "author": "Stephanie",
      "author_url": "",
      "date": "2007-08-10 08:04:24",
      "content": "What about 'Passioné Végétarien'? (French for Vegetarian Aficionado)\n\nI'd check the translation, but I think that's how you spell it.",
      "parent": "0",
      "gravatar_hash": "b8d0798e8b043fbe68c0eb83912b4c18"
    },
    {
      "id": "4136",
      "author": "Stephanie",
      "author_url": "",
      "date": "2007-08-10 08:05:40",
      "content": "Or, you could even just call the site 'The Vegetarian Aficionado'.",
      "parent": "0",
      "gravatar_hash": "b8d0798e8b043fbe68c0eb83912b4c18"
    },
    {
      "id": "4137",
      "author": "jen",
      "author_url": "",
      "date": "2007-08-10 08:29:21",
      "content": "Flavor me Veggie\nBibimbap & Chive\nSoZoM Y Boga",
      "parent": "0",
      "gravatar_hash": "b6a7410d826a9e5fa1f9a77c394d0fda"
    },
    {
      "id": "4138",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2007-08-11 08:58:05",
      "content": "Thanks everyone for all the great suggestions! And that article that d.m. linked about the word \"foodie\" is worth a read. I think that both made me feel better about the f word in general, but also made me realize that it is more about eating than cooking, that is what bothers me. My brother recently suggested \"The Vegetarian Blowtorch\"! That might be it.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "4139",
      "author": "jen",
      "author_url": "",
      "date": "2007-08-11 14:22:11",
      "content": "How about Vegetarian Morsels?  The word morsels always makes my mouth water.\n\nI like vegetarian blowtorch--and if you use 'blow' as a key word that should really rev up the traffic.  Plus the graphic design possibilities would be endless.",
      "parent": "0",
      "gravatar_hash": "b6a7410d826a9e5fa1f9a77c394d0fda"
    },
    {
      "id": "4140",
      "author": "Sarah",
      "author_url": "",
      "date": "2007-08-17 03:37:01",
      "content": "I am really enjoying your site, thanks for taking the time to update it so often.\n\nI suggest a name that involves Seattle somehow - your eating habits are clearly influenced by where you live. Unfortunately, I have no ideas for you, but I think it would be a shame not to include something about where you live.",
      "parent": "0",
      "gravatar_hash": "dc07edaf395d216508697c1fe01bd13d"
    },
    {
      "id": "4141",
      "author": "sara",
      "author_url": "",
      "date": "2007-08-17 21:29:46",
      "content": "Vegetarian Blowtorch - I can't get it out of my mind, it's such a powerfully silly phrase. Also,it makes me think of the word blowhard, not that you are one, but it does mean an excessively chatty person - appropriate for a blogger, no?",
      "parent": "0",
      "gravatar_hash": ""
    }
  ]
}