{
  "comment_count": 9,
  "comments": [
    {
      "id": "3911",
      "author": "radish",
      "author_url": "http://www.sassyradish.com",
      "date": "2007-10-24 12:18:01",
      "content": "This looks delicious - i need to do more research on gluten-free bakeries in New York. I know there's a vegan one, but I'm more interested in gluten free... Congrats on your chef apprenticeship - that's terrific!",
      "parent": "0",
      "gravatar_hash": "04341568a39187cf5897aaea878fb272"
    },
    {
      "id": "3912",
      "author": "Rilan2",
      "author_url": "",
      "date": "2007-11-30 19:31:02",
      "content": "I knew Flying Apron before they moved and I am so disappointed in their change.  Reason being they raised their prices big time (and they were already expensive to begin with), and raised their minimum wholesale quantities.  Which together means that many stores have discontinued carrying their products.  Because gluten-free bakeries are an anomaly, and sometimes I don't have the time or desire to cook my own stuff, I overlooked the crumbly consistency of their muffins and other goods and their inconsistent and mediocre quality.  However, since they have passed the cost of their new storefront bakery on to their customers, and raised their prices to ridiculous heights, and since the last few times I've been there their goods have looked good but tasted quite poor, I can now say that I knew Flying Apron bakery when it used to be good, but it is not anymore.",
      "parent": "0",
      "gravatar_hash": "43ce45adb270d88111bacef8496c5443"
    },
    {
      "id": "3913",
      "author": "Linda",
      "author_url": "",
      "date": "2008-02-26 05:40:10",
      "content": "The cake which appears on their special order page is our wedding cake.",
      "parent": "0",
      "gravatar_hash": "b430f3948d524dffffab7581f4e7c8b4"
    },
    {
      "id": "3914",
      "author": "Sandra",
      "author_url": "http://www.myspace.com/sandrasmile",
      "date": "2008-03-29 19:58:35",
      "content": "The first thing I want to say, in case you don't read further is - if you go to the Flying Apron, and love conventional sweets - start with one of the following: 1.) The chocolate/chocolate cupcake, 2.) a chocolate mint cupcake (it's the frosting!), 3.) a peacan cinnamon roll or 4.) one for their oversized pieces of cardamon chai cake. You will not be disappointed! You will loooooooooove it. And the organic Matcha (green) tea is the very best. Try it with almond milk as a latte.\n\nI'm one of those lucky people who can't eat wheat or gluten. Given the fact that baking goodies *used to be* one of my favorite passtimes Flying Apron has saved my life. There are many reasons to eat at this bakery - you don't need to be vegan, or someone that needs to avoid gluten. The ingredients are largely organic, and although they do use cane juice, they also have baked goods created with alternate sweeteners like fruit juice and maple syrup. If you can eat conventional sweets and prefer the taste of things that are sweet in that way try one of the items I mention above. I don't eat a lot of sugar, haha.. not that you can tell by my post - so I like many of their other options that aren't as sweet. If you want a wonderful scone type buiscit, try the Flying Apron (with berries, if they have them).\n\nTo everyone who works there I say thank you! They all know I love them. Oh! And a quick note on the pricing. It may be a little steep but in my opinion it's worth every penny.\n\nHappy sweet discoveries!\n;)\n-s",
      "parent": "0",
      "gravatar_hash": "d0704036f696f44fc1af9d2aebb18643"
    },
    {
      "id": "3915",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-03-31 21:38:44",
      "content": "Well, let me just say, I ate there today and I was pretty sad. Thought I'd try their food too, so I got the \"trio of salads\". Acceptable green salad. Woefully undercooked sweet potato salad. Fairly undercooked roasted beet salad with big sticks of rosemary. Argh. Chocolate cake was ok in a \"I guess for vegan and gluten free not too bad\" way, but definitely not something I'd go out of my way to eat if I have other options. It was a *huge* slice though (for $5.50 so not cheap).",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3916",
      "author": "Liam Edwards",
      "author_url": "",
      "date": "2008-06-29 16:02:42",
      "content": "This place is absolutely awesome.  I'm a pastry fanatic, I've been there several times now, and all I can say is absolutely every molecule of food in that place is straight from heaven.  Best latte in Seattle as well.\nOkay, one time the potatoes in my salad were a little undercooked, but this trifle was quickly forgotten in the midst of an otherwise superb dining experience.  I give it 5 stars, consistently.  There is much to love about this place.",
      "parent": "0",
      "gravatar_hash": "3b74600f93c12bfb5e634441953cfeb4"
    },
    {
      "id": "3917",
      "author": "Dana",
      "author_url": "http://www.noglutenbakery.com",
      "date": "2008-09-05 15:24:24",
      "content": "After coming to terms with the fact I need to start eating gluten-free again, I am always thrilled when I find delicious gluten-free bakeries/products.  Thanks for the 411 on this place, next time I am in Seattle, I'll pop in!  Keep all the great info coming!",
      "parent": "0",
      "gravatar_hash": "57f26da49d06c4103e5871f3e88fe3c1"
    },
    {
      "id": "3918",
      "author": "kimkim",
      "author_url": "http://www.apronshop.co.uk/category/novelty-aprons/",
      "date": "2010-03-29 14:03:13",
      "content": "That photo is awsome, like a dream-world there. Think every one could do with eating better and the best place to start is with your self and then hope others join in.\n__________________________________\n<a href=\"http://www.apronshop.co.uk/category/novelty-aprons/\" rel=\"nofollow\">http://www.apronshop.co.uk/category/novelty-aprons/</a>",
      "parent": "0",
      "gravatar_hash": "7faf04cac03fef923bc24ca6126a4603"
    },
    {
      "id": "937976",
      "author": "rebekah",
      "author_url": "",
      "date": "2014-06-13 15:13:21",
      "content": "There is a gluten free &amp; vegan bakery in new york city called babycakes.",
      "parent": "3911",
      "gravatar_hash": "891e4b96149c0d23617aed486908006a"
    }
  ]
}