{
  "comment_count": 8,
  "comments": [
    {
      "id": "3525",
      "author": "Mel",
      "author_url": "http://www.melbedggood.com",
      "date": "2008-05-12 23:03:34",
      "content": "Wow these look delicious!  No wonder you love the place!\n\nI have to admit I've got a soft spot for Indian sweets! :D",
      "parent": "0",
      "gravatar_hash": "df21ee2df20afa2738dd4a27a7061033"
    },
    {
      "id": "3526",
      "author": "april_d",
      "author_url": "http://www.aprildoodles.com",
      "date": "2008-05-13 14:34:27",
      "content": "Thank you! Thank you! Thank you! for sharing this place.  I can not wait to get down there and taste everything.  It is rare to find a place that makes all the Indian treats and chaat that I love.",
      "parent": "0",
      "gravatar_hash": "3d6cccc0fd9d476f371cd0988d554569"
    },
    {
      "id": "3527",
      "author": "Niamh",
      "author_url": "http://www.eatlikeagirl.com",
      "date": "2008-05-14 08:14:59",
      "content": "OH - YUM! I do love indian food like this. Especially mutter paneer and dosa. This place looks fabulous!",
      "parent": "0",
      "gravatar_hash": "6be58aa1945a3812dd092bd5ccbfa0e6"
    },
    {
      "id": "3528",
      "author": "Hillary",
      "author_url": "http://chewonthatblog.com",
      "date": "2008-05-14 13:42:13",
      "content": "I had an Indian pastry at a restaurant once that looked like one of those. It was a pink square, I wrote about it here: http://chewonthatblog.com/2007/11/30/pabla-indian-cuisine-seattle/\n\nOh yea, we're also having a contest on our blog where you could win a package from Lou Malnati's. <a href=\"http://chewonthatblog.com/2008/04/30/chicago-food-giveaway-contest/\" rel=\"nofollow\">Check it out!</a>",
      "parent": "0",
      "gravatar_hash": "30a98e176497d2665d6ebe4e25a89382"
    },
    {
      "id": "3529",
      "author": "Sarah",
      "author_url": "",
      "date": "2008-05-14 15:22:40",
      "content": "I too recently went to Punjab Sweets and found it to be fantastic.  I am glad to hear you also had a good experience.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3530",
      "author": "pixen",
      "author_url": "http://pixieate.blogspot.com",
      "date": "2008-05-18 12:02:49",
      "content": "OMG... they are so yummy! Better than the ones I ate in my  hometown :(\n\nIn October each year, there's a Taoist influenced celebration called 'Festival of Nine Emperors' where everything served or sold is vegetarian- which made mostly from gluten, wheat, rice, beans,etc with no garlic added! During this time, I love to buy vegetarian cakes made of sesame,green beans,peanuts,etc. The cakes or sweets are wrapped in yellow or white transparent papers (the color of the festival). Devotees would eat vegetarian food for 9 days followed by processions to the sea for cast of offerings until next year. In my hometown, we have many vegetarian restaurants serving from vegetarian pork char siu to noodles to desserts! The only fun time is during the festival mentioned because everywhere you will see road side stalls set up with yellow banners hanged to inform the public of the festival.\nYou must visit this part of continent for the feast... :-)",
      "parent": "0",
      "gravatar_hash": "40435e59bce7a23ff1983642061a3c05"
    },
    {
      "id": "3531",
      "author": "jamie",
      "author_url": "",
      "date": "2008-06-02 18:32:11",
      "content": "yeah, Punjab Sweets is amazing in my humble opinion - I wish they'd open one in Bellevue",
      "parent": "0",
      "gravatar_hash": "1fa2a9431b2b4e6f3e802ad746747534"
    },
    {
      "id": "174019",
      "author": "Spencer",
      "author_url": "http://www.moolollybar.com.au/",
      "date": "2013-07-15 21:29:24",
      "content": "I used to live near Southall in London so I ate loads of yummy punjab sweets when I was there. I wish we could get them in Queensland.",
      "parent": "0",
      "gravatar_hash": "b55e2f7bb5d7b29ad7d793dbdde95a11"
    }
  ]
}