{
  "comment_count": 3,
  "comments": [
    {
      "id": "3655",
      "author": "seadevi",
      "author_url": "http://chtriangle.blogspot.com",
      "date": "2008-04-12 14:39:25",
      "content": "Thanks for organizing this Michael.  I enjoyed comparing notes with other foodies in town.  And it's nice having a timeframe to go visit a particular restaurant (forces me to venture beyond my neighborhood).",
      "parent": "0",
      "gravatar_hash": "4eafcc62d47f8dbeb19850a57348cff5"
    },
    {
      "id": "3656",
      "author": "Joy",
      "author_url": "",
      "date": "2008-04-13 17:01:48",
      "content": "I only recently subscribed to your blog.  I'm a vegan and always interested in relevant food-related info.  I will likely unsubscribe soon.\n\nI really was not expecting to read about octopus or suckling pig.  I don't wish to think about (and therefore visualize) either as food.  Why is a \"Vegetarian Foodie\" reporting on octopus and suckling pig?\n\nI recognize that you did a Round-up.  Perhaps if you had categorized the flesh-eating reviews so as to warn people like me, already assaulted enough with images of meat in the media.  It's unexpected and unappreciated in my opinion.\n\nI apologize if I seem harsh and negative, but you requested feedback and there you are.",
      "parent": "0",
      "gravatar_hash": "377b92e423a57871430e8d6148e15a11"
    },
    {
      "id": "3657",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-04-13 22:35:15",
      "content": "Hi Joy - well, I appreciate your feedback, it is always nice to know what readers are thinking.\n\nFor some reason I've always been the kind of vegetarian that doesn't really mind thinking about other people eating animals. I know it isn't for me, but I figure everyone makes their own choices.\n\nVery few of the restaurants I go to, cookbooks I own, and none of the food mags and shows I read and watch are only vegetarian. I just find I can't learn enough about this subject that I'm so in love with by limiting myself only to the points of view of my fellow vegetarians, even though that is how I choose to eat.\n\nThat said, I think you will find hardly any of the posts on this site mention meat, although of course lots of them talk about dairy and eggs.\n\nThanks again for writing!\n\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}