{
  "comment_count": 8,
  "comments": [
    {
      "id": "22892",
      "author": "Jenny@vegetarianhatesvegetables",
      "author_url": "http://vegetarianhatesvegetables.blogspot",
      "date": "2012-04-16 07:47:42",
      "content": "This looks great, Michael!  A cooking forum I participate in had a long debate about risotto, posing the question: \"Is it worthy of the hype?\"  The answer from most vegetarians was \"no,\" but the omnivores shared an enthusiastic \"Yes!\"  Most of the vegetarians had tasted it at omni restaurants, which are usually pretty clueless about how to make vegetarian food taste good.  The debate made me want to try it and this video makes it look less intimidating.",
      "parent": "0",
      "gravatar_hash": "efd63fa22c1a4cd1b5e1e7c8fc2b99bb"
    },
    {
      "id": "22893",
      "author": "Melissa",
      "author_url": "http://none",
      "date": "2012-04-16 08:07:48",
      "content": "Hey Michael, \nWould it be possible for you to include the written recipe in your video recipe posts? It'd be nice to be able to follow along with the video. Also, it's nice to still be able to read the recipe in my email during the morning and then be able to collect the ingredients and then go home and follow along with your video. Just a suggestion :)\n\nI can't wait for your cookbook to come in the mail!",
      "parent": "0",
      "gravatar_hash": "b33cca673da40073e0a0423148136813"
    },
    {
      "id": "22905",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-16 16:44:06",
      "content": "Hey Melissa - I know, I'm sorry I haven't been including the recipes with the videos.. I simply haven't had time to move them all over, though they are all in the cookbook - except this one! However you can base it on this risotto: https://herbivoracious.com/2009/08/roasted-tomato-and-corn-risotto-recipe.html - simply substituting the broth and using quickly pan-seared fennel for the topping.",
      "parent": "22893",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22989",
      "author": "angela@spinachtiger",
      "author_url": "http://spinachtiger.com",
      "date": "2012-04-18 13:05:49",
      "content": "I'm loving the videos. Would like to see the food closer up as it's being cooked.",
      "parent": "0",
      "gravatar_hash": "813dc67a9d1df4ad31a84c463c10c4af"
    },
    {
      "id": "23140",
      "author": "Vegetarians",
      "author_url": "http://www.sevenpoint2.com/",
      "date": "2012-04-23 01:52:55",
      "content": "You're right Michael, I love the way you make the video recipes because it is easier and interactive. Aside from the balsamic vinegar, would there be another vinegar substitute that would still fit the meal like black fig?",
      "parent": "0",
      "gravatar_hash": "bda7603876252c69c15f63b58a0bf6f0"
    },
    {
      "id": "23190",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-23 09:18:41",
      "content": "Absolutely, if you have a thick/syrupy fig vinegar I think it would be fantastic on this dish. (If you have a thin one, try reducing it with some sugar.)",
      "parent": "23140",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "23209",
      "author": "Caren Roma",
      "author_url": "",
      "date": "2012-04-23 15:09:46",
      "content": "Hey Michael, I was going to make an asparagus and leek risotto tonight for dinner and Scott forwarded this on. Super excited to try it with a touch of fig vinegar on top. Looking forward to seeing you this weekend.",
      "parent": "0",
      "gravatar_hash": "442f51823113fcb7711bef7dd09fb7e9"
    },
    {
      "id": "23211",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-23 15:45:31",
      "content": "I'm looking forward to catching up with you guys in SF too! Fig vin should be great on that.",
      "parent": "23209",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}