{
  "comment_count": 19,
  "comments": [
    {
      "id": "140891",
      "author": "John",
      "author_url": "",
      "date": "2013-04-22 09:01:12",
      "content": "OK. This goes directly on the \"gotta make it\" list. But surely you could go with grilled endive rather than raw -- esp. the cut-in-half-and-grill-face-down-over-high-heat version where the edges cook fast and are almost black, but the center of the leaf is still almost raw and has plenty of stiffness for scooping the hummus. (And the very center \"half core\" is a special treat!)\nIn fact, you could probably do the asparagus on a grill, too. \n\nThe \"hummus\" also sounds like the kind of thing that would keep really well -- a nice midsummer dish where you can do the prep in the cool morning and the eating on a hot afternoon. Yum!",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "140893",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-04-22 09:04:07",
      "content": "Yep, for sure, you could definitely do it with grilled endive, that would be delicious. It would also be nice with a smaller amount of the puree and any kind of salad of mixed raw or cooked vegetables on top. In effect it is a dip, you are just presenting it composed.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "140925",
      "author": "Rachel",
      "author_url": "http://rbnutt.blogspot.com",
      "date": "2013-04-22 11:50:25",
      "content": "This looks delicious. I have never tried a pistachio purée, but I do love a good nut \"hummus,\" as you call it (I agree; nut \"cheeses\" and purées alike always remind me more of hummus or pesto than anything). Will definitely be trying this one.",
      "parent": "0",
      "gravatar_hash": "59d14f01c49c6834e1a183fb26bc9138"
    },
    {
      "id": "140997",
      "author": "Maureen | Orgasmic Chef",
      "author_url": "http://orgasmicchef.com",
      "date": "2013-04-22 15:20:59",
      "content": "Call me anything but late for dinner for this one.  I've only had pistachio puree once and I swore I'd make it again and hadn't thought of it until I saw this post.",
      "parent": "0",
      "gravatar_hash": "3648105a666a70d5e02acb5cba6d5370"
    },
    {
      "id": "141193",
      "author": "Eldan Goldenberg",
      "author_url": "http://eldan.co.uk/",
      "date": "2013-04-22 21:22:00",
      "content": "Definite hit!  I made this exactly as specified, except that I gave the endive about a minute in the oven to warm it without really cooking it, and doubled the pistachio puree so I could keep a lot for spreading on toast.  The one issue I had was that the pistachio puree discolours within an hour or two of exposure to air, so it's worth putting the surplus straight into jars rather than leaving it in an open blender for while as I sloppily did.",
      "parent": "0",
      "gravatar_hash": "546fdfb13d94fbabcda513cbe68c8fb3"
    },
    {
      "id": "141200",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-04-22 21:44:46",
      "content": "That's awesome that you've already made it, and I'm glad you liked! Agree, it does oxidize pretty quickly. I'm lucky to have a vacuum sealer at work, so I put my extra in airless bag, but otherwise yep, jars or any kind of container, maybe drizzle a bit of oil over the top and pat a layer of plastic wrap down right on the surface.",
      "parent": "141193",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "141485",
      "author": "Lynne McMillan",
      "author_url": "http://www.omegathreebenefits.com/",
      "date": "2013-04-24 03:01:37",
      "content": "Wow. This recipe looks so good in pictures, which makes me want to try it someday. Perhaps I need food processor for this one to make the pistachio puree easier. Is there a substitute or alternative ingredient if pistacchio is not available? Where can I get maldon salt? And can I use just an apple cider vinegar if the balsamic vinegar is not available? Thanks for the recipe.",
      "parent": "0",
      "gravatar_hash": "84011f88ae6814b5d6ac29c37e25e1ec"
    },
    {
      "id": "141823",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-04-25 08:15:47",
      "content": "I'm sure it will be good with other nuts - for example there is a delicious Middle Eastern dish called muhammara made with walnuts and pomegranate molasses. No, I wouldn't use apple cider vinegar if you can't get good balsamic - real balsamic is thick, syrupy, and sweet. I'd just skip the vinegar garnish in that case.",
      "parent": "141485",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "141860",
      "author": "Virginia S",
      "author_url": "http://trymaquiberry.com",
      "date": "2013-04-25 12:37:11",
      "content": "Wow that looks good! It actually does not look that hard to prepare, I am going to give it a try. Of course the fact that I love both pistachios and asparagus doesn't hurt, thanks for the recipe.",
      "parent": "0",
      "gravatar_hash": "b0fb414939af2c59c34f5e7f92978f1b"
    },
    {
      "id": "142436",
      "author": "amy@currylime",
      "author_url": "http://www.currylime.com",
      "date": "2013-04-28 08:32:59",
      "content": "Beautiful recipe for a beautiful spring day!",
      "parent": "0",
      "gravatar_hash": "dade4534ba42774757d7b9efe954b8be"
    },
    {
      "id": "145228",
      "author": "Carla @ Gluten Free Recipe Box",
      "author_url": "http://glutenfreerecipebox.com/",
      "date": "2013-05-07 23:49:37",
      "content": "Being half Italian, when I hear pistachio anything, I come running...spumoni ice cream, sorbet, pesto, you name it. I have to try this now! I'm allergic to citrus, but have a work-around using a bit of apple cider vinegar and a pinch of stevia or sugar. Pistachios on now on my shopping list. Thanks!\n\nBTW, I love your blog!",
      "parent": "0",
      "gravatar_hash": "8436f9e162ed68619e740383337db031"
    },
    {
      "id": "149298",
      "author": "Scottsdale dentist",
      "author_url": "http://www.kmansell.com",
      "date": "2013-05-19 17:51:49",
      "content": "Separately, asparagus and pistachios are on the top of my list of favorites, but I never considered eating them together. Your pistachio puree looks tasty and worth trying. Some people say that a serving of pistachios can go a long way to easing indigestion. Its appearance reminds me a bit of organic peanut butter. \n\nDo you suggest if for use with any other vegetables? As of foodie, I like to experiment with new recipes once I get the basics of preparation down.",
      "parent": "0",
      "gravatar_hash": "2965c6b6d15d1e34cdb25ddabfbb0af1"
    },
    {
      "id": "149705",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-20 20:30:47",
      "content": "Sure, I think you could use this with a pretty wide range of vegetables. It would be great as a general dip for crudites, it could be served as the base of a hearty salad, heck I think it would even be good with potatoes. The only thing I wouldn't necessarily do is use it with something that is both special and mildly flavored, as it might overwhelm it.",
      "parent": "149298",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1082132",
      "author": "VegoRules",
      "author_url": "http://thevegetariancenter.com/how-to-be-vegetarian.php",
      "date": "2014-09-19 21:00:52",
      "content": "Just have to wait a couple more months for the asparagus to come into season ... have definitely printed this one out and it will be stored for a semi-good occasion as pistachios are quite expensive here and I'd probably need to have extra!!!!",
      "parent": "0",
      "gravatar_hash": "9069816adc294b90df2bda626b04fd9f"
    },
    {
      "id": "1314271",
      "author": "Laura",
      "author_url": "",
      "date": "2017-02-09 16:35:10",
      "content": "I made this and it was so good! I fell hard for the pistachio cream and have made it several times since to use a spread/dip/bean-free hummus. I usually make 1/2 of the quantity and It works very well in my Blend-Tec blender. I roast fresh, raw pistachios each time I make it and find that it is even better the 2nd day. Thanks for the great recipe!!",
      "parent": "0",
      "gravatar_hash": "c44bfa5f31e4095d85ae3c516b9cef20"
    },
    {
      "id": "1315152",
      "author": "LJ",
      "author_url": "",
      "date": "2022-04-29 13:00:26",
      "content": "Hi,\nLove your blog. Beautiful pictures.\nBut for the life of me I could not find this recipe anywhere to print.\nIf I could get it, I’d make it for a dinner party for vegan guests.\n\nSincerely, \nLuddite in L.A.",
      "parent": "0",
      "gravatar_hash": "6b54794d2102f4100fd4e365b00a6759"
    },
    {
      "id": "1315201",
      "author": "Tully",
      "author_url": "",
      "date": "2022-06-04 05:40:57",
      "content": "I can't see the recipe for this, can anyone help? This looks delish!",
      "parent": "0",
      "gravatar_hash": "d0fc884d9f6bd75dc0f651e406b3330f"
    },
    {
      "id": "1315202",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2022-06-04 06:58:48",
      "content": "Fixed, enjoy!",
      "parent": "1315201",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1315203",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2022-06-04 06:59:14",
      "content": "Fixed!",
      "parent": "1315152",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}