{
  "comment_count": 5,
  "comments": [
    {
      "id": "132276",
      "author": "mary",
      "author_url": "",
      "date": "2013-04-01 15:25:41",
      "content": "Wow, loved this recipe.  I had to make a few changes, I used thin fresh asparagus and cremini mushrooms, the saffron was so pleasing and made the dish.  Since I was making a smaller portion I used only 1 cup of the arborio rice and parmesan for the cheese.  I topped it off with a few shrimp I had left over from dinner yesterday and a fresh chopped tomato with a tiny squeeze of lemon juice.  Thanks for the inspiration!",
      "parent": "0",
      "gravatar_hash": "99d631e89ba6b628b44d74e2db19e19a"
    },
    {
      "id": "132282",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-04-01 15:40:30",
      "content": "So awesome that I just posted it today and you've already made it! That makes my day.",
      "parent": "132276",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "133945",
      "author": "Lawrence",
      "author_url": "http://www.makewinehome.com",
      "date": "2013-04-06 14:53:23",
      "content": "I first tried Risotto after seeing it feature so much on the food programmes.  It never sounded too tasty but then I tried it and have been hooked ever since.\nNot only do I like the taste and the fact that there are so many different ways to make it but the making is so therapeutic.  \nI take it slowly and my mind reflects on a million things.\nSo another one to try.  The cream cheese sounds interesting \nI have saffron but (embarrassed to admit) have never really noticed the taste of it.  Maybe I don't add enough because it is so expensive.",
      "parent": "0",
      "gravatar_hash": "692822b7b458ec0f07ff29633dff37de"
    },
    {
      "id": "134154",
      "author": "The Mistress of Spices",
      "author_url": "http://www.mistress-of-spices.com",
      "date": "2013-04-07 07:08:05",
      "content": "Lovely idea with the watercress puree! And I just happen to have xanthan gum...will have to make some to serve alongside this luscious risotto!",
      "parent": "0",
      "gravatar_hash": "0b0bd5f05e41e767570141f351c17fb0"
    },
    {
      "id": "134560",
      "author": "John",
      "author_url": "",
      "date": "2013-04-08 07:56:26",
      "content": "I liked this idea so much I made it two days in a row. The first time I couldn't find watercress, and didn't have  triple-cream cheese. So I skipped the puree, and used some grated Mahon cheese instead. Wonderful! BTW, if you have a nice tall microwave-safe rice-and-pasta cooker, this can all be done in the microwave. Roughly 4-5 minutes per cup of liquid in my somewhat old microwave. I made the onions and rice in a skillet, added the wine, then added the first cup of stock, and once it was warm, transferred it to the microwave pasta cooker. I could then deal with other aspects of dinner with just a quick stir-and-pour every 5 min. \n\n(I also blanched the peas and asparagus in the microwave. For pinkie-thickness asparagus, about 2.5 min works for me.)\n\nThe second day I had the watercress (but no xanthan gum. I used a little olive oil --  mostly to get it to stop sticking to the sides of my mini-chopper -- and it worked fine). Made for a really nice flavor combination. The balance of the saffron and the cheese seemed exactly right. Another \"Michael recipe\" to go on the short rotation. :)",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    }
  ]
}