{
  "comment_count": 18,
  "comments": [
    {
      "id": "113697",
      "author": "Jenné @ Sweet Potato Soul",
      "author_url": "http://www.sweetpotatosoul.com",
      "date": "2013-02-04 08:12:56",
      "content": "This looks so delicious! I wonder if it would work as well with coconut milk...",
      "parent": "0",
      "gravatar_hash": "ecbfd7cf05cb8055f0de5ba4cac789db"
    },
    {
      "id": "113733",
      "author": "Maria Tadic",
      "author_url": "http://beanafoodie.com/blog",
      "date": "2013-02-04 09:58:08",
      "content": "Like the previous commenter...could you make this with maybe 2% milk or a mixture of 2% and whole?  I generally have trouble only eating one serving of desserts....",
      "parent": "0",
      "gravatar_hash": "6bfe146cf37cb3fae3d830d260bf31d5"
    },
    {
      "id": "113740",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-04 10:13:49",
      "content": "Hey Jenne - nope, I don't think acid will set coconut milk. You could use the same flavors but set it with a starch of your choice (cornstarch or whatever you prefer.)",
      "parent": "113697",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "113741",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-04 10:15:01",
      "content": "Hey, no I don't think this will work with milk instead of cream - the acid will turn it into cheese curds. If you want to do a lower fat version of this dessert, your best bet would be to make it as a traditional starch or egg-set pudding.",
      "parent": "113733",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "114262",
      "author": "Katherine Martinelli",
      "author_url": "http://www.katherinemartinelli.com",
      "date": "2013-02-05 08:33:26",
      "content": "I love posset!! I've only made lemon (delicious, especially topped with passionfruit) but have been meaning to experiment with other flavor combinations. This one definitely jumps out at me!",
      "parent": "0",
      "gravatar_hash": "77cbf18926e13167a62ef95f9dc0f7cf"
    },
    {
      "id": "114367",
      "author": "Jen",
      "author_url": "",
      "date": "2013-02-05 11:49:06",
      "content": "You've inspired me again, Michael!\n\nI'm making this (or a somewhat-reasonable facsimile thereof) for tonight's dessert. Like Maria above, I can't in good conscience consume that much cream in one sitting...too much cholesterol for me! So, I'm making mine with a combination of coconut cream and almond milk and will use either xantham gum or agar agar as a thickener.\n\n(Probably agar agar because it's way more fun to say.)",
      "parent": "0",
      "gravatar_hash": "03805508fde894933855b1c7c55fa6dd"
    },
    {
      "id": "114374",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-05 12:02:21",
      "content": "Nice, let me know how it turns out! Bonus points for photos.",
      "parent": "114367",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "114584",
      "author": "Jen",
      "author_url": "",
      "date": "2013-02-05 18:46:55",
      "content": "Hey, I'm all about getting bonus points!\n\nhttps://twitter.com/jensen2401/status/298972609775824896/photo/1\n\nI need to tweak the recipe a bit but it's worth tweaking. I had some separation when I first made it so I reheated it and added some sodium citrate as an emulsifier. That made it a little salty so I added the toasted coconut as a sweet counterpoint.\n\nUltimately, I used 325g of almond milk and one tin of coconut cream (note that it's cream and not milk!) with 2 g of agar agar and 10 g of sodium citrate. (It's the sodium citrate level that I think needs tweaking.) With those amounts, the yield was four servings.\n\nNow that I know it works, I can pick up the ingredients for the saffron-date pudding!",
      "parent": "114374",
      "gravatar_hash": "03805508fde894933855b1c7c55fa6dd"
    },
    {
      "id": "114609",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-05 19:46:58",
      "content": "Very nice, Jen! I didn't know sodium citrate worked as an emulsifier in non-dairy situations. I'll have to ask Chris about that tomorrow. I've had good luck in a dairy but no egg or gelatin situation using just 0.2% agar (Telephone brand).. here's that recipe in case it helps as you reformulate this: https://herbivoracious.com/2012/10/caramelized-banana-and-buttermilk-panna-cotta-vegetarian-panna-cotta-recipe.html .",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "115002",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-06 11:18:52",
      "content": "Hey Jen -\n\nSo I checked with Chris Young, and he asked an interesting question. Does your coconut cream have any added stabilizers, likely some type of gum? It is possible they are incompatible with the agar and that might have caused the initial breaking you saw. Also, did you use the citric acid from the original recipe too, or no?\n\nThanks,\nMichael",
      "parent": "114584",
      "gravatar_hash": "18b93ab19ab9e4835b8e854e043deb0c"
    },
    {
      "id": "115394",
      "author": "Jen",
      "author_url": "",
      "date": "2013-02-07 11:05:31",
      "content": "I've binned the tin now so can't answer the first question. In retrospect, I was also wondering if the separation might have been caused by the coconut solids coming out of suspension because the agar agar wasn't setting quickly. \n\nI did not use the citric acid as there was no dairy &amp; I assumed the citric acid was modifying the dairy proteins. (That assumption may or may not have any foundation in reality...LOL)",
      "parent": "115002",
      "gravatar_hash": "03805508fde894933855b1c7c55fa6dd"
    },
    {
      "id": "115778",
      "author": "Mark",
      "author_url": "",
      "date": "2013-02-08 11:41:49",
      "content": "Is this essentially un-strained mascarpone?",
      "parent": "0",
      "gravatar_hash": "fe7a4e6cee5a3f7d8fe9cea86ca72d56"
    },
    {
      "id": "115785",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-08 12:26:15",
      "content": "Yes, that's a good analogy - just like making mascarpone except you don't drain off any whey, you just let it set-up undisturbed.",
      "parent": "115778",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "115818",
      "author": "Sara @ The Cozy Herbivore",
      "author_url": "http://thecozyherbivore.blogspot.com",
      "date": "2013-02-08 15:50:00",
      "content": "I've never had/made a posset before, but I'm a total sucker for puddings and custards, so this looks right up my alley. And so easy to make, what a bonus! I confess a giant longing for every panna cotta on every dessert menu, knowing fully that it doesn't jive with my vegetarianism. This looks like the perfect compromise. Love your flavor combinations.",
      "parent": "0",
      "gravatar_hash": "1d5985d7cc6f6858b98242094ff0124d"
    },
    {
      "id": "116147",
      "author": "Zara",
      "author_url": "",
      "date": "2013-02-09 15:38:53",
      "content": "For using milk instead of cream, you could set it with rennet (or \"Vegetarian rennet\") to make a junket, which has the same very delicate set as a posset.",
      "parent": "0",
      "gravatar_hash": "cfa3c7827cb2934b235e7185c8f9cb8e"
    },
    {
      "id": "125929",
      "author": "susan ardis",
      "author_url": "",
      "date": "2013-03-11 04:48:23",
      "content": "Posset is a very Victorian and earlier recipe.   It was served in especially designed pots--called posset pots.  You can see hundreds of them on google images.\n\nvioletdundas",
      "parent": "0",
      "gravatar_hash": "59420e8607615140b65edd0282038415"
    },
    {
      "id": "905542",
      "author": "Dolly",
      "author_url": "",
      "date": "2014-05-12 04:43:02",
      "content": "I would really like to do this dessert but I'm finding it difficult to find Date sugar and Pistachio oil. The only Date sugar I have found is with soya flour and I have also found Date syrup. Could one of these work?\n\nBtw, I live in Sweden.",
      "parent": "0",
      "gravatar_hash": "37ade34e6593000fd3ab0bbafd975de7"
    },
    {
      "id": "905582",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-05-12 05:41:33",
      "content": "I haven't tried, but I think either one can probably work. If the date sugar just has a small amount of soy flour, that probably won't be a problem at all. (Like a few percent.) I'd guess the syrup might just work as is, maybe reducing the amount of cream slightly to offset the additional liquid. You could always try making a half or quarter batch first to see how it goes. If you do it, let us know how it works out!",
      "parent": "905542",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}