{
  "comment_count": 20,
  "comments": [
    {
      "id": "8048",
      "author": "John",
      "author_url": "",
      "date": "2011-12-05 11:15:23",
      "content": "This is going on the must-cook list for later in the week. I'll be using chard rather than beets (same family anyhow!), since it's growing right outside int he garden. I think that I might actually KEEP the stems, cooked just enough to leave a tiny bit of 'crunch'. I'll also use the microwave for cooking the greens -- I end up throwing away less of the flavor that way, although I suppose that with beet greens there's plenty to spare. As for morels...fat chance here in New England in December! But maybe I'll uses one of your suggested substitutes, or one of those single-black-truffles-in-a-can that I've been waiting to use. We'll see...",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "8052",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2011-12-05 11:30:09",
      "content": "Sounds good! I agree, with chard the stems are quite nice.",
      "parent": "8048",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "8189",
      "author": "angela@spinachtiger",
      "author_url": "http://spinachtiger.com",
      "date": "2011-12-05 19:25:43",
      "content": "I wish I could smell it too. I can only imagine. I love to use beet greens in dishes, as I hate to waste food.The morels would be heaven.",
      "parent": "0",
      "gravatar_hash": "813dc67a9d1df4ad31a84c463c10c4af"
    },
    {
      "id": "8354",
      "author": "Vidhya",
      "author_url": "",
      "date": "2011-12-05 23:58:25",
      "content": "Hi Michael, am a newbie to your website and a vegetarian as well! Your website looks great and am looking forward to try out your recipes! Regarding this post on the savory bread pudding- It looks delicious and I can't wait to give it a try- however, we live in Singapore where it's quite difficult to find morel or the other gourmet mushrooms u ve mentioned... Any other easier substitutes? Can i use portobello mushrooms instead? Let me know! Thank you :)",
      "parent": "0",
      "gravatar_hash": "d1d4a2a3ce9dbed8a28ff07c770ecc68"
    },
    {
      "id": "8490",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2011-12-06 07:37:58",
      "content": "Hi Vidhya - yes indeed, you can do this with portobello or even regular cultivated mushrooms, you'll just want to be sure and brown them really well first to extract the liquid and develop flavor. Enjoy!",
      "parent": "8354",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "8707",
      "author": "Vidhya",
      "author_url": "",
      "date": "2011-12-06 17:18:12",
      "content": "Great! Thank you and will let u know how it goes :)",
      "parent": "0",
      "gravatar_hash": "d1d4a2a3ce9dbed8a28ff07c770ecc68"
    },
    {
      "id": "8909",
      "author": "vegetarian",
      "author_url": "http://www.veglov.com/",
      "date": "2011-12-06 21:54:10",
      "content": "looks yummy and delicious! thanks for the great recipe!",
      "parent": "0",
      "gravatar_hash": "f270bc5ac065d878db42b84896b88745"
    },
    {
      "id": "9950",
      "author": "Nilam",
      "author_url": "http://khavanu.blogspot.com",
      "date": "2011-12-08 15:44:58",
      "content": "not usually a fan of bread puddings, but I think your recipe may have made it on my week of meals. I love using the greens from the beets. Perfect.",
      "parent": "0",
      "gravatar_hash": "39a80437f59150fc64ae46179001398a"
    },
    {
      "id": "10585",
      "author": "John",
      "author_url": "",
      "date": "2011-12-10 11:15:00",
      "content": "We made this last night. We made a 1.5x batch, using crimini and oyster mushrooms. The mix of the thicker \"pudding\" portion near the bottom, the crisp-and-toasty bits at the top, and the crunchy bits around the edges was great. And the spicing was just right -- the nutmeg was present but not overpowering; same for the rosemary. I might have increased the smoked paprika just a little.  I skipped the chives (it took a lot longer than planned, and we were HUNGRY, and going outside at 9PM to look for chives just didn't seem worth it), We used \"bright lights\" chard (about 8 leaves) instead of beet greens. \n\n1. We should have used more chard. We cut out the stems, cut the rest into 1\"-wide ribbons, and cut the stems into tiny slices (1/4\" or less). We cooked the stems in the microwave for 2 min, and the leaves for 1 min. If we'd had twice as much chard, the 2 min would have worked; as it was, the stems lost all crunch. Doing it again, I'd cut the stems into 3/4\" long pieces, if only for color. \n\n2. With the scaled-up recipe, we should have cooked it in two souffle dishes; we used one larger dish, and it took about 1:25 to get heated through. (Indeed, I turned down the oven temp part way along to prevent burning the bread on the surface.)\n\n3. It makes a lot of sense to do the combining of bread and onions and greens in a LARGE bowl, and pour the milk/egg mix in there too for the \"soaking up\", and then dump everything into the buttered dish. We started to make it as instructed, but it was clearly going to end up all over the kitchen floor if we persisted. \n\n4, We used whole-wheat sourdough. I meant to get regular sourdough, but I was in a hurry. If I had it to do over again, I'd use regular. \n\nThe general assessment: this one's a keeper! It might even go into the short rotation for the next week or two, until the chard finally dies off when we get a hard frost.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "10734",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2011-12-11 09:41:49",
      "content": "Your version sounds great, and I agree with you - more greens and more paprika are good ideas.",
      "parent": "10585",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "12115",
      "author": "Gourmandelle",
      "author_url": "http://gourmandelle.blogspot.com",
      "date": "2011-12-15 04:45:28",
      "content": "Wow! I will definitely try this! Thank you for this great recipe :)",
      "parent": "0",
      "gravatar_hash": "70d21c39ab6c2b8392c262be075db803"
    },
    {
      "id": "12580",
      "author": "Jill Mant",
      "author_url": "http://www.saucycooks.com",
      "date": "2011-12-16 16:34:22",
      "content": "Yummmm!! And I do believe I can smell this due to your fabulous writing. Now I can't wait to make this recipe so I can actually taste it too!\n\nCheers,\n\nJill",
      "parent": "0",
      "gravatar_hash": "6d1f2354b8d411390aee9ba23b38d202"
    },
    {
      "id": "70124",
      "author": "Sandy",
      "author_url": "",
      "date": "2012-10-28 10:41:08",
      "content": "Wow! I can't wait to try this! I hope our PacNW rains bring chanterelles someday soon. It's still pretty bleak out there, although I think I still have some in the freezer from last year.  I'm going to use plain unsweetened soy milk instead of dairy.",
      "parent": "0",
      "gravatar_hash": "96ab387a73aa57e377402ccf59d6808c"
    },
    {
      "id": "80002",
      "author": "Nicole",
      "author_url": "",
      "date": "2012-11-14 10:17:42",
      "content": "Hi Michael, this looks amazing, but I'm not as much a fan of the custard texture.  Do you think I could prepare this in more of a stuffing fashion by using stock instead of the milk and eggs?  Thank you!",
      "parent": "0",
      "gravatar_hash": "ea6b6365a2f565e32bb8ab3fefa0448a"
    },
    {
      "id": "80005",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-11-14 10:20:58",
      "content": "I haven't tried it, but I don't see any reason it shouldn't be delicious! If you do, please let us know how it turns out.",
      "parent": "80002",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "80007",
      "author": "Nicole",
      "author_url": "",
      "date": "2012-11-14 10:22:07",
      "content": "will do, and thank you!",
      "parent": "0",
      "gravatar_hash": "ea6b6365a2f565e32bb8ab3fefa0448a"
    },
    {
      "id": "80038",
      "author": "cathy",
      "author_url": "",
      "date": "2012-11-14 12:10:33",
      "content": "Any other suggestions I can use instead of morels?\nThey are quite hard to come by in Canada.",
      "parent": "0",
      "gravatar_hash": "0573965c76654211cfaa9a5e75f4b3b4"
    },
    {
      "id": "80261",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-11-14 22:45:59",
      "content": "This would be tasty with chanterelles or porcini (cepes) too!",
      "parent": "80038",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "80588",
      "author": "Sandy",
      "author_url": "",
      "date": "2012-11-15 13:39:07",
      "content": "porcini -- also known as King Boletus in case you have any mushrooming friends out hunting them!  :-)",
      "parent": "80261",
      "gravatar_hash": "96ab387a73aa57e377402ccf59d6808c"
    },
    {
      "id": "81056",
      "author": "cathy",
      "author_url": "",
      "date": "2012-11-16 13:22:44",
      "content": "Awesome. Thank you. There is an Asian grocery store\nin the same mall I work and they have those for sure.\ncan't wait to make this. I have a really good Italian\nRecipe similar to this made with ricotta.",
      "parent": "0",
      "gravatar_hash": "0573965c76654211cfaa9a5e75f4b3b4"
    }
  ]
}