{
  "comment_count": 13,
  "comments": [
    {
      "id": "91",
      "author": "Russell at Chasing Delicious",
      "author_url": "http://chasingdelicious.com/short-sweet-pecan-whipped-cream-cake/",
      "date": "2011-10-10 08:14:57",
      "content": "Yum! What a scrumptious looking rice recipe.",
      "parent": "0",
      "gravatar_hash": "db6f47fbf750ec25a5432690c30b4ec1"
    },
    {
      "id": "92",
      "author": "Curdriceaurora",
      "author_url": "http://profile.typepad.com/curdriceaurora",
      "date": "2011-10-10 08:48:32",
      "content": "I did not read past the first line. Curd rice is not made with Basmati rice.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "93",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-10 09:02:00",
      "content": "Well, you are welcome to your opinion, but lots of people make curd rice with basmati rice. Here are a few examples:\n<a href=\"http://bit.ly/n6W1yu\" rel=\"nofollow\">http://bit.ly/n6W1yu</a>, <a href=\"http://bit.ly/oNmTn1\" rel=\"nofollow\">http://bit.ly/oNmTn1</a>, and <a href=\"http://bit.ly/nsk9Nu\" rel=\"nofollow\">http://bit.ly/nsk9Nu</a>.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "94",
      "author": "Lpande",
      "author_url": "http://profile.typepad.com/lpande",
      "date": "2011-10-10 09:42:47",
      "content": "This has been one of my favorite comfort foods since my parents started me on solids.  It's dynamite with some lime pickle.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "95",
      "author": "Radhika",
      "author_url": "http://justhomemade.wordpress.com",
      "date": "2011-10-11 19:41:42",
      "content": "WoW! Michael, Curd rice is something that I can't do without in my daily meals.. Scallion is an interesting seasoning for Curd rice. Sometimes, when we are too used to eating food a certain way, it is hard to think of it out of the box!\nBTW, curd rice is hardly ever made with Basmati rice :) Short grain rice which you have used by chance is the typical rice of choice for Curd rice in South India... Turning leftover rice to Curd rice is a quite common practice though :)",
      "parent": "0",
      "gravatar_hash": "29c9dbaa92cda56f546b80d2defbe788"
    },
    {
      "id": "96",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-11 19:50:35",
      "content": "Thanks, Radhika! Yeah, I know the scallion is a bit of a departure, I appreciate that you are willing to even contemplate it. I find that many times folks (myself included) get so stuck in a certain way of making a dish they grew up with that it can be very upsetting to think of changing it! And thanks for the info about what type of rice is used, which confirms what curdriceaurora wrote above, though there seem to be counterexamples as well. Just goes to show you how specific local variations can be. You should see how many types of charoset we have to have at my family&#39;s Passover celebration :).",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "97",
      "author": "amee",
      "author_url": "http://www.rabbitfoodrocks.blogspot.com",
      "date": "2011-10-11 20:08:57",
      "content": "wow.  lots of strong opinions on rice grain length here.  Everyone - unwad your undies!  go take a yoga class or something.  We would eat this with Basmati rice, but I personally would eat this with whatever we have on hand.  i love attention to simple dishes.  they often go unnoticed or appreciated.",
      "parent": "0",
      "gravatar_hash": "22476a0ce17918636d3355926c514729"
    },
    {
      "id": "98",
      "author": "angela@spinachtiger",
      "author_url": "http://www.spinachtiger.com",
      "date": "2011-10-12 05:50:49",
      "content": "It's always nice to see a new way to eat what we all love, rice.",
      "parent": "0",
      "gravatar_hash": "813dc67a9d1df4ad31a84c463c10c4af"
    },
    {
      "id": "99",
      "author": "swarna mani",
      "author_url": "",
      "date": "2011-10-14 15:46:44",
      "content": "Nice variation Michael.\nAny kind of rice is ok for curd rice, all it needs is starchy rice.You can even prepare this with well cooked barley.\nSometimes rice is cooked withe extra water so it can be mashed...so that grains are not clearly visible.\n\nI have tried adding grated carrots or chopped cucumbers or green mango. But scallions are a new variation. Will try soon.",
      "parent": "0",
      "gravatar_hash": "49bfc5e273477b9f711b907be1035c22"
    },
    {
      "id": "100",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-14 16:09:05",
      "content": "Thanks, Swarna! I&#39;ve seen pictures of the variations with the rice cooked until broken (almost like a Chinese congee I guess?) but I&#39;ve never tried it as far as I remember. I might have had it on my one evening in Bangalore but that meal was so incredible I can&#39;t even remember all of the components. Do you have a recipe for that version?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "101",
      "author": "swarna mani",
      "author_url": "",
      "date": "2011-10-15 14:04:11",
      "content": "Sure.\n\nTake normal long grain rice.(It has worked best for me)\n\nFor 1 cup rice add 2.5 cups water and cook. If pressure cooker available go for it.\nAfter rice is cooked and when hot add about 1/2 cup milk  and desired salt . Take a potato masher and mash till you get the desired consistency.\nAdd about 2 cups yogurt mix well.\n\nIn a separate pan heat 1 spoon oil, add 1/2 spoon mustard, 1/2 spoon urad dal (optional), a pinch of asoftida or hing.\n\nWhen mustard splutters add it to rice.\nIf consistency is thick add more yogurt or( if sour taste is ur liking) or milk(if less sour is your liking) to get desired consistency.\n\nMix-in Variations:\n(1)\nYou can add finely chopped green chilles/jalapenos for xtra zing. Some chopped cilantro/curry leaves  if you like.\n(2)\nYou can add one or all of  chopped cucumber , grated carrots( say 1/4 cup each for colorfulness). Chopped green mango if you can get it(just scant 2 table spoon).\n\n(3) You can serve it topped with pomegranate fruit bits\n\n(4)You can mix in un-roasted cashews\n\n\nEnjoy!!!\n\nLove your blog.\n\nWaiting for your book.",
      "parent": "0",
      "gravatar_hash": "49bfc5e273477b9f711b907be1035c22"
    },
    {
      "id": "102",
      "author": "raphael",
      "author_url": "http://blaculamarx.blogspot.com/",
      "date": "2011-10-16 12:50:46",
      "content": "ah ghee...\ni'm always looking for ghee recipes\none of those jars lasts quite awhile\nand i love to hear mustard seeds pop\nthank you",
      "parent": "0",
      "gravatar_hash": "72c9ed05578a1079f231d4d7f4a66b70"
    },
    {
      "id": "45815",
      "author": "Smriti Isaac",
      "author_url": "http://Foodsdisaac.posterous.com",
      "date": "2012-08-17 10:26:47",
      "content": "Nice variation on the theme. Two things however: if you had a choice you would not use Basmati; if you had no choice however, you would use anything on hand.  If you do use Basmati you would take care to mash it well. Second and this is more a common practice or technique:  the tempered seasoning goes on top of the curd rice and not vice versa. :) Otherwise, great work for a non-native; keep it up!",
      "parent": "0",
      "gravatar_hash": "04754ffb2faaeeff77a109b0dbb916c2"
    }
  ]
}