{
  "comment_count": 9,
  "comments": [
    {
      "id": "3247",
      "author": "Leslie",
      "author_url": "http://www.three-bowls.com",
      "date": "2008-10-06 09:31:24",
      "content": "I've been reading about epazote for years (my first source was Mexican Light which is a really great cookbook despite the name! and has a good bit of veggie options) but funnily enough never actually found it until I moved from the Southwest to the Pacific Northwest.  I have yet to try the bean thing although Mexican Light recommends much the same for bean-making.  I have a big batch of black beans to get through and will try after that. I will be sure to scramble up some eggs while I've got it!\n\nMy new bean trick has been - per Russ Parsons - dried chipotle peppers cooked with the beans to give them a smokey, also almost meaty flavor.  Have you ever tried both chipotle and epazote in the same batch of beans?  I assume they would work well together but will have to experiment to see if I am right.",
      "parent": "0",
      "gravatar_hash": "a0b16afd28eb241745f3099e5867c748"
    },
    {
      "id": "3248",
      "author": "Cindy",
      "author_url": "",
      "date": "2008-10-06 09:49:24",
      "content": "Epazote is a great herb. I love chopping it and mixing it with corn/onion/peppers. I'll try it with eggs too now. Yum.\n\nEpazote is also very, very easy to grow. It self-seeds like crazy and grows <i>everywhere</i>. It will grow through cracks in the sidewalk if a seed happens to blow in there... really, really easy to grow.",
      "parent": "0",
      "gravatar_hash": "ed0fc8faa5aa6e611b24349120fbf9c4"
    },
    {
      "id": "3249",
      "author": "Alison @ Wholesome Goodness",
      "author_url": "http://wholesomegoodness.net",
      "date": "2008-10-06 10:13:47",
      "content": "Now you have me totally curious.  I wonder if I could track down seeds and grow the herb myself?  I'm on the hunt for more variety in my herb garden next year.  This might be a wonderful experiment.  (Love your blog, by the way.  I found you through The Kitchn, and I look forward to coming back!)",
      "parent": "0",
      "gravatar_hash": "069d6b389387f278ba6656f24d11163c"
    },
    {
      "id": "3250",
      "author": "redman",
      "author_url": "http://www.winewall.blogspot.com",
      "date": "2008-10-06 10:24:55",
      "content": "I concur, this is an awesome herb.",
      "parent": "0",
      "gravatar_hash": "70ef388fbf05eb453271997925a8d650"
    },
    {
      "id": "3251",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-10-06 10:28:20",
      "content": "Leslie - I'm sure epazote and chipotle would be quite compatible. You might have to experiment to find a balance that would allow you to taste both.\n\nCindy - it sounds good with the corn mixture, and thanks for the growing tips.\n\nAlison - well, looks like Cindy has our answer! Thanks for coming by via The Kitchn, they do a nice job.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3252",
      "author": "Hannah",
      "author_url": "http://iheartkale.blogspot.com",
      "date": "2008-10-06 10:58:00",
      "content": "I use dried epazote when cooking black beans, the same way you'd use asafoetida in an Indian recipe or kombu in a macrobiotic recipe--it supposedly helps with digestion.  I've used it with chipotle, but the dried epazote doesn't impart quite as much flavor as the fresh so the chipotle really takes over.",
      "parent": "0",
      "gravatar_hash": "bd1d5c38a95426994aa2235bf3f2558a"
    },
    {
      "id": "3253",
      "author": "",
      "author_url": "",
      "date": "2008-10-08 08:49:22",
      "content": "Ok...I admit it, I have never heard of Epazote .  Now I'm going to have to track it down and try it out.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "3254",
      "author": "PotatoChef",
      "author_url": "http://www.PotatoPatchRecipes.com",
      "date": "2008-10-08 08:50:53",
      "content": "oops.  forgot to sign in with name...\n\nOk...I admit it, I have never heard of Epazote . Now I'm going to have to track it down and try it out.",
      "parent": "0",
      "gravatar_hash": "72a8b649a1406949711e12f0fee7d405"
    },
    {
      "id": "103389",
      "author": "bonnie",
      "author_url": "",
      "date": "2012-12-31 08:38:05",
      "content": "As several people mentioned, epazote is very easy to grow.  Seeds are available from several vendors and nurseries.  As it has grown more popular, some sources also sell plants (possibly the Tilth Edible Plant Sale, held every spring at the Good Shepherd Center in Seattle).  The plants like hot weather (i.e. they don't come up until the weather warms up), and if you let them go to seed you will have more next year.  \n\nThe Hardy Plant Society of Washington (www.hardyplantsocietywa.org) has a seed exchange, and there is usually epazote seed (listed as Chenopodium ambrosioides) available for around $1 per packet.  The seeds are sold at HPSW meetings, at their two plant sales, at the Arboretum Foundation spring plant sale, or contact them directly.",
      "parent": "0",
      "gravatar_hash": "ce7a0fd81c4716d9eb66a63d49bd95d0"
    }
  ]
}