{
  "comment_count": 21,
  "comments": [
    {
      "id": "327",
      "author": "John",
      "author_url": "",
      "date": "2011-06-09 07:12:54",
      "content": "Wow! What a gorgeous photo.\n\nI love the dehydrated corn idea, but I can imagine that a few kernels of *frozen* corn (which I happen to have, inn contrast to the dehydrated stuff) could be pretty darned good as well, providing a nice hot/cold contrast. Then again, I like to eat frozen corn raw, so your mileage may vary.\n\nSince I'm not so keen on olives, I'm trying to think of a suitable replacement. I can imagine a little drizzle of something like cilantro pesto (I happen to have LOTS of cilantro in my garden right now) working, but I'd love any alternative suggestion. The cilantro seems to me to be all \"high notes,\" while the olive-mash has more of a \"bass\" to it  that seems to balance the corn and watermelon.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "328",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-06-09 08:59:44",
      "content": "Hey John - I think the frozen corn idea could be good, especially if you can get it to the table at that perfect point where it is still cold but not rock hard. I&#39;d then want to add something else for crunch, maybe popcorn, pistachio, or cocoa nibs. Cilantro pesto would work well; if I did that I&#39;d probably omit some or all of the other herbs. A dot or two of rehydrated and pureed sundried tomato might be an interesting replacement for the olive. There are definitely lots of ways to spin this! Let me know what you try and how it turns out.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "329",
      "author": "Weber",
      "author_url": "http://weberreview.com/weber-ranch-kettle/",
      "date": "2011-06-09 09:09:39",
      "content": "Thats so strange seeing another comment about the photo, it does look so tasty certainly. I wonder whether this recipe could work on a barbeque. Might have to give it a try. Great variation from the usual stuff.",
      "parent": "0",
      "gravatar_hash": "972c506ed98054bbf0f01df0c0eeb7a9"
    },
    {
      "id": "330",
      "author": "punksocks",
      "author_url": "https://twitter.com/#!/libbyking",
      "date": "2011-06-09 09:54:59",
      "content": "sweet baby cheeses!",
      "parent": "0",
      "gravatar_hash": "97929238a35c5fb4a2cf222962643fdd"
    },
    {
      "id": "331",
      "author": "Tanvi",
      "author_url": "http://thehathicooks.blogspot.com/",
      "date": "2011-06-09 16:28:53",
      "content": "This looks absolutely beautiful!  And deceptively like meat.  I love grilled and cooked fruit but have never tried cooked watermelon.  I love the idea of pairing the sweet and savory.",
      "parent": "0",
      "gravatar_hash": "fbe4607375b0690142ede262e3678a68"
    },
    {
      "id": "332",
      "author": "Cassie",
      "author_url": "http://kitchen--alchemist.blogspot.com",
      "date": "2011-06-10 10:35:43",
      "content": "I usually have an aversion to cooking fruit, since I'd really like to simply eat the fruit... however I'm not that big on watermelon, so this seems like something I would try!",
      "parent": "0",
      "gravatar_hash": "e6802adf23c04a802733dafe4b2aef64"
    },
    {
      "id": "333",
      "author": "Katherine",
      "author_url": "http://www.katherinemartinelli.com",
      "date": "2011-06-10 12:18:23",
      "content": "Stunning photograph. I love grilled watermelon and this looks amazing! In Israel it's common to serve watermelon with Bulgarian cheese (similar to feta) and mint - I might have to try it grilled with a similar combo!",
      "parent": "0",
      "gravatar_hash": "77cbf18926e13167a62ef95f9dc0f7cf"
    },
    {
      "id": "334",
      "author": "lisaiscooking",
      "author_url": "http://lisaiscooking.blogspot.com/",
      "date": "2011-06-10 12:58:25",
      "content": "This looks so cool, I have to try it! I love taking watermelon in a savory direction.",
      "parent": "0",
      "gravatar_hash": "0a9a4542e87845b6596d9c41d7e3c257"
    },
    {
      "id": "335",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-06-10 14:14:39",
      "content": "Thanks, Katherine! I love the watermelon and feta combination too, I think that would be really interesting with this dish, especially if you grilled it and then chilled it.\n\n\n\n\nMichael Natkin\nFind me:\nThe latest from my blog, Herbivoracious:  Seared Watermelon with Flavors of Summer - Yes, That&#39;s Vegetarian - Recipe",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "336",
      "author": "Eric Isaac",
      "author_url": "http://food.ericisaac.com",
      "date": "2011-06-10 15:50:40",
      "content": "i saw the post that you were referring to the other day. Thomas Keller has a very fancy \"steak tartare\" using watermelon in Under Pressure. I'm considering making his version as I have the book but Kelcogel F is like 130 bucks! I like the sound of this version better...at least my bank account does!",
      "parent": "0",
      "gravatar_hash": "9e2d99a68074cf1da7642b5faf3a1853"
    },
    {
      "id": "337",
      "author": "Jun",
      "author_url": "http://indochinekitchen.com",
      "date": "2011-06-11 03:37:58",
      "content": "Whoa! The first time I've heard of seared watermelon! Thanks for sharing! I gotta find a watermelon first.",
      "parent": "0",
      "gravatar_hash": "adc123aceb638790081d032d33a14aad"
    },
    {
      "id": "338",
      "author": "Alex",
      "author_url": "http://3sqmiles.blogspot.com",
      "date": "2011-06-12 05:43:16",
      "content": "Looks fantastic, definitely something to try this summer with a nice bit of Feta.",
      "parent": "0",
      "gravatar_hash": "65f5891df7d1a841168dc32c6e1f6266"
    },
    {
      "id": "339",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-06-12 09:36:31",
      "content": "Thanks, Eric! There is also a watermelon bulgogi in Modernist Cuisine that looks quite amusing/amazing!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "340",
      "author": "nithya at hungrydesi",
      "author_url": "http://www.hungrydesi.com",
      "date": "2011-06-12 20:58:04",
      "content": "This sounds (and looks) amazing...I like to serve a grilled apple and haloumi cheese appetizer...this makes me think it would work well with watermelon too. Or maybe even pari this watermelon with a thin slice of paneer?",
      "parent": "0",
      "gravatar_hash": "3cf25ebcaa3098674f11e97334bdc8f3"
    },
    {
      "id": "341",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-06-14 07:46:57",
      "content": "Hey Nithya - oh yeah, I could definitely see the versions you are talking about. The most common dairy pairing with watermelon is feta, but that doesn&#39;t mean there aren&#39;t other good options to try.\n\n\n\n\nMichael Natkin\nFind me:\nThe latest from my blog, Herbivoracious:  Double Crust Pizza with Broccoli Raab, Ricotta and Caramelized Onions - Recipe",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "342",
      "author": "John",
      "author_url": "",
      "date": "2011-06-14 15:30:22",
      "content": "We made it with a sun-dried tomato sauce AND a (very mild) cilantro pesto, with the nearly-frozen corn kernels, the \"jus\" dribbled around, and the Maldon salt. The pieces were only abour 3/4\" thick, and I think I cooked them 2 min per side, with the result that I got some searing, but the very center was still cool-ish. The results were wonderful -- not oversweet (as I had feared), but instead a lovely balance of flavors and textures and color. The seared watermelon itself is so 'surprising', even though we all knew what it was, that it hardly seemed to taste like watermelon. In that sense, it's a little like the herb-baked cucumber recipe that I recommended to you once before -- a really familiar flavor becomes new when placed in a new context. (BTW, my daughter tells me she had some grilled watermelon at a restaurant in Newport, RI .. so perhaps the word is out!)",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "343",
      "author": "Radhika",
      "author_url": "http://justhomemade.wordpress.com",
      "date": "2011-06-17 22:09:37",
      "content": "Searing watermelon? Forget searing, I'd never thought that something as wet as watermelon had possibilities of browning in any way!\nThe browned (or charred) edges look really cool and make it so tempting..\nAnd, love the reflection in the photograph..",
      "parent": "0",
      "gravatar_hash": "29c9dbaa92cda56f546b80d2defbe788"
    },
    {
      "id": "344",
      "author": "Recipes Club",
      "author_url": "http://www.justapinch.com/",
      "date": "2011-06-19 12:02:40",
      "content": "Beautiful photo! Love the colors! I've never even imagined searing watermelon before.  That's a really clever idea.  And the olive paste makes for a really unique flavor combination.  I'll definitely be trying this one out this summer.  What other unconventional recipes have you come across with summer fruits? I want to venture out a little bit and find some new uses for the stuff in our little fruit garden.\n~Nancy Lewis~",
      "parent": "0",
      "gravatar_hash": "0f49e4bbd903e74ff4819f0f3a11bfc8"
    },
    {
      "id": "345",
      "author": "Mike - At The Table Nutrition",
      "author_url": "http://www.atthetablenutrition.com",
      "date": "2011-06-24 08:21:20",
      "content": "What an interesting thought to sear watermelon!  I wonder if it wouldn't go good with perhaps a berry sauce.  Healthy and beautiful.",
      "parent": "0",
      "gravatar_hash": "2cf6742e6625658a4cf5e8d813597c72"
    },
    {
      "id": "346",
      "author": "Yama",
      "author_url": "http://yamahareviews.net/yamaha-ef3000ise",
      "date": "2011-09-05 13:26:57",
      "content": "I have not long had a new grill pan, will have to get this good looking dish on the go. Not sure if it will look as good as this picture though. Would oil in the pan spoil it a bit, which sort is best to use? Also would any sort of nut go with this?, and I suppose the nut and olive elements just balance out this dish nicely.",
      "parent": "0",
      "gravatar_hash": "5df0d2c985ae6a95d55d188849c2a7ff"
    },
    {
      "id": "347",
      "author": "erinwyso",
      "author_url": "http://olivesfordinner.blogspot.com",
      "date": "2011-09-28 17:53:27",
      "content": "absolutely gorgeous photo and amazing idea ... thanks for sharing!",
      "parent": "0",
      "gravatar_hash": "e8ecb99f7645a800e269c0a423ba249a"
    }
  ]
}