{
  "comment_count": 4,
  "comments": [
    {
      "id": "3797",
      "author": "d.m.",
      "author_url": "",
      "date": "2008-01-03 22:36:07",
      "content": "wow, that is really incredible - congratulations!  i'm so pleased for you.  way to go out (of the internship) with a bang!",
      "parent": "0",
      "gravatar_hash": "facc932377d7fe09d7268f3d54558da6"
    },
    {
      "id": "3798",
      "author": "Barbara",
      "author_url": "http://www.synchronicitycoaching.com",
      "date": "2008-01-04 14:12:13",
      "content": "Hi Michael,\nWhat a great review - I will definitely be eating at Cafe Flora next time I'm in Seattle...seeing as that is not in the near future plans, I may have to convince you to make the \"Green Dumplings in Shitake Broth\" at your computer station at Adobe!\nI took time out of my day to read the whole review and am intrigued by the comment at the bottom about the food critics arriving and eating unannounced - when do you find out who they are? Does that happen the day before the article is published so everyone is frantically trying to read what's been said and anticipate local response?\nThanks for keeping me inspired with food.",
      "parent": "0",
      "gravatar_hash": "35a0844a632079f9c80145caa1fbbe0e"
    },
    {
      "id": "3799",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-01-04 22:55:26",
      "content": "I think they call to give us a heads up that the article is online and will be published the next day. Ideally if a restaurant critic is doing their job well, the restaurants don't know what they look like.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "3800",
      "author": "Lisa",
      "author_url": "http://episcopollyanna.blogspot.com",
      "date": "2008-01-05 12:18:41",
      "content": "That's awesome - congrats! Just came here from the P-I review and your link in the comments. We love Cafe Flora and will have to go check out that dish (sounds yummy)!",
      "parent": "0",
      "gravatar_hash": "2e8bd71758a35e551fad7653689ede8e"
    }
  ]
}