{
  "comment_count": 12,
  "comments": [
    {
      "id": "47682",
      "author": "Yael",
      "author_url": "http://appelsiinejahunajaa.blogspot.co.il/",
      "date": "2012-08-30 06:48:36",
      "content": "I love that first picture! Those pastries look so pretty;and sound so good:)",
      "parent": "0",
      "gravatar_hash": "4252ebe6577d511a7c68c9ba10f94877"
    },
    {
      "id": "47703",
      "author": "Betty Ann @Mango_Queen",
      "author_url": "http://www.asianinamericamag.com",
      "date": "2012-08-30 07:46:17",
      "content": "This looks amazing and is similar to our own version of \"empanadas\" - which Filipinos attribute to the Spanish influence in our food and culture. I was intrigued by the white wine in the pastry. Does the wine have to be chilled when added to the flour? Thanks for sharing this historical background and recipe, Michael !",
      "parent": "0",
      "gravatar_hash": "2f47cf20944759bec2f5c79ae8ee733f"
    },
    {
      "id": "47716",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-30 08:14:23",
      "content": "Hey Betty Ann - As far as I know, the white wine wasn't chilled. I think if you were using it in a butter dough where you are trying to keep everything cold, that would be a good idea, but probably not necessary in this oil dough.",
      "parent": "47703",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "47727",
      "author": "Marina@Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-08-30 08:37:38",
      "content": "Hi Michael, thank you for this post: so informative and interesting. You know, I've been doing the repulgo edges on my pasta and other dough creations for so many years just for fun, and never knew where it came from and what's the name of that elegant edge. Baking for bazaar is a great tradition, would be nice to have it in each community so people can taste the World, share their stories, learn from one another and be friends... :)",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "47843",
      "author": "Laura Winikow",
      "author_url": "",
      "date": "2012-08-30 15:15:55",
      "content": "Thank you so much for posting this...I grew up on Borekas (though we tended toward the savory versions) and now even my Ashkenazi husband requests them for his birthday...I sent this to my many boreka making relatives and a few boreka making friends.  Wish I were up in Seattle for this event!",
      "parent": "0",
      "gravatar_hash": "aea9f796d607360458ff09b445e87de5"
    },
    {
      "id": "48090",
      "author": "Stephanie, The Recipe Renovator",
      "author_url": "http://gravatar.com/reciperenovator",
      "date": "2012-08-31 15:12:41",
      "content": "I love how you shared both tradition, community, and food knowledge in this post. They sound delicious. I just tried making my first-ever ravioli (gluten-free). While it was edible, it certainly wasn't blog-worthy, and I will keep on trying.",
      "parent": "0",
      "gravatar_hash": "ae4ce01b589df3c3c03cde012ebee3d0"
    },
    {
      "id": "48200",
      "author": "Hannah",
      "author_url": "http://www.bluekaleroad.com",
      "date": "2012-09-01 17:16:34",
      "content": "This Bazaar is wonderful and I'm delighted Eli is bringing it back!  Sephardic cuisine is the best - you are fortunate to have recipes and traditions in your family.  And you are so right that you really cannot just follow a recipe, but rather need to learn from someone experienced.  We need to keep these traditions alive!  I had a blast making borekas with a group of Sephardic women for a friend's son's bar mitzvah - my rolling never came close to theirs but I learned a lot!",
      "parent": "0",
      "gravatar_hash": "d0f4f85f5ae47d7807f69af298769edf"
    },
    {
      "id": "48926",
      "author": "Alkaline Mom",
      "author_url": "http://www.sevenpoint2.com/",
      "date": "2012-09-06 05:12:26",
      "content": "I have eaten this when my friend visited my home. She learned the recipe for the cookbook. I am trying to learn how to make this one. Do you have some tips on how to make it simpler to do?",
      "parent": "0",
      "gravatar_hash": "bda7603876252c69c15f63b58a0bf6f0"
    },
    {
      "id": "48930",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-06 05:41:46",
      "content": "Hey A.M. -\n\nNo, really, I don't even feel like an expert on this one myself yet, so no particular thoughts on how to make it simpler. I think this is more one of those labor of love projects :).",
      "parent": "48926",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "49464",
      "author": "Carol",
      "author_url": "",
      "date": "2012-09-09 15:39:54",
      "content": "This was a great event!! I can't wait to try the goodies! I wouldn't have known about it until you posted about it. We definitely came out enriched by the experience and have split 6 kinds of goodies with friends. Thanks for sharing!!",
      "parent": "0",
      "gravatar_hash": "149016d5db895fc9a7a217f16063a2c6"
    },
    {
      "id": "49499",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-09 22:18:58",
      "content": "I'm so glad you came out!",
      "parent": "49464",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "56365",
      "author": "Veggie kids",
      "author_url": "http://www.kidsveggiefood.com/",
      "date": "2012-09-30 10:28:39",
      "content": "Can't wait to try the travados. All them nuts and seeds must make it highly nutritious, full of omega oils, proteins, phytochemicals, minerals... You could forget how good they look, I bet they're super tasty. Thanks again herbivoracious man for sharing great food",
      "parent": "0",
      "gravatar_hash": "4bbf027c76d106db51e69d858296bc4d"
    }
  ]
}