{
  "comment_count": 23,
  "comments": [
    {
      "id": "108990",
      "author": "Kari@Loaves n Dishes",
      "author_url": "http://www.loavesndishes.com",
      "date": "2013-01-21 07:30:10",
      "content": "I love these flavors, and anything with an egg on top has my heart.",
      "parent": "0",
      "gravatar_hash": "3353f69e9e0e2db51355fb2c84cb9c75"
    },
    {
      "id": "108999",
      "author": "Will",
      "author_url": "",
      "date": "2013-01-21 08:06:27",
      "content": "Your comment that sous vide is an \"eminently practical\" technique in the home kitchen is amusing but unsupported by your example. Your recipe for breakfast Shiitake Congee requires two hours to prepare, a highly impractical allotment for all but the 1% who's chefs might rise that early to put this on the table.\n\nIf there are any truly practical applications for the rest of us do share them.",
      "parent": "0",
      "gravatar_hash": "9b944dd28f4103dc347bab08b7e4a9bd"
    },
    {
      "id": "109023",
      "author": "Marina@Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2013-01-21 08:57:15",
      "content": "Shiitake, I forgot all about this mushroom! I did some improvisation of my own, come see it. :) I need to do shopping and get me some shiitake mushrooms, I already have an idea how to use it!",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "109031",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-01-21 09:14:47",
      "content": "Will, that's a totally fair point. This recipe isn't meant to be proof that SV is super practical, it is more of just an experiment. But workaday uses of SV include easy, 100% reliable poached or soft-boiled eggs, the best <a href=\"http://www.chefsteps.com/courses/accelerated-sous-vide-cooking-course/simple-sous-vide-vegetables\" rel=\"nofollow\">blanched-and-shocked vegetables</a> ever (and they hold for days in the fridge), <a href=\"http://www.chefsteps.com/courses/accelerated-sous-vide-cooking-course/red-wine-poached-pear\" rel=\"nofollow\">poached pears</a>, and we are working on recipes for incredibly easy mashed potatoes, etc. We'll be sharing lots more of this stuff on ChefSteps over time.",
      "parent": "108999",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "109208",
      "author": "Brian Douglas",
      "author_url": "http://magnificentlardon.blogspot.com/",
      "date": "2013-01-21 18:09:32",
      "content": "HI all!  I heard Michael threw out the challenge to his readers, so I thought I'd step over and throw down.  The chef steps forum just started our weekly challenge series last week and got some great, but decidedly meat heavy, breakfast dishes.  This week it's vegetarian only.  So while the term sous vide may be strange and frightening to many of you, trust me when I say that words like vegetarian and vegan make some of us feel the same way.  Anyway, let's see what you've got.  An easy home sous vide set up doesn't take any more equipment than a big pot, a thermometer, and some ziploc bags.  That's how I got my start.  I'm hoping to see some entries this week from the Herbivoracious crowd.  I'm also looking forward to your perspective on our dishes, so stop on by!",
      "parent": "0",
      "gravatar_hash": "d396ab0f9a3ff3151b895121929aa0ca"
    },
    {
      "id": "109230",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-01-21 18:59:33",
      "content": "Dude, so awesome that you came by with the words of encouragement!",
      "parent": "109208",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "109693",
      "author": "Annonie Muss",
      "author_url": "",
      "date": "2013-01-23 11:46:48",
      "content": "What a ridiculously patronizing intro here. It's as if you're speaking to a bunch of 4-year-olds. If you truly believe that your readers are scared of foreign words why bother writing at all? What a depressing thought, to think that everything should be addressed to the lowest common denominator. I also think it's foolish to assume that people who read food blogs and are willing to click on a link to a recipe for shiitake congee will not have even heard of sous vide cooking. There seems to be an almost infinite number of priggish prats proselytizing about it these days.",
      "parent": "0",
      "gravatar_hash": "b939b57967a975ae959d95c3cb802e55"
    },
    {
      "id": "109698",
      "author": "Neela",
      "author_url": "",
      "date": "2013-01-23 12:14:45",
      "content": "I just don't like the idea of cooking my food in plastic. However, I love the idea of powdering dried shiitake mushrooms. I'm thinking of making the congee overnight in a slow-cooker and frying the stuffed yuba rolls in the morning as I soft-boil the eggs. This would make breakfast prep faster, Will. \n\nSo, I suppose I'll be missing the point to try sous-vide, but I imagine I'll end up with a yummy breakfast all the same!",
      "parent": "0",
      "gravatar_hash": "20e9122d12d0574ebf03d831b8b21eb7"
    },
    {
      "id": "109699",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-01-23 12:18:12",
      "content": "Oh, no, that will totally work. Really sous vide is incidental to this recipe, at least for the congee - but it does make the best damn poached eggs you'll ever find.",
      "parent": "109698",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "109734",
      "author": "KIm",
      "author_url": "",
      "date": "2013-01-23 15:22:43",
      "content": "I've been getting your emails with recipes since the fall. I don't think you used grams for measurements before. Is this what to expect from now on?",
      "parent": "0",
      "gravatar_hash": "df858af73e951d9b1f1d75dcde4c6026"
    },
    {
      "id": "109736",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-01-23 15:30:33",
      "content": "By the way, re cooking in plastic, we have a resource here: http://forum.chefsteps.com/discussion/15/safety-of-plastics-used-in-sous-vide-cooking",
      "parent": "109698",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "109738",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-01-23 15:32:36",
      "content": "I'm trying to move more in that direction, yes. It is much more consistent, faster, and cleaner... we've got some resources <a href=\" http://www.chefsteps.com/courses/accelerated-sous-vide-cooking-course/weight-vs-volume-speed\" rel=\"nofollow\">here</a> and <a href=\"http://www.chefsteps.com/courses/accelerated-sous-vide-cooking-course/weight-vs-volume-accuracy\" rel=\"nofollow\">here</a>. That said, if enough people find it too frustrating, I'll try to include volume measurements as well.",
      "parent": "109734",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "109802",
      "author": "gourmet michelin recipes",
      "author_url": "http://www.gourmandia.net",
      "date": "2013-01-23 19:11:57",
      "content": "Awesome recipe. Good thing I still have some shiitake. I'm trying this for breakfast tomorrow.",
      "parent": "0",
      "gravatar_hash": "93d129910c27c857fedd70c0f51393ba"
    },
    {
      "id": "110372",
      "author": "Jen",
      "author_url": "",
      "date": "2013-01-25 10:24:10",
      "content": "I am thrilled to see some of the modernist cooking techniques here. After giving me \"Modernist Cuisine at Home\" for Christmas, my spouse was hemming and hawing about buying a sous vide kit as we didn't think I would be using it too much. He ended up getting one and has had some lovely looking meat out of it; I'm excited that I'll be able to use it too...and for congee yet (one of my favourite comfort foods)!\n\nI can't wait to see more of the modernist techniques in future posts!",
      "parent": "0",
      "gravatar_hash": "03805508fde894933855b1c7c55fa6dd"
    },
    {
      "id": "110401",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-01-25 11:16:30",
      "content": "Hey Jen - \n\nNice xmas present! I'm delighted to hear you are excited about using some of these new techniques! And of course come check out what we are doing at <a href=\"http://chefsteps.com\" target=\"_blank\" rel=\"nofollow\">ChefSteps</a> as well - we've got a whole free sous vide video course there, so we'll have lots of ideas for you.",
      "parent": "110372",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "111005",
      "author": "Lorne Marr",
      "author_url": "http://lornesmarr.gather.com/",
      "date": "2013-01-27 09:14:59",
      "content": "Thanks for the inspiring recipe Michael. You seem to be a very creative chef and I'm glad you share your tips&amp;tricks so that also we amateurs can learn a thing or two. I've been living healthy for some time and fresh ideas are always helpful. Although I must say that 2 hours is quite a long total time.",
      "parent": "0",
      "gravatar_hash": "4bdb3ba19fbab4d363a87dff8525f428"
    },
    {
      "id": "112631",
      "author": "Gabby",
      "author_url": "",
      "date": "2013-02-01 12:08:26",
      "content": "Hi Michael, if I were to omit the egg (trying to make this dish vegan) would it drastically change the flavor composition of the dish? In other words, does the egg \"make the dish\"?\n\nThanks!",
      "parent": "0",
      "gravatar_hash": "6049f36fc327ae36c7b0137341547a00"
    },
    {
      "id": "112641",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-01 12:36:45",
      "content": "You could definitely omit the egg, and just add more of everything else. The egg adds a certain richness but it will still be very good without it. Maybe you could add some sauteed fresh shiitakes.",
      "parent": "112631",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "138323",
      "author": "Jerry",
      "author_url": "http://bestvacuumcleanerreviewshq.net/",
      "date": "2013-04-16 13:18:08",
      "content": "I am only a self taught chef but I really like to cook and and try different things. My wife thinks I'm crazy because I cook my butter chicken in my indoor wood fireplace since I don't have a tandoori oven.It makes the chicken really smoky tasting, better than most local Indian restaurants I have tried. I have always wanted to try sous vide. I am going to try and build my own cooker similar to this (http://www.instructables.com/id/Universal-controller-for-sous-vide-cooking/), yes I also like messing with electronics. I will have to try this recipe when I get it built, thanks.",
      "parent": "0",
      "gravatar_hash": "abb1009a9905c3f8c8a09932f26c459a"
    },
    {
      "id": "155216",
      "author": "Jenifer",
      "author_url": "http://cnafly.com/",
      "date": "2013-06-04 23:38:56",
      "content": "Great recipe Michael I never thought of that ! It definitely reflects your creativity as a cook! Btw, is it safe to cook in plastic? Hehe, running out of shiitakes , gotta get some!",
      "parent": "0",
      "gravatar_hash": "56072ef9475cb0a716fd33b64d415f6a"
    },
    {
      "id": "155498",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-06-05 10:30:39",
      "content": "Thanks, Jennifer! Re cooking in plastic, we get that question a lot, so we've got an answer right here for you: http://forum.chefsteps.com/discussion/15/safety-of-plastics-used-in-sous-vide-cooking",
      "parent": "155216",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "166289",
      "author": "JackyS",
      "author_url": "http://vacuumcleanerreviewhub.com",
      "date": "2013-06-27 17:55:19",
      "content": "Shiitake Congee is amazing and healthy! I used half the salt and it still tasted fantastic. I cooked this for my family and it was a major hit. Thank you so much! \n\nJS",
      "parent": "0",
      "gravatar_hash": "c4a2e91f7b4ab4369271b9389cd0db8b"
    },
    {
      "id": "873530",
      "author": "Phoebe Jones",
      "author_url": "",
      "date": "2014-04-06 13:49:31",
      "content": "Here in Vancouver, BC, a commercially produced (product of Singapore) seasoning, called 'Vegetalk vegetarian mushroom seasoning (basically dry mushroom powder/salt, no MSG) is readily available in the Chinese grocery stores.  I had been cooking congee with multi-grain in pressure cooker for awhile with very good result.  I use 2 cups of multi-grains in a large pot of water, pressure-cooked for 40 min. boiled uncovered for another 15 min. seasoned with mushroom seasoning.  Add vegetable (corn, mushroom, tofu etc.)/meat/seafood of your choice.  Make a good breakfast/lunch/dinner anytime.",
      "parent": "0",
      "gravatar_hash": "0658f05f03deb18035d00ea59aa2b710"
    }
  ]
}