{
  "comment_count": 11,
  "comments": [
    {
      "id": "101037",
      "author": "John",
      "author_url": "",
      "date": "2012-12-18 09:59:41",
      "content": "I believe that Sichuan Peppercorns are from the mountain ash tree, or a close relative, and are related to something that native americans called \"toothache plant\", because the buds, when chewed, tend to numb your mouth. I love this effect, but some folks find it weird and unpleasant. Above and beyond this effect is a kind of pungency that's terrific. The one weird thing (given Sichuan food) is that Sichuan Peppercorns are not very \"hot\" (in the sense of \"6-alarm chili\", or scoville units) -- they're more flavorful than hot. Of course, the other chili powder in this recipe addresses that. \n\nRecipe sounds terrific, as usual. Could be especially good in midsummer...",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "101038",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-12-18 10:02:21",
      "content": "Quite right; and sometimes you'll find them already ground and sold as \"Prickly Ash Powder.\" Which, I don't know about you, but I find hilarious.",
      "parent": "101037",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "101053",
      "author": "John",
      "author_url": "",
      "date": "2012-12-18 11:41:15",
      "content": "One more thing: if you want that tingly-electric-numbing feeling, freshness is really important. If you live in New York or San Francisco or Seattle and get your peppercorns from a busy Asian grocery, they'll be great. If you live in Providence, like me, you may find that all bags of peppercorns have dust on them. There's still flavor, but none of the tingliness. For that, I need to go to a busier store, perhaps in Boston or New York.",
      "parent": "101038",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "101716",
      "author": "Donna",
      "author_url": "",
      "date": "2012-12-21 12:18:56",
      "content": "Merry Christmas! I made these and they are fun to eat but I must say the recipe is annoying. Really, 9 grams of zest? Who weights their zest or their oil for cooking. I can see it in baking but not here.  Now that I have a 113 grams of these yummy tongue tingling little goodies, I will go look for more things to do with them!\nThanks,\n\nPS, I skipped all the salt and used salted nuts. I had them on hand! And I used a Puya chili pepper, very hot but I had them. It was to cold to go out.",
      "parent": "0",
      "gravatar_hash": "726419ad367eaa06b39cb5acc1136547"
    },
    {
      "id": "106088",
      "author": "Melissa",
      "author_url": "http://www.etsy.com/shop/TheKitchenImp",
      "date": "2013-01-11 15:12:30",
      "content": "Mmmmmm. Those peanuts sound marvelous. I'll bet they'd be wonderful chopped and sprinkled on a stir-fry. Have you tried them any way in addition to out-of-hand?\n\nI just recently discovered the beauty of Szechuan peppercorns.  One of the wonderful things about them is that one can grind them and only one other spice, or maybe two, and get a tremendously nuanced, deep flavor.  They have sweetness and spiciness and acid all in one place.",
      "parent": "0",
      "gravatar_hash": "e7bff6ce0e60bb045549d30a3c2c4717"
    },
    {
      "id": "106176",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-01-11 23:43:17",
      "content": "I haven't used those peanuts in a dish, but I t hink it is a fine idea!",
      "parent": "106088",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "110977",
      "author": "John",
      "author_url": "",
      "date": "2013-01-27 05:24:19",
      "content": "Wow. These are REALLY good. The blend of the citrus flavor of the orange zest and the salt and spicy stuff is addictive. \n\nSince not everyone has a gram scale lying around, and I'm pretty sure the amounts aren't really critical for this, here's a quick summary of what the amounts I measured looked like: \n\n2-3t Sichuan peppercorns\n2t coriander seed\n1t ancho chili powder \n1 dried guajillo pepper\nzest of half an orange [and the next time I make it, I might increase this to a whole orange]\n2T vegetable oil\n1.5 cups unsalted, dry roasted peanuts\nsalt to taste (I used about 1/2t)\n\n[t = teaspoon; T = tablespoon]\n\nMaybe Michael will say that the difference between 34 and 36 g of vegetable oil makes a difference, but I have a hard time believing it, since probably 25g ended up on the paper towel. :)",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "111002",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-01-27 08:39:07",
      "content": "Thanks, Spike! I like that we are crowdsourcing the volume measurements! \n\nBTW I'm not claiming  that the precision of working by weight is required for this recipe. I also find working by weight to be much cleaner because you don't end up with as many measuring utensils to clean, faster because you just tare & pour, tare and pour, and great when you want to scale a recipe up or down. So much easier to do four times 150 grams then four times 1 & 2/3 cup. All that said, I know a lot of folks aren't ready to make the switch, so I'll try to make a habit of offering both when I have them.",
      "parent": "110977",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "118301",
      "author": "Giri N",
      "author_url": "",
      "date": "2013-02-16 12:40:28",
      "content": "Just made these peanuts. I am addicted to Sichuan Peppercorns. I skipped the orange zest and added a bit of garlic powder. Just delicious.\n\nGram weights were not a problem. I have this <a href=\"http://www.amazon.com/dp/B005QRWEBK/?tag=poeticlicen07-20\" rel=\"nofollow\">Mira Kitchen Scale from Amazon</a>.\n\n\nThank you for the recipe.",
      "parent": "0",
      "gravatar_hash": "243675843add56a131ee45285187ff59"
    },
    {
      "id": "118302",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-16 12:49:24",
      "content": "Glad you like! That is the same scale that we recommend at ChefSteps for home use. Works great.",
      "parent": "118301",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "175709",
      "author": "Joel Sax",
      "author_url": "http://chicagovending.net",
      "date": "2013-07-19 12:26:01",
      "content": "That's weird - I saw these in a vending machine in Narita airport.  They were really good.  The Japanese have really cool snack machines.  20 years ago I was in Okinawa and that was the first time I every saw iced coffee - it was being dispensed in a can.  Now, off course, we have iced coffee everywhere.\n\nThank you for reminding me a out these nuts.\n\nJoel",
      "parent": "0",
      "gravatar_hash": "5de038123da92daa98df0cd8658ff0f3"
    }
  ]
}