{
  "comment_count": 42,
  "comments": [
    {
      "id": "20480",
      "author": "Marina",
      "author_url": "http://www.cowboycountryvegetarian.blogspot.com",
      "date": "2012-02-29 07:34:07",
      "content": "This looks really good, but raisins with spaghetti? I have to trust you on that if you say \" the combination is astonishingly good\". I am not a big fan of raisins in my food. I definitely have to give it a try. Thanks Michael!",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "20484",
      "author": "sweet road",
      "author_url": "http://www.asweetroad.com",
      "date": "2012-02-29 08:16:43",
      "content": "This sounds really delicious! It is a great combination of ingredients and flavors that one wouldn't immediately think to put with pasta, but I'm sure it works well. I do like recipes that incorporate cauliflower... it never gets much attention but it really can taste great!",
      "parent": "0",
      "gravatar_hash": "eec3e0e058b7a2779222b9720b26acd7"
    },
    {
      "id": "20486",
      "author": "arugulove",
      "author_url": "",
      "date": "2012-02-29 08:20:16",
      "content": "Looks amazing.  I've been buying up bags of romanesco at the farmers market all winter and have been looking for new ways to cook it.  I think I'm going to try this recipe with that this weekend.",
      "parent": "0",
      "gravatar_hash": "253d1978cdae80b623ebb342e1426589"
    },
    {
      "id": "20487",
      "author": "ben freedman",
      "author_url": "",
      "date": "2012-02-29 08:20:56",
      "content": "sounds yummy! i think raisins are great with anything! looking forward to making this one!\n\nas always, thanks for all you share!\n\nlooking forward to your book!\n\nben",
      "parent": "0",
      "gravatar_hash": "825a1e4c2a61919d1de8623b92eeed1d"
    },
    {
      "id": "20490",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-02-29 08:29:58",
      "content": "I think what gets us is that in the US we associate raisins as \"kid food\", something to pack for a snack along with peanut butter and crackers or put in oatmeal cookies. You have to try and look at them with fresh eyes as something with an intense, complex, fruity, tart and slightly sweet flavor that has a broader range of uses.",
      "parent": "20480",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "20513",
      "author": "Joanna",
      "author_url": "",
      "date": "2012-02-29 11:24:34",
      "content": "How funny, I was already planning on making a similar cauliflower-with-pasta dish for dinner tonight! (from this recipe: http://www.tastingtable.com/entry_detail/chefs_recipes/3027/An_Italian_virtuosos_unexpected_pasta.htm)\n\nI think maybe I will combine the 2 recipes -- keep the olives and breadcrumbs from the other one, but add the fennel seeds and pine nuts from yours. I'll admit I'm still a little on the fence when it comes to the raisins but maybe I will give it a go.\n\nAnd I can't wait for your book!!",
      "parent": "0",
      "gravatar_hash": "162fb33db8c91df1cb51af7780965c65"
    },
    {
      "id": "20519",
      "author": "Vegetarians",
      "author_url": "http://www.sevenpoint2.com/",
      "date": "2012-02-29 13:20:01",
      "content": "I must say, lovely caramelized color on the cauliflowers. The recipe looks simple to make as well, should be trying this out within the next few days. Do you think its' safe to add some mushrooms(love them) to the dish without altering the taste much?",
      "parent": "0",
      "gravatar_hash": "bda7603876252c69c15f63b58a0bf6f0"
    },
    {
      "id": "20521",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-02-29 13:31:43",
      "content": "I don't think adding mushrooms will ruin the dish in any way, but I would say I don't think of them as a perfect fit with the rest of the flavors. But what I think doesn't matter! If it sounds good to you, I absolutely think you should try it.",
      "parent": "20519",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "20541",
      "author": "Marina",
      "author_url": "http://www.cowboycountryvegetarian.blogspot.com",
      "date": "2012-02-29 19:30:58",
      "content": "Thanks Michael. I will give it a try. I don't associate raisins with kids food. They are just too sweet for me. I've tried some middle eastern raisins, they wold add that perfect flavor for sure. I need to shop for some very good raisins. Where is Uwajmaya? Or PalDo? Or Mayuri Foods? We lived in  Bellevue, in Crossroads area, and I could walk to any of those stores for the perfect ingredient...",
      "parent": "20490",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "20580",
      "author": "Jenny@vegetarianhatesvegetables",
      "author_url": "http://vegetarianhatesvegetables.blogspot",
      "date": "2012-03-01 09:55:40",
      "content": "There was a couscous salad at Trader Joe's that I adored, and it had raisins in it.  My friend wanted to try it until she saw the raisins.  It's kind of sad how we limit ourselves.",
      "parent": "0",
      "gravatar_hash": "efd63fa22c1a4cd1b5e1e7c8fc2b99bb"
    },
    {
      "id": "20581",
      "author": "Katherine Martinelli",
      "author_url": "http://www.katherinemartinelli.com",
      "date": "2012-03-01 09:57:36",
      "content": "I do love this unique Sicilian flavor combination and it looks incredible paired with your pasta here. Congrats on the upcoming cookbook!",
      "parent": "0",
      "gravatar_hash": "77cbf18926e13167a62ef95f9dc0f7cf"
    },
    {
      "id": "20582",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-01 10:00:25",
      "content": "Raisins do seem to be on a lot of people's hate list. Along with, hmm let's see... cabbage, mayonnaise, brussels sprouts, kimchi.... I love 'em all but I know many people don't.",
      "parent": "20580",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "20585",
      "author": "Adam Tracey",
      "author_url": "",
      "date": "2012-03-01 10:47:53",
      "content": "I make this regularly with a few tweaks - swap capers for a few anchovies (or anchovy oil), add sundried tomatoes and top with toasted breadcrumbs - which is perhaps a good alternative for those that don't eat cheese. I also sometimes add a minced onion. \n\nI find golden or sultana raisins work best in this dish.",
      "parent": "0",
      "gravatar_hash": "f0133129938a8bc1384bc791d0add37b"
    },
    {
      "id": "20674",
      "author": "Elva @ Gluten Free",
      "author_url": "http://simplygluten-free.com",
      "date": "2012-03-03 01:15:50",
      "content": "i gotta try -roasted cauliflower. once again, you’re a genius!!!",
      "parent": "0",
      "gravatar_hash": "fa2acb03a6a5eb5fae35541189325733"
    },
    {
      "id": "20764",
      "author": "Johan",
      "author_url": "",
      "date": "2012-03-05 00:53:36",
      "content": "Michael, you've captured the heart of Sicilian cooking with this sweet-nutty-savoury combination. Well done! I remember a similar pasta from the New York Times some years ago (which has now become a family favorite)- pinenuts, chopped parsley, raisins, olive oil, and flaked roast chicken brushed with smoked paprika- somehow the raisins always add to the balance of the dish. Using cauliflower instead makes the meal healthier and cheaper without any loss of flavour.",
      "parent": "0",
      "gravatar_hash": "7078f1949c004ed1a945d3598b655bd5"
    },
    {
      "id": "20922",
      "author": "Stephanie",
      "author_url": "",
      "date": "2012-03-06 18:51:59",
      "content": "Hey Michael,  I made this tonight, except that I forgot the capers (bummer) and threw in some baby collards that were in my CSA share (which worked fine for me).  It was very good and a nice change from the tomato based sauces that tend to be the pasta fall back position.  I used golden raisins, and as I ate it, I kind of wished for a squeeze of lemon along with the orange, but it was good enough that I didn't bother to get up to go to the kitchen and get the lemon :) Thanks for another great recipe!",
      "parent": "0",
      "gravatar_hash": "18112fefe795ff5109254e3866db1b66"
    },
    {
      "id": "20923",
      "author": "The Cozy Herbivore",
      "author_url": "http://thecozyherbivore.blogspot.com",
      "date": "2012-03-06 18:59:32",
      "content": "Wow, I love these flavor profiles. I'm always looking for fun things to top my pasta, and this looks like the next thing I'll try! Congrats on the cookbook, by the way!",
      "parent": "0",
      "gravatar_hash": "1d5985d7cc6f6858b98242094ff0124d"
    },
    {
      "id": "21340",
      "author": "Dean",
      "author_url": "",
      "date": "2012-03-12 03:30:19",
      "content": "I cooked this the other night and it was fantastic. I'm not sure the pinenuts are doing enough work taste wise so I would leave them out given they're quite expensive. The parmesan doesn't do much either. On the other hand, I did omit the parsley and I think it really needed it to round the taste off.\n\nI love mushrooms too but their texture won't fit this dish at all well I don't think.",
      "parent": "0",
      "gravatar_hash": "ac26d450eafdee4726e6197ca09dc89b"
    },
    {
      "id": "21732",
      "author": "Becky",
      "author_url": "http://archaeonerd.blogspot.com",
      "date": "2012-03-21 14:17:56",
      "content": "This was absolutely delicious, and the flavors were unexpected and really vibrant. Thanks so much for the recipe!",
      "parent": "0",
      "gravatar_hash": "f956b9a61df914d684eba9079387e602"
    },
    {
      "id": "22216",
      "author": "John",
      "author_url": "",
      "date": "2012-03-29 11:06:54",
      "content": "I agree completely with Becky: unexpected, vibrant, and a delicious combination. I was uncertain (since I'm not a big fan of fennel to start with), but the mix was really delicious. My only suggested change was that next time, I might go with smaller pieces of cauliflower, to allow a little more browing, and maybe slightly better mixing. We all really wanted to take bites that had a bit of everything, but the large cauliflower bits made that more difficult.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "22230",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-29 18:02:21",
      "content": "You know, I totally agree with you. I should have called for the cauliflower to be bite-sized. Alright, first item for the cookbook errata page!",
      "parent": "22216",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22258",
      "author": "LSK",
      "author_url": "http://lovelysunnykitchen.blogspot.com",
      "date": "2012-03-30 08:13:34",
      "content": "I love the site!\n\nIt proves that vegetarians too can be decadent diners. \n\nI've just started my own vegetarian food blog at http://lovelysunnykitchen.blogspot.com",
      "parent": "0",
      "gravatar_hash": "3d54f441b53580d6cbb2e38e1cf7d2d0"
    },
    {
      "id": "22972",
      "author": "Jana",
      "author_url": "",
      "date": "2012-04-18 07:05:57",
      "content": "I'm new to this site, and this was the first recipe I tried. It was excellent! After tasting it, my 6 year old daughter commented that the dish belongs in a fancy restaurant. Thanks for sharing!",
      "parent": "0",
      "gravatar_hash": "908bad85e2762481ec4d659cdfa98970"
    },
    {
      "id": "23003",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-18 18:13:56",
      "content": "Awesome! I love it when the kids think we are cool ;)",
      "parent": "22972",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "24946",
      "author": "Pekka",
      "author_url": "",
      "date": "2012-05-26 13:15:04",
      "content": "I didn't have all the ingredients (no fennel seeds and pine nuts in striking distance) but I decided to do it anyway today. It's easily one of the most intriguing dishes I've ever made. The sweet-spicy-bitter combination is really like nothing I've tasted before. I'll make it a little bit less lemony and more orange-y next time, and I'll make sure I have the seeds and nuts - I understand now why they're important. :) But either way, it's a work of genius!",
      "parent": "0",
      "gravatar_hash": "100a6c42a31a56e882475725d65537f8"
    },
    {
      "id": "25104",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-27 19:38:26",
      "content": "I'm glad you tried it even without having every single ingredient! That same treatment can be used just on cauliflower without pasta as well, as more of a side dish.",
      "parent": "24946",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "37861",
      "author": "Bruce Bowman",
      "author_url": "",
      "date": "2012-07-15 17:36:53",
      "content": "Has anyone tried this with other types of pasta, like penne, or angel hair? I love this dish and have made it often, so just wondering if other pastas work well too.",
      "parent": "0",
      "gravatar_hash": "7619b79bc6677dd0076637ca6c0ee595"
    },
    {
      "id": "38069",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-16 09:51:31",
      "content": "Hey Bruce - there are no fixed rules about which pasta shapes go with what other ingredients. Generally with a thinner sauce you want something with nooks and crannies to hold onto it. This particular dish is pretty sauceless, so not a crucial concern. I think angel hair might feel too delicate with the big chunks of cauliflower; penne sounds good to me. But don't be afraid to experiment with any shape you like!",
      "parent": "37861",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "51528",
      "author": "Spargo",
      "author_url": "",
      "date": "2012-09-15 17:45:48",
      "content": "Came across your website today for the first time and decided to make this for dinner.  DELICIOUS!  Loved the unique combinations of ingredients.  Will definitely be trying more of your recipes.",
      "parent": "0",
      "gravatar_hash": "2db36e184b64d87861c62db723ddd649"
    },
    {
      "id": "55476",
      "author": "Victoria",
      "author_url": "http://www.victoirasilver.com",
      "date": "2012-09-27 19:42:58",
      "content": "Just wanted to say thank you for this amazing original recipe!  My fussy husband LOVED it.  Can't wait to make again....next time for a family dinner maybe accompanied with fresh grilled swordfish and a nice salad.....perfection!",
      "parent": "0",
      "gravatar_hash": "0d23ac378120f364e9912363103b2a6e"
    },
    {
      "id": "112577",
      "author": "Rita",
      "author_url": "",
      "date": "2013-02-01 08:28:54",
      "content": "Hi, Just tried this recipe and overall it came out great, very adaptable, with a really nice combination of flavors.  I did have a minor problem, though, with the sliced garlic, which stayed on the bottom of the pan throughout and got dark brown very quickly--by the time the cauliflower was done the garlic was close to being burned and getting a little bitter. I used a cast iron skillet because it's so good for browning, was it maybe a little too good?  I don't see from the comments that anyone else had this problem, and the dish was still very tasty, so maybe the garlic is just supposed to be \"well done\"?  Anyway, thanks so much for a \"keeper\" recipe.",
      "parent": "0",
      "gravatar_hash": "2002fd44744c9f3bedffbce824d536bc"
    },
    {
      "id": "112604",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-01 10:16:54",
      "content": "Hi Rita - \n\nThat's a good point. If the \"well done\" garlic bothers you, you could add it later. What I sometimes do when I have that problem with other dishes is push some of the food towards the side, add a bit more olive oil and cook the garlic in that spot for a few seconds before stirring it through - just a minute or so before finishing the dish.",
      "parent": "112577",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "119032",
      "author": "Miri Lewis",
      "author_url": "http://miri-thegreatcookeryadventure.blogspot.co.uk/",
      "date": "2013-02-18 07:51:50",
      "content": "This looks amazing! I am definitely going to be makign this one. I love the use of Raisins/ pine nuts/ capers in savoury dishes - I know it can sounds scary but sweet and salty is a fantastic and fulfilling combination. The 'Pizza Express' restaurant chain in the UK puts them on a pizza together with olives and onions I think, and it's amazing. Is it easy to get vegetarian parmesan style cheese in the US? It is pretty much impossible over here :(",
      "parent": "0",
      "gravatar_hash": "ea793db1dd704c8d5f70dc6c35f34c0b"
    },
    {
      "id": "119033",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-18 08:02:23",
      "content": "Thanks, Miri! And yes, there are several pretty tasty brands of \"parmesan\" made with vegetarian rennet available here.",
      "parent": "119032",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "567668",
      "author": "jodie",
      "author_url": "",
      "date": "2014-01-14 10:53:10",
      "content": "Thank you Michael, for a new addition to my \"I really love cauliflower...now\" recipes!  Hated it as a kid, but now devour it.  I made this sans pasta, because ...well just because!  Instead of roasting in a pan, I put it in a 400 degree oven for about 25 plus minutes.  Added everything else and uh plumped my raisins in a little cream sherry...well because!...Anyway, the whole recipe is really put together beautiful and I very much am noshing out on it.  I miss Seattle, my old home town!",
      "parent": "0",
      "gravatar_hash": "fff1956f4530db39b1b52a8fc55a244f"
    },
    {
      "id": "567718",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-01-14 10:59:35",
      "content": "We love a nice oven-roasted cauliflower in our house too... often cook it til is is just short of burned and then eat it with nothing more than good salt.",
      "parent": "567668",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314022",
      "author": "John",
      "author_url": "",
      "date": "2015-08-24 04:03:11",
      "content": "My son now makes this dish at a moment's notice, but (because he doesn't like raisins), we treat several of the ingredients as \"add-ons\", with a dish of plumped raisins, a dish of parsley, a dish of shaved parmesan, etc., all sitting on the table. The big win? Instead of just a dish of capers, he puts out a dish of shallow-fried capers (recipe: heat 1/8\" of oil in a pan. Fry capers until crisp; dry on a paper towel. Serve promptly, esp. in humid weather.) instead of just capers-from-the-jar. These add a wonderful crunch and an intensified flavor to the dish that just can't be beat. (And boy, does he outdo his college buddies, whose culinary skills range from hamburgers to pasta-with-red-sauce-from-a-jar and back!)",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "1314023",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2015-08-24 06:55:29",
      "content": "That's awesome that you found a way to make it work for the whole family. I'm a big fan of fried capers too, I learned about them as part of the Caesar salad at Cafe Flora, but I never thought to use them in this dish. Nice!",
      "parent": "1314022",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314490",
      "author": "Shannon",
      "author_url": "",
      "date": "2018-02-04 22:25:04",
      "content": "I’m going to make this in a couple of days - it looks great! One question: can you tell me how much you mean (in volume or weight) by one head of cauliflower? I’ll be using romanesco that I happen to have in the fridge.",
      "parent": "0",
      "gravatar_hash": "e0a124ee4ccbdcc60bf1403fec858cd3"
    },
    {
      "id": "1314491",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2018-02-05 19:35:33",
      "content": "Hi Shannon - I haven't made this in awhile, but if you just go to the store and buy an average sized head of romanesco, you will be fine. If it seems giant, use a bit less, and if it seems tiny, use 1.5.",
      "parent": "1314490",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314495",
      "author": "Shannon",
      "author_url": "",
      "date": "2018-02-09 12:51:03",
      "content": "Thanks for your reply. This recipe was a big hit with our family - including my 7 year old son!  I love it when sophisticated flavor combinations are also kid-friendly.  I will definitely be making this again. Next time I would plan to either increase the amount of cauliflower/romanesco (I used a smallish head plus a quarter of another), or only make 12 oz of pasta instead of a full pound....although that would be a shame since the leftovers are also delicious. i'm also imagining a summer version where the cauliflower is replaced by eggplant - wouldn't that be delicious?",
      "parent": "0",
      "gravatar_hash": "e0a124ee4ccbdcc60bf1403fec858cd3"
    },
    {
      "id": "1314496",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2018-02-09 13:41:35",
      "content": "Glad you liked it, and yes eggplant sounds great!",
      "parent": "1314495",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}