{
  "comment_count": 86,
  "comments": [
    {
      "id": "21836",
      "author": "Kathy - Panini Happy",
      "author_url": "http://www.paninihappy.com",
      "date": "2012-03-22 10:47:19",
      "content": "Thanks so much for sharing all of your fascinating insights on staging. It's a pipe dream of mine to give this a try one day - wonder if I have it in me. :-)",
      "parent": "0",
      "gravatar_hash": "3173541fef2db6b40f403784d5c76724"
    },
    {
      "id": "21838",
      "author": "RLB",
      "author_url": "",
      "date": "2012-03-22 11:53:38",
      "content": "This makes filing reports in triplicate seem so much more appealing. :)",
      "parent": "0",
      "gravatar_hash": "9eca23b634740948002e7ffea4706087"
    },
    {
      "id": "21844",
      "author": "Nilam",
      "author_url": "http://khavanu.blogspot.com",
      "date": "2012-03-22 12:38:42",
      "content": "In college for my undergrad in nutrition, we had to take a commercial food production class, where we rotated among every aspect of commercial food prep. Our prereq was 2 food science courses with their labs. At the time, I thought it was a total waste of time and labor (we ran a once per week nutrition \"restaurant\"), Little did I know how useful and amazing this chance was and how much I learned from it.  \n\nWhat a great and useful post!",
      "parent": "0",
      "gravatar_hash": "39a80437f59150fc64ae46179001398a"
    },
    {
      "id": "21910",
      "author": "ellen",
      "author_url": "",
      "date": "2012-03-23 07:22:27",
      "content": "Thanks, Michael. I've been thinking a lot lately about my 3 kids and their eventual transition into the workforce, and it struck me as I was reading this that your excellent advice transcends the specifics of being a stage in a professional kitchen, and is kind of a template for embarking on any kind of new work.",
      "parent": "0",
      "gravatar_hash": "7692604ece62c2b568d6cb89ab0be0f2"
    },
    {
      "id": "21913",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-23 07:49:17",
      "content": "It is so true. I always think the same thing when I read Shuna's stuff (that I linked to above). The specifics may be different, and the kitchen may be more hierarchical than most workplaces, and more demanding in some ways, but the keys to being successful and getting the most out of any situation are really the same everywhere.",
      "parent": "21910",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21948",
      "author": "Jana",
      "author_url": "",
      "date": "2012-03-23 18:19:02",
      "content": "So...wicked...true.  All of it.  Thank you.  This should me required reading in culinary schools.",
      "parent": "0",
      "gravatar_hash": "3243865f4eb08ad6add6c0f99b6b7853"
    },
    {
      "id": "22059",
      "author": "Bruce Bowman",
      "author_url": "",
      "date": "2012-03-26 16:09:05",
      "content": "Thanks for this Michael, very interesting, and the timing is perfect, as a friend of mine just finished at the French Culinary Academy and is considering this very thing. -Bruce",
      "parent": "0",
      "gravatar_hash": "7619b79bc6677dd0076637ca6c0ee595"
    },
    {
      "id": "22067",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-26 19:33:21",
      "content": "Good timing! If you show it to them, I'd be interested to hear what they they think.",
      "parent": "22059",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22087",
      "author": "Phoebe",
      "author_url": "",
      "date": "2012-03-27 06:54:17",
      "content": "Michael, what an inspiring, generous guide to staging -- so helpful, thorough, and eminently practical.  Thank you so much for taking the time to write this post!  I have no current plans to stage but I really agree with the comments above: that this is more than a post about staging per se-- you've offered genuine insight into how to make the most of an early apprentice experience in any highly desirable, highly competitive field.  Thanks again!",
      "parent": "0",
      "gravatar_hash": "9abef0a5542cebbb31b8ecec750bb816"
    },
    {
      "id": "22243",
      "author": "Charul Ajmera",
      "author_url": "http://www.tadkamasala.com",
      "date": "2012-03-30 01:28:00",
      "content": "Hey Michael, came here from Veggie Belly, and so glad that I found this post. I always wanted to work in a restaurant but was not sure whether they would take me or not considering that I do not have any qualification in that respect. But this post has left me with some more hopes in that direction. Thanks a lot for those. :)\n\nPls do visit my blog www.tadkamasala.com (whenever possible) and let me know what you feel. Your comments would mean a lot.",
      "parent": "0",
      "gravatar_hash": "5cb712d919ff3d1f4bffb17bf3a21bac"
    },
    {
      "id": "22254",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-30 07:53:59",
      "content": "Thanks, Charul! That is the great thing about restaurants - hard work and a good attitude can allow just about anyone in the door to get a tryout, as long as you are willing to work your way up. I checked out tadkamasala, it is very cool. I like the way you did the homepage especially, I've never seen anything quite like that. I'm very visual so it appeals to me. Your dum ghobi looks great!",
      "parent": "22243",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22535",
      "author": "Diego Cervantes",
      "author_url": "",
      "date": "2012-04-07 07:28:52",
      "content": "I had a stage trial today, the problem is that i had just moved from another city and hadn't brought my knifes or chef clothing with me, the stage was going to be from 8-4pm and I called the chef at 7am to let him know my situation and told me that we can try this next week. I feel dissapointed that I couldnt start today. Could this ruin my opportunity?",
      "parent": "0",
      "gravatar_hash": "93fe1ad108881d3d2b847324de40b1e5"
    },
    {
      "id": "22538",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-07 08:18:42",
      "content": "Hopefully not... obviously it isn't ideal to not be able to follow through on your commitment on the first day. Some chefs would probably have just said \"forget it then\", so the fact that this one is willing to wait a couple days seems to indicate that they are still going to give you a chance. So show up early and fully prepared on the day you re-agreed to and kick ass and it may still work out. And if not, find another restaurant and try again!",
      "parent": "22535",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22539",
      "author": "Diego Cervantes",
      "author_url": "",
      "date": "2012-04-07 09:08:53",
      "content": "Another question.. Im a Culinary Arts/Baking and Pastry Arts student , but no experience in any restaurant.. since I was not succesful at landing a job as a prep cook or Line cook I was willing to take any position even as a dishwasher in a newly open French restaurant and I did.. In My mind I was looking forward of moving my way up like other chefs have done.. I don't like to mention racism because I dont even want to believe it exist..but at the moment I arrived my first day there were a pile of dishes from the previous dishwashers that had quit the first day 2 of them and that restaurant had been opened 2 days.. I took my my job seriously and immediately started doing my job... there wasn't a system set up yet and I noticed I needed extra help at least for the 2-3 busy hours.. but I didn't complain.. what I did suggested were more racks for extra storage because I wasnt able to continue my flow and I couldnt' finish alll the dishes by the end of the day.. for 8.5 hours I have not even taken a restoom break or any break at all .. I asked the manager if I could come in earlier the next day to organize and finish since the restaurant is open from 5-10pm.. he said \"no just come in at 4pm\" the next day I planned on organizing and setting up a system where I can communicate with the bussers, waiters and bartenders so that we can work together on where the y needed me or I needed them to place dishes and pans ..etc ..started working more efficiently but again when it got busy nobody cared and everything got piled up again.. still no extra storage... and again i couldn't finish so the schef at the end came up to me and asked \"why so many dishes\" so I explained.. he didn't say anything and told me it was closing time and said \"Señor! you need to finish tommorow before closing!\" and spoke to me in Spanish as if not he will hire someone else.. I will continue my job today but what can I do?..Just keep my head down? I know I could get faster by time but they haven't done their part by adding another dishwasher or extra racks.",
      "parent": "0",
      "gravatar_hash": "93fe1ad108881d3d2b847324de40b1e5"
    },
    {
      "id": "22552",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-07 19:40:28",
      "content": "Hey Diego -\n\nI have a few thoughts here, and I'll also see if I can get some folks with more industry experience than me to weigh in.\n\n(1) To me, it sure sounds like the chef made an assumption based on the color of your skin that you didn't speak English. That's obnoxious. It is true that there are certainly a lot of non-English speaking dishwashers in the industry, but that had to feel crappy when you've made a conscious choice to try and work your way up from the dishroom and the first thing you face is that kind of assumption.\n\n(2) It is entirely common in the industry for facilities not to be optimized to make jobs as efficient as they could be. I think it is fine to make a suggestion, but on the other hand if it is your first day or two in a professional kitchen, it might be the case that you need to just work with what is available for now. And especially, this is a restaurant that is literally brand new, they probably aren't thinking the dish system is their biggest problem right now. \n\n(3) Even though it might seem like the dishpit isn't a real high skill position, there is still a lot of knowledge and speed that comes with time on the job, so it is kind of a crappy situation for you to be in there on your own, with  no-one experienced to show you the ropes.\n\n(4) To me it is shortsighted of that manager, if you are offering to come in an hour early and get things organized, to say no to that kind of initiative.\n\nBottom line - my guess is that if you've decided to try and work your way up from dishwasher, you'll have to make a call as to whether that can happen in this kitchen or not. But actually I think you'd be better off asking to stage somewhere better, working as an extra hand for free on prep and garde mange and get in the door that way.",
      "parent": "22539",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22555",
      "author": "dana",
      "author_url": "",
      "date": "2012-04-07 22:19:32",
      "content": "Diego- I am a professional pastry chef, working 14 hours a day, which is probably about 6 less than anyone in a managerial position who is opening a restaurant. I barely had the time/patience to read your lenghtey comment. Don't take this as an insult. But this industry moves FAST, and the higher up you get, the less time you have for details like the racks in a dish pit. The best dishwashers out there come in, blow through your dishes without speaking, finish, and go home. Strike that. They go to a second job somewhere. You're jumping in with grand intentions, but into a position where the standard has been set by people who work like maniacs, don't ask questions, and always get their job done.  \n\nIf you are feeling injured on your second day by your bosses attitude, maybe this isn't the right way for you to enter the industry. Take it as a lesson, the dishwasher is the most overworked, thankless job in an industry filled with overworked thankless jobs. \n\nI've been through restauarant openings. It's not just that there's no system for the dishes yet, there's not a system for anything, and the dish pit is low on the priority list, behind how to get the food cooked, and how to get it to the customer. \n\nIf the interaction you described made you feel injured, you either need a big lesson in sucking it up, (this is not being mean, this is absolutely necessary for a career in restaurants) or you need a more gentle introduction to the industry. You're going to be that chef someday, who only needs to know one thing. You have dishes, they need to get done between the hours of 4 and 12, and you need someone to do it. It won't be personal, it's a yes or no question. Will they do it for you or won't they. \n\nEither put your head down, learn to work with what you have, and stick it out, using it as practice for the years of grueling thankless overworked underaccommodated hours you are about to endure as a line cook, OR go get a slower more delicate start by offering your unskilled hands for free as a stage. You will likely find that about 1000 times more satisfying. But the same lesson applies, keep your head down, push through, and work with what they give you. \n\nYou are a culinary student. you don't have to scrub yourself out of the dish pit into a prep cook job if you don't want to. You have educated yourself and have other ways into kitchens.",
      "parent": "0",
      "gravatar_hash": "bc8d7fb511f8ba01563b0280cdc8cc08"
    },
    {
      "id": "22560",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-08 06:33:05",
      "content": "Fantastic, realistic answer.. thanks, Dana!",
      "parent": "22555",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22564",
      "author": "Dennis",
      "author_url": "http://hoodiabuzz.com/my-hoodia/uniquehoodia/",
      "date": "2012-04-08 07:30:58",
      "content": "I've often thought about a career as a chef but then I seen how demanding and high stress that job is. I'll stick to filing reports and just enjoy eating the food.",
      "parent": "0",
      "gravatar_hash": "16d736eedec6dda0a5ad094e9cae41e3"
    },
    {
      "id": "118958",
      "author": "luis",
      "author_url": "",
      "date": "2013-02-17 23:51:11",
      "content": "hey everyone wondering if you can help me with the mails of some emails of places you all have stage before thanks to all.",
      "parent": "0",
      "gravatar_hash": "7c1c2826ddd8f18b9407c12fef87df65"
    },
    {
      "id": "138258",
      "author": "ashli michelle",
      "author_url": "http://almostveggies.com",
      "date": "2013-04-16 07:04:40",
      "content": "This is very helpful. I start tonight. I kind of know the deal, but am more of a food writer than a food cooker. :) Nice article!!",
      "parent": "0",
      "gravatar_hash": "4ca589c54e6831e2fabe3b8a34af5076"
    },
    {
      "id": "153507",
      "author": "T Davis",
      "author_url": "",
      "date": "2013-05-30 09:13:57",
      "content": "As a current culinary student (and career changer) with no experience in professional kitchens, I have decided to seek out opportunities to stage before externship.  Reading this, I realize how much I have learned, how much common sense I will take into the experience, and what joy I have in the work ahead of me.",
      "parent": "0",
      "gravatar_hash": "507c3f6ea060e1df92a41501c644da93"
    },
    {
      "id": "153508",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-30 09:23:40",
      "content": "Great decision! If you are inspired to come back and comment to tell us about your experiences, I'm sure many people would benefit.",
      "parent": "153507",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "155813",
      "author": "Amber",
      "author_url": "",
      "date": "2013-06-06 04:13:44",
      "content": "Thank you for this info. I'm actually a line cook and am staging this weekend at my first Michelin star restaurant. I'm a bit nervous and excited. I've always assumed only us cooks staged at other places for extra experience. It's nice to know that anyone can. I'm wondering if this also applies to California residents, since we have strict food handlers laws. As of I believe 2011 you have to have your Serve Safe certification. \n\nOh, and LOL about the name &amp; phrase on coats... I've seen \"John Doe, CHEF\" \n\nWe aren't chefs until we're successfully running a kitchen with the earned respect of our brigade. My opinion at least. :0)",
      "parent": "0",
      "gravatar_hash": "e72b2e4ac9c788564682109e61beefcd"
    },
    {
      "id": "155839",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-06-06 05:42:48",
      "content": "Yes, in Washington there is a food handler's permit that you need to have before working in a restaurant, though you can get it online after about a 1 hour training.\n\n> We aren’t chefs until we’re successfully running a kitchen with the earned respect of our brigade. My opinion at least. :0)\n\nAmen to that.",
      "parent": "155813",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "166650",
      "author": "Tine",
      "author_url": "http://spoonfiller.com",
      "date": "2013-06-28 08:55:43",
      "content": "This is great info. I recently left my career for a life in the kitchen. This is something I always wanted to do and basically followed the \"no better time than the present\" idea. Given that I went through university and blindly ended up in jobs I didn't like before I decided to go the other way around this time and look for a stage. Since I live in London I made a list of the best restaurants at the moment and then went through the list for restaurants I really liked (because of their style, product, menus, etc.). I obviously ended up with an extremely long list but nevertheless started writing them all telling them about my enthusiasm, motivation, why I like them, etc. This week I got my first reply back and HOERAAH for me cause I can start with a week in September. I'm over the moon to be able to get this experience and will definitely use the tips you gave me here. Can't wait to absorb knowledge in there!",
      "parent": "0",
      "gravatar_hash": "a38c670d19188f7d2a4c8c663f394590"
    },
    {
      "id": "166890",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-06-28 23:15:49",
      "content": "Congratulations and best of luck! If you aren't too exhausted, stop back by and let us know about your experiences.",
      "parent": "166650",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "169442",
      "author": "Megan McMinn",
      "author_url": "",
      "date": "2013-07-04 08:27:48",
      "content": "Thanks for the article, very helpful. I just have one question:\nWhat is your suggestion on the best way to arrange a stage, if you don't have a referral, would email or an old school letter be better? Also, what is the best information to include in a cover letter or email asking to stage. I am a culinary arts student and my chef told me to email a few places to stage. He didn't say what should be included, have any suggestions? \n\nThanks in advance!",
      "parent": "0",
      "gravatar_hash": "bf1b841d090d3a87ca236cd75df62b7c"
    },
    {
      "id": "169780",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-07-05 08:13:12",
      "content": "I think in this modern era that an email would be ok. I've never asked for a stage as a complete cold call, I've always either gotten an introduction or met the chef through the web first, but especially for a culinary school student I don't think it is a huge problem. I'd keep it really brief - just tell them who you are, what your experience (both school and work) is, and when and how long you'd like to stage for if it is possible (including whatever flexibility you have on dates). Maybe a sentence or two of why you specifically chose their restaurant.",
      "parent": "169442",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "199255",
      "author": "Amier",
      "author_url": "",
      "date": "2013-10-06 09:09:33",
      "content": "Hye, \n\nmay i know if we should ask the chef on how long the stage gonna be? becos i dont wanna ask to many question as i just to work/be in that kitchen.",
      "parent": "0",
      "gravatar_hash": "d192d3226a96935f834c6896cec575b3"
    },
    {
      "id": "199256",
      "author": "Amier",
      "author_url": "",
      "date": "2013-10-06 09:11:50",
      "content": "i mean do i have to give the periods of stage that i want like 2 weeks, 1 months or just let him decide?",
      "parent": "0",
      "gravatar_hash": "d192d3226a96935f834c6896cec575b3"
    },
    {
      "id": "199260",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-10-06 09:31:34",
      "content": "You would typically include that as part of your request, like \"Would it be possible to stage with you for 2 weeks?\"",
      "parent": "199256",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "215720",
      "author": "The Fit Duck",
      "author_url": "http://thefitduck.wordpress.com",
      "date": "2013-11-01 21:28:37",
      "content": "Hi Michael, I have to thank you for this post.\n\nYour tips had contribute to start my 4 week stage in a restaurant. Even if I am 31 IT guy without any previous experience in a professional kitchen. :)\nI have just completed the first week yesterday and it was pretty good!\nI also started a blog where I keep track of my adventures. Maybe it will last only 4 weeks. Or maybe more. ;)\n\nThanks again!\n\nCheers,\nNico",
      "parent": "0",
      "gravatar_hash": "1d8f699f3ea014af20aa1f08ceeaa848"
    },
    {
      "id": "216262",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-11-02 08:41:45",
      "content": "Nice, Nico! I enjoyed reading through your recent entries.",
      "parent": "215720",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "815309",
      "author": "mely",
      "author_url": "",
      "date": "2014-03-11 20:04:24",
      "content": "I love stages :) in my station I have no use for them as I have neither the time nor patience to try to teach someone how to make fresh pastas. But they do great prep work for our saute :) and when I have to jump on the line to bang out plates it's nice to have an extra person to hand me plates or run to the walk ins!",
      "parent": "0",
      "gravatar_hash": "a84c1b7db9fbaacd19ddf81a78b8da24"
    },
    {
      "id": "842956",
      "author": "Megan",
      "author_url": "",
      "date": "2014-03-17 09:27:07",
      "content": "Thank you-very informative! I have stages coming up to find an intern site (I'm in culinary school) and it is freaking me out a bit! I have waited table for the last decade, but am now venturing to the BOH. Scary and exciting-this definitely helps.",
      "parent": "0",
      "gravatar_hash": "7a6b057d55dfdd051f411e927fd9bc4c"
    },
    {
      "id": "893175",
      "author": "Sherine",
      "author_url": "",
      "date": "2014-04-26 09:18:48",
      "content": "I'm a career changer and I just googled staging and I can say that I'm completely impressed by your description of the entire process. As I was reading I felt like I was actually in the kitchen going through the staging process myself. Thank you from the bottom of my heart.",
      "parent": "0",
      "gravatar_hash": "e77f56395eb1b2cd8baa0557b0874114"
    },
    {
      "id": "925380",
      "author": "Sathyan",
      "author_url": "https://herbivoracious.com",
      "date": "2014-06-01 17:28:21",
      "content": "Hi Mr. Michael Natkin,\n\nThese are very good valuable information, well let me come to the point, iam a chef with an experience of 13 years especially in the middle east &amp; would like to do a stage program,unfortunately i dont have any contacts with any of the chefs, how do i sneak in for one of those programs, can you please suggest... preferably Fine dining.\n\nthanks.",
      "parent": "0",
      "gravatar_hash": "888ca5e41768db23c0548a044572c23d"
    },
    {
      "id": "925416",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-06-01 18:38:03",
      "content": "Hi Sathyan - if you've been working for 13 years, someone you've worked with or for must know someone at least a level up in the ranks of restaurants beyond where you are now. I'd work that network of connections, no matter how thin, and get someone to make a call for you to arrange a stage.",
      "parent": "925380",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "925440",
      "author": "Sathyan",
      "author_url": "https://herbivoracious.com",
      "date": "2014-06-01 19:03:34",
      "content": "Thank you very much, iam right now working in United arab emirates, Abu dhabi .\n\nwith Abu dhabi national hotels. well i do know some chefs and they are also trying ..",
      "parent": "0",
      "gravatar_hash": "888ca5e41768db23c0548a044572c23d"
    },
    {
      "id": "953532",
      "author": "John",
      "author_url": "",
      "date": "2014-06-30 13:25:10",
      "content": "Hi Michael,\n    Thanks for this great post.  It's very informative.  I have a question though.  Is there such a thing as a part-time staging?  I was thinking of looking for some weeknights and maybe weekends staging without quitting my day job.\nThanks,\nJohn",
      "parent": "0",
      "gravatar_hash": "cf2ba6ad358e98006abe10444d5a0faa"
    },
    {
      "id": "954153",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-07-01 06:58:48",
      "content": "It's possible, you'd just have to find a chef willing to say yes!",
      "parent": "953532",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "961253",
      "author": "Elisa",
      "author_url": "",
      "date": "2014-07-10 10:50:48",
      "content": "Michael. .Thank you so much!..This is extremely helpful since I have a trail run next week in NYC at a 4 1/2 star restaurant and I only recently graduated from Culinary for baking/..pastry..I read their dessert Menu and have honestly never learned or made most.The position is for Pastry cook and I am so nervous!",
      "parent": "0",
      "gravatar_hash": "1ad797400024a2fc36625c09a90fc227"
    },
    {
      "id": "961270",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-07-10 11:09:23",
      "content": "Best of luck!",
      "parent": "961253",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "966265",
      "author": "Min",
      "author_url": "",
      "date": "2014-07-15 12:44:36",
      "content": "These are all great tips and I very much want to stage at some place but I'm not sure how to start. I have zero experience in a any kind of kitchen besides the one in my family home and I'm unsure if any place would take me. I want to join a culinary program but many people suggest that I work in a real kitchen first before entering any programs to see if i could handle the atmosphere. Do you have any advice on how to find a stage program and apply for it?",
      "parent": "0",
      "gravatar_hash": "0f2f41adcd6b20050feaa8c7d472266e"
    },
    {
      "id": "966524",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-07-15 19:27:29",
      "content": "I think if you read carefully up above, you'll find some good tips for finding a first stage - basically it comes down to finding a connection or screwing up the courage to ask cold.",
      "parent": "966265",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1062608",
      "author": "chris",
      "author_url": "",
      "date": "2014-09-02 04:33:55",
      "content": "Thank you so much for this article. it confirmed a lot of the assumptions i had about work in a professional kitchen and let me know what to expect - which is exactly what i needed.\n\ni'm going to be staging for a michelin star restaurant on wednesday starting at noon. i've been working on my own techniques nightly working as a grocery clerk in order to hopefully get my foot in the door. i ended up inside this restaurant (on my 30 min lunch break, on advice from a coworker) i knew nothing about, inquiring about a dishwashing position i learned they had already filled.\n\n i knew i just wanted to get into the kitchen somehow. within 30 seconds i had both head chefs in front of me asking me questions, such as if i had chefs shoes and pants and good knives. they said they needed someone to work garde (i had to ask them what that meant).\n\nmy previous identity was a d1 athlete, but i always knew i wanted to cook. however, i have absolutely no formal training. the past 4 days have been a blur. i bought the founding chef's book, replaced my inherited 30-yr-old 8\" wusthof with a new one, and even treated my roommate to a $120 dinner just to get an idea of the place. \n\n i am really excited about the team aspect of being in kitchen. i am trying to prepare myself the best i can so i do not miss this opportunity. however, while i have total confidence in my work ethic, ability to learn, and social skills, i am beside myself with some weird sort of calm anxiety. \n\nobviously, this can lead to a career as a professional chef. ive always thought about culinary school, but what most excites me about this opportunity is the idea that i can skip all of that formal training, as long as i can make the cut. is this an accurate expectation? i have no illusions about the life of a cook. i want to feel like i am contributing to something greater than myself, even at the grocery store. that drives me to always find ways to improve the store. i hope these skills translate. \n\nanyways, this opportunity is way above my league. and you have helped me tremendously in preparation. how nervous should i be, given my confidence in work ethic and learning ability? and even without formal training, can I take this further? how long would i have to work to be qualified for another position in a professional kitchen?",
      "parent": "0",
      "gravatar_hash": "e06ba80b6dc002bd298db51e5e189482"
    },
    {
      "id": "1062612",
      "author": "chris",
      "author_url": "",
      "date": "2014-09-02 04:36:56",
      "content": "i talked about myself wayyy too much in that post. but it kind of helps me to overcome these feelings i have never felt before. the potential of a career ive always dreamed of. and i literally dont know anybody who works in a kitchen professionally, so I dont have anyone else to talk to.\n\nThank you for your time. and thank you for this article.",
      "parent": "0",
      "gravatar_hash": "e06ba80b6dc002bd298db51e5e189482"
    },
    {
      "id": "1062707",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-09-02 05:57:31",
      "content": "Chris: you've got the right attitude. You are going to be fine. The fact that they \"drafted\" you is a good sign, they know they are going to have to teach you everything. Yes, absolutely, if this goes well and you like it, you'll be able to move up through other stations over time and no you don't have to go to culinary school. Especially b/c you are getting the break of starting at a very good restaurant. Put in your time there (at least a year, maybe more, assuming you like it) and you'll be able to springboard from that to other restaurants. But all of that is cart before the horse. Start by just working your ass off and learning everything you can.",
      "parent": "1062608",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1121195",
      "author": "John",
      "author_url": "",
      "date": "2014-10-21 18:35:49",
      "content": "Hi Michael,\n     I made a comment here before on 6/30/14.  I just wanted to let you know that I started a PT internship last weekend!  My schedule is weekends and one weeknight.  I am very excited about this because I never worked in a professional kitchen before plus I don't have to quit my job.  I am an avid cook at home though and really work on perfecting every dish I make.  I seem to be convinced that cooking is something that I can do for the rest of my life.  But I am sort of testing the waters via this gig just in case I may be wrong :-).  \n     Anyway, I really think the first day was the hardest part because I had no clue what I was getting myself into.  My biggest worry was whether I would be able to stay standing for several hours and not my basic kitchen skills and knowledge or lack thereof.  \n     So what have I learned? (0) First, let me describe how I got the internship.  I went to one of the restaurants on my favorite restaurant list (between 3-4 pm) and filled out an application.  I asked to talk to the chef but he was in a meeting for a while so I just said that I was going to come back.  I didn't go back :-) but instead wrote a very carefully written honest email to the restaurant.  I got an interview, followed up after over a week, and was told to come in to start the internship :-) (1) Things happen really fast so listen carefully and ask for clarification if it's not clear to you when you are given instructions. (2) It's true what they say that there are many Spanish speaking people who work BOH :-) They work really quickly!  But they were also very nice and helpful.  One of them helped me a lot when the Chef was busy.  (3)  Being nice and helpful to everyone around you can do wonders! (4)  Working hard can do wonders! (4) The first day is the most difficult for the body.  If you are like me who has a regular job sitting down working in front of a computer, then working in a professional kitchen will shock your body!  And this is even though I work out at the gym and play sports regularly!  I had to take a painkiller pill before going to bed :-( The second day, my body was fine :-) (5) Now I know what the sharpie is for - labeling prepped food that is put in storage or later use!  (6) Crocs Bistro Clogs are great!  (7) Work fast but carefully.\n       These are just some of my initial thoughts after only 2 days of working so some of them may change in time :-)  I'm already looking forward to the next time I'll be at the restaurant!\n       Btw, thanks again for all your very helpful thoughts and insights on staging.  I'm also thankful to everyone who made comments especially Nico from The Fit Duck.  I read all (!) his blog entries and it helped me gain some rather interesting insights about working in BOH.  I also appreciate his effective use of emoticons :-).\n       Again, thanks!  I'll be stopping by here again sometime to report about my future experiences :-).",
      "parent": "0",
      "gravatar_hash": "36c7eee035d608f8a4da99ca1a223d2f"
    },
    {
      "id": "1121205",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-10-21 18:46:58",
      "content": "I loved reading this! Thanks for sharing and please do come back and update us on what you are learning.",
      "parent": "1121195",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1139647",
      "author": "Dr Roger Stambaugh",
      "author_url": "http://pericowest.com",
      "date": "2014-11-07 20:13:40",
      "content": "After CIA culinary training, Stella in Truckee,Ca, professional chef training in Italy, and many,many years of cooking at home and on hot lines: At age 77: if you are not in shape do not attempt a stage. Physically it is very demanding. Hours, demands, standing, pressure. Been there ,done that. Have you ever noticed? There are no grey haired chefs? if you are over 65 do not attempt this.  Go there for dinner. You have earned it.",
      "parent": "0",
      "gravatar_hash": "9dacfc66eececab1dea20e3a80dc5809"
    },
    {
      "id": "1150623",
      "author": "Brittany",
      "author_url": "",
      "date": "2014-11-19 08:51:15",
      "content": "I thought this was a wonderful article! Just a few questions though- what is the follow up procedure for a stage? Let's say your ultimate goal is employment, and you get the opportunity to stage for a week. Should you expect them to offer you a job on your last day? Or do you need to ask for a job directly? \n\nThanks!\n\n~Brittany",
      "parent": "0",
      "gravatar_hash": "f846461ebf7dc0027345dd5163869de6"
    },
    {
      "id": "1150700",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-11-19 10:22:05",
      "content": "A stage isn't normally considered a job interview, though it wouldn't be unheard of for them to offer you a job. If they don't, and you want to keep working there you should just ask the chef directly; you certainly won't hurt their feelings!",
      "parent": "1150623",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1236844",
      "author": "Ola",
      "author_url": "http://chceupiec.blogspot.com",
      "date": "2015-01-24 12:04:49",
      "content": "hi Michael, thank u so much for this article :) im studying culinary arts nd we have to go for our work placement for 3 months this summer... I would love to go to France beacause i love French cuisine, especially pastry (i love baking!!) so maybe do u know where should i start looking for job? any names of restaurants or chefs who can help me with this? i would be really appreacieated for any help :)",
      "parent": "0",
      "gravatar_hash": "4b8cd8fb6400165dccfd7bbafb3dd348"
    },
    {
      "id": "1237276",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2015-01-24 19:45:20",
      "content": "Hi Ola - no specific recommendations, you'll have to do some delicious research!",
      "parent": "1236844",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1240374",
      "author": "John",
      "author_url": "",
      "date": "2015-01-27 11:56:59",
      "content": "Ola, see this website:\n\nhttp://www.davidlebovitz.com/2010/07/bakery-restaurant-internship-in-france/",
      "parent": "0",
      "gravatar_hash": "36c7eee035d608f8a4da99ca1a223d2f"
    },
    {
      "id": "1287552",
      "author": "Beemah",
      "author_url": "",
      "date": "2015-03-28 22:28:18",
      "content": "Great article!  \n\nMuch like many people in the industry, I got my start through the \"School of hard knocks.\"  If your goal is to find yourself your first kitchen job, I would also add that you should never underestimate the power of a good, honest, \"Sir, I don't know much, but I've got decent knife skills, and I'm happy to learn anything you'll teach me.\"  \n\nThis is how I landed my first prep job in a long-standing fine dining restaurant, and spent a few years, leaving as a sous chef, to learn more about pastry.  That job, too, was a \"Sir, I don't know anything about pastry, but I'll gladly chop vegetables and prep for you, if you'll only let me hang out in the pastry department in my off time to learn more.\"  \n\nI suppose I got lucky with a couple of chefs who were willing to take a chance on an eager 24 year old who was willing to put himself out there. \n\nWhat I like best about your article is that it's more than just a description on how to get a good stage, it's also a great list of hints on how to start your first kitchen experience, paid or not.  Some chefs use the stage as an interview tool, and others are happy to just let someone come in and hang out (read:  work hard) for awhile to learn.  Whatever your goal, these are excellent pointers to aspiring young chefs!",
      "parent": "0",
      "gravatar_hash": "ad474a7eae8d8fd258d16d6f56a5df39"
    },
    {
      "id": "1287801",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2015-03-29 07:22:00",
      "content": "I couldn't agree with you more, Stephen. A willingness to be humble, work hard, and learn is what it takes. Your story is exactly what people need to hear.",
      "parent": "1287552",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314016",
      "author": "guy french",
      "author_url": "",
      "date": "2015-08-18 21:09:44",
      "content": "Actually a stage position is for cooks looking to learn or move up in the industry... not for people who daydream about it because they've seen foodtv... This is nonsense. I'll eat my skullcap the day I hear a story about some middle manager doing a stage at any Michelin rated restaurant and being offered a job at the end of the term. You're not Ruhlman, and things have changed a lot since the 90's with respect to whats going on in fine dining. Where does your knowledge of classical mother sauces get you when you're asked to make a fluid gel??",
      "parent": "0",
      "gravatar_hash": "6afe8b715da38b41b753389bbac099e8"
    },
    {
      "id": "1314017",
      "author": "melissa",
      "author_url": "",
      "date": "2015-08-19 10:57:40",
      "content": "Hello,\n   I will be doing an internship, but they have asked me to come in for a stage from 2-10 months before the internship on a day when the chef will have more time to spend with me. Do you think that means I will still have to cut/cook etc? or do you think I will just be shadowing? I am waiting for them to email me more information, but the more I read it seems like everyone stages for longer than one day?\nthoughts?\n\nMelissa",
      "parent": "0",
      "gravatar_hash": "b52b7201c309f5811c019b26d04caa82"
    },
    {
      "id": "1314018",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2015-08-19 11:25:49",
      "content": "Haha well, I should ignore trolls, but I'll bet you a dollar I know a lot more about fluid gels that you do :).",
      "parent": "1314016",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314019",
      "author": "Stephen",
      "author_url": "",
      "date": "2015-08-19 12:02:16",
      "content": "Your Stage is always a try-out, so you should go in expecting to work.  Knife Skills, prep skills, cleanliness and organization are all things that they'll be looking at.  The Length of the stage depends, though, probably mostly on you.  \n\nI've seen people stage for 5 days and NOT get the job or internship, and seen folks who only have to do it a few hours before the chef offers up some money.  Just be ready to come in open-minded, ready to show them everything you've got, and you'll do fine!",
      "parent": "1314017",
      "gravatar_hash": "b6ae47041642a60f7ed878e7d5e99e7f"
    },
    {
      "id": "1314020",
      "author": "laurie",
      "author_url": "",
      "date": "2015-08-20 12:00:26",
      "content": "Thank you so much for this article.  I'm staging  today and this was a great read before heading in.",
      "parent": "0",
      "gravatar_hash": "9cdd885a5c573eb8b5987f0a972e0e79"
    },
    {
      "id": "1314048",
      "author": "Marge",
      "author_url": "",
      "date": "2015-10-06 07:38:49",
      "content": "I totally agree with you! I'm a 21 year-old culinary arts students but I never had much interest in working in a restaurant, I'm just wanted to work at a little bakery. Until this summer, when I had no job during college vaccation and I replied to a job offering (for 3 months) that a guy from my school posted on facebook.. In a restaurant, as a cook. I went there and just told them: \"I've never worked in a kitchen before, and since I'm only used to baking cakes and making sweets my cooking skills are seriously lacking. BUT I'm really eager to learn and work hard\" I got hired :) After the 3 months my classes started and they asked me to stay ( but working less hours because of school). Be humble and hard working and they'll respect you!",
      "parent": "1287552",
      "gravatar_hash": "f189bca36b95eaf1ba8977d9fcd878f7"
    },
    {
      "id": "1314132",
      "author": "Paul",
      "author_url": "http://www.huegah.com",
      "date": "2016-03-29 06:47:27",
      "content": "Always looking for folks interested in staging.  We are a catering company out of Chicago.  Visit our website and shoot us an email.\n\n-Paul",
      "parent": "0",
      "gravatar_hash": "e97c7a39ccc10ac63b1f692a402ec671"
    },
    {
      "id": "1314141",
      "author": "SBH",
      "author_url": "",
      "date": "2016-04-16 09:50:58",
      "content": "Did one 2 months ago, experience was exactly like you wrote about. Great advice, excellent writing, wish I read this before I went! But I got the job, yay, so happy &amp; loving it every day! Extremely hard work, physically demanding, but truly awesome experience to work in a kitchen full time &amp; learn from an awesome chef &amp; sous chef! Actually, I learn from everyone in the kitchen...about 20-30 new things a day...little &amp; big pieces of advice that I didn't necessarily learn at culinary school (once you're in their kitchen, new rules &amp; interesting ways of doing things \"their way\" seem to come up daily)! But no matter how tired I am or how hard the day is, I find myself smiling from ear to ear as I get in my car to go home. I never thought I could be so happy at a job &amp; it's so satisfying on so many levels. Anyway, this really is great advice. I'm going to keep reading what you recommended b/c, like you said, it's inspiring &amp; always interesting to hear what the more experienced have to offer. Thank you for such a thoughtful, well-written &amp; helpful post!!",
      "parent": "0",
      "gravatar_hash": "857cf11cee0dda4e4c62bd34e1bfc497"
    },
    {
      "id": "1314166",
      "author": "William",
      "author_url": "",
      "date": "2016-05-22 09:58:09",
      "content": "Hello,\nActualy in France in the dordogne near Bergerac.\nI am looking for a kitchen porter or a cook willing to learn,(internship)\nvery serious person only need to apply.\nPlease send me your cv.\nBest regards\nWilliam",
      "parent": "0",
      "gravatar_hash": "5a50b85b21474ff90aebdbcd9c3911f7"
    },
    {
      "id": "1314171",
      "author": "Jhon",
      "author_url": "http://Facebook.com/NohjSP",
      "date": "2016-06-19 13:35:11",
      "content": "Hello Sir William, I'm a 19 yr old Filipino chef currently living in Istanbul. To live and become a chef in France means everything to me. Im willing to work and learn under your guidance. I dont care about money, I want to gain more experience and knowledge. I speak fluent English and basic French. Thank you",
      "parent": "1314166",
      "gravatar_hash": "11cf62c89f5abf04040eccc459ff6120"
    },
    {
      "id": "1314185",
      "author": "William",
      "author_url": "http://www.lavillastlaurent.com",
      "date": "2016-07-15 09:11:25",
      "content": "Hello,\n\nWe will be interested in you depending on your previous experience could you send me your CV direct email\nlavillastlaurent@orange.fr\nBest regards\nWilliam",
      "parent": "0",
      "gravatar_hash": "5a50b85b21474ff90aebdbcd9c3911f7"
    },
    {
      "id": "1314186",
      "author": "William",
      "author_url": "http://www.lavillastlaurent.com",
      "date": "2016-07-15 09:26:12",
      "content": "HELLO \n\nALSO WE ARE LOOKING FOR A WAITRESS / HOUSE KEEPER\n\nTHIS POSITION APPLY TO SERIOUS PERSON ONLY\n\nCOULD BE A LIVING POSITION FOR THE RIGHT PERSON\n\nWWW.LAVILLASTLAURENT.COM\n\nBEST REGARDS\n\nWILLIAM",
      "parent": "0",
      "gravatar_hash": "5a50b85b21474ff90aebdbcd9c3911f7"
    },
    {
      "id": "1314198",
      "author": "Eriko",
      "author_url": "",
      "date": "2016-08-07 07:18:29",
      "content": "Thank you so much for sharing your wonderful experience! Tomorrow I'll have stage at French restaurant in Melbourne. I'm  nervous so I can't sleep now. This report makes me feel better. I'll do my best! :)",
      "parent": "0",
      "gravatar_hash": "a1e21b29e2e4b89f443eb4b87be79730"
    },
    {
      "id": "1314199",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2016-08-07 07:26:02",
      "content": "Good luck! If you can keep your eyes open afterwards, tell us how it goes!",
      "parent": "1314198",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314207",
      "author": "Jeanne",
      "author_url": "",
      "date": "2016-08-24 22:01:28",
      "content": "thank you so much for taking the time to write such an informative article.  I am a fairly accomplished home chef and as a hobby I arrange food and wine pairing parties for 30 to 50 people where i do most of the recipe development and the cooking.  At my last party the executive chef of a well regarded local restaurant attended one of my dinners as the guest of one of my regulars. I was very nervous having a real chef at my table, and to my surprise he asked me to do a pop up with him. When I told him I had no restaurant experience, he asked me to stage at his place.  Subsequently another guest who is a food photographer introduced me to two of his clients, one of whom is well connected to Thomas Keller.  Both of these clients suggested we do a pop up together in the near future.  It's like a dream come true but I am also terrified at the prospect because I have no professional experience.  What in your opinion are the top things you would recommend I learn to successfully maneuver the pop up experience? I know how to cook but have no experience dealing with the fast pace of a typical service and maneuvering through the various roles in a commercial kitchen. How many weeks (months?) do you think an appropriate stage would take for me to learn these things?",
      "parent": "0",
      "gravatar_hash": "d62c599a1ace23a3859560ea943f7012"
    },
    {
      "id": "1314208",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2016-08-24 22:14:25",
      "content": "That's great, they must think highly of your food to be interested in doing a popup with you. I would say that if you are already preparing and cooking for 30-50 people, that basically is a popup! So you are well on your way. I'd take that opportunity to stage, preferably for a week more. Other than that, the key to a popup is really the same as any other restaurant situation: preparation. Make those lists, check them and check them again, do everything you possibly can in advance, work clean, pack up all the prep really neatly, make sure you have everything you need for chilling, heating, finishing, serving. Make sure you have all the help you need for final cooking, service and cleanup. Just be incredibly organized so that you aren't improvising when it is time to serve, and it should all go great.",
      "parent": "1314207",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314247",
      "author": "Jacob",
      "author_url": "",
      "date": "2016-12-17 00:58:36",
      "content": "Hi everyone. I'm really hopping someone could give me some adivce.. I'm 21 years old and I work at my Gradmothers restaurant. It's in a small town with quality food. We never really referred to bringing some in to possible be employees for 2 hours (unpaid) has a stage. We called it a working interview. But now we are being sued, and it dose not look good for us. Can anyone give me any advice?\n\n Thanks, Jacob",
      "parent": "0",
      "gravatar_hash": "0a3e8164ff5f26424d49336df1995af5"
    },
    {
      "id": "1314287",
      "author": "kaattie",
      "author_url": "",
      "date": "2017-03-25 10:35:14",
      "content": "My daughter is in her first semester at CIA (baking &amp; pastry) and landed a stage at a 1 Michelin star restaurant. Today's the day! She is exceedingly nervous and didn't want to read up on staging beforehand. Glad to read this piece on her behalf! When I get the scoop from her I'll leave another comment with her experiences. Thank you for this excellent post!",
      "parent": "0",
      "gravatar_hash": "e5ad4afb3ca42ac303b884db2ae4b859"
    },
    {
      "id": "1314300",
      "author": "Furqan Meerza",
      "author_url": "",
      "date": "2017-05-06 05:14:45",
      "content": "Hey Michael,\n\nI am in culinary school right now and will graduate this month. I have had the privilege of working with some of the best chefs' in this country by doing apprenticeships during summer breaks. I've been offered a stage at Noor Restaurant in Cordoba,Spain which is a one Michelin currently. The chef is Paco Morales who has worked at El Bulli and Mugaritz amongst others and is bringing back the cuisine of the Arab Moors who ruled Spain during 12th century. \nDo you think it is a good decision to start my career with a stage. From among the chefs I've spoken to hear about the same, some said it is better I work a year or two somewhere here and then move on to a stage while some said this is the best time because you're young and you have age on your side and later you might have other commitments. I personally want to do this stage because I never apply for it and it just came my way while having a chat with Chef Paco so I am very sure I'd regret not doing it. Please do get back thank you. \n\nP.S The article you've written is amazing. Truly catches the essence of working at a restaurant from what I've experienced. Cheers!",
      "parent": "0",
      "gravatar_hash": "5987d72a349a3d4fb448e5de3bf7c16a"
    },
    {
      "id": "1314301",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2017-05-06 09:00:58",
      "content": "There is no single right answer, but if it were me I would absolutely take that stage! You never know what doors it might open for you, and you might not get that opportunity again. Plus the chance to work in another country is always great. Good luck and let us know how it turns out!",
      "parent": "1314300",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314322",
      "author": "Christopher Keimer",
      "author_url": "",
      "date": "2017-06-22 12:57:12",
      "content": "I am a 14+ year line cook in Seattle.  I am currently looking for a 3 month stage in Italy.  Any tips or advice on how to achieve such a goal?  I am currently trying to write cold letters to the various restaurants i would like to work at, would you know where i could find templates for such a letter?  Any recommendations would be greatly appreciated. Thank you.",
      "parent": "0",
      "gravatar_hash": "fb35522b23bc0ce45d44de435349ba9a"
    },
    {
      "id": "1314323",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2017-06-25 20:05:45",
      "content": "I don't have any personal experience with that, but my best suggestion would be to try and work your network. If you can find anyone you have worked for or with that might know someone there who can make an introduction I'm sure it will go a long way.",
      "parent": "1314322",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314328",
      "author": "Kat",
      "author_url": "",
      "date": "2017-07-05 04:13:19",
      "content": "Hey there Jacob, this is kind of a tough one. You're going to need to do a little research on your local laws. Also, you'll need to go through the lawsuit, reasons for the suit etc. \nThere's not a ton of help that can be offered without more context. As someone who was supposed to go into law, but ended up as a Chef/Somm, I would highly suggest finding similar cases where the restaurant won their case. You will need these to prove in Civil Court why no value should be awarded to the disgruntled individual. Using these past cases as an example helps solidify your arguments in front of the judge. Good luck!",
      "parent": "1314247",
      "gravatar_hash": "3f549324dfbcd53be51d2a51801c256e"
    },
    {
      "id": "1314494",
      "author": "Michael Mcmillian",
      "author_url": "",
      "date": "2018-02-06 16:35:40",
      "content": "Hello this is just an awesome insight to my next career choice , I’ve dreamed of working in and learning to do different things with food and it’s production . \nI’m 50 now and I’ve always had a high motor , I look forward to more insights .\nI’m actually headed towards fully realizing my dream very soon .",
      "parent": "0",
      "gravatar_hash": "a1952f7289f2d9e432a594c218357b9f"
    },
    {
      "id": "1314522",
      "author": "Marcey",
      "author_url": "",
      "date": "2018-05-18 17:37:55",
      "content": "That was a great article.  I have a cousin in Chicago who owns a restaurant,  Bar Roma. My son,  who is 16, cooks and bakes at home ak the time.  He is getting a chance to stage,  this article was so helpful and interesting! Thank you!",
      "parent": "0",
      "gravatar_hash": "761bbef2766ad7b546db678f3fe62342"
    },
    {
      "id": "1314523",
      "author": "Marcey",
      "author_url": "",
      "date": "2018-05-19 10:30:36",
      "content": "Sorry for typo in the last comment. Question my older son not in the food business says he doesn't think Scott will need to spend money on cooking knives and chefs clothes since he's still in high school but he is doing the stage at the restaurant in Chicago. What is your thoughts on that. Thank you.",
      "parent": "0",
      "gravatar_hash": "761bbef2766ad7b546db678f3fe62342"
    },
    {
      "id": "1314524",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2018-05-19 14:35:48",
      "content": "Hmm, I don't know for sure. I've always arrived at a stage with pants, jacket, crocs & knives. It is possible the restaurant might be willing to loan them to him, but I wouldn't assume it if no-one told him so. He might just want to call and ask if that's possible.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314584",
      "author": "Alan Nippert",
      "author_url": "",
      "date": "2019-04-23 18:43:09",
      "content": "I’ve been a Chef for 12 years. It’s straight crazy. Not sure that I could recommend it to anyone. It’s funny though, I wouldn’t want to do anything else. Even though it’s hard and leaves you with little time outside of the business of operations, purchasing, inventory, schedules, menu costing, hiring, firing..........the list goes on.........it’s rewarding and can be a lot of fun. It’s funny the reason I am reading this post is because tomorrow I am administering my first stage. Now I get to see what it’s like from the other side. Haha, well toodles.",
      "parent": "0",
      "gravatar_hash": "2868b157ea95e3a1754400f74272c541"
    }
  ]
}