{
  "comment_count": 30,
  "comments": [
    {
      "id": "1895",
      "author": "Ben",
      "author_url": "http://ourfarmadventure.org",
      "date": "2009-10-15 09:29:13",
      "content": "This looks fantastic! I never would have thought to adulterate my collards with shiitake and shoyu, but I'm gonna give this a try :)",
      "parent": "0",
      "gravatar_hash": "fb15d82b23600461360e08daae89808d"
    },
    {
      "id": "1896",
      "author": "alice",
      "author_url": "http://savorysweetlife.com",
      "date": "2009-10-16 01:21:04",
      "content": "I love Southern style collard greens. I like your umami substitute.. have you ever considered kombu for added umami?",
      "parent": "0",
      "gravatar_hash": "6ca987bc2434b8f7d0c27afd61dd1338"
    },
    {
      "id": "1897",
      "author": "Paola Loriggio",
      "author_url": "http://profile.typepad.com/6p0120a64427e6970c",
      "date": "2009-10-16 08:35:50",
      "content": "I often use Bragg's Liquid Aminos instead of soy sauce. Works the same, minus the association with Asian food.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "1898",
      "author": "c",
      "author_url": "",
      "date": "2009-10-16 18:37:47",
      "content": "The greens were very tasty but the shiitakes bothered me.  I used thinly sliced, dried versions that I soaked in a little water for 30 seconds before adding them to the pot. IMO, dried shiitakes smell like feet.  But what the heck, I had them in my cupboard so I used them. When they were cooked, they left a foot odor aftertaste in my mouth. The weird part is that the \"foot\" flavor would surface 30 seconds after the fact.  Strange, I know.  Any suggestions? should I just use fresh mushrooms next time?",
      "parent": "0",
      "gravatar_hash": "45d42aefb9a576dbc10611bb452b1066"
    },
    {
      "id": "1899",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-16 19:08:04",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n@c - Yep, dried shiitakes and fresh shiitakes really aren&#39;t interchangeable. The dried ones are great for making broth, and rehydrated they are good in certain chinese dishes where their texture is expected. This collard green dish needs the fresh ones. BTW, whenever you are working with dried ones, they need much more than 30 seconds of hydration. More like 10-15 minutes in water that was brought to the boil.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1900",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-16 21:48:31",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\nThanks Alice - I think a bit of kombu would work well!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1901",
      "author": "easy recipes",
      "author_url": "http://www.fastrecipes.com",
      "date": "2009-10-17 04:56:16",
      "content": "this recipe look great. I have two types of paprika. Does it make a difference which one I'll use?",
      "parent": "0",
      "gravatar_hash": "5d91814be9e331e0b2e85dd0206aa014"
    },
    {
      "id": "1902",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-17 07:48:35",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n@easyrecipes - we want a smoked paprika, like a pimenton de la vera or pimenton agridulce. If both of the ones you have are smoked, I&#39;d just go with the one you like the best.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1903",
      "author": "Susan + Sanjay",
      "author_url": "http://vegfoodings.blogspot.com",
      "date": "2009-10-17 12:41:30",
      "content": "We are really surprised by how little fat you have in this recipe. Our relatives down in the 'bama put use butter for flavor and pig for tradition. How come you decided against greasing this sucker up?",
      "parent": "0",
      "gravatar_hash": "e0c6d84e9adf98bfb7ff8d3a16c12ef8"
    },
    {
      "id": "1904",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-17 13:21:52",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n@susan+sanjay - that&#39;s just how I like &#39;em, but if you feel you need more butter in them, you won&#39;t hurt my feelings :)",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1905",
      "author": "Sara",
      "author_url": "",
      "date": "2009-10-17 22:30:54",
      "content": "Ha - except the word, \"well\" was at least three syllables long when she said it. Are these the very same greens you served with the awesome cornbread and jalapeno butter? If so, I am totally surprised there were mushrooms in there.",
      "parent": "0",
      "gravatar_hash": "cc577de9e5547e7e34f35469619cbc34"
    },
    {
      "id": "1906",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-17 22:43:46",
      "content": "@sara Those are they.. I mean thems are those... oh forget it. Yes. I&#39;m glad you didn&#39;t notice the mushrooms, I wanted them to be background flavor.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1907",
      "author": "Lang",
      "author_url": "http://fat-of-the-land.blogspot.com/",
      "date": "2009-10-18 08:47:39",
      "content": "Just watched a rerun of Top Chef and a bunch of the chefs used shiitaki to satisfy the \"umami\" component of a meal. Have shiitake always been recognized for their umami factor--what about other mushrooms? BTW, we're meat-eaters but usually do our kale/chards/collards w/o meat. Love 'em sauteed simply in oil with a little garlic, soy, and maybe a dollop of apple jelly.",
      "parent": "0",
      "gravatar_hash": "2dd41620fbb4b83b989b9d07081e3f88"
    },
    {
      "id": "1908",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-18 10:03:41",
      "content": "My understanding is that all mushrooms have a decent level of natural glutamates (the source of umami). Drying shiitakes seems to dramatically concentrate them. I love to use them to make broth, like in this dish: <a href=\"http://bit.ly/4x3BhD\" rel=\"nofollow\">http://bit.ly/4x3BhD</a> . Apple jelly with greens? Now that is really interesting, never heard of that but I could see how it would work.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1909",
      "author": "yaheardme",
      "author_url": "",
      "date": "2009-10-20 11:44:21",
      "content": "This recipe was so delicious.  While I love kale and swiss chard my relationship with collards and mustard greens has never been as simple.  When I received mustard greens and shiitake mushrooms in my CSA box this week this post immediately came to mind.  The flavors were spot on.  Thanks for such a wonderful creation.  I'm now even more excited about the long winter green season that is just beginning down here in Louisiana.",
      "parent": "0",
      "gravatar_hash": "8ee91b1a64256af31d4f55da0c52dedd"
    },
    {
      "id": "12397",
      "author": "mowriyah",
      "author_url": "",
      "date": "2011-12-16 04:02:33",
      "content": "can this recipe be done with mustard greens instead of collard greens?",
      "parent": "0",
      "gravatar_hash": "676379d6246ca47354d618672944301b"
    },
    {
      "id": "12456",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2011-12-16 09:07:04",
      "content": "Absolutely! It will work well with any of the hearty leafy greens.",
      "parent": "12397",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "12868",
      "author": "mowriyah",
      "author_url": "",
      "date": "2011-12-17 17:04:05",
      "content": "you never say when to add the paprika",
      "parent": "0",
      "gravatar_hash": "676379d6246ca47354d618672944301b"
    },
    {
      "id": "12909",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2011-12-17 22:09:50",
      "content": "Fixed, thank you!",
      "parent": "12868",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "15257",
      "author": "Shannon Dea",
      "author_url": "",
      "date": "2011-12-27 11:06:18",
      "content": "Made this recipe last night. It was great. I love collards (or bitter greens of any kind), but my partner and daughter aren't sold on them. They quite like them prepared this way though. My usual method is to blanche them in boiling water, roughly chop them and then briefly saute them in evoo with kosher salt, garlic and chilli flakes. My family finds collards done my way too tough and bitter; they liked the tenderness and sweetness of this method. I couldn't stand the colour, though. I like my greens bright green, not muddy green-brown. But, I must say, my collards looked exactly like the photo above. I was at least reassured that I wasn't the only one producing this colour of greens!",
      "parent": "0",
      "gravatar_hash": "807b40c705fb471ad797556e911d7579"
    },
    {
      "id": "15258",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2011-12-27 11:16:14",
      "content": "Hah, yep, it was hard for me to accept that the heartier greens taste better when fully \"hammered\" too. We've been so programmed in recent decades to prefer the bright green colors of lightly cooked vegetables, and in most cases I prefer them that way too. But collards, mustard greens and so forth really are much more delicious when fully broken down. The color isn't lovely, but the taste is!",
      "parent": "15257",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "23635",
      "author": "Keyla Escribano",
      "author_url": "http://eat2live2day.com",
      "date": "2012-05-06 15:50:34",
      "content": "I had the biggest craving for greens and remembered that I had a bunch of Collard greens in my fridge. I'm Puerto RIcan, and it's not something that we typically make so I had no idea how to approach it. I found this recipe and wow, it's amazing. Simple yet flavorful. I tweaked it a little. I used sesame oil, and garnished the collard greens with Vegbits (bacon bits), and chives. My friend and husband also approved! Thanks for the recipe and the guidance! I tweeted you!",
      "parent": "0",
      "gravatar_hash": "28479271c46c519f01ff01db19c47f3c"
    },
    {
      "id": "83450",
      "author": "JDH",
      "author_url": "",
      "date": "2012-11-20 14:56:37",
      "content": "Making these for Thanksgiving.  Can I make them a day or two ahead of time?  Thanks.",
      "parent": "0",
      "gravatar_hash": "bb09ad6f16d3a234a191666da5e6a229"
    },
    {
      "id": "83484",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-11-20 15:39:09",
      "content": "I think they will reheat ok!",
      "parent": "83450",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "104988",
      "author": "Julie",
      "author_url": "",
      "date": "2013-01-07 20:23:21",
      "content": "I've been looking for something to do with my CSA collards that doesn't involve pig! I'm so  excited to try this--but I'm a little afraid because shiitakes are my least favorite mushroom :( Do you think any other one would substitute ok? Thanks for the recipe and the fun discussion, J",
      "parent": "0",
      "gravatar_hash": "5cf6c900c7ed40ec620695ef07cbb8b5"
    },
    {
      "id": "104991",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-01-07 20:37:12",
      "content": "I think if there is another mushroom you prefer, you should go for it!",
      "parent": "104988",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "106660",
      "author": "Julie",
      "author_url": "",
      "date": "2013-01-14 10:22:35",
      "content": "Thanks for the encouragement! I made them with criminis and added a little garlic and red wine and they were a spectacular success! Thanks so much for the recipe, it will be a regular in our kitchen :)",
      "parent": "0",
      "gravatar_hash": "5cf6c900c7ed40ec620695ef07cbb8b5"
    },
    {
      "id": "1098989",
      "author": "Penopolis",
      "author_url": "",
      "date": "2014-10-04 16:31:17",
      "content": "Perfect recipe! I serve this up with homemade cornbread and a can of baked beans and life is good!",
      "parent": "0",
      "gravatar_hash": "2cc6d8594cc4201aa64ceb617c5e34aa"
    },
    {
      "id": "1206719",
      "author": "Matt",
      "author_url": "",
      "date": "2014-12-30 07:51:55",
      "content": "Fantastic recipe! My wife grew up in the South eating pork-cooked collards, and for years I'd been trying to come up with a suitable vegetarian replacement that still hits all the right savory and smoky notes. These are always a hit.\n\nFor the past two years, I've used some variation on these greens for New Years' brunch, and I plan to make them again this year. (I make them throughout the year as well, whenever I get my hands on good looking greens, but New Years is when I really go all out and make them for a crowd, served alongside Nigerian-inspired black-eyed pea fritters.)\n\nLast year I replaced the water with a quick broth made from dried shiitake and kombu, and finished the dish with a tea-smoked salt, which came out just about perfectly. This year I've got some of your umami broth kicking around my freezer, so I think I'll use that and try cooking these in the pressure cooker.\n\nThanks as always for a great recipe!",
      "parent": "0",
      "gravatar_hash": "da4eaa857c16adcb07f2ced62c2c5745"
    },
    {
      "id": "1208058",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-12-31 08:58:39",
      "content": "I love that you've been experimenting with variations on them! They all sound great.",
      "parent": "1206719",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}