{
  "comment_count": 11,
  "comments": [
    {
      "id": "1495",
      "author": "Diana @ frontyardfoodie",
      "author_url": "http://frontyardfoodie.com",
      "date": "2010-01-21 08:06:38",
      "content": "I feel like in America we're more addicted to fake food and carbs than fats. I love fats! Avocado, olive oil, nuts! It's awesome!",
      "parent": "0",
      "gravatar_hash": "d637c04fa62080412fba51b62455918a"
    },
    {
      "id": "1496",
      "author": "Alessandra",
      "author_url": "http://alessandra-onlyrecipes.blogspot.com/",
      "date": "2010-01-21 12:19:57",
      "content": "I'll say: eat more fat less!\n\nTo clarify, 'fatty' food is nice, mmmmh, and we need it too, but I think that some people exaggerate with portions!!!\n\nGoing back to your Making your food pop theme Michael, I don't usually do soliciting on other people's blogs, but I would like you, (and your readers if they like) to try this very easy food experiment for an unusual and amazing taste experience  <a href=\"http://alessandra-onlyrecipes.blogspot.com/2010/01/tomato-gari.html\" rel=\"nofollow\">http://alessandra-onlyrecipes.blogspot.com/2010/01/tomato-gari.html</a>\n\nLet me know!!\n\nciao\n\nAlessandra",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "1497",
      "author": "Katya",
      "author_url": "http://fulltimefoodie.wordpress.com/",
      "date": "2010-01-21 17:17:01",
      "content": "mmmm, good quality olive oil is worth every single calorie.  Not only is it healthy but it is also delicious.  It can elevate any dish from mediocre to outstanding - just as you proved with the case of the green beans.",
      "parent": "0",
      "gravatar_hash": "4af9ef4ad3ddb1f3f64d982d02858f92"
    },
    {
      "id": "1498",
      "author": "Suzanne",
      "author_url": "",
      "date": "2010-01-21 18:52:14",
      "content": "Not only in moderation but by making better choices we can have our fat and eat it too!  Wouldn't be without my olive oil or my butter!  It certainly does make food pop!",
      "parent": "0",
      "gravatar_hash": "e95750c132d32107fa4c89808694bf50"
    },
    {
      "id": "1499",
      "author": "Sarah",
      "author_url": "http://vegetarianperpective.wordpress.com",
      "date": "2010-01-21 19:19:11",
      "content": "Lately I've been crazy about truffle oil and truffle salt - it's amazing how the tiniest amount imparts such dynamic flavor. I can't get enough, and I'm 5' 5\" and 130 pounds...I never eat anything that is not food, and I eat until I am full. I do think there is something to the real food part of it all.",
      "parent": "0",
      "gravatar_hash": "f5405b2c4e709b370aeb35f190902cb5"
    },
    {
      "id": "1500",
      "author": "Vanessa",
      "author_url": "http://www.italyinsf.com",
      "date": "2010-01-21 20:36:22",
      "content": "I have just learned about Etruria products this past weekend at the Fancy Food Show- and what a line!! I will always splurge on good quality EVOO, especially because I don't do prepackaged dressings or sprays or whatever else. I like my food to taste like food, just like Sarah said!\nHowever, I have to say I was quite surprised by some lower-calories options, like the vinegar made from honey- which has a completely different taste profile and intrigued me to no end!",
      "parent": "0",
      "gravatar_hash": "160fd88d95c72d45e7facb0d6b37205c"
    },
    {
      "id": "1501",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-21 20:42:20",
      "content": "@Vanessa - Isn&#39;t that Etruria mandarin-infused EVOO spectacular? I&#39;ve got a bag of their pasta I&#39;m dying to try too. What else did you try?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1502",
      "author": "Vanessa",
      "author_url": "http://www.italyinsf.com",
      "date": "2010-01-21 20:47:58",
      "content": "OUT OF THIS WORLD- I have a bottle of truffle-infused olive oil, but I have to say that I was really blown out of the water by the vinegars. I am dying to get a few and try them out- and they were possibly my favorite things at the show, along with the Filippino ice cream and the vanilla from Sonoma Syrup Co. Oh, and the smoked olive oil was just... ehm, different?? In all I was a bit underwhelmed by the show. What did you like?",
      "parent": "0",
      "gravatar_hash": "160fd88d95c72d45e7facb0d6b37205c"
    },
    {
      "id": "1503",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-21 22:01:53",
      "content": "@Vanessa - I wasn&#39;t at the Fancy Food Show, I learned about Etruria at ChefShop.com&#39;s brick-and-mortar location in Seattle. They have a good part of their line their; seems to be wonderful stuff.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1504",
      "author": "thepinkpeppercorn",
      "author_url": "http://thepinkpeppercorn.blogspot.com",
      "date": "2010-01-23 11:03:42",
      "content": "Are you kidding - worth the calories!!!???  I don't even think twice about calories.  When I eat good food, made from scratch, I don't gain weight, and I don't eat too much because the food is actually filling and fulfilling too.  I definitely try to eat my vegetables and all, but if my soup that is loaded with vegetables has some nitrate-free bacon in it for flavour, a bunch of salt, and perhaps some more fat from olive oil, I don't give it a second thought.",
      "parent": "0",
      "gravatar_hash": "0145f8dcbe06da53cbda0bb3145f268f"
    },
    {
      "id": "1505",
      "author": "Jami Moss Wise",
      "author_url": "http://www.thenewlyfeds.blogspot.com",
      "date": "2010-01-25 06:01:14",
      "content": "This post reminded me of how I felt returning to the U.S. from a trip to Italy a few years back. I was eating out a lot then, and the contrast in the food quality was startling. Suddenly I realized how awful most food in the average American restaurant was--because they tend to pile poor quality fat (cheap Provolone cheese, ranch dressing, bacon) on dishes to mask the poor quality of the ingredients. In Italy, though, there was no need for that--they used oil just enough to bring out the flavor of the ingredients.",
      "parent": "0",
      "gravatar_hash": "4a664421ac28ea4627d5e5319c396ed0"
    }
  ]
}