{
  "comment_count": 11,
  "comments": [
    {
      "id": "23192",
      "author": "emmycooks",
      "author_url": "http://www.emmycooks.com",
      "date": "2012-04-23 09:27:49",
      "content": "Mama Lil's peppers are the best!  I love them on pizza and in sandwiches, but have never used them in pasta--great idea.  Do you have any other recommendations for them I haven't thought of yet?  I like to eat them as much as possible.  :)",
      "parent": "0",
      "gravatar_hash": "a61a30a9ebb08ca22bc83f8cda99f9e9"
    },
    {
      "id": "23207",
      "author": "Lisa Nicholson",
      "author_url": "http://www.tofudie.com",
      "date": "2012-04-23 13:09:17",
      "content": "Oh yum!  So many carbonara recipes I find on the net use cream.  It's nice to see a good, simple vegetarian recipe that is close to the original, traditional carbonara recipe.  I would love to try this one, I live in Australia and it may be a little difficult to get Mama Lil's Peppers delivered, I will check on the website.  Is there anything I can use as a substitute?",
      "parent": "0",
      "gravatar_hash": "1a732593fbb66c2d8bdb969d799f7643"
    },
    {
      "id": "23212",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-23 15:46:32",
      "content": "I'm not aware of anything that is really a direct sub for Mama Lil's, but I guess you could use jarred roasted red peppers or piquillo peppers, add more olive oil, and then add cayenne or another hot pepper to bring in the spice. It won't be the same, but I'm sure it will be good!",
      "parent": "23207",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "23214",
      "author": "LP",
      "author_url": "http://www.dishclips.com",
      "date": "2012-04-23 16:57:54",
      "content": "This looks like a great idea, because I know pasta can have a bad reputation because of carbs, but added ingredients in this video looks like it would compensate for the healthiness factor.",
      "parent": "0",
      "gravatar_hash": "23a88ccc9179c3c107ffcaba7f56324f"
    },
    {
      "id": "23228",
      "author": "Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-04-24 06:55:56",
      "content": "Great Michael! I made pasta yesterday (come see if you like it), and thanks to this video I know what's for dinner tonight. Although I am going to use just roasted peppers... \nAlso I've been making a lot of cornbread following your recipe, well, the ratio on your recipe. I made it with just corn flour and increased baking soda to 1 tsp (that I mixed with 1 tsp of lemon juice), and it's fantastic. Your recipes are perfect, thanks for sharing it. So far whatever I cooked from your blog came out just wonderful! We love it...:)",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "23232",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-24 08:12:31",
      "content": "Your pasta looks lovely! I wouldn't necessarily use that for carbonara though, carbonara is one of those dishes that really wants to be made with dried pasta not fresh. I find that fresh and dried really have different applications. I'm glad to hear you've adopted the cornbread, it is one of my favorite things to eat too.",
      "parent": "23228",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "23269",
      "author": "Ben Montgomery",
      "author_url": "",
      "date": "2012-04-25 09:59:10",
      "content": "This recipe looks fantastic. My girlfriend loves pastas so I decided to try this recipe for her. She just decided to try to become a vegetarian so I wanted to show her there is great quality food available for besides the average salad. Thanks for posting such a delicious recipe and opening our eyes to a more fun/healthy/tasty perspective of vegetarianism.",
      "parent": "0",
      "gravatar_hash": "0724de2f725faed7ed09141ad29c3e5b"
    },
    {
      "id": "23361",
      "author": "JeCaThRe",
      "author_url": "http://breadwinesalt.blogspot.com",
      "date": "2012-04-28 16:50:24",
      "content": "Looks gorgeous.  I'll have to get some Mama Lil's and try this.",
      "parent": "0",
      "gravatar_hash": "27992f9631fa6dfd70c35382458e3a4c"
    },
    {
      "id": "23431",
      "author": "Fat Burner",
      "author_url": "http://www.sevenpoint2.com/",
      "date": "2012-05-01 03:24:16",
      "content": "Mama Lil’s are one of the best peppers. I use it on pizza's instead of adding jalapenos. Egg on pasta is rather new to me",
      "parent": "0",
      "gravatar_hash": "bda7603876252c69c15f63b58a0bf6f0"
    },
    {
      "id": "23708",
      "author": "Chris Kandrat",
      "author_url": "",
      "date": "2012-05-08 17:12:18",
      "content": "Great video, I enjoy pasta's alot a grew up with them, but this was something totally new and different, really enjoyed it.",
      "parent": "0",
      "gravatar_hash": "2dcfa9a0c3a96a38d24d5f698532bf4c"
    },
    {
      "id": "29554",
      "author": "Jess",
      "author_url": "",
      "date": "2012-06-22 17:49:55",
      "content": "Awesome recipe. I absolutely loved it.\nHere's a recipe for Fettuccine Carbonara you may like to try.\nhttp://www.wascene.com/food-drink/fettuccine-carbonara-recipe/ \nThanks for sharing.\nJess",
      "parent": "0",
      "gravatar_hash": "9b6489696f3e74a5c91c141febf60568"
    }
  ]
}