{
  "comment_count": 17,
  "comments": [
    {
      "id": "185",
      "author": "lisaiscooking",
      "author_url": "http://lisaiscooking.blogspot.com/",
      "date": "2011-09-06 07:25:27",
      "content": "These are so cool! I tried to grow winged beans in my garden years ago, but they didn't work out. I've never tasted them but would love to.",
      "parent": "0",
      "gravatar_hash": "0a9a4542e87845b6596d9c41d7e3c257"
    },
    {
      "id": "186",
      "author": "amee",
      "author_url": "http://www.rabbitfoodrocks.blogspot.com",
      "date": "2011-09-06 20:41:05",
      "content": "hey!  i think Xiaolu at 6bittersweets just posted a Kacang photo from her singapore trip recently...  there are still so many things i haven't cooked with from the ordinary grocery store.  i'm still in Pre-k...you....have gone to get your masters.",
      "parent": "0",
      "gravatar_hash": "22476a0ce17918636d3355926c514729"
    },
    {
      "id": "187",
      "author": "Sonia Gabrielson",
      "author_url": "http://profile.typepad.com/soniagabrielson",
      "date": "2011-09-06 22:06:10",
      "content": "I would love to try them, what an interesting sounding vegetable. <br /><br />When you said that the exterior was like romaine it made me wonder how it would be grilled and served with a vinaigrette?",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "188",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-06 22:18:34",
      "content": "Grilled like romaine? Sounds good to me!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "189",
      "author": "tn",
      "author_url": "http://www.hungerhunger.blogspot.com",
      "date": "2011-09-06 22:52:54",
      "content": "\"my policy is to always buy an unknown fruit or vegetable\"--i like tt policy bc tt's my policy too!\n\nwinged beans (also called 4 angled beans) grow easily in tropical weather. just plant some seeds next to a fence in a sunny area and the plant'll give so many beans tt you'll have to give them away. they can be fried plain, with some chopped garlic, oil and salt. they must never be overcooked. your simple plate of winged beans are making me hungry!",
      "parent": "0",
      "gravatar_hash": "7625df5548e8e76106d35b68d81f403b"
    },
    {
      "id": "190",
      "author": "Kalyn",
      "author_url": "http://www.kalynskitchen.com",
      "date": "2011-09-07 12:16:37",
      "content": "Very interesting!  I've never seen beans like this but I'd certainly be game to try them if I ran across some.",
      "parent": "0",
      "gravatar_hash": "d24156669d5962deb7fdc31688282e65"
    },
    {
      "id": "191",
      "author": "Katherine Martinelli",
      "author_url": "http://www.katherinemartinelli.com",
      "date": "2011-09-07 14:32:56",
      "content": "I've never seen or heard of winged beans but they're so pretty! That's great that you have a rental kitchen and can buy new produce like this. Whenever I travel I go to markets and have the impulse to cook with local ingredients and then am sad when I don't have a kitchen.",
      "parent": "0",
      "gravatar_hash": "77cbf18926e13167a62ef95f9dc0f7cf"
    },
    {
      "id": "192",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-07 20:50:56",
      "content": "So what is a vegetable from the regular grocery that you haven&#39;t taken around the track yet?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "193",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-07 20:55:22",
      "content": "Yeah, I&#39;ve only had kitchens in vacation rentals a few times, but I always love it. VRBO.com and airbnb are great ways to find places that have kitchens and very cool spaces, often at prices lower than hotels, although of course without the service. One tip: if you do get a rental with a kitchen, bring your own sharp knife and possibly a few other small tools, as the ones you find there may be iffy at best.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "194",
      "author": "Divamama",
      "author_url": "",
      "date": "2011-11-09 23:49:54",
      "content": "As a kid, we used to eat it raw with sambal belanchan.  My m-in-law grew these along her garden fence and we often had these eaten raw.  When cooked, it is usually with pounded dried shrimps and fresh chillis pounded into a paste, as the basic ingredient.  Husband couldn't resist picking up 2 pkts of 250gms each when he spotted them in the supermarket. However, due to medical reasons, my husband cannot eat raw veg (and dried shrimps is not his favorite), I had to find a recipe and yes, found only yours!  Thanks!  Tried it but added sliced fresh green chillis and half a teaspoon sambal belachan (can't resist this!)  Husband found it delicious.  Next time round, I'll add  more sambal belanchan (for more kick!) and toss in fried crispy tiny silver fish.  Mix well and serve immediately.",
      "parent": "0",
      "gravatar_hash": "006249ebb3cbea2a180146e0b54d919d"
    },
    {
      "id": "195",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-11-11 07:48:41",
      "content": "I&#39;m glad to hear the recipe met with the approval of a long time afficionado! That really is an interesting vegetable to those of us who didn&#39;t grow up with them. Most unusual.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "180693",
      "author": "Frwom",
      "author_url": "",
      "date": "2013-07-29 12:12:07",
      "content": "My husband is growing winged beans, now with a nice crop.  I do not know how to serve them.  Any recipes from a knowledeable cook?",
      "parent": "0",
      "gravatar_hash": "66ed51a07f37967e8a3e69b1eaed766a"
    },
    {
      "id": "180710",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-07-29 13:02:21",
      "content": "The recipe you see here was my one and only opportunity to cook with them so far!",
      "parent": "180693",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1277936",
      "author": "Melissa",
      "author_url": "",
      "date": "2015-03-17 17:37:46",
      "content": "Hi! This is a popular vegetable here in the Philippines. We call it \"sigarilyas.\" We usually cook it with coconut milk. You simply saute garlic, onion, and tomato then add the sliced winged beans. Sprinkle some salt and pepper to taste. Add the coconut milk, do not overcook and it's ready to serve! :)",
      "parent": "0",
      "gravatar_hash": "e12eeef3fec59179ede3834f823c0cfc"
    },
    {
      "id": "1314219",
      "author": "Yvonne",
      "author_url": "",
      "date": "2016-10-01 23:06:35",
      "content": "Bought these yesterday at my local farmers and I've followed your recipe ...\nWow !!! what just happened in my plate ?? I really love,love,love this recipe!!! What a great vegetable! they are tender still crisp, sweet and fresh...wow,just wow ...",
      "parent": "0",
      "gravatar_hash": "384e856b78236f07073d936d39055d82"
    },
    {
      "id": "1314526",
      "author": "Joan",
      "author_url": "",
      "date": "2018-06-02 17:38:18",
      "content": "When is best season to grow wing beans?",
      "parent": "0",
      "gravatar_hash": "3b501ae1a1ee66eefea3bb30a05c401c"
    },
    {
      "id": "1314544",
      "author": "Dilruk Kannangara",
      "author_url": "https://awidda-paya.blogspot.com/",
      "date": "2018-08-28 13:45:33",
      "content": "Amazingly I cooked the same dish yesterday along with mushrooms. My office mates loved them. In Sri Lanka we add lot of curry leaves, pandan leave and cinnamon to almost any dish which make your dish aromatic and tasty and of course nutrition. We use Chillie pieces as well. That depends on the way you like it.",
      "parent": "0",
      "gravatar_hash": "5e8e7a10f09ff02e663a9ba109a14c52"
    }
  ]
}