{
  "comment_count": 20,
  "comments": [
    {
      "id": "72",
      "author": "Kathy - Panini Happy",
      "author_url": "http://www.paninihappy.com",
      "date": "2011-10-17 07:24:05",
      "content": "Oh my goodness, I'm flagging this one for Thanksgiving morning. Love all the flavors - you're so right about a strata being a bit more forgiving than a quiche (although I count both among my favorites). Wish I had a piece now!",
      "parent": "0",
      "gravatar_hash": "3173541fef2db6b40f403784d5c76724"
    },
    {
      "id": "73",
      "author": "Cristy",
      "author_url": "",
      "date": "2011-10-17 09:05:00",
      "content": "Yum!! Definitely one to bookmark for the holidays!",
      "parent": "0",
      "gravatar_hash": "6c72ac5eb41f268ec284a5273e451b59"
    },
    {
      "id": "74",
      "author": "gfveg",
      "author_url": "http://www.wheatlessandmeatless.com",
      "date": "2011-10-17 16:51:19",
      "content": "i'm crazy about smoked mozzarella so this is a natural for me! i'll just use gluten-free bread. can't wait!",
      "parent": "0",
      "gravatar_hash": "ef5a033606d3813149a19e70153de869"
    },
    {
      "id": "75",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-17 20:34:12",
      "content": "I imagine that should work just fine! This recipe wants some free starch, but I don&#39;t think it cares about the gluten at all.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "76",
      "author": "hcg diet for weight loss",
      "author_url": "http://www.hcgtreatments.com/",
      "date": "2011-10-18 03:07:26",
      "content": "A must recipe to be served this fall on all food days. Just love it!",
      "parent": "0",
      "gravatar_hash": "46ce04d70c704262233dd9eb264d32bd"
    },
    {
      "id": "77",
      "author": "Natalie",
      "author_url": "http://cookingquidnunc.blogspot.com/",
      "date": "2011-10-18 12:32:07",
      "content": "Oh wow this looks good! Cheese and mushrooms, yum!",
      "parent": "0",
      "gravatar_hash": "5f5722e7c7832df4b21acd5b5834803d"
    },
    {
      "id": "78",
      "author": "Megan at ScholasticFood",
      "author_url": "http://scholasticfood.wordpress.com",
      "date": "2011-10-18 15:03:07",
      "content": "This looks so, so good.  I recently had a mushroom quiche, but I've never had a strata before and this looks like a wonderful one to try.  Caramelized mushrooms and onions go SO well together :)",
      "parent": "0",
      "gravatar_hash": "36ef692ee81cb34f1dabb47d685a054f"
    },
    {
      "id": "79",
      "author": "Without Bacon",
      "author_url": "http://withoutbacon.wordpress.com",
      "date": "2011-10-18 19:31:13",
      "content": "Love this blog -- lots of great recipes that I hope to try out some day!  I recently started a blog that you and your readers might find interesting:  <a href=\"http://withoutbacon.wordpress.com\" rel=\"nofollow\">http://withoutbacon.wordpress.com</a> .  The premise of the blog is that it's really hard to find nice restaurants (currently focusing on New York, but with a few other cities sprinkled in from time to time) with good vegetarian options (and by \"good\", I mean \"not just mixed vegetable pasta\").  So it's like a restaurant review, but focusing on what's vegetarian, and holding these 'top chefs' to their own standards.  Check it out and let me know if you have any feedback -- much appreciated -- and would love if you saw fit to mention on your blog.  Thanks!",
      "parent": "0",
      "gravatar_hash": "40d55d895158b1e8e0da98639a5b614a"
    },
    {
      "id": "80",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-19 08:13:01",
      "content": "Very cool. I like what you are doing, as I often have the issue that when I travel I want to know (a) what are the great local restaurants (which I can usually figure out without enough research) and (b) which ones of them have serious vegetarian options (which can be much harder to discern). I especially like the pictures, as that makes it pretty easy for me to decide for myself if a place should be on my radar. Nice work!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "81",
      "author": "Washington Weight loss",
      "author_url": "http://www.dietdocwashington.com/",
      "date": "2011-10-21 00:43:14",
      "content": "Great, like the blog pattern and process of making a good food with the combination of Mushrooms and Smoked Mozzarella… I am going to try this now!!",
      "parent": "0",
      "gravatar_hash": "4eb5f764829d6f35861e405cce52d3df"
    },
    {
      "id": "74079",
      "author": "ann",
      "author_url": "",
      "date": "2012-11-04 10:23:07",
      "content": "I made this last weekend as the main dish for a (challenging) dinner party of vegetarians and committed meat-eaters -- \nEverybody loved it; it was completely delicious and very rich tasting.  They wanted the recipe, so I gave them your website.  I am riffing off it this weekend again for my family.  I thank you very much for this great recipe.",
      "parent": "0",
      "gravatar_hash": "a03c4b7ca635b4db4127b7ae8a0907be"
    },
    {
      "id": "74084",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-11-04 10:34:48",
      "content": "I'm glad it was a hit! And indeed, that is a very \"riffable\" recipe. Let me know what you come up with, and thanks for sharing the site with your friends too, I really appreciate that.",
      "parent": "74079",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "74149",
      "author": "ann",
      "author_url": "",
      "date": "2012-11-04 13:47:11",
      "content": "It came out scrumptious-ly (if that is a word).\n\nThis time I used what I had left from the last farmers' market and some odds and ends from the fridge:\n\ntwo big leeks, a few stalks of celery, a few cloves of garlic, sauteed slow and long in olive oil,\nwith lots of fresh thyme (+ sea salt and fresh ground pepper)\n\nsliced baby bellas sauteed in 2.5 Tbs butter (again, + a little sea salt and fresh ground pepper)\n\nseven medium potatoes, boiled \n\nA roux, with milk (and a little heavy cream), into which I threw about 6 oz smoked mozzarella (left over from making your recipe), and a big dash of cayenne.\n\nAbout 2 cups of chopped kale, uncooked.  \n\nI put everything into a large oval le creuset, and stirred it together.  On top I slice an heirloom tomato, and sprinkled some parmesan.\n\nI covered it and baked it at 350 for, I don't know, maybe 40 minutes, then I uncovered it and cooked it til everything was bubbly and tinged with brown on top.\n\nI apologize for the seat of the pants nature of this - \n\nIt was so tasty!  Your recipe - which was dazzling - gave me the inspiration to pull my hodge podge of ingredients together into something that was really savory and satisfying.  \n\nThanks again, Michael.",
      "parent": "0",
      "gravatar_hash": "a03c4b7ca635b4db4127b7ae8a0907be"
    },
    {
      "id": "114242",
      "author": "Moira",
      "author_url": "",
      "date": "2013-02-05 07:46:40",
      "content": "I've been a sweet bread pudding baker since ... my first baked recipe at 12yrs.old !!!\n\nI started making savory ones, flying by the seat of my pants 'cause I'd never seen a recipe for one, when I moved in with a Vegetarian housemate.  Her idea of a meal was popcorn and leftover Wasabi sauce; (loves food ~ didn't cook).  We worked together in an up-scale cuisinery restaurant, so didn't cook meals at home more than once a week.  Savory bread pudding became the go-to.  There was always one in the fridge ... 'cause there's always some form of bread on the counter, and always bits of veggies and cheese in the fridge.\n\nI recently made one with Lays Tomato-Basil potato chips (kids weren't eating them), layered with roasted peppers, mushrooms, shallots and cheeses, dried basil.  Poured the custard on top and ... voila!  Kids thought it was excellent !\n\nYou can also make these with bits of leftover meats, but don't tell your Vegetarians you go there when they're not looking!",
      "parent": "0",
      "gravatar_hash": "e14043d0b484489c08c4c6c496a215f7"
    },
    {
      "id": "125956",
      "author": "Larry Gaian (@BBQGrail)",
      "author_url": "http://www.thebbqgrail.com",
      "date": "2013-03-11 07:17:50",
      "content": "This recipe sounds as good as the picture of the final result.  I love the idea of using smoked mozzarella.  You've given me a good starting point for coming up with my own outdoor cooked strata.  Thanks!",
      "parent": "0",
      "gravatar_hash": "7ee5ac2101af8c43e335c3bc9e96e2a9"
    },
    {
      "id": "126894",
      "author": "Ashley Stanley",
      "author_url": "",
      "date": "2013-03-14 15:46:59",
      "content": "I made two mini versions of this strata for dinner tonight for my husband and me using leftover bread he had made earlier in the week and it was fantastic!  I substituted sage from the garden (I didn't have fresh tarragon), used tarragon olive oil in addition to butter to sauté the mushrooms, and did not have smoked mozzarella but some plain I had made so used smoked sea salt instead of the regular Maldon's we use. Wow. I will try it again once I have your full ingredients but this was a killer dinner with a small salad. I went a little nuts and made 5 mini ones and now have a bunch for lunch tomorrow. Thank you!!",
      "parent": "0",
      "gravatar_hash": "485e6f94c374af95514072f89f50819c"
    },
    {
      "id": "126903",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-03-14 16:40:00",
      "content": "Your variations sound delish to me!",
      "parent": "126894",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "184051",
      "author": "sheebah",
      "author_url": "",
      "date": "2013-08-04 17:14:07",
      "content": "This is the best egg dish I have ever made.",
      "parent": "0",
      "gravatar_hash": "40e3c0e5de5fe685ab5a4545d5ecf038"
    },
    {
      "id": "184076",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-08-04 17:56:36",
      "content": "Well you know I love to hear that!",
      "parent": "184051",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "187943",
      "author": "Chef Bob",
      "author_url": "http://www.mycopia.com",
      "date": "2013-08-13 08:27:03",
      "content": "This is going to be my next brunch, and I think it will be even more awesome with some Maitake Frondosa or Velvet Pioppini, but then I'm prejudiced. http://mycopia.com/fresh-varieties-maitake.htm\n\nI'll have to experiment with textures, but I usually like letting the egg-mixture and bread soak a little before baking so they have a chance to meld.",
      "parent": "0",
      "gravatar_hash": "b57b8f83cbe9d90b74d25ebe3fd30aef"
    }
  ]
}