{
  "comment_count": 13,
  "comments": [
    {
      "id": "102240",
      "author": "Marina@Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-12-24 15:19:43",
      "content": "Hi Michael, I am not allergic to peanuts, but I hate it, so I never has peanut cookie either. Yes to sunflower butter! It gives to cookies such a nice flavor, especially if you make your own roasted sunflower butter... :)\nHow is your new job? I hope you enjoying it.",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "102279",
      "author": "Northwest Herbivore",
      "author_url": "http://www.northwestherbivore.com",
      "date": "2012-12-24 21:08:25",
      "content": "In general and in principle, I like unsweetened nut and seed butters, but the sunflower seed butter I've become addicted to (as someone who had no trouble with peanuts or tree nuts) is Once Again brand. I go through jar after jar of the stuff. Sweetened, but organic and cooperatively owned. And delicious.",
      "parent": "0",
      "gravatar_hash": "fb1c2b81280b6364671ba460337470b3"
    },
    {
      "id": "102506",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-12-26 06:01:43",
      "content": "I'm absolutely loving my new job at ChefSteps - it isn't often that you find yourself in a situation where you can use everything you've ever worked on and been passionate about!",
      "parent": "102240",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "102507",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-12-26 06:02:23",
      "content": "I haven't seen that brand, I don't think... I'll be sure and pick up a jar if I run into it.",
      "parent": "102279",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "102956",
      "author": "jodye @ chocolate and chou fleur",
      "author_url": "http://chocolateandchoufleur.com",
      "date": "2012-12-28 21:55:41",
      "content": "I, too am a great fan of sunflower seed butter (especially the sunbutter brand), and honestly would choose it over peanut butter any day. I've used it with great success in many recipes, and even used it in a batch of hummus when I ran out of tahini. My favorite, thought, is homemade salted chocolate sunflower seed butter!",
      "parent": "0",
      "gravatar_hash": "e3f98dd7e06403907c5211633faaa50d"
    },
    {
      "id": "102999",
      "author": "nia",
      "author_url": "",
      "date": "2012-12-29 09:00:18",
      "content": "My son has allergies to nuts, coconut and sesame - we also recently discovered Sunbutter - it's amazing.  I've been using it for baking, thai noodles, any recipe that calls for nuts, it's very versatile.  I prefer the crunchy version for texture - just wish it wasn't so expensive here in Canada!  Love your blog and have been trying recipes from your cookbook.  My son and I are vegetarian whereas my husband and other son are not - it's nice to find recipes that are so flavourful that they don't miss the meat.  cheers!",
      "parent": "0",
      "gravatar_hash": "a40e417bc381227cbd63d7f7953a3bae"
    },
    {
      "id": "103707",
      "author": "Bella",
      "author_url": "http://www.sweetnsavorylife.com",
      "date": "2013-01-01 18:04:18",
      "content": "These look very good! I have sunflower butter. Guess I will go to work making these vegan and gluten free. Beautiful picture too! ~ Bella @ www.Sweetnsavorylife.com",
      "parent": "0",
      "gravatar_hash": "d6e5f5f78520af5233670ace84735f39"
    },
    {
      "id": "103852",
      "author": "nia",
      "author_url": "",
      "date": "2013-01-02 05:09:13",
      "content": "I've experimented further with this recipe and just leaving out the flour and butter worked for a gluten free version.  I added some mini chocolate chips and they were very yum!  It didn't work as well if I also cut out the egg so I'm not sure how to make it vegan, perhaps with an egg substitute?  cheers!",
      "parent": "103707",
      "gravatar_hash": "a40e417bc381227cbd63d7f7953a3bae"
    },
    {
      "id": "104793",
      "author": "Mark",
      "author_url": "http://www.avantinaturalstore.com",
      "date": "2013-01-06 20:54:14",
      "content": "Happy New Year Michael, We've enjoyed your blogs and books for years and wanted to take a moment to introduce ourselves.  We're Avanti Cafe in Costa Mesa, organic, vegetarian restaurant going on 8 years.  This year we're launching our online retail store, selling our sweets, salt &amp; spice blends.  We're spreading the word nation wide and looking for support from all the vegetarian communities we admire online.  Please spread the word, come visit Avanti when you're next in our area &amp; check out what we have to offer online at avantinaturalstore.com",
      "parent": "0",
      "gravatar_hash": "19904bf0350aa816cc667601781c1bb9"
    },
    {
      "id": "142261",
      "author": "Ana",
      "author_url": "",
      "date": "2013-04-27 10:07:18",
      "content": "Thank you for this recipe. My son is peanut/egg/gluten free due to food allergies. I used flax powder  and water for eggs and king Arthur gf multi-purpose flour. The came out awesome. They were so good that everyone else in the house ate them. They already requested more.",
      "parent": "0",
      "gravatar_hash": "fc928e77689e2bb1f041f4002bbd89eb"
    },
    {
      "id": "142429",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-04-28 07:27:33",
      "content": "Thanks for letting us know how the substitution worked out, I know there are lots of folks that will want to know that!",
      "parent": "142261",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1116393",
      "author": "Heidi",
      "author_url": "",
      "date": "2014-10-18 14:28:51",
      "content": "That's a great idea! I just made my first batch of sunflower seed butter and I can't wait to use it!",
      "parent": "102956",
      "gravatar_hash": "d6bdbbb2e77eb606001780151df264aa"
    },
    {
      "id": "1314002",
      "author": "jackie",
      "author_url": "http://pintrest",
      "date": "2015-07-25 11:36:32",
      "content": "thank you for this recipe.  I can not eat peanut butter.  when i found out there was a sunflower butter is was so happy.  then I found your recipe for sunflower butter cookies.  THANK YOU !!!",
      "parent": "0",
      "gravatar_hash": "56f65a07e6e0b0fcf33b7b2921cfa792"
    }
  ]
}