{
  "comment_count": 23,
  "comments": [
    {
      "id": "26050",
      "author": "Hannah Greendale",
      "author_url": "",
      "date": "2012-06-05 16:10:22",
      "content": "Mike, you're a tofu magician!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "26051",
      "author": "Hannah Greendale",
      "author_url": "",
      "date": "2012-06-05 16:10:22",
      "content": "Mike, you're a tofu magician!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "26055",
      "author": "Katie",
      "author_url": "http://www.themuffinmyth.com/",
      "date": "2012-06-06 04:15:43",
      "content": "Yum! I love tofu, and I love all things spicy. This looks great, thanks so much for the recipe!",
      "parent": "0",
      "gravatar_hash": "328d85059862707ce76c0192c628f5b1"
    },
    {
      "id": "26560",
      "author": "Vegan",
      "author_url": "http://www.sevenpoint2.com/",
      "date": "2012-06-11 01:48:54",
      "content": "I made this today and it came out great. I added broccoli and carrots and it turned out good. I will be cooking this again tomorrow but I'll try to make it sweet and spicy. Can you share some thoughts about sweet and spicy tofu?",
      "parent": "0",
      "gravatar_hash": "bda7603876252c69c15f63b58a0bf6f0"
    },
    {
      "id": "26742",
      "author": "Betty Ann @Mango_Queen",
      "author_url": "http://www.asianinamericamag.com",
      "date": "2012-06-12 08:03:04",
      "content": "I love tofu and this is a spicy take you have here! I have a large tub of tofu all the time and reading your recipe now, I may have all the ingredients to make this. Must try this! Thanks for sharing, Michael! Just subscribed to your site &amp; I look forward to so many more recipes. BTW, I'm enjoying your cookbook, too !!!! Thanks for all your hard work to bring us fresh, new ideas all the time!",
      "parent": "0",
      "gravatar_hash": "2f47cf20944759bec2f5c79ae8ee733f"
    },
    {
      "id": "26743",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-06-12 08:16:26",
      "content": "Thanks, Betty Ann! It was such a pleasure to meet you and your hubby at #EWR!",
      "parent": "26742",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "26745",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-06-12 08:28:24",
      "content": "So if you want sweet and spicy, which is very nice, I would just add sugar or more mirin (to taste) to this sauce. If you want more sauce volume, add additional water or clear vegetable broth and more cornstarch to thicken it. If you want sweet &amp; sour &amp; spicy, you'll want to use more rice wine vinegar or black vinegar. These sauces are all very flexible, you just have to taste them as you build them, and then figure out how much cornstarch you need to find the right glossiness.",
      "parent": "26560",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "27970",
      "author": "Marcus",
      "author_url": "http://www.greenvegetarianrecipes.com",
      "date": "2012-06-18 05:35:23",
      "content": "Tofu &amp; spice, just what I was looking for.. awesome, thank you!",
      "parent": "0",
      "gravatar_hash": "edd1a44bcf80063e9461f259ddb778a0"
    },
    {
      "id": "33068",
      "author": "Kelly",
      "author_url": "http://info@littlepenguinsonline.com",
      "date": "2012-07-02 17:38:58",
      "content": "Hi Michael,\nWould it be possible to do this as a shish ka-bob form for the fourth of July? What I'm wondering is if the sauce will remain \"powdery\" from uncooked cornstarch, or if the grilling will thicken it in time?\nThank you~  BTW, just found you and am a lifelong veg, as is my 4 year old. Great to see all the different ethnic cultures you cook from, it's the only way to be a vegetarian:)",
      "parent": "0",
      "gravatar_hash": "15b9a685ba5bfb538544061f2f3d95a2"
    },
    {
      "id": "33077",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-02 18:00:58",
      "content": "Hey Kelly - what you would want to do in a situation like that is make the sauce on the stovetop separately, just bringing it to a simmer to thicken the cornstarch. Then you can brush it on the shiskabob later w/o worrying if it will taste uncooked. You'll probably want to at least double the amount of sauce. Totally agree with you about cooking from many cultures. I always say that American comfort food is just about the worst place to look when you want to create vegetarian meals.",
      "parent": "33068",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "33087",
      "author": "Kelly",
      "author_url": "http://info@littlepenguinsonline.com",
      "date": "2012-07-02 18:20:05",
      "content": "OH!!! Of course, that's perfect, thank you so much for the quick reply. Can't wait to try more of your goodies!",
      "parent": "0",
      "gravatar_hash": "15b9a685ba5bfb538544061f2f3d95a2"
    },
    {
      "id": "40249",
      "author": "Sasha Taylor",
      "author_url": "http://lighten-skin.com/how-to-lighten-skin-naturally/",
      "date": "2012-07-23 12:59:24",
      "content": "That is such a good recipe. I keep trying to combine tofu with different things to get the right combination. Can't wait to try this one!",
      "parent": "0",
      "gravatar_hash": "1cffecf21b6d87b66214a3aab3957d8d"
    },
    {
      "id": "42833",
      "author": "John",
      "author_url": "",
      "date": "2012-07-31 04:09:49",
      "content": "This is excellent stuff. My version was a little surprising, because the Jalapenos I got turned out to be surprisingly mild, so my daughter and I kept expecting that bite with the blow-your-head-off heat and never got it. On the other hand, the mild version made it easy to taste and enjoy the rest of the ingredients, which make a very nice miix. I was skeptical about the \"1 min\" of cooking (esp for the scallions -- mine were quite thick), but when this was combined with the cooking time for the sauce as well, the scallions ended up with none of that \"raw onion\" flavor, so the timing was good.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "42879",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-31 10:20:35",
      "content": "Isn't that odd, how some jalapenos can be mild as a bell pepper, and others can be halfway to habanero? I'm not sure if it is genetics or growing conditions, but you really do have to taste them and gauge how much to use.",
      "parent": "42833",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "54407",
      "author": "sheebah",
      "author_url": "",
      "date": "2012-09-23 16:47:20",
      "content": "Wow. Jalapeno in stif-fry never would have occurred to me. This dish was fierce! Absolutely loved it. I toasted some peanuts and threw them in, as suggested -- which added some heft. The deep greens and ruby-red made this visually appealing, too. \n\nThis was the first tofu dish I've ever made at home -- the first of many!",
      "parent": "0",
      "gravatar_hash": "40e3c0e5de5fe685ab5a4545d5ecf038"
    },
    {
      "id": "54424",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-23 19:29:57",
      "content": "Fierce, that's what I like to hear!",
      "parent": "54407",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "97597",
      "author": "Lucy Maddock",
      "author_url": "",
      "date": "2012-12-10 18:35:14",
      "content": "I made this tonight for my husband and three children (17, 9, 8). I used 3 bell peppers and 3 jalapenos because I was afraid of making it too spicy for the littles. I needn't have worried. In fact, with only 3 jalapenos it had hardly any heat at all. We are Chinese/Jewish/Irish. So next time, I will follow your recipe to the letter. Everyone had 2nds and everyone, even my dubious husband, loved the tofu. By the by, my pal John Hughes recommended your site. So far he has set me up with a husband and an awesome recipe website. What more could a girl ask for? Ordered your book yesterday. Many, many thanks!!!",
      "parent": "0",
      "gravatar_hash": "dceea052c3baecd06c3f21b89ff4bb52"
    },
    {
      "id": "97636",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-12-10 20:03:52",
      "content": "John is a pretty amazing guy! I'm delighted to hear that recipe was such a big hit, and apparently your kids have a pretty nice heat tolerance, which is awesome. Of coures jalapenos can vary a lot from batch to batch so be sure to taste a bit before committing.",
      "parent": "97597",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "182096",
      "author": "Saga",
      "author_url": "http://www.sagaplaza.com",
      "date": "2013-08-01 01:52:42",
      "content": "Will be perfect for me this weekend. I looking forward to it, thanks Mike :-)",
      "parent": "0",
      "gravatar_hash": "f11149d6830e4a6aecf117dc77e92b5d"
    },
    {
      "id": "213190",
      "author": "Natalie",
      "author_url": "",
      "date": "2013-10-30 12:56:29",
      "content": "Making this for my family for dinner tonight to prove to them that tofu isn't gross. \n\nIt smells great already!  I added a bit of fresh ginger and it's great! \n\nI'm excited to share this with them. And keeping this recipe for later! Thanks!!",
      "parent": "0",
      "gravatar_hash": "2227c56ca228d7c6953d2cb8de2588d2"
    },
    {
      "id": "701397",
      "author": "bansidhe",
      "author_url": "",
      "date": "2014-02-11 05:00:13",
      "content": "Cool! \n\nInstead of Tofu, I have used Seitan which I cut into thin strips and marinated in oil, soy sauce, fresh ginger and sesame oil. I served this to my boyfriend and he almost didn't realize it wasn't made with Chicken.  :-)",
      "parent": "0",
      "gravatar_hash": "7d253164596c9ec0f13b8145535836b0"
    },
    {
      "id": "1099361",
      "author": "Nichole",
      "author_url": "http://trumpetflowers.com",
      "date": "2014-10-05 03:46:38",
      "content": "You are sooo spot on with this delish recipe Michael! I discovered a few years ago how great tofu is with sweet bell peppers, and your tutorial on how to crisp up the tofu using a hot brine and \nthen stir-frying has made the texture heavenly. Thanks so much for your wonderful recipes and advice.",
      "parent": "0",
      "gravatar_hash": "9372aae49ce746794d69e299190ebcbe"
    },
    {
      "id": "1099482",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-10-05 06:44:28",
      "content": "Thanks Nichole!",
      "parent": "1099361",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}