{
  "comment_count": 11,
  "comments": [
    {
      "id": "38044",
      "author": "Betty Ann @Mango_Queen",
      "author_url": "http://www.asianinamericamag.com",
      "date": "2012-07-16 07:54:35",
      "content": "This looks so quick, easy and very delish! Perfect for a busy week in the middle of summer. Thanks for sharing this, Michael!",
      "parent": "0",
      "gravatar_hash": "2f47cf20944759bec2f5c79ae8ee733f"
    },
    {
      "id": "38094",
      "author": "Eileen",
      "author_url": "http://hampiesandwiches.blogspot.com",
      "date": "2012-07-16 11:41:56",
      "content": "I love chard--and this spiced version sounds delicious.  The yogurt is a perfect garnish!",
      "parent": "0",
      "gravatar_hash": "cd24e89d6c89fdf442e1f717b0827eee"
    },
    {
      "id": "38237",
      "author": "Marina@ Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-07-16 18:01:35",
      "content": "Hi Michael, I was thinking of chard myself another day, but I have to go a hundred miles away to buy it...  I have some exiting news, well, it's not a news for you, but I was very happy to see it. Last week I was in NYC and saw your book on the window display in one of the stores. I was so happy for you! I will have a post about this bookstore and I think I catch it on the photo too. :)",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "38247",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-16 19:10:16",
      "content": "Hey Marina - I'm always happy to hear about which stores are carrying the book, and especially when it is being nicely featured, like in a window display! Was this Kitchen Arts and Letters?",
      "parent": "38237",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "38248",
      "author": "Marina@ Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-07-16 19:14:42",
      "content": "Well, Michael, you scare me: do you have an ability to read people's minds?! Yes indeed, it was Kitchen Arts and Letters... :) Did you do a book signing there? Lovely place, friendly staff and an ocean of cookbooks!",
      "parent": "38247",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "38429",
      "author": "John",
      "author_url": "",
      "date": "2012-07-17 07:59:10",
      "content": "I grow chard, so I tend to eat a lot. We had some just last night. The microwave method is a really good one. Two suggestions: 1. Cook just the stems for about 3 minutes, THEN add the leaves for another two minutes. I find that the stems are tougher, and need a little more time. 2. When you're chopping the stems, chop the bottom parts only about 1/4-inch long. That way if they remain fibrous, at least the fibers are short. \n\nDukkah: the first time I saw it mentioned here, I made some from some recipe on the web, and my whole family fell in love with it. I can't find the original recipe, but I do have my rough after-the-fact transcription of it at https://sites.google.com/site/jfhrecipes/home/recipes/dukkah . The one at http://www.ruggedfilly.com/2012/06/recipe-dukkah/ looks pretty promising as well. \n\nI tend to make 1-2 cups of the stuff and keep it in the fridge in a sealed plastic container so it won't get rancid. Somehow it seems to go away long before that's a threat, though. My daughter's been known to eat it with a spoon. (!)",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "38440",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-17 08:46:28",
      "content": "Hey Marina - I didn't do a public signing, but I did sign the stock copies. Yes, an amazing store! I could spend a year in there.",
      "parent": "38248",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "38537",
      "author": "Marina@ Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-07-17 14:38:58",
      "content": "Maybe it was a signed stock copy?! Oh well, we have less then a year before we move back to Seattle, so I hope to sign my copy there some day...:)",
      "parent": "38440",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "39397",
      "author": "Octavia",
      "author_url": "http://www.amazine.com",
      "date": "2012-07-20 02:35:11",
      "content": "Hey there,\n\nI love your recipes, as a vegetarian it's so nice to see more cookery books in stores! I have just created a website looking for talented people to post on in magazine styles with links to your own blog! Maybe you could check it out! www.amazine.com",
      "parent": "0",
      "gravatar_hash": "93f37ab5b0175e8f5a0f0595fb2c2449"
    },
    {
      "id": "42428",
      "author": "Vegan",
      "author_url": "http://www.sevenpoint2.com/",
      "date": "2012-07-29 19:11:34",
      "content": "Great, healthful, novel side dish. Used chopped chard stems as addition to filling for stuffed bell peppers.",
      "parent": "0",
      "gravatar_hash": "bda7603876252c69c15f63b58a0bf6f0"
    },
    {
      "id": "45061",
      "author": "DDombak",
      "author_url": "http://rabbitstable.blogspot.com/",
      "date": "2012-08-12 18:46:53",
      "content": "I substituted beet greens and served this dish along side steamed beats for a great summer dinner. The dukka seasoning is a great combination along with the yogurt (including stained soy yogurt for the vegans)!",
      "parent": "0",
      "gravatar_hash": "fa7502e7e5ccfde6e3e6da1476a5fc8f"
    }
  ]
}