{
  "comment_count": 45,
  "comments": [
    {
      "id": "2848",
      "author": "Mark",
      "author_url": "http://vegetarianduck.blogspot.com",
      "date": "2009-02-06 00:49:35",
      "content": "hey michael,\n\nlooks great...i'm wondering, did your tortillas retain anything resembling a tortilla shape, or were you just scooping out casserole-style piles of \"enchilada\"?\n\nI've never done the rolling on hot plates and covering with sauce bit, but I may have to try it: my roommate mentioned the shapelessness of my last batch, and not in a good way (\"oh, look at how adorably shapeless those are!\").",
      "parent": "0",
      "gravatar_hash": "8a7af42ad52326dd362812731cee41a2"
    },
    {
      "id": "2849",
      "author": "lisaiscooking",
      "author_url": "http://lisaiscooking.blogspot.com/",
      "date": "2009-02-06 06:00:58",
      "content": "Great looking enchiladas! I'm a fan of chard stems too. They do taste very good and bring color to a dish.",
      "parent": "0",
      "gravatar_hash": "561295eae7a0ea547c538ab03aca58f2"
    },
    {
      "id": "2850",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-02-06 11:26:44",
      "content": "It is true, they don't stand at attention the same way a rolled-to-order\nstyle would. But they retain a degree of individuality :). For me it is a\ngood tradeoff because they come out nice and hot, and are more practical for\na family dinner especially with kids. But I think both approaches are valid.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2851",
      "author": "MyLastBite",
      "author_url": "http://www.MyLastBite.com",
      "date": "2009-02-06 13:03:17",
      "content": "THIS LOOKS SO GOOOOD!!!",
      "parent": "0",
      "gravatar_hash": "dcf0fc52882e79b58223d748ce598bda"
    },
    {
      "id": "2852",
      "author": "pigpigscorner",
      "author_url": "http://www.pigpigscorner.com/",
      "date": "2009-02-06 14:53:10",
      "content": "That's a great shot! Looks so delicious!",
      "parent": "0",
      "gravatar_hash": "01f2d7049bb0b63e0ff64632f4ed0827"
    },
    {
      "id": "2853",
      "author": "Barry",
      "author_url": "",
      "date": "2009-02-06 18:04:38",
      "content": "Got to you via TasteSpotting. This sounds and looks amazing. Can't wait to give it a go. You've got another reader, my man!\n\nOh, and looooove AfterEffects.",
      "parent": "0",
      "gravatar_hash": "e335594ad599cb25cefa3b335c4a6e45"
    },
    {
      "id": "2854",
      "author": "Melissa",
      "author_url": "http://schweetnsavory.blogspot.com",
      "date": "2009-02-06 19:41:49",
      "content": "Wow! These sound great, especially with the jalapeno peppers!",
      "parent": "0",
      "gravatar_hash": "6be6608a396e7288faac2fde6908ab2f"
    },
    {
      "id": "2855",
      "author": "Joie de vivre",
      "author_url": "http://joiedevivreanamateurgourmetsguide.blogspot.com/",
      "date": "2009-02-06 19:51:33",
      "content": "Your first sentence was a good enough endorsement for me!",
      "parent": "0",
      "gravatar_hash": "4589fa50eb2d0888f2cc8688cd3fc1e3"
    },
    {
      "id": "2856",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-02-06 21:08:17",
      "content": "Cool, a cross-over food/After Effects reader, love it :)!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2857",
      "author": "Sha",
      "author_url": "http://www.flavorcapture.com",
      "date": "2009-02-07 06:41:48",
      "content": "I know what I'm going to order tonight at the Mexican restaurant! And after that I guess I'm going to cook Mexican meals like your recipe again and again!",
      "parent": "0",
      "gravatar_hash": "071ec1806ecc7f1a2abed81b7b30dbeb"
    },
    {
      "id": "2858",
      "author": "Joanna",
      "author_url": "http://scalloped-edge.blogspot.com",
      "date": "2009-02-07 13:19:13",
      "content": "Oh, these look great!  I lived my whole life without even tasting a tomatillo, but my Texan-born roommate turned me on to them this past summer, and I fell in love with their tart flavor.  She adds a little cream cheese to her enchiladas, which sounds weird (and I'm sure is not remotely authentic) but it's SO tasty.  I'll have to try this chard and onion version next time!",
      "parent": "0",
      "gravatar_hash": "162fb33db8c91df1cb51af7780965c65"
    },
    {
      "id": "2859",
      "author": "Daily Spud",
      "author_url": "http://www.thedailyspud.com",
      "date": "2009-02-08 15:55:42",
      "content": "Ah, chard, I've grown it, I love it and the stems have got to be the best part! Those enchiladas sound great...",
      "parent": "0",
      "gravatar_hash": "574ac8e528f96dc53d671e1d6f19b0e0"
    },
    {
      "id": "2860",
      "author": "Abby",
      "author_url": "http://www.mangerlaville.blogspot.com",
      "date": "2009-02-08 19:48:23",
      "content": "Rick Bayless has great recipes. I love broccoli stems, but I need to try swiss chard stems. And I love tomatillos, I just made some salsa last week. These sound great.",
      "parent": "0",
      "gravatar_hash": "e7d66c856ddd33ecd4436336fb163ec4"
    },
    {
      "id": "2861",
      "author": "Anticiplate",
      "author_url": "http://www.anticiplate.com",
      "date": "2009-02-09 09:43:53",
      "content": "Delicious! I should have made this but I ended up making sundried tomato and goat cheese ravioli with a parsley and pine nut sauce. With Rainbow Chard on the side:)",
      "parent": "0",
      "gravatar_hash": "95dc86ca41258f2f67c9ce0c12ea79a3"
    },
    {
      "id": "2862",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-02-09 09:45:50",
      "content": "Oh, that sounds good... how long until lunch?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2863",
      "author": "veggiebelly",
      "author_url": "http://www.veggiebelly.com",
      "date": "2009-02-09 09:50:50",
      "content": "Ooooooh my gosh! This looks gorgeous, I love how you put the onion rings on top. Your dish is making me hungry! Gotta love rick bayless :)",
      "parent": "0",
      "gravatar_hash": "c9b1259ff74b0aee40402ce029be9633"
    },
    {
      "id": "2864",
      "author": "Kathy  Egawa",
      "author_url": "http://profile.typepad.com/1224456653s344",
      "date": "2009-02-09 17:51:28",
      "content": "Made these last night (half chard, half spinach) and loved them. And to Mark, mine did stay enchilada-shaped, and that with the generous use of sauce. All the elements of this recipe come together. I wondered about oven roasting the tomatillos, jalapenos and onion, as called for in other recipes, but all was fine enough without that step. And the bonus is leftovers for lunch today and tomorrow. YUM!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2865",
      "author": "Amy",
      "author_url": "http://work-from-home-247.com",
      "date": "2009-02-12 11:52:29",
      "content": "I have been craving Mexican food all week, and was just looking around for a recipe to try...jackpot. These enchiladas sound so delicious I can't wait to try them. My mouth was watering as I was reading! This recipe is so different than anything else I found. I am on my way to the market to get everything. I hope they turn out as good as they sound. Thanks again!",
      "parent": "0",
      "gravatar_hash": "5941f77e3ce51e98304530285cdc9e80"
    },
    {
      "id": "2866",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-02-12 12:02:34",
      "content": "I'm glad you are making them Amy! Let us know how they turn out, and if you\nhave time, please fill out the survey at\n<a href=\"https://herbivoracious.com/recipe-testing-results-fo.html\" rel=\"nofollow\">https://herbivoracious.com/recipe-testing-results-fo.html</a> so I can improve\nthe recipes over time.\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2867",
      "author": "Free Recipe Software",
      "author_url": "http://www.hobbycook.com/gallery-lite-intro.html",
      "date": "2009-02-14 17:31:09",
      "content": "The enchilada looks delicious. I think the onion adds an additional dimension to the taste.\n\nI am hungry now :)",
      "parent": "0",
      "gravatar_hash": "172a62cde97183381df251af0cb928a1"
    },
    {
      "id": "2868",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-02-15 09:13:44",
      "content": "I'm glad you liked them, thanks for letting me know! I've seen recipes that\ncall for the roasting step, but I think this recipe gets similar results on\nthe stovetop by sort of caramelizing the liquified tomatillos for awhile.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2869",
      "author": "Christi",
      "author_url": "",
      "date": "2009-03-13 10:59:48",
      "content": "I made these last night and they were AMAZING! Some of the best enchiladas we have ever had.\nThis dish will definitely go into high rotation in our kitchen.",
      "parent": "0",
      "gravatar_hash": "9a7776dc3a331f95a2df8ec928540688"
    },
    {
      "id": "2870",
      "author": "imposterpockets",
      "author_url": "http://imposterpockets.vox.com",
      "date": "2009-10-08 12:09:32",
      "content": "The tomatillo sauce was outstanding.",
      "parent": "0",
      "gravatar_hash": "5965bc9eb521ec1598e6a671057c4d08"
    },
    {
      "id": "2871",
      "author": "Jen",
      "author_url": "",
      "date": "2009-10-26 11:57:13",
      "content": "I made these from Rick's book over the weekend and, reading your recipe, I think I'll try it again with your variations--the sauce was a bit thin, and I didn't put it in the oven as I usually do, and I didn't use cheese to benefit a vegan guest. I look forward to trying these again, with your modifications.",
      "parent": "0",
      "gravatar_hash": "332f9fc8f277e1107d7cd9406b3ee8f0"
    },
    {
      "id": "2872",
      "author": "Annalisa",
      "author_url": "",
      "date": "2009-11-17 15:57:16",
      "content": "I just discovered your blog and can I just tell you: I'm in love!  Never have I seen so many vegetarian recipes that I HAVE TO MAKE!  This is awesome!  You have no idea how excited I am right now... You are so awesome and they food you make is real and it looks satisfying.  I'm not a vegetarian (yet), but I'm trying to introduce myself and my family to really great tasting vegetarian meals BUT, and its a big BUT, I don't want to use a lot of imitation beef or lots and lots of tofu.  Its not that I have anything against them, I just would rather the meals be based on vegetables and beans in their natural state.  I don't want to eat bulgar in my chili, when I really want beef.  This will only disapoint me (not to mention my fam!).  Okay, I'm rambling... last words:  This site is a GOLDMINE! Thank you!",
      "parent": "0",
      "gravatar_hash": "f3ae3e086c1e94791f0251e3ba970aa4"
    },
    {
      "id": "2873",
      "author": "Annalisa",
      "author_url": "",
      "date": "2010-01-05 09:28:50",
      "content": "so i finally made this. i used spinach instead of the chard (couldnt find it). i wasn't sure if my wife and brother-in-law would like it, as they love their meat and chicken... but guess what!?!?!  they LOVED it!  I was so happy and surprised.  mom and my son loved it as well... but they're less picky i think.  and of course i loved it.  thank you again! :o)  cant wait to make more from your site, i'm so inspired to introduce more veggie recipes at home (as long as i dont say \"its vegetarian\")!",
      "parent": "0",
      "gravatar_hash": "f3ae3e086c1e94791f0251e3ba970aa4"
    },
    {
      "id": "2874",
      "author": "imposterpockets.vox.com",
      "author_url": "http://profile.typepad.com/6p0120a6255cdf970c",
      "date": "2010-02-05 05:34:00",
      "content": "Yesterday, I noticed the survey function on your blog and decided to report back on my making of these last year.  Everything went so smoothly that time and they tasted so good that filling out the survey made me want to make them again.  However, this time there were several rough parts, though in the end they still tasted great.\n\nI must have added too much water in Step 5 because when I took off the lid to let the greens dry out, they just wouldn't do it.  I would estimate that it took about 15 to 20 minutes of basically boiling greens down to a mushy, soupy glop before I took the pan over to the sink and squeezed the rest of the liquid out with a spoon.\n\nAfter that, I was sure that things would go smoothly, but was back into frustration when my corn tortillas wouldn't soften enough to roll.  Eventually I just put down layers lasagna style, since any rolling attempts ended up in tortilla shrapnel.\n\nThe result was a little heavy on the tortilla, since they weren't spaced out by the filling, but it was still good.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2875",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-02-06 19:51:59",
      "content": "Good feedback! I&#39;ll update the steps to clarify that it only needs to be maybe a quarter cup of water, since the greens will release a lot on their own.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2876",
      "author": "imposterpockets",
      "author_url": "http://imposterpockets.vox.com",
      "date": "2010-02-23 08:05:42",
      "content": "I think that I am putting in even less than that.  Maybe the chard in my area is particularly filled with liquid, or it could be a difference in pan or heat.  I will test out adding almost no water next time.\n\nRegardless, this recipe is delicious!  I have made it several times.",
      "parent": "0",
      "gravatar_hash": "5965bc9eb521ec1598e6a671057c4d08"
    },
    {
      "id": "2877",
      "author": "Kate",
      "author_url": "",
      "date": "2010-06-04 17:04:24",
      "content": "Just ran across this recipe from your post on How to Plan a Veggie meal.... can't wait to make it tonight with Swiss Chard from my garden!   Sounds very delicious and a different take on veggie enchiladas.   Thanks Michael!",
      "parent": "0",
      "gravatar_hash": "520f5ab0813519c5968c030be8051fc9"
    },
    {
      "id": "2878",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-06 07:28:05",
      "content": "Thanks, Kate! Did you make the enchiladas? If so, how did they turn out? It is always great to get feedback on the recipes so I can tweak them if they need anything.\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2879",
      "author": "Kate",
      "author_url": "",
      "date": "2010-06-07 16:20:02",
      "content": "I did make them and my husband LOVED them!  I also added in some diced sauteed portobello mushrooms along with the chard and it added that \"meaty\" taste.  These are going on my rotation, thanks again!",
      "parent": "0",
      "gravatar_hash": "520f5ab0813519c5968c030be8051fc9"
    },
    {
      "id": "2880",
      "author": "Derek",
      "author_url": "",
      "date": "2010-07-09 09:04:34",
      "content": "This has become a staple in our house, a huge hit everytime I serve to others.  I often add shitake mushrooms to the filling.  Also, the chard/onion mix and the tomatillo sauce both freeze very well, I've put these up in the fall so I can enjoy the enchiladas all winter.",
      "parent": "0",
      "gravatar_hash": "9c0d114cfd0c3c2dc033ef142d4e3e44"
    },
    {
      "id": "2881",
      "author": "Mercedes",
      "author_url": "http://www.ksfarmersmarkets.org",
      "date": "2010-09-12 11:30:54",
      "content": "These look amazing and the ingredients are on m shopping list for today. I work with farmers markets across Kansas and one of our most well-known programs is Savor the Season. We host workshops for farmers, introducing them to specialty crops in the hopes of diversifying the fruits and vegetables available at market. We then promote these crops to market shoppers via our recipe sections and Savor the Season cards.\nChard is one of eleven crops we're focusing on in 2010. I shared this drool-inducing recipe here:\n<a href=\"http://www.ksfarmersmarkets.org/recipes/swiss-chard-onion-and-monterey-jack-filled-vegetarian-enchiladas-in-a-tomatillo-salsa\" rel=\"nofollow\">http://www.ksfarmersmarkets.org/recipes/swiss-chard-onion-and-monterey-jack-filled-vegetarian-enchiladas-in-a-tomatillo-salsa</a>\nThanks so much!",
      "parent": "0",
      "gravatar_hash": "2c57c458af6844a67aaf1f5e53ac0085"
    },
    {
      "id": "2882",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-09-12 12:37:34",
      "content": "Hey Mercedes - I&#39;m so glad you like the recipe, and sounds like you are doing great work with the farmer&#39;s markets in Kansas. One thing though: the recipes on my site are copyrighted because I&#39;m writing a book. Please just link to the original, don&#39;t copy the text over to your site.\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "100466",
      "author": "Hannah",
      "author_url": "",
      "date": "2012-12-16 18:49:21",
      "content": "I tried this recipe, but substituted in flour tortillas, which was a HUGE MISTAKE. I hope there's more texture in the dish with corn tortillas because, while it was delicious, the entire dish had the texture of melty cheese. (which does not a sexy date food make)",
      "parent": "0",
      "gravatar_hash": "d4e2b2a394a1cbe4929aca9d7672f0aa"
    },
    {
      "id": "100479",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-12-16 20:44:45",
      "content": "Nope, enchiladas with flour tortillas not recommended :). It will still be cheesy with corn tortillas, but as you say, there will be more contrasting texture and flavor.",
      "parent": "100466",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "105004",
      "author": "Susan",
      "author_url": "",
      "date": "2013-01-07 22:32:25",
      "content": "Made tonight--first night in weeks I haven't had to cajole my daughter to finish!  Used wine instead of water in the greens, and added some crimini mushrooms with the chard stems.  Cooked an extra minute to get some color on the mushrooms. Also, used whole wheat tortillas with flaxseed--less authentic but extra fiber and omega fatty acids, and held their shape fine.  Delicious, thanks!  Strike another win for Herbivoracious!",
      "parent": "0",
      "gravatar_hash": "ba4e036462b060f66fbac8b38ad0386f"
    },
    {
      "id": "205375",
      "author": "Kristen",
      "author_url": "",
      "date": "2013-10-20 21:53:32",
      "content": "We've made these three times and they are fantastic.  Since we got sweet potatoes in our CSA box, we roasted those and added them to the mix, along with mushrooms and the other listed ingredients. The sweet of the potatoes compliments the spicy/hot of the tomatillo sauce. We've been trying to find the correct Mexican cheese substitute for Monterey Jack -- any ideas?  Queso fresco casero is too crumbly for the inside.  Thanks!",
      "parent": "0",
      "gravatar_hash": "bc2b0759121870702fe3665248aa0f4f"
    },
    {
      "id": "205792",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-10-21 08:40:37",
      "content": "Hey Kristen - glad you like them! I'm not very clear on my Mexican cheeses either, so I don't think I can suggest the correct replacement. This looks like some decent info: http://lynnescountrykitchen.net/mexican/cheeses.html",
      "parent": "205375",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "218396",
      "author": "Margo",
      "author_url": "",
      "date": "2013-11-04 13:47:52",
      "content": "You meant to put the halved tomatillos in a processor, instead of the blender, right? I put them in the blender and...nothing! Processor worked great, though. Yum.",
      "parent": "0",
      "gravatar_hash": "edc881b97d675d09c6b3f8382c21e339"
    },
    {
      "id": "219147",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-11-05 06:45:55",
      "content": "Blenders vary widely in power; it works fine in mine, but a food processor is a fine alternative!",
      "parent": "218396",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1069278",
      "author": "Jessica",
      "author_url": "http://www.jsandersphoto.com",
      "date": "2014-09-07 18:12:07",
      "content": "My sister just signed me up for a CSA and I had swiss chard in my first box - I had no idea what to do with it. Came across this recipe and then remembered - I have your cookbook in my kitchen! I was at Eat Write Retreat in 2012 and received a copy of your book - complete with \"Eat your veggies!\" inscribed on the front page. I made these almost exactly as written - except I cheated and bought some salsa verde (same ingredients as your recipe, although I'm sure the homemade version is even better). BEST ENCHILADAS I'VE EVER MADE!! I don't know why I was surprised, but I was - damn they're good. My husband can't handle raw onions, so I omitted them on the top and just made a quick guacamole with avocado, cilantro, lime juice, and salt and we used that as a garnish instead. Cannot wait to make them again - I was completely blown away. Thanks for making my first swiss chard adventure a successful one!",
      "parent": "0",
      "gravatar_hash": "9ce0ed936dca7fe379fa9cc41063d398"
    },
    {
      "id": "1069340",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-09-07 19:32:39",
      "content": "That's great! I'm glad you remembered the book, and even happier to hear that you & your husband enjoyed the enchiladas.",
      "parent": "1069278",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314621",
      "author": "Susie",
      "author_url": "",
      "date": "2019-09-20 12:58:20",
      "content": "Has anyone tried to freeze the pan? Cook ahead or not?",
      "parent": "0",
      "gravatar_hash": "1c2f9549785397ecf4cd59fdfbbcbf52"
    }
  ]
}