{
  "comment_count": 2,
  "comments": [
    {
      "id": "3517",
      "author": "Katie",
      "author_url": "http://everydaylifeofahousewife.wordpress.com",
      "date": "2008-05-21 09:17:13",
      "content": "Wow - that was good.  I am technically a pescatarian although I very seldom use the term because it's easier to just say I'm a vegetarian and I eat seafood.  I know, as he explains, that makes me an omnivore, but for me, it's more about taste and texture than not eating living things.  I've been at it for eleven years now and I almost thought I was going back to poultry last year until I tried a bit and really didn't like it. Vegetarian food has so much potential, often much more than meat based cuisine, as long as it's cooked with care and attention to detail. I love stumbling on a good vegetarian blog - yours has been a nice treat, as well as Tofu Hunter and Mac and Cheese from Philly(www.macandcheesereview.blogspot.com).  I read GastroGnome, but when she gets going on duck prosciutto or raw meat..I get a little lost because it really doesn't appeal to me.\nBack to the article - I found it hilarious that he mentioned enjoying the smell of meat and having people call it hypocrisy. My father-in-law has this deep desire to make me eat meat again and he does it by waving medium rare steak in my face and talking about how good it smells and how nice it looks. I'll agree with him - a barbequed steak does smell good, but it doesn't make me want to eat it.\nAnyway, I've gone on long enough - keep up the good work..I think I've read nearly everything you've written here in the last two weeks, so I need more :).",
      "parent": "0",
      "gravatar_hash": "f0daaaf40ca68cbe4a0b76b7abb58aed"
    },
    {
      "id": "3518",
      "author": "april",
      "author_url": "http://www.aprildoodles.com",
      "date": "2008-06-27 18:30:55",
      "content": "Haha! I find it funny that people are so concerned or frustrated about what someone else chooses to put in their belly.  My sister has been a veggie for so long it's all normal to me.\nThanks for linking to the article, I would have missed out on a good laugh.",
      "parent": "0",
      "gravatar_hash": "3d6cccc0fd9d476f371cd0988d554569"
    }
  ]
}