{
  "comment_count": 10,
  "comments": [
    {
      "id": "2528",
      "author": "Surly Gourmand",
      "author_url": "http://surlygourmand.blogspot.com/",
      "date": "2009-04-23 13:06:05",
      "content": "Michael,\n\nThe photo looks very tasty but I thought we'd already discussed the fact that you can deep fry ANYTHING, even a dismembered gorilla's anus, and it would taste good. And don't disparage deep fried gorilla anus; it's a delicacy in many cultures you ethnocentric dick.\n\nThere's just no way around the natural law that tempeh sucks ass. In fact, tempeh's shitiness is even stronger than gravity because unlike the law of gravity, the law of tempeh sucking ass holds true even at the subatomic level.\n\nSincerely,\n\nYour Friend the Surly Motherfucking Gourmand",
      "parent": "0",
      "gravatar_hash": "1397332a9786fe147a302504cde55c55"
    },
    {
      "id": "2529",
      "author": "Dana",
      "author_url": "http://www.danatreat.com",
      "date": "2009-04-23 17:17:55",
      "content": "What a lovely plate!  The only way I like tempeh is to marinate it and then bake it in the marinade until it evaporates.  But I've never pan-fried it and think I'll have to try it.",
      "parent": "0",
      "gravatar_hash": "7e044150f12fee222a380d0d5f8b717e"
    },
    {
      "id": "2530",
      "author": "A&amp;N",
      "author_url": "http://reluctantchefs..blogspot.com",
      "date": "2009-04-23 18:00:05",
      "content": "Empty refrigerator challenges are always fun. We are on an empty the whole pantry and fridge challenge and I'm amazed at the things we come up with!",
      "parent": "0",
      "gravatar_hash": "50de5463f411bb5bad4710eb70af07f3"
    },
    {
      "id": "2531",
      "author": "robyn",
      "author_url": "",
      "date": "2009-04-24 14:30:17",
      "content": "great recipe and it will taste even better with spicy peanut sauce for an Indonesian twist.",
      "parent": "0",
      "gravatar_hash": "f0b62c854810d0dc92965005bd327050"
    },
    {
      "id": "2532",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-04-24 20:58:45",
      "content": "Yes, that is right on, as you say, Tempeh is an Indonesian ingredient and a\npeanut sauce would work very well in this dish. (Unfortunately I can't serve\nitin\nmy house ... )",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2533",
      "author": "Tracy",
      "author_url": "http://www.tracyfood.com",
      "date": "2009-04-26 08:10:10",
      "content": "Tempeh and eggplant — both recently-acquired tastes for me, but now I can dig them.  Turns out, I don't like them poorly prepared.... go figure.  Anyway, I'm adding this to the list of dinners to try.",
      "parent": "0",
      "gravatar_hash": "ec4ee57bf1dbee11d6fa8f212eaf2f13"
    },
    {
      "id": "2534",
      "author": "Mark",
      "author_url": "http://vegetarianduck.blogspot.com",
      "date": "2009-07-06 03:17:45",
      "content": "For people who think that tempeh will never taste as good as fried gorilla anus, I normally deep-fry some and serve it with a stripe of ketchup and a couple of dots of mayo, this changes their tune pretty quickly (though they never quite lose the pucker, must be their diet).",
      "parent": "0",
      "gravatar_hash": "8a7af42ad52326dd362812731cee41a2"
    },
    {
      "id": "2535",
      "author": "Dawei",
      "author_url": "http://www.vegetarianrecipesblog.com/61/aubergine-finbeans/",
      "date": "2009-07-29 09:48:10",
      "content": "On first look, I thought there was deep fried fish in it. great picture, mouth watering recipe, hmmm, hungry again.",
      "parent": "0",
      "gravatar_hash": "d80628713985baa632d8a466d8778444"
    },
    {
      "id": "2536",
      "author": "christine grace",
      "author_url": "",
      "date": "2010-03-14 23:33:31",
      "content": "mmmm... i happen to have tempeh and a whole bunch of eggplants in my fridge! will have to make this soon. thx for the recipe!",
      "parent": "0",
      "gravatar_hash": "ac2d5c5170eab677b6ccfb997684aeda"
    },
    {
      "id": "146450",
      "author": "Judy",
      "author_url": "http://sevensecondrhapsody.com/",
      "date": "2013-05-11 20:15:16",
      "content": "i love tempeh! It's something I love to make any time as a meal accompaniment since it's great with tofu, vegetables, ANYTHING. \n\nHave to agree that cooking-style wise, tempeh's only got a good fry going for it, but after that the possibilities are endless. I love it fried\n\n...with a little salt and it goes well with mee goreng (had it just yesterday!)\n...with a little cumin and spice and goes well as a veggie/tofu burger alternative \n...and stir fried with a little tofu in a spicy sambal sauce or chilli paste. ;)\n\nyour recipe with lemongrass sounds great and I can't wait to add it as a staple to my weeknight dinners!",
      "parent": "0",
      "gravatar_hash": "c0dec433f01e2edba43c1916213bb26b"
    }
  ]
}