{
  "comment_count": 11,
  "comments": [
    {
      "id": "35846",
      "author": "Betty Ann @Mango_Queen",
      "author_url": "http://www.asianinamericamag.com",
      "date": "2012-07-09 07:23:33",
      "content": "I just came from the Asian markets this weekend and I got my fave Japanese eggplants (some recipes call them \"Chinese eggplants\",too ) my lemongrass and ginger. But I have to head back right now to get some of the Thai basil after seeing your recipe. Thanks for another great one, Michael. Honestly, I feel much better after a vegetable meal and I really love the unique ideas you give us regularly.",
      "parent": "0",
      "gravatar_hash": "2f47cf20944759bec2f5c79ae8ee733f"
    },
    {
      "id": "35901",
      "author": "Eileen",
      "author_url": "http://hampiesandwiches.blogspot.com",
      "date": "2012-07-09 10:32:19",
      "content": "This eggplant sounds well worth the search for Thai basil!  (Actually, that shouldn't be too hard, as we have all kinds of Asian veg and herbs in our local farmer's market.  Hooray for California!)",
      "parent": "0",
      "gravatar_hash": "cd24e89d6c89fdf442e1f717b0827eee"
    },
    {
      "id": "36408",
      "author": "thyme (sarah)",
      "author_url": "http://rileymadel.blogspot.com",
      "date": "2012-07-11 03:35:35",
      "content": "Delicious recipe using eggplant!  I am always stumped trying to find different ways to cook eggplant so my family will eat it.  I love it but can't make it exciting enough for anyone else to love it.  I'll try this out...I like that it isn't served with mounds of rice...",
      "parent": "0",
      "gravatar_hash": "65b18d1b0fd4a641aa0c34f0bfaf6433"
    },
    {
      "id": "38033",
      "author": "Vegan",
      "author_url": "http://www.sevenpoint2.com/",
      "date": "2012-07-16 06:50:13",
      "content": "This is another great way of cooking eggplant. I didn't know there are many types of basil. I'm going to really look for that Thai basil.",
      "parent": "0",
      "gravatar_hash": "bda7603876252c69c15f63b58a0bf6f0"
    },
    {
      "id": "46187",
      "author": "Charis",
      "author_url": "",
      "date": "2012-08-19 22:59:10",
      "content": "Thanks for a Thai recipe. I'm lucky that our neighborhood farmer's market has an Asian vegetable stand where I can get a thick bunch of Thai basil for $2.50. This dish would be a great way to use the herb. I keep whatever is left after cooking in a vase with cold water on a sunny windowsill. They keep fresh for weeks and will even sprout. \n\nOn a side note, I'm curious if you ever got around cooking bitter melons and know any good ways to tackle them. As soon as I saw them at the farmer's market, I couldn't resist taking them home despite my lack of knowledge and experience with them. I can't get past the initial bitterness but want to find a way to enjoy it without being overwhelmed.",
      "parent": "0",
      "gravatar_hash": "7bb2130ee088a4f56fa3775bd1414594"
    },
    {
      "id": "46274",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-20 06:51:32",
      "content": "Hey Charis - nope, I've done very little cooking with bitter melon. I like a bite or two of it in Vietnamese soups, but I've never really bonded with it :).",
      "parent": "46187",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "56469",
      "author": "Kitty Payne",
      "author_url": "",
      "date": "2012-09-30 12:28:04",
      "content": "I grow this basil in my garden  Is it better fresh or dried?",
      "parent": "0",
      "gravatar_hash": "80c6e449000732dbc7ad01c934939aff"
    },
    {
      "id": "56475",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-30 12:31:49",
      "content": "Fresh; for sure. I've never heard of Thai Basil or Holy Basil being dried, don't think it would be much good. Even with Italian basil, the fresh and dried herbs are so completely different. They aren't really substitutes for each other, they just serve different purposes.",
      "parent": "56469",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "196855",
      "author": "Christine",
      "author_url": "",
      "date": "2013-09-20 08:45:53",
      "content": "Instead of water, you might want to substitute fish sauce for the eggplant steaming part of the recipe, unless you need to have it remain vegan. No additional salt is likely needed afterward if the fish sauce is used, and it rounds out the 'thai' flavor, imho.",
      "parent": "0",
      "gravatar_hash": "db955560fbb154ebbef0362b0be12886"
    },
    {
      "id": "1314041",
      "author": "Emily",
      "author_url": "",
      "date": "2015-09-25 14:20:30",
      "content": "It looks like you leave the eggplant unpeeled. Is that true?",
      "parent": "0",
      "gravatar_hash": "45568bbdc26d075d6cd5ce91de3c4858"
    },
    {
      "id": "1314042",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2015-09-27 16:01:53",
      "content": "Yep!",
      "parent": "1314041",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}