{
  "comment_count": 13,
  "comments": [
    {
      "id": "1390",
      "author": "Sarah",
      "author_url": "http://braiseandbutter.wordpress.com",
      "date": "2010-02-25 11:02:46",
      "content": "gosh, this looks wonderful-so full of vibrant flavors to wake up my winter-deadened palate!",
      "parent": "0",
      "gravatar_hash": "877d12a5c5efb6f03a24f4d19158fa3c"
    },
    {
      "id": "1391",
      "author": "lisaiscooking",
      "author_url": "http://lisaiscooking.blogspot.com",
      "date": "2010-02-25 12:17:36",
      "content": "I love these flavors. Sounds like a delicious, healthy meal!",
      "parent": "0",
      "gravatar_hash": "561295eae7a0ea547c538ab03aca58f2"
    },
    {
      "id": "1392",
      "author": "Foodeater",
      "author_url": "http://www.toliveandeatinla.com",
      "date": "2010-02-25 20:21:22",
      "content": "Mmmm delicious... and gorgeous!",
      "parent": "0",
      "gravatar_hash": "799b6f2d64f2b3520049ccff01bc0f97"
    },
    {
      "id": "1393",
      "author": "Alessandra",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2010-02-25 23:42:14",
      "content": "Delicious! Funny how you say cilantro and I say coriander :-)",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "1394",
      "author": "Charlottes Vegetarian Blog",
      "author_url": "http://www.charlotteconley.com",
      "date": "2010-02-26 17:16:47",
      "content": "I love how you describe the balance of the flavors! I might make it without the bird chili because I'm a big wuss :)",
      "parent": "0",
      "gravatar_hash": "77a7e6c7152bdfadb6f2e2a2a8d19d86"
    },
    {
      "id": "1395",
      "author": "wine blog",
      "author_url": "http://www.blogwinecellar.com",
      "date": "2010-02-26 17:17:07",
      "content": "Sounds like an amazingly delicious dish! Thanks for the recipe. Cheers~",
      "parent": "0",
      "gravatar_hash": "38e156545a0afaab27cf5d9f69e5765e"
    },
    {
      "id": "1396",
      "author": "roopa",
      "author_url": "http://raspberryeggplant.blogspot.com",
      "date": "2010-03-03 09:48:44",
      "content": "I've been on a huge Thai food kick lately since discovering one of the only Thai grocery stores in NYC just a few blocks from my office.  However, I've been in a drunken noodles, curry, and papaya/mango salad rut so when I saw this I knew I had to make it.  So, I made it over the weekend to go with some drunken noodles and my husband and I <b>loved</b> it.  The proportions and combination of flavors was just perfect.  I literally had to slap my husband's hand off the serving spoon because he almost ate all of it without letting me go back in for more!  It actually tasted better the next day when all the flavors came together and soaked into the tofu, but was still wonderful served immediately.\n\nThe strangest thing is that it tasted like there was fish sauce in it...not sure how those flavors combined to do that but it made it taste completely authentic.",
      "parent": "0",
      "gravatar_hash": "7c4a2c6bc7adee5cb2f7a96d7efa37df"
    },
    {
      "id": "1397",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-03-03 10:02:41",
      "content": "Thanks Roopa! I usually use a small amount of high quality soy sauce as the closest vegetarian thing to fish sauce. It doesn&#39;t have that same funkiness, but actually not having grown up with fish sauce, for me that is a plus. Especially when combined with the lime. I know there are plenty of people who *adore* fish sauce and think that recipes without it are missing the whole point, and there is no arguing taste. But in my book, I&#39;m happy. I bet if you wanted to get an even closer analog, a little dried-shiitake soaking liquid would give an umami boost.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1398",
      "author": "Silky Sienna",
      "author_url": "http://salad-a-day.blogspot.com",
      "date": "2011-08-31 19:44:52",
      "content": "Just a note, but an important one: a clarification is neccessary when calling this Gluten Free...Soy Sauce contains wheat, therefore gluten. I know and learned this from many bad and mysterious experiences. It is a terrible bloat and pain from that tiniest bit of gluten. However, most gluten-free people I hope already know that. But some, when just starting out with dietary allergies, etc., find Gluten hides in so many processed foods and sauces. Tamari Wheat Free soy sauce is the best alternative I have found, and I keep a small vial in my purse for sushi emergencies!",
      "parent": "0",
      "gravatar_hash": "57f2799d80a568b0503d5f2bd494a531"
    },
    {
      "id": "1399",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-08-31 20:05:54",
      "content": "Yes, you are absolutely right. I usually note this in the ingredient list but forgot to do it on this one! Will edit it now, and thanks for pointing that out.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1400",
      "author": "Heather",
      "author_url": "",
      "date": "2011-10-11 18:20:05",
      "content": "My husband is from Burma and it's hard to find recipes that are like his moms to give him that every now and then! So I am really enjoying this website and this salad sounds like a less spicy version of the one my mother in law makes! Thank you!",
      "parent": "0",
      "gravatar_hash": "d2c5864ca9c448e2f1890fc74cc7be90"
    },
    {
      "id": "1313971",
      "author": "Nancy",
      "author_url": "",
      "date": "2015-06-18 10:07:05",
      "content": "Made this for lunch today, I HATE tofu, but I ate a huge bowl!!  Definitely converted me to healthy tofu, thank you.",
      "parent": "0",
      "gravatar_hash": "669e731a079f4dc7dc387f08fb7b4f7c"
    },
    {
      "id": "1313972",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2015-06-18 10:46:50",
      "content": "That's what I like to hear!",
      "parent": "1313971",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}