{
  "comment_count": 5,
  "comments": [
    {
      "id": "3269",
      "author": "The Italian Dish",
      "author_url": "http://www.theitaliandish.blogspot.com",
      "date": "2008-09-30 07:30:25",
      "content": "Thanks for the great book review.  I'm pretty much a cookbook/food book addict.  I love reading about new books and you sold me on this one!",
      "parent": "0",
      "gravatar_hash": "3e4e3826bf4c9300ffc14fd965fa8026"
    },
    {
      "id": "3270",
      "author": "Joanna",
      "author_url": "http://scalloped-edge.blogspot.com",
      "date": "2008-09-30 08:48:34",
      "content": "Okay, I'm sold!  Actually, I read another review of this book earlier this week, and I was mostly sold then, but now your glowing review has pushed me over the edge.  I often take a \"throw everything in the pot\" approach to cooking, but a book like this might help me reign in those tendencies and really focus on what flavors work well together.",
      "parent": "0",
      "gravatar_hash": "162fb33db8c91df1cb51af7780965c65"
    },
    {
      "id": "3271",
      "author": "Micha",
      "author_url": "http://www.scrapingtheskillet.com",
      "date": "2008-09-30 16:08:34",
      "content": "I think I clicked over here from tastespotting...\n\nThanks for the review - I definitely have to get this book now.  I've been searching for a similar type of reference on the web but haven't found anything as thorough as this sounds.\n\nAlso, loved the recipe for the Achiote-Rubbed Butternut Squash Tacos.  I think I'll be making a variation on this in the near future...",
      "parent": "0",
      "gravatar_hash": "b8903e37928675f64eb87966ef385bf9"
    },
    {
      "id": "3272",
      "author": "Lael",
      "author_url": "http://onehungrysoul.blogspot.com",
      "date": "2008-10-02 07:58:03",
      "content": "thanks for making me aware of this great book and the couple behind it. I am wanting to become a more creative cook, and this sounds like great inspiration.\nbtw, I'm from Bellingham, but living in Texas for now. It's great to meet a fellow Pacific Northwester!",
      "parent": "0",
      "gravatar_hash": "6d506e8693d10c31dcab2f0b30f7bda4"
    },
    {
      "id": "3273",
      "author": "Lesley",
      "author_url": "http://lesleyeats.blogspot.com",
      "date": "2008-10-07 10:33:29",
      "content": "The Flavor Bible is definitely going on my Christmas list!",
      "parent": "0",
      "gravatar_hash": "1da8a8df7f00378ce9496cc845075fa0"
    }
  ]
}