{
  "comment_count": 9,
  "comments": [
    {
      "id": "49587",
      "author": "ben freedman",
      "author_url": "",
      "date": "2012-09-10 06:39:43",
      "content": "WOW, beautiful!",
      "parent": "0",
      "gravatar_hash": "825a1e4c2a61919d1de8623b92eeed1d"
    },
    {
      "id": "49591",
      "author": "Marina@Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-09-10 06:49:13",
      "content": "It is \"damned exciting food\" indeed! Artichoke tortellinis look very attractive, as well as everything else... I can even handle the dessert! :)",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "49593",
      "author": "Erik",
      "author_url": "http://postmath.net",
      "date": "2012-09-10 07:02:08",
      "content": "Awesome food, awesome story! (I was less than thrilled, though, to find the nag box about your cookbook covering my screen with, initially, no way to close it -- especially since I already have, and love, the book...)",
      "parent": "0",
      "gravatar_hash": "de9cd458b335ab8818467060e6d51769"
    },
    {
      "id": "49609",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-10 08:35:56",
      "content": "Hey Erik - Glad you liked the Canlis post, and the book! I hear you about the popup. I'm changing it now so that the close button is available right away, and it only appears to each person one time, so it won't be any kind of ongoing annoyance.",
      "parent": "49593",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "49619",
      "author": "Dawn | KitchenTravels",
      "author_url": "http://www.kitchentravels.com",
      "date": "2012-09-10 09:23:52",
      "content": "Michael - I've been following your blog for a couple of years now, and it gets more beautiful and engaging with every post. As an omnivore who absolutely loves vegetarian meals, I, too, am usually disappointed with the lack of interesting veggie options at \"regular\" restaurants. I hope more chefs will accept your challenge! Keep up the great work. xo",
      "parent": "0",
      "gravatar_hash": "cdd3b28114324aafd93b1030244c92b7"
    },
    {
      "id": "49629",
      "author": "Laura",
      "author_url": "",
      "date": "2012-09-10 09:43:48",
      "content": "Love what you did and the challenge to other chefs to take their veg dishes more serious.  I haven't eaten at Canlis in years since I live in California now but those dishes look enticing.  Readers challenge the chefs at the restaurants you go to to up their game when it comes to vegetarian.  I   bet it would be worth it.\n\nKeep the great blogs coming.",
      "parent": "0",
      "gravatar_hash": "eb9730ec28517427db4072a17e9097b5"
    },
    {
      "id": "49853",
      "author": "Dina",
      "author_url": "http://www.oliveoilandlemons.com",
      "date": "2012-09-11 11:00:25",
      "content": "Great post and look at that food. Work of art. I am also enjoying your book. Many treasures in there.\nCiao,\nDina",
      "parent": "0",
      "gravatar_hash": "004ea6b9e5095dcfe4c72df400f02fd0"
    },
    {
      "id": "155370",
      "author": "Rene'e Amantia-Yonnetti",
      "author_url": "",
      "date": "2013-06-05 06:05:21",
      "content": "Your area of passion and talent just amaze me ! I wish to learn more and more from you. I'm in the mist of opening a Rustic Bistro -Seafood and fresh Pasta Shoppe in the upstate area of New York and can't get enough of your vegetarian creativity with that I'm trying to pair with my pasta . Here's the thing I have no schooling with food just an endless desire to create flavors with a visual palette . Now off to this breath taking meal from Canlis where could someone learn hands on for this level of creativity ?Thank You so kindly for all you share. Rene'e",
      "parent": "0",
      "gravatar_hash": "5a82091bbd4e9da3e2dcfc8b9ac1e536"
    },
    {
      "id": "155497",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-06-05 10:29:42",
      "content": "Hey Rene'e - thanks for the kind words and congratulations on opening your bistro! As far as learning this level of creativity, it is mostly a matter of carving out time to learn and try new things. Take a look at what we are doing over at http://chefsteps.com - you'll find a *lot* of innovative, beautiful techniques with videos that show you exactly how to do them.",
      "parent": "155370",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}