{
  "comment_count": 71,
  "comments": [
    {
      "id": "1784",
      "author": "jenisesilva@yahoo.com",
      "author_url": "",
      "date": "2009-10-28 20:29:50",
      "content": "Extending the Table for the wonderful world cuisine recipes & the culural stories associated with each entry.",
      "parent": "0",
      "gravatar_hash": "7101863c2f3daab4ada8d3869dce0f32"
    },
    {
      "id": "1785",
      "author": "Holly",
      "author_url": "",
      "date": "2009-10-28 20:50:39",
      "content": "I just picked up a copy of  \"Vegan Yum Yum\" by Lauren Ulm last week, and it's become a fast favorite. As a vegetarian (border-line vegan) living with three hungry omnivore boys, a cookbook like this would be perfect for our household! :)",
      "parent": "0",
      "gravatar_hash": "7185160019a620873fa4c5326761b649"
    },
    {
      "id": "1786",
      "author": "Dianne",
      "author_url": "http://www.cityproperties.re",
      "date": "2009-10-28 21:09:38",
      "content": "I. Want. To Win! I am in the same boat as Ivy, but I'm the vegetarian.",
      "parent": "0",
      "gravatar_hash": "efbca1d9482879ed86826fdbec97a135"
    },
    {
      "id": "1787",
      "author": "Miriam",
      "author_url": "",
      "date": "2009-10-28 21:43:51",
      "content": "I the all the Moosewood Collective's Cookbooks for vegetarian standards although I am particularly exited about The Adaptable Feast.  My live-in partner is a committed carnivore and I'm a 20+ year vegetarian.   Dinner can be a struggle.",
      "parent": "0",
      "gravatar_hash": "7e6b59860231340c095f5da0ff4b5542"
    },
    {
      "id": "1788",
      "author": "berniegehret@hotmail.com",
      "author_url": "http://www.portlandoregonwine.com",
      "date": "2009-10-28 22:09:13",
      "content": "My favorite cookbook is simply the \"Joy of Cooking\", because it's such a great reference for all of the basics!  Every time I cook meat I check it for cooking times...",
      "parent": "0",
      "gravatar_hash": "e751eea31f9ff3a151b9681248c1ea5c"
    },
    {
      "id": "1789",
      "author": "Alana",
      "author_url": "http://teapotsandpolkadots.blogspot.com",
      "date": "2009-10-28 22:23:05",
      "content": "I adore The Bread Bible by Beth Hensperger. Taught me how to bake bread, and continues to inspire me to try new things.",
      "parent": "0",
      "gravatar_hash": "2a14018189915d51a2823129452bb9de"
    },
    {
      "id": "1790",
      "author": "heather",
      "author_url": "",
      "date": "2009-10-28 22:29:27",
      "content": "one of the first cookbooks i bought after giving up meat was \"world vegetarian\" by madhur jaffrey.  not only did i get some wonderful recipes, but learning about all these different cuisines gave me the courage to start mixing and matching and coming up with things on my own.",
      "parent": "0",
      "gravatar_hash": "0f842171422a75151312853807a1d00c"
    },
    {
      "id": "1791",
      "author": "Jess",
      "author_url": "",
      "date": "2009-10-28 22:32:25",
      "content": "I would love this cookbook because I have a mixed group of eaters in my house",
      "parent": "0",
      "gravatar_hash": "bf4e9f21f50718f5a9dab34cd493f5bf"
    },
    {
      "id": "1792",
      "author": "Katie",
      "author_url": "http://everydaylifeofahousewife.wordpress.com",
      "date": "2009-10-28 22:34:15",
      "content": "I want this - does it matter that I live in Canada if I win it??  I'm a fish eating vegetarian and my hubby is a meat lover - the kind who loves a dripping steak.  I am working around to eating poultry that is raised kindly and locally, but I can't imagine going back to eating beef and pork.  Even if I do start eating poultry again, for the sake of money, I want to keep a mostly vegetarian menu for supper at home.",
      "parent": "0",
      "gravatar_hash": "ddd897cbdf5040d277a43b7b3f5b0514"
    },
    {
      "id": "1793",
      "author": "Christine",
      "author_url": "",
      "date": "2009-10-28 23:04:23",
      "content": "My favorite cookbook is actually a collection my Mom put together of all her family's favorites over the years. It has been in our kitchen for almost 15 years and is well worn and something I can always look to for a home-made meal - even though my family is omnivorous and I am vegetarian. I am excited to see this new cookbook.",
      "parent": "0",
      "gravatar_hash": "8a3ed170bc56d57680c2204a969941e6"
    },
    {
      "id": "1794",
      "author": "John - Mormon Foodie",
      "author_url": "http://mormonfoodie.blogspot.com",
      "date": "2009-10-28 23:28:27",
      "content": "This is brilliant. I'm an omnivore at heart, but I'm also a big believer in limiting animal products in our diets. As Mark Bittman might say, I'm trying to be a \"lessmeatarian. :-) The trouble I'm running into is both access to, and great ideas for, vegetable based dishes. Of course, that's why I read your blog, Micheal, and the blogs of other vegetarians.\n\nOh! Thanks for the \"introduction\" to Ivy Manning. I've started following her on Twitter. I follow you and a few other vegetarians, too. Does that make me a veggie-stalker? Hmmm. ;-)",
      "parent": "0",
      "gravatar_hash": "0750826129ee44caebb3eba7010ade18"
    },
    {
      "id": "1795",
      "author": "Ellen",
      "author_url": "http://www.ellenp1214.wordpress.com",
      "date": "2009-10-29 00:05:46",
      "content": "i love mark bittman's how to cook everything. i'm not 100% vegetarian, but i almost always cook that way. this book would be a great resource! thanks for the giveaway.",
      "parent": "0",
      "gravatar_hash": "458ac01b003f1a3d7211aae8e16a9b16"
    },
    {
      "id": "1796",
      "author": "Anne",
      "author_url": "",
      "date": "2009-10-29 04:10:57",
      "content": "My favorite cookbook is the one that Michael Natkin hasn't written yet.  ;)  But failing that, I love Jack Bishop's _The Complete Italian Vegetarian Cookbook_ - there are so many classic recipes, and new ones with a twist, and nothing I've ever made from that book has failed to please everybody at the dinner table.\n\nMichael, if you don't know about _The Flexitarian Table_, you should check it out. It's also focused on meals that have a meat/fish and a veg component, and there are some really innovative flavor combinations. It transformed the way I look at tofu - it had never really occurred to me that tofu could be combined with flavors from all different cultures, not just Asian ones.\n\nCongratulations to Ivy - the new book sounds great!",
      "parent": "0",
      "gravatar_hash": "5cdecc447861b205659b26b2585302fb"
    },
    {
      "id": "1797",
      "author": "Laura",
      "author_url": "http://www.waspandorchid.blogspot.com",
      "date": "2009-10-29 06:02:16",
      "content": "Thanks for the opportunity!  Ivy's cookbook sounds wonderful. My go-to cookbook lately has been The Healthy Hedonist by Myra Kornfeld. All of the recipes in it are so tempting, and the ones I've made so far are definitely keepers.",
      "parent": "0",
      "gravatar_hash": "d9d4c4085cb4523725afbd27d760e64e"
    },
    {
      "id": "1798",
      "author": "Holly",
      "author_url": "",
      "date": "2009-10-29 06:13:46",
      "content": "Mark Bittman's \"How To Cook Everything\" and \"How To Cook Everything Vegetarian\" are my bibles. I'm really not good at following rules, and his recipes are easy to manipulate.",
      "parent": "0",
      "gravatar_hash": "37ceceeb12f2d03e3f0dbed3f919e666"
    },
    {
      "id": "1799",
      "author": "lisaiscooking",
      "author_url": "http://lisaiscooking.blogspot.com/",
      "date": "2009-10-29 06:51:23",
      "content": "This book sounds great. For vegetarian cooking, I have to say my favorite is Deborah Madison's Veg. Cooking for Everyone for completeness.",
      "parent": "0",
      "gravatar_hash": "561295eae7a0ea547c538ab03aca58f2"
    },
    {
      "id": "1800",
      "author": "Scott",
      "author_url": "",
      "date": "2009-10-29 07:18:46",
      "content": "I'll second Anne's nod to \"The Flexitarian Table\" by Peter Berley, coming from a house with vegetarians and omnivores.  We'll have to check out the Adaptable Feast as well.\n\nOne of our favorite vegetarian cookbooks is Heidi Swanson's \"Super Natural Cooking.\"  Great ideas and flavor combinations.  I also enjoy her blog \"101 Cookbooks.\"  Madhur Jaffrey's and Mark Bittman's cookbooks are also go-to's in our kitchen.",
      "parent": "0",
      "gravatar_hash": "b56360d04072b2e3d2d8649634dd6ca9"
    },
    {
      "id": "1801",
      "author": "Debbie",
      "author_url": "",
      "date": "2009-10-29 07:34:40",
      "content": "I like the recipes in the \"Cancer Survivor's Cookbook\" because it was my first experience with plant-based cooking and I can always get a healthy low-fat recipe out of there!",
      "parent": "0",
      "gravatar_hash": "040418f36a919d74b6e67efeab6211bb"
    },
    {
      "id": "1802",
      "author": "Tiffani",
      "author_url": "http://manzanilloblog.com",
      "date": "2009-10-29 07:38:45",
      "content": "My grandma made me a cookbook. I think it is the only family item i have passed down. She is German and makes incredible food. Now i can make it too even though i live far away. It is my favorite for sure.",
      "parent": "0",
      "gravatar_hash": "bee503ad065ec3da4402985294d0fa50"
    },
    {
      "id": "1803",
      "author": "Raluca",
      "author_url": "http://thesassyfoodie.wordpress.com",
      "date": "2009-10-29 07:53:41",
      "content": "My fav cookbook so far is: McGee - On food and cooking. I find it absolutely fascinating! But can I have this one as well? :)",
      "parent": "0",
      "gravatar_hash": "5dcad8950beb92fa7b63dc651bdbd47f"
    },
    {
      "id": "1804",
      "author": "Amber",
      "author_url": "",
      "date": "2009-10-29 08:03:25",
      "content": "The Grit Cookbook, I just can't get enough of their yeast gravy or their Carrot Cake!  Beware the yield on these recipes are huge.  I love it so much I gave it as gifts to 4 people last Christmas.  I'm also looking to \"How to cook everything Vegetarian\" a lot lately too.  It's a wealth of basic knowledge.",
      "parent": "0",
      "gravatar_hash": "6c706ad79e3d94c836bbc1bc8c0102a5"
    },
    {
      "id": "1805",
      "author": "Sheilah Schneider",
      "author_url": "",
      "date": "2009-10-29 08:17:37",
      "content": "As the only vegetarian in a Wyoming carnivore family, I'd love to have \"The Adaptable Feast.\" I can use all the help I can get! My current favorite cookbook is Isa Chandra Moskowitz' \"Vegan Brunch.\" Her muffin recipes have been feeding my brother's carnivore crew for weeks, and everyone loves them! I still make oatmeal pancakes from a 20-year old version of \"Laurel's Kitchen,\" my first favorite cookbook. And I have to mention \"Heaven's Banquet\" by Miriam Kasin Hospodar - her recipe for Summer Squash in Sour Cream with Dill and Fennel is marvelous.",
      "parent": "0",
      "gravatar_hash": "5f020115c9067418ccce43f820c16733"
    },
    {
      "id": "1806",
      "author": "Colleen",
      "author_url": "",
      "date": "2009-10-29 08:22:13",
      "content": "I have an ever-growing cookbook collection, and just about all of them have at least 1 favorite recipe in them.  But the one which I can confidently turn to for just about fool-proof recipes is Bernard Clayton's _New Complete Book of Breads_.  Whole wheat breads, corn breads, white breads, onion rye... and the fabulous recipe for dinner rolls are all ones I've used repeatedly.",
      "parent": "0",
      "gravatar_hash": "13731271bc450f97a19b7939973aef07"
    },
    {
      "id": "1807",
      "author": "Jean Gogolin",
      "author_url": "http://www.jeangogolin.com",
      "date": "2009-10-29 08:23:55",
      "content": "My all-time favorite cookbooks (out of more than 100) are Julia's original one and Lynn Rosetta Kasper's \"The Spendid Table.\" I've never made anything from Splendid Table that wasn't wonderful, especially the garlic soup. And once you peel the cloves of 3 heads of garlic, it's a breeze to make.",
      "parent": "0",
      "gravatar_hash": "8d28b29ad91afb602536f279c91f9052"
    },
    {
      "id": "1808",
      "author": "Dips",
      "author_url": "http://centaurcooks.blogspot.com",
      "date": "2009-10-29 08:54:20",
      "content": "My favorite cookbook these days is the 'The Art of Indian Vegetarian Cooking' by Yamuna Devi..a great book for simple but amazingly tasty recipes..",
      "parent": "0",
      "gravatar_hash": "bec4cc1f11a167a8f4e689f8a5fc503f"
    },
    {
      "id": "1809",
      "author": "Heather",
      "author_url": "",
      "date": "2009-10-29 09:06:26",
      "content": "My go-to cookbook is the Joy of Cooking, it's chockfull of classic recipes and helpful background information about all sorts of ingredients!",
      "parent": "0",
      "gravatar_hash": "eb137aed0d5e334dd7a696b31930c922"
    },
    {
      "id": "1810",
      "author": "Jamie B",
      "author_url": "",
      "date": "2009-10-29 09:24:22",
      "content": "Picking my favorite cookbook is like trying to pick your favorite kid.  So I just went with the one I give as a gift on a regular basis:  Good Housekeepings Illustrated CookBook.  It is hands down the best basic cookbook on how to cook everything.  It has illustrations (duh) that are a huge help to beginning cooks.   I am vegetarian, however it does have illustrations on how to bone a chicken, measure equivalents, etc My mom bought my sister and I a copy over 20 years ago and its still my go-to for the basics.  The cinnamon roll recipe is the bomb.",
      "parent": "0",
      "gravatar_hash": "7777e7e6cbdcfcb617061c3e0657761f"
    },
    {
      "id": "1811",
      "author": "Wendy French",
      "author_url": "http://www.skinnycookscantbetrusted.blogspot.com",
      "date": "2009-10-29 09:32:18",
      "content": "My favorite cookbook is \"How to Eat Supper\" by Lynne Rossetto Kasper and Sally Swift.  It's very entertaining and has lots of wonderful information.  Not to mention, the recipes are very tasty, quick, adaptable and easy to prepare on weeknights.\n\nMy favorite recipe is the 21st Century Mac & Cheese.  Yuuuum.",
      "parent": "0",
      "gravatar_hash": "bcc315d4f6852345800d225d9960e07b"
    },
    {
      "id": "1812",
      "author": "Christi",
      "author_url": "",
      "date": "2009-10-29 09:46:08",
      "content": "I've collected quite a few cookbooks over the years but my favorite, by far, is \"Simply in Season\" from the Mennonite Central Committee.  This book has tons of amazing, simple to prepare recipes sorted by season so that the recipes are made from produce that is at it's peak locally during that season.  LOVE IT.",
      "parent": "0",
      "gravatar_hash": "9a7776dc3a331f95a2df8ec928540688"
    },
    {
      "id": "1813",
      "author": "Hannah",
      "author_url": "http://iheartkale.blogspot.com",
      "date": "2009-10-29 09:58:40",
      "content": "Another vote for Madhur Jaffrey's World Vegetarian!  It's so huge that I'm always finding new recipes, and I love how it's sorted by ingredient--it really facilitates cooking seasonally to be able to flip straight to the eggplant recipes.",
      "parent": "0",
      "gravatar_hash": "bd1d5c38a95426994aa2235bf3f2558a"
    },
    {
      "id": "1814",
      "author": "Janice",
      "author_url": "",
      "date": "2009-10-29 10:52:00",
      "content": "One of my favorite cookbooks is Heidi Swanson's Super Natural Cooking.  Delicious from cover to cover, with gorgeous photos to match.",
      "parent": "0",
      "gravatar_hash": "e11a51478f85112093ad209dbacfb6b4"
    },
    {
      "id": "1815",
      "author": "Danielle",
      "author_url": "",
      "date": "2009-10-29 10:59:23",
      "content": "How to Cook Everything Vegetarian by Mark Bittman - he's the greatest.\nLove your blog - keep up the good work!",
      "parent": "0",
      "gravatar_hash": "18008d703148948548f61925147bd729"
    },
    {
      "id": "1816",
      "author": "Jamie",
      "author_url": "",
      "date": "2009-10-29 11:01:02",
      "content": "I'm not the first to say it, but Mark Bittman's \"How To Cook Everything Vegetarian\".  I wasn't a cook before I picked this up.  Now I'm still not much of a cook, but I'm getting there.  I find that one of the greatest things about this book is how complete the index is.  Kale is cheap?  Buy some - it's easy to search by ingredient in this book.",
      "parent": "0",
      "gravatar_hash": "ccb76a8f193d66c514fb78d67647a400"
    },
    {
      "id": "1817",
      "author": "Cristy",
      "author_url": "",
      "date": "2009-10-29 11:41:34",
      "content": "I'd love a copy of this book for the mix of eaters in my house!",
      "parent": "0",
      "gravatar_hash": "4ef1e9de887a49c2cdf0d4ae5fe8060b"
    },
    {
      "id": "1818",
      "author": "-Shuli",
      "author_url": "",
      "date": "2009-10-29 13:44:37",
      "content": "How to Cook Everything Vegetarian, Mark Bittman.  Go to's for just about every veggie and grain - plus a million ways to create and combine.  It has taught me how to cook off-the-cuff and reinvent recipes.  I sometimes go shopping for an ingredient I've never used before and then come home and open the book... never disappointed.  Next great book:\nWhole Grains Every Day, Every Way by Lorna Sass.",
      "parent": "0",
      "gravatar_hash": "7b783f6ec3aa45848bafcfce4b893b48"
    },
    {
      "id": "1819",
      "author": "Swarna Mani",
      "author_url": "",
      "date": "2009-10-29 14:14:46",
      "content": "I love Steven Raichlen's High-Flavor, Low-Fat Vegetarian Cooking. I like this the most out of my 40 cookbooks beacuse not even a single recipe has failed me. I have tried about 1/2 dozen recipes and after I finish and taste them , they arte ambrosia in my mouth.\nSome examples grilled zucchini and red pepper lasagna, Vegetable burger, quinoa pilaf.\n\n-- Swarna",
      "parent": "0",
      "gravatar_hash": "49bfc5e273477b9f711b907be1035c22"
    },
    {
      "id": "1820",
      "author": "Elizabeth",
      "author_url": "",
      "date": "2009-10-29 14:33:33",
      "content": "This book sounds great!  I love The Art of Simple Food, which isn't vegetarian but all the vegetarian recipes in it are amazing.",
      "parent": "0",
      "gravatar_hash": "541da0e09cc6259cd15bcd4872e7d367"
    },
    {
      "id": "1821",
      "author": "Sarah",
      "author_url": "",
      "date": "2009-10-29 14:36:46",
      "content": "I don't have a favorite cookbook! It depends, but right now I'm digging the winter dishes in Vegetarian Suppers by Deborah Madison.",
      "parent": "0",
      "gravatar_hash": "6463615559f8065f734ddda8a993215c"
    },
    {
      "id": "1822",
      "author": "Kate B",
      "author_url": "",
      "date": "2009-10-29 15:41:31",
      "content": "I love \"Vegetarian Planet\" by Didi Emmons.  Seriously, everything I make out of there is fabulous!!  The recipes vary from the elaborate to the simple, so there is always something to make.  But I also am into \"Moosewood Daily Restaurant Special\" for all of its wonderful soups.  Perfect for this time of year!  Thanks for considering me for this drawing!",
      "parent": "0",
      "gravatar_hash": "77b2300fdf168eeb27f28edf3e2da827"
    },
    {
      "id": "1823",
      "author": "LJ",
      "author_url": "",
      "date": "2009-10-29 16:06:08",
      "content": "I love Veganomicon, but since my husband is an omni, The Adaptable Feast sounds like it could become our new favorite!",
      "parent": "0",
      "gravatar_hash": "04b4dca736ce135bc8a58a9295cd5e97"
    },
    {
      "id": "1824",
      "author": "Ivy Manning",
      "author_url": "http://ivysfeast.blogspot.com",
      "date": "2009-10-29 16:24:24",
      "content": "I second Anne, I am looking forward to Michael's cookbook! When will that be out, Mr. Herbivoracious?  I also second Kate B, I love Vegetarian Planet. Not so much with Didi's second book, but the first one is gold!\n\nAnybody that is mixed diet, or trusts Michael's advice, please stop by my blog ivysfeast <dot> blogspot. It's newish, but there's lots of mixed diet and veggie content there, too.\nGood luck on the contest!",
      "parent": "0",
      "gravatar_hash": "398d9a223280b1350d4db253ecccefe3"
    },
    {
      "id": "1825",
      "author": "Kim",
      "author_url": "",
      "date": "2009-10-29 16:56:38",
      "content": "Favorite Cookbook???? That is a hard one.  I have been Veg for 16 years now, but still find myself always referring to 'Joy Of Cooking' although I do love Mark Bittman's 'How to Cook Everything Vegetarian' -- I just love his approach.  I think that this cookbook sounds genius!  It is nice to know that I will be able to satisfy both parties at a potluck and not always be the girl that brings the Veg dish.  Thanks for the great giveaway...Keeping my fingers crossed.  Cheers!!!",
      "parent": "0",
      "gravatar_hash": "1e0b5de3d9663f476b203a2b0821cc5d"
    },
    {
      "id": "1826",
      "author": "Vicki",
      "author_url": "http://madball911.blogspot.com",
      "date": "2009-10-29 17:16:53",
      "content": "I love my copy of Culinaria Hungary. Not only are there great recipes, but the photos are amazing, and there's a lot of history & information about the dishes and the ingredients.",
      "parent": "0",
      "gravatar_hash": "d1f1c91031ecef8eb728c0bebe815eb8"
    },
    {
      "id": "1827",
      "author": "arugulove",
      "author_url": "http://arugulove.wordpress.com",
      "date": "2009-10-29 19:26:43",
      "content": "I love Deborah Madison's Local Flavors.  I just got it recently, but I'm in love with it.  Everything in it is simple and fresh.\n\nThis cookbook sounds great.  My first cookbook was Almost Vegetarian, which has a lot of flexible omnivore/carnivore type recipes in it.  It has served me well over the years and I'd love a new spin on it.",
      "parent": "0",
      "gravatar_hash": "253d1978cdae80b623ebb342e1426589"
    },
    {
      "id": "1828",
      "author": "Tracy",
      "author_url": "http://www.tracyfood.com",
      "date": "2009-10-29 19:37:53",
      "content": "I'm definitely curious about this book and am off to see if I can get a library copy if I don't luck out on this contest =)",
      "parent": "0",
      "gravatar_hash": "ec4ee57bf1dbee11d6fa8f212eaf2f13"
    },
    {
      "id": "1829",
      "author": "Kimberly",
      "author_url": "",
      "date": "2009-10-29 20:09:26",
      "content": "I like my basic Better Homes and Gardens -- it is easy to adapt everything and sometimes just the basics are the best.",
      "parent": "0",
      "gravatar_hash": "988fddd0fde142f5686e50999c1d160b"
    },
    {
      "id": "1830",
      "author": "karyn",
      "author_url": "",
      "date": "2009-10-29 20:23:22",
      "content": "My favorite cookbook changes all the time with my moods, the seasons, my schedule or my stress level.   Right now my favorite cookbook is Vegan Express.  Life is hectic at the moment and this book helps me a lot.\n\nThe Adaptable Feast sounds like just what I need for the holidays.  The rest of the family is omni and I sometimes just give up and make the same things over and over again.  New ideas would be wonderful.",
      "parent": "0",
      "gravatar_hash": "840375831920bc4f8c09a3ae9c10b091"
    },
    {
      "id": "1831",
      "author": "Rammy M",
      "author_url": "",
      "date": "2009-10-29 22:03:36",
      "content": "No favorite cookbook, just favorite recipes.  One from \"here\" one from \"there\" etc, ranging from NYT cookbook, check-out lane recipe booklet, websites, etc.",
      "parent": "0",
      "gravatar_hash": "4da8fea2778a405bff1a1f16dc588b89"
    },
    {
      "id": "1832",
      "author": "missy",
      "author_url": "",
      "date": "2009-10-30 14:26:05",
      "content": "I love the good housekeeping cookbook, if only for the fact that it taught my fiance how to cook.  <3",
      "parent": "0",
      "gravatar_hash": "a3998b46e3f3a7da09269a49f2ca92dc"
    },
    {
      "id": "1833",
      "author": "SippitySup",
      "author_url": "http://www.sippitysup.com",
      "date": "2009-10-31 10:20:29",
      "content": "I love Guy Mirabellas new book Eat/Ate because it is as beautiful in your hands as it is in your belly! GREG",
      "parent": "0",
      "gravatar_hash": "9cabcc3f2cd4831786098e56138aae69"
    },
    {
      "id": "1834",
      "author": "Sofie",
      "author_url": "",
      "date": "2009-10-31 14:31:43",
      "content": "My favourite cook is \"Delicious Days\" written by blogger/cookbook author Nicole Stich",
      "parent": "0",
      "gravatar_hash": "d7b37c6c51715b754e894bed58036e7f"
    },
    {
      "id": "1835",
      "author": "Melissa",
      "author_url": "http://thestylemd.blogspot.com",
      "date": "2009-10-31 19:52:09",
      "content": "Right now my fave cookbook is Vegan Planet cause they have so many recipes that I will never run out!",
      "parent": "0",
      "gravatar_hash": "8e39a45b6dd4f0ec3b3489b2990d8986"
    },
    {
      "id": "1836",
      "author": "Romana",
      "author_url": "",
      "date": "2009-11-01 00:20:13",
      "content": "Right now (because it's new and because I love dumplings is Andrea Nguyen's \"Asian Dumplings: Mastering Gyoza, Spring Rolls, Samosas, and More\".\n\nThanks for the great give away. I keep my fingers crossed!\n\nGreetings from Berlin, Germany",
      "parent": "0",
      "gravatar_hash": "345e18465ea6c0ac9833aee1e124d71b"
    },
    {
      "id": "1837",
      "author": "Celia",
      "author_url": "http://www.greencolander.com",
      "date": "2009-11-01 07:28:24",
      "content": "This cookbook sounds perfect! I am a vegetarian, my fiance is a carnivore, and we have a mix of both (and vegans and gluten-free!) in our regular circle of friends. I'm a collector of cookbooks and I love to cook, so for me it's always a fun challenge more than an obstacle, but I need all the help I can get - I will have to get my hands on this book. Thanks for bringing it to our attention!",
      "parent": "0",
      "gravatar_hash": "905718d900c5d7809c49133fc0b1057a"
    },
    {
      "id": "1838",
      "author": "Celia",
      "author_url": "http://www.greencolander.com",
      "date": "2009-11-01 07:31:20",
      "content": "I totally forgot to add my own favorite cookbook. For hearty vegetarian meals that are so delicious and filling that the carnivores don't even notice they're missing the meat - I love Claire's Cornercopia, an awesome veggie book from the small cafe in New Haven that I used to go to in college, when I was NOT vegetarian, just because their food was so great. I highly recommend her soups!",
      "parent": "0",
      "gravatar_hash": "905718d900c5d7809c49133fc0b1057a"
    },
    {
      "id": "1839",
      "author": "Jennifer Erickson/Rook No. 17",
      "author_url": "http://www.rookno17.blogspot.com",
      "date": "2009-11-01 12:16:40",
      "content": "Michael, this cookbook looks wonderful.  My favorite cookbook (the one that has the most \"miles\" on it) is my Cooks Illustrated Best Recipe.  I've tried dozens of recipes and have been beyond thrilled with every single one (except the Northern cornbread and the banana bread).",
      "parent": "0",
      "gravatar_hash": "863e4f8d2ba47a2c1453811a93ac0e64"
    },
    {
      "id": "1840",
      "author": "Ung Chi Huor",
      "author_url": "",
      "date": "2009-11-02 10:52:11",
      "content": "I've been to London a couple of weeks ago and fell immediately in love with the delicious food of the Ottolenghi restaurants.\n\nThat's why I bought Yotam Ottolenghi's and Sami Tamimi's \"Ottolenghi: The Cookbook.\"\n\nYotam and Sami’s inventive yet simple dishes are inspired by their respective childhoods in West and East Jerusalem based on culinary traditions from North Africa, Lebanon, Italy and California",
      "parent": "0",
      "gravatar_hash": "aaffd36ec635cd94936a2f30a8df805e"
    },
    {
      "id": "1841",
      "author": "Sarah",
      "author_url": "",
      "date": "2009-11-02 15:03:39",
      "content": "I like Vegan Fusion cookbook, as I love the healthy ethic, fresh herbs and unique signature taste. Right now, I'm seeking new cookbooks, so would love to win this book!",
      "parent": "0",
      "gravatar_hash": "9d43d3efc2704d81ef8d256daec6f38e"
    },
    {
      "id": "1842",
      "author": "Hillary",
      "author_url": "http://chewonthatblog.com",
      "date": "2009-11-02 15:32:52",
      "content": "This sounds like a great cookbook! We love Alice Waters' The Art of Simple Food! <a href=\"http://www.chewonthatblog.com/2007/10/04/on-meeting-alice-waters/\" rel=\"nofollow\">http://www.chewonthatblog.com/2007/10/04/on-meeting-alice-waters/</a>",
      "parent": "0",
      "gravatar_hash": "30a98e176497d2665d6ebe4e25a89382"
    },
    {
      "id": "1843",
      "author": "JMom",
      "author_url": "http://kitchen.amoores.com",
      "date": "2009-11-02 18:47:24",
      "content": "The Fanny Farmer Cookbook is my Joy of Cooking. It's the first cookbook I've ever owned and still refer to.",
      "parent": "0",
      "gravatar_hash": "60006c4849bbb477b14eb84bbd4c1340"
    },
    {
      "id": "1844",
      "author": "amelia",
      "author_url": "http://www.ztastylife.com/",
      "date": "2009-11-02 21:51:19",
      "content": "I love Chez Panisse vegetables because it starts with the ingredient first, which ultimately produces wonderful final results.",
      "parent": "0",
      "gravatar_hash": "01dcca60fc4a0ece8a2005ba7eddddd3"
    },
    {
      "id": "1845",
      "author": "Megan",
      "author_url": "",
      "date": "2009-11-03 11:47:48",
      "content": "How to Cook Everything... Vegetarian by Mark Bittman.",
      "parent": "0",
      "gravatar_hash": "065fe7d7f5e69eea5eccf18a2e29b461"
    },
    {
      "id": "1846",
      "author": "Keosun",
      "author_url": "",
      "date": "2009-11-03 14:32:35",
      "content": "I love my brandnew cookbook \"Momofuku\" written by David Chang and Peter Meehan",
      "parent": "0",
      "gravatar_hash": "bc2dc98c95c3449b107f565012d7d710"
    },
    {
      "id": "1847",
      "author": "Rebecca",
      "author_url": "",
      "date": "2009-11-03 21:05:34",
      "content": "My first cookbook is my favorite-- the Moosewood Low-Fat Cookbook. Why? Well, because it was my first! And it's chock-full of amazing recipes that even as a poor, busy college student I could adapt and make my own.",
      "parent": "0",
      "gravatar_hash": "0bd69bcaf53497c8c83e12947d3a11e8"
    },
    {
      "id": "1848",
      "author": "Lisa",
      "author_url": "",
      "date": "2009-11-04 19:15:38",
      "content": "have you seen \"The Flexitarian Table\" by Peter Berley?  it has the exact same premise.  wish i had found your blog early enough to submit the comment in time to win the cookbook...",
      "parent": "0",
      "gravatar_hash": "42b13723d62995ab4849b0bf1df0a776"
    },
    {
      "id": "1849",
      "author": "rich",
      "author_url": "",
      "date": "2009-11-04 19:43:46",
      "content": "I don't really have a fav cookbook, since recipes come from a variety of sources, but Rick Bayless \"One Plate at a Time' and 'Hot Sour Salty Sweet' were memorable.",
      "parent": "0",
      "gravatar_hash": "da5afbf459c6ce47dd9e762c4c0b887a"
    },
    {
      "id": "1850",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-11-04 21:27:18",
      "content": "And the winner is commenter #7, Heather, who's favorite cookbook is Madhur Jaffrey's World Vegetarian. Thanks everyone for entering! And if you didn't win, I highly recommend purchasing Ivy's book - the link is up in the article.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22407",
      "author": "Jeanne Endsley",
      "author_url": "",
      "date": "2012-04-04 06:33:15",
      "content": "My favorite cookbook at the moment is  the veggie queen by Jill nussenow.",
      "parent": "0",
      "gravatar_hash": "204443b370ea97dc2e5426574e3feb33"
    },
    {
      "id": "22464",
      "author": "Alison Lambert",
      "author_url": "",
      "date": "2012-04-04 18:07:38",
      "content": "Elizabeth David's FRENCH PROVINCIAL COOKING has to top my list. I found the hard copy  decades ago in an op shop for 20 cents and in provincial Queensland in the 60s it showed me a whole new approach to food. I like a cookbook to be a pleasure to read as well as instructive. Thanks also for your interesting and inspirational site, Michael!",
      "parent": "0",
      "gravatar_hash": "05e2349133bf6e78dd742985d040c8cf"
    },
    {
      "id": "136554",
      "author": "Jan",
      "author_url": "",
      "date": "2013-04-12 12:48:38",
      "content": "When the recipe has to be edible on the first try (and I have a bad habit of trying out new things for important events) I depend on my Ultimate Southern Living Cookbook. For inspiration, I read Frank Stitt's Southern Table or Yotam Ottolenghi's Plenty.",
      "parent": "0",
      "gravatar_hash": "162202a47304ac8fa8e44cc64d31d9a3"
    },
    {
      "id": "154041",
      "author": "Shauna Meador",
      "author_url": "",
      "date": "2013-06-01 09:24:07",
      "content": "When my husband and I decided to \"Pescatarian July\" in 2011, Julie Sahni's \"Classic Indian Cooking\" became my bible.  We remained Pescatarian.  Today we begin \"Vegetarian June\" and I received my copy of \"Herbivoracious\" last Thursday!  We shall see what the future holds for us...",
      "parent": "0",
      "gravatar_hash": "5e27c3922533893d120dc0d7f1b42a5a"
    }
  ]
}