{
  "comment_count": 10,
  "comments": [
    {
      "id": "1122",
      "author": "Rashmi",
      "author_url": "",
      "date": "2010-05-24 20:40:54",
      "content": "Hi Michael,\nI am regular reader of your blog, sometimes my day at work starts after reading something yummy in your blog. I am not too familiar with many ingredients that you use, so I usually look it up on the net. The other day I was looking up Parmigiano reggiano. The use of calf rennet in cheese making shocked me. I am a south Indian vegetarian and I love to eat Pizzas and pastas at times because of the cheesy goodness. But now I am so much in doubt. Does the cheese that you use also have rennet? And do you have any idea about the cheese we get in India? :(",
      "parent": "0",
      "gravatar_hash": "cc625ef86168ceaf440e7056c9267fd0"
    },
    {
      "id": "1123",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-05-24 22:10:53",
      "content": "These are very good questions, Rashmi, and the answers can be elusive at times. Fortunately in the States, some of the more conscientious stores are getting better at labeling cheeses as to whether they use animal rennet or one of the alternatives (microbial, vegetable). I&#39;ve heard anecdotally that the non-animal sources are cheaper so cheeses that don&#39;t specify actually may well be vegetarian. I&#39;d be hopeful that in India, with such a strong vegetarian culture, it would be considered very bad to be selling non-vegetarian products without clear labeling, but you should certainly ask at your market for clarification. There is also some good info on the wikipedia page about rennet (<a href=\"http://en.wikipedia.org/wiki/Rennet#Alternative_sources_of_rennet).\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Rennet#Alternative_sources_of_rennet).</a>",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1124",
      "author": "Kate",
      "author_url": "",
      "date": "2010-05-27 13:16:55",
      "content": "These fritters look so tasty and not too time-consuming.  I've been trying to think of something different for zucchini, thank you for the great recipe, making tonight!",
      "parent": "0",
      "gravatar_hash": "520f5ab0813519c5968c030be8051fc9"
    },
    {
      "id": "16998",
      "author": "Diego",
      "author_url": "",
      "date": "2012-01-14 09:24:31",
      "content": "I've also been in the mood for pan fried cakes. What would you recommend serving this with?",
      "parent": "0",
      "gravatar_hash": "35474b34e2a2c4184987f883689069fa"
    },
    {
      "id": "17055",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-15 08:12:58",
      "content": "Hmm, let's see. I think those zucchini cakes would go really well this <a href=\"https://herbivoracious.com/2009/12/black-bean-soup-recipe.html\" rel=\"nofollow\">black bean soup with the orange/jalapeno salsa</a>. Or for a lighter meal I might just have them with a <a href=\"https://herbivoracious.com/2010/04/chopped-salad-revisiting-a-classic-recipe.html\" rel=\"nofollow\">chopped salad.</a>",
      "parent": "16998",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17062",
      "author": "Diego",
      "author_url": "",
      "date": "2012-01-15 09:40:19",
      "content": "Thanks! I think it'll go really well with the salad. Planning on making the the zucchini cakes with the salad on wednesday. I'll make sure to leave a comment here.",
      "parent": "17055",
      "gravatar_hash": "35474b34e2a2c4184987f883689069fa"
    },
    {
      "id": "17197",
      "author": "Raghav",
      "author_url": "",
      "date": "2012-01-16 19:14:31",
      "content": "Hi Michael,\n\nI just started reading your blog recently. I am vegetarian but, unlike you, I don't have egg. I'm also just 18, so I don't have much experience in the kitchen. What substitute may I use for egg in this recipe (and many other recipes in which, I think, it is used to bind the ingredients)?",
      "parent": "0",
      "gravatar_hash": "47f698b01e0e865864884a556d7644a1"
    },
    {
      "id": "17240",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-17 08:59:20",
      "content": "One thing you can try is <a href=\"http://www.amazon.com/dp/B0014DZGUQ/?tag=poeticlicen07-20\" rel=\"nofollow\">Ener-G egg replacer</a>. It is kind of a strange product but I think it will give you some of that binding effect for fritters etc.",
      "parent": "17197",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17788",
      "author": "Raghav",
      "author_url": "",
      "date": "2012-01-24 04:51:54",
      "content": "I'm vegan and I don't get Ener-G egg replacer in my country. If you are one of those who, like me, don't get the Ener-G thing in your country try using some chickpea flour (besan) instead of the eggs. It really works. Michael suggested this to me.",
      "parent": "17240",
      "gravatar_hash": "47f698b01e0e865864884a556d7644a1"
    },
    {
      "id": "107802",
      "author": "Evelyn",
      "author_url": "https://v8mile.wordpress.com/",
      "date": "2013-01-17 19:14:23",
      "content": "If anyone's looking for a gluten-free version, I've made one:\nhttps://v8mile.wordpress.com/2013/01/18/gluten-free-mu%CC%88cver-zucchini-fritters/",
      "parent": "0",
      "gravatar_hash": "f04a1fc61c4c5408437d16988978160a"
    }
  ]
}