{
  "comment_count": 25,
  "comments": [
    {
      "id": "82",
      "author": "rural_gal",
      "author_url": "",
      "date": "2011-10-12 09:41:24",
      "content": "Ghirardelli uses genetically modified ingredients in their chocolate:\n\n<a href=\"http://kellythekitchenkop.com/2009/04/chocolate-chips-gmos.html\" rel=\"nofollow\">http://kellythekitchenkop.com/2009/04/chocolate-chips-gmos.html</a>\n\nUse only organic to avoid genetically engineered foods, as GMOs are not allowed.",
      "parent": "0",
      "gravatar_hash": "a38860ddee6e4d21e4fa9b793ca4448b"
    },
    {
      "id": "83",
      "author": "Karen",
      "author_url": "http://karebou.com",
      "date": "2011-10-12 12:17:57",
      "content": "Now I know exactly what I'm doing this weekend! :)",
      "parent": "0",
      "gravatar_hash": "54dde47ff81d00baa17f418f0728a3c8"
    },
    {
      "id": "84",
      "author": "John",
      "author_url": "",
      "date": "2011-10-13 05:19:14",
      "content": "Ghirardelli ... sigh. I remember when I first tried that, in Berkeley in the '80s. I said \"Geez...THIS is what people are raving about? Have they actually TASTED this crap?\" I've tried it again, off and on, over the intervening 3 decades, and I still like it less than (a) Hershey's (which ain't great), (b) Cadbury's (a bit better), (c) Lindt (much better), and (d) the second-cheapest stuff you can get at any grocery store in France. Which all goes to show, I guess, that tastes differ. But in this rare case, Michael, you're WRONG! :)\n\nAll that being said, I like the rest of the recipe. And I'm totally with you on the walnuts.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "85",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-13 07:48:35",
      "content": "So keep in mind I&#39;m speaking specifically of chocolate chips. I agree, Ghiradelli is nothing spectacular at all, but I like it far better than Hershey&#39;s and Nestle, so as far as widely available brands of chips go, I think it is the best option. And actually for some reason I think their chip formulations taste better than their bars, which I don&#39;t care for either. \n\n\n\nDo Lindt and Cadbury make chips? If so, I&#39;ve missed them. Another good choice is Callebaut buttons, I see them pretty frequently now. They are pretty enormous as chips but you could halve them, or of course you can get any good brand of bar or bulk dark chocolate and chop it, if you don&#39;t mind irregular size chunks in your cookies.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "86",
      "author": "Dina",
      "author_url": "http://www.elegantlabels.com",
      "date": "2011-10-14 13:07:06",
      "content": "Your cookies look amazing!",
      "parent": "0",
      "gravatar_hash": "c913852a040a12ed6604ccda8a790b9f"
    },
    {
      "id": "87",
      "author": "NanAppetit",
      "author_url": "http://www.alittlelessmeat.com",
      "date": "2011-10-20 19:31:57",
      "content": "So you like cakey cookies--so does my husband. Unfortunately for him, I rarely want to make them that way. Why do we all prefer different textures?",
      "parent": "0",
      "gravatar_hash": "72e7b0c7dd4581a13f91875532e84125"
    },
    {
      "id": "88",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-20 20:36:46",
      "content": "Ha! Well, you could probably accomodate both with this recipe by baking half right after you mix the dough and the other half after they have been well refrigerated.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "89",
      "author": "Karen",
      "author_url": "http://karebou.com",
      "date": "2011-11-07 13:34:31",
      "content": "I made these over the weekend and let the dough sit in the fridge overnight. They were absolutely delicious but they weren't thick. I'm wondering what I did wrong. Maybe my baking soda was a bit old...could that have done it?\n\nAnd in response to your chocolate chips, Cadbury does make them and I know they're available here in New Zealand and Australia but not sure if they export them to the States. I'd imagine that they would. :)",
      "parent": "0",
      "gravatar_hash": "54dde47ff81d00baa17f418f0728a3c8"
    },
    {
      "id": "90",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-11-07 13:42:45",
      "content": "Hey Karen - well, let&#39;s see if we can debug what went wrong. Did they actually spread out thin, or did they stay compact but simply not rise? If they spread out, it sounds like maybe your oven runs cool (which would give them time to spread) or maybe you didn&#39;t get them in the oven while the dough was actually still quite cold? If they stayed compact, but didn&#39;t rise, then old baking soda sounds like a logical suspicion. Hmm, or here&#39;s another idea. I don&#39;t know that I&#39;ve ever actually let them rest that long in the fridge, maybe not more than a couple of hours. I wonder if a dough that is going to sit that long needs baking powder instead of soda so that it has some oomph left in the oven. I apologize if I sent you astray on the longer rest!\n\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "16368",
      "author": "Jennalee",
      "author_url": "",
      "date": "2012-01-06 06:44:57",
      "content": "I always melt the butter for my choc. chip cookies!  I did it by accident once when I was about 13...the recipe said softened butter, so I melted it (Momma wasn't around to correct that).  They ended up looking darker and tasting so very delicious.",
      "parent": "0",
      "gravatar_hash": "01243ff1908f137e555464859b5f4c2a"
    },
    {
      "id": "17072",
      "author": "Sara Merkel",
      "author_url": "",
      "date": "2012-01-15 11:40:26",
      "content": "I also refrigerated the dough over night.  half way through the baking, they puffed up, but by the time they were done, they fell flat.  spread out and flat. and even flatter once they were cooling on the table.  i wonder also about adding a tsp or 2 of baking powder for that added oomph.  Might have to try that next time. what's the most amount of baking powder i should use, if i'm using baking soda also?  Or, should i just use the baking powder only?",
      "parent": "0",
      "gravatar_hash": "1adb485a34c70b56316bc35f00511873"
    },
    {
      "id": "17111",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-15 22:03:27",
      "content": "If they puffed up and then fell, the problem isn't too little leavening. If anything, it could be too much leavening, causing them to overinflate and collapse. But I know the amount of leavening in this recipe works, so I'm going to take a stab and say that you should check your oven temperature. If it is running a little low, that could cause you to underbake the cookies and they wouldn't set properly. Let me know if that helps!",
      "parent": "17072",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17497",
      "author": "Jenny",
      "author_url": "http://vegetarianhatesvegetables.blogspot",
      "date": "2012-01-19 19:17:04",
      "content": "Hey!  I've been lurking on here for a while, but this is the first time I've tried one of your recipes.  I had to use cheap chocolate chips, but they were still just about the best chocolate chip cookies I ever had!  Fantastic recipe!",
      "parent": "0",
      "gravatar_hash": "efd63fa22c1a4cd1b5e1e7c8fc2b99bb"
    },
    {
      "id": "17498",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-19 19:36:48",
      "content": "Thanks! Your blog name cracks me up.",
      "parent": "17497",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17562",
      "author": "Sara",
      "author_url": "",
      "date": "2012-01-20 08:57:23",
      "content": "Oven temp is accurate.  Tried freezing some of the dough.  Still puffed up during baking, then fell flat.  Next time I'll try a little less butter, or sugar or both.  Maybe a little more flour and and extra egg or egg white.",
      "parent": "17111",
      "gravatar_hash": "1adb485a34c70b56316bc35f00511873"
    },
    {
      "id": "17565",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-20 09:58:18",
      "content": "Hmm, well if you figure it out, let me know. That recipe works like clockwork for me so I'm curious. Two more thoughts: my all purpose flour is from King Arthur, which I believe is a little bit higher gluten than average, so that might hold the shape more. Also, if you have a scale, try using the weight measurements in the recipe to make sure everything is accurate.",
      "parent": "17562",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "20443",
      "author": "Margaret",
      "author_url": "",
      "date": "2012-02-29 05:16:17",
      "content": "\"Thick and cakey\" are just the words to describe the chocolate chip cookie recipe of my dreams. I've been playing with chocolate chip recipes for years in order to get a cookie of this description. I was very excited to find a recipe that promised to have the characteristics I've been looking for but so far I have not had success. I am a very experienced, careful baker. I've weighed the ingredients, have an oven I trust, use King Arthur flour, have new baking soda, have left the dough in the refrigerator for 24 hours and have not squashed the dough balls at all. The only direction I haven't followed has to do with the salt. I've used 1tsp. of Morton's salt, instead of two of Maldon. Could that make all the difference? My cookies have puffed up and then fallen flat when cooling. What am I doing wrong? I do have a convection oven and have used that setting when baking.",
      "parent": "0",
      "gravatar_hash": "b11b2e91858d32b9f5fa144aa6122e1a"
    },
    {
      "id": "20489",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-02-29 08:28:15",
      "content": "Well, this really has become a mystery. As we can see above in the comments, other folks have had the same problem, and yet I've made this recipe at least a dozen times and it always works for me as long as I let the dough chill. I don't tend to suspect the salt, although I guess stranger things have happened. (But you should try the Maldon, it is a big improvement.) I haven't often refrigerated it overnight, 1 hour is more common so you could try that to see if it makes a difference. Another thought - maybe try baking them one more minute? I like mine well browned, and that presumably gives the gluten and egg networks a lot of time to set. Please do let me know if you experiment more and can identify a factor I'm not calling out, I want to get this recipe to be reproducible for all the cakey-cookie lovers!",
      "parent": "20443",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "20597",
      "author": "Margaret",
      "author_url": "",
      "date": "2012-03-01 17:37:45",
      "content": "I think next time I will let the dough rest for only a few hours. When I let it rest 24 hours, it rose and then fell flat. When I used the rest of the same dough at 48 hours, it didn't rise at all!",
      "parent": "0",
      "gravatar_hash": "b11b2e91858d32b9f5fa144aa6122e1a"
    },
    {
      "id": "20598",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-01 17:40:19",
      "content": "Ok, very good, that might well be the difference then. Please do let me know the results of your experiment, and I'll try to replicate and update the recipe.",
      "parent": "20597",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21187",
      "author": "American in London",
      "author_url": "",
      "date": "2012-03-09 11:44:24",
      "content": "I followed this recipe very carefully and they still came out flat (in fact every recipe i have tried has come out flat!). I have been using self-rising flour though, could that explain the result? I also let the dough sit for about 8 hours and am curious if anyone who has had trouble has retried with only 1 hour of fridge time??",
      "parent": "0",
      "gravatar_hash": "57e2ec475edf48e86f54fad2f61c6ea6"
    },
    {
      "id": "21196",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-09 14:02:20",
      "content": "Self-rising flour already has leavening agents in it, so it definitely won't work in this recipe. You should only use self-rising flour in recipes that specifically call for it, or I suppose you could look up how much baking powder is in it and omit a corresponding amount.",
      "parent": "21187",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22423",
      "author": "Lori",
      "author_url": "",
      "date": "2012-04-04 08:24:16",
      "content": "Guittard makes delicious fair-trade chocolate chips, I can buy them at my local Whole Foods: http://www.amazon.com/dp/B002BEKJOA/?tag=poeticlicen07-20",
      "parent": "0",
      "gravatar_hash": "12777c289bc738260faa353a1b03ac81"
    },
    {
      "id": "22424",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-04 08:31:05",
      "content": "Yes! We've been able to get those lately too, and I agree they are very nice.",
      "parent": "22423",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314133",
      "author": "Lyndsey",
      "author_url": "",
      "date": "2016-04-02 13:20:05",
      "content": "I've made this recipe at least 4 times: it's my favorite. I did try aging the dough 48+ hours, and I can't say I've seen a difference in consistency or flavor. \n\nThe only thing I make sure of is that between batches, the newest batch is waiting in the freezer to be certain it won't reach room temp. Straight from freezer to oven- make sure you've good pans. I do wait for the pan to cool before I prepare the next batch, though. Gotta keep those good pans.",
      "parent": "0",
      "gravatar_hash": "fdaf955914c2413d455bce2b93cacc1a"
    }
  ]
}