{
  "comment_count": 20,
  "comments": [
    {
      "id": "604",
      "author": "Earl Lee",
      "author_url": "http://toastable.com",
      "date": "2011-01-24 08:34:03",
      "content": "I think using spices goes along well with the section about salt. Perhaps there is an index on the web with percentages regarding how much herb one should use based on weight?",
      "parent": "0",
      "gravatar_hash": "6e5515df7c2fa4519cd6141e594fa1ae"
    },
    {
      "id": "605",
      "author": "sweet road",
      "author_url": "http://www.asweetroad.blogspot.com",
      "date": "2011-01-24 09:51:44",
      "content": "good tips, i always try to remember to not be afraid of garlic and spices... you'll never know how certain spices work in a recipe unless you try them!",
      "parent": "0",
      "gravatar_hash": "eec3e0e058b7a2779222b9720b26acd7"
    },
    {
      "id": "606",
      "author": "Diana @ frontyardfoodie",
      "author_url": "http://frontyardfoodie.com",
      "date": "2011-01-24 11:09:26",
      "content": "These are definitely awesome. I never had trouble with salt because I learned when I was about twelve that if I salted well everyone loved my food.....but knife skills and the use of high heat came later and were AMAZING what they did for me.",
      "parent": "0",
      "gravatar_hash": "d637c04fa62080412fba51b62455918a"
    },
    {
      "id": "607",
      "author": "Lea",
      "author_url": "",
      "date": "2011-01-24 21:57:49",
      "content": "Agreed on all points!\nSur La Table offers a very good single evening course on knife skills. Even though I've been cooking for many, many years, I picked up some new tips/skills which have made my food prep safer, if not more efficient!",
      "parent": "0",
      "gravatar_hash": "442e785c165a05ff7b50e50f01391355"
    },
    {
      "id": "608",
      "author": "Lael Hazan @educatedpalate",
      "author_url": "http://www.giulianohazan.com/blog",
      "date": "2011-01-25 06:19:09",
      "content": "Great points!  A sharp knife is essential and much less dangerous to use.  That said, please remind people NOT to sharpen their knives too often, they should use a steel to keep the edge.  Sharpening too often changes the shape of the entire knife and it won't last as long.",
      "parent": "0",
      "gravatar_hash": "3f513a08ba12dd91fd9177912008f47a"
    },
    {
      "id": "609",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-01-25 07:29:06",
      "content": "Yes, that is very true! With the Chefs Choice sharpener, the 3rd wheel is as fine as a ceramic &quot;steel&quot; so it is ok to use quite often, but otherwise it is important to learn to use a steel and do it frequently.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "610",
      "author": "Lisa@ButteryBooks",
      "author_url": "http://butterybooks.com",
      "date": "2011-01-25 13:04:51",
      "content": "Thanks for all the great tips!",
      "parent": "0",
      "gravatar_hash": "c83f680780364cf9d5ad02f7835b7278"
    },
    {
      "id": "611",
      "author": "Amanda",
      "author_url": "http://www.infohive.info/natural-relief-from-depression/",
      "date": "2011-01-27 02:11:39",
      "content": "I need more practice! Thanks for sharing this post. Love these tips!",
      "parent": "0",
      "gravatar_hash": "39bf0c66413a100e961bbab529861d40"
    },
    {
      "id": "612",
      "author": "Jenni",
      "author_url": "http://www.pastrychefonline.com/blog",
      "date": "2011-01-27 06:01:24",
      "content": "I am with you, especially on the salt front.  I have long considered myself the Ambassador of Salt (I just gave myself that title, however).  I've written about it on several occasions, especially when it comes to desserts.  Even if people get over the hurdle of putting enough salt in their savory foods, they rarely use enough--if any--salt in their desserts.\n\nSo great to see someone else extolling the virtues of salt! :)",
      "parent": "0",
      "gravatar_hash": "b083e59b95eb8fe5d0bc611a0fcce438"
    },
    {
      "id": "613",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-01-27 08:18:32",
      "content": "Jenni - you are so right about salt in dessert. Almost all desserts benefit from at least a subtle pinch or two to bring out the flavors. And many desserts, especially if they include chocolate or caramel, are amazing with a fairly sizeable amount of salt. My standard move when following someone else&#39;s recipe for, say, brownies or chocolate chip cookies is to double the salt. (But don&#39;t do that with any recipes you find on my site, or they really will be too salty!)",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "614",
      "author": "Jmfield",
      "author_url": "http://profile.typepad.com/jmfield1",
      "date": "2011-01-27 09:44:31",
      "content": "That's my rule as well.  Double the salt.  I generally figure 1/4 teaspoon (give or take) per 1 cup of flour in baked goods.  In custards, it makes all the difference in the world.  I bet that most people who say they hate creme brule haven't had a well-seasoned creme brule. :)",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "615",
      "author": "Jessi",
      "author_url": "http://profile.typepad.com/jessipatuano",
      "date": "2011-01-27 17:09:00",
      "content": "I couldn't agree more with these points. I have seen so many home cooks as well as some professionals struggle with this. I know many have said it before but there really is no better way to season then to taste as you go. Without a little taste here and there how do you know where your dish stands? As for knife skills learn the basics and the rest will follow. Master how to slice or dice and onion and you have tackled one of the most common obstacles. These truly are the perfect start to better food from your kitchen at home.",
      "parent": "0",
      "gravatar_hash": "c1fcbd8cf5d60c0f4133215e99d326dc"
    },
    {
      "id": "616",
      "author": "Lelia",
      "author_url": "http://www.veggie-quest.com",
      "date": "2011-01-28 15:09:37",
      "content": "Taking a class on knife skills: what a great idea! I'd love to be able to get prep steps like chopping out of the way faster, and with greater consistency in the final product. Off to find a class near me now!\n\nAlso, while this is really basic, having one's ingredients in place and ready to go BEFORE cooking is a huge confidence booster in the kitchen--that way you're not scrambling at the last minute for the goshdarned garlic while everything else is sizzling away in the skillet. (Not that that's happened to me, or anything...)",
      "parent": "0",
      "gravatar_hash": "e4bb3dea4dc22b52e0f4647b786774c3"
    },
    {
      "id": "617",
      "author": "graciela.",
      "author_url": "",
      "date": "2011-02-03 13:20:10",
      "content": "All the talk and health concerns over sodium has made people afraid of using table salt in their kitchens. That's my impression. My stepsister refuses to put salt in her food and of course, almost everything is bland. There's got to be a happy medium.\n\nPersonally, I think if you cook from scratch at home, the whole sodium issue isn't as crazy its made out to be (unless you have health problems, of course). It's the junk and fake food that we should worry about. If you put a teaspoon of salt on one serving of home-made food, it would be inedible. But that's how much is lurking in a fast food meal.",
      "parent": "0",
      "gravatar_hash": "97da4730e3a4d2d9c58785ad42187796"
    },
    {
      "id": "618",
      "author": "Chris of Stumptown",
      "author_url": "",
      "date": "2011-04-17 20:52:07",
      "content": "Hi, ever use the EdgePro sharpeners?  Thanks.\n\nI think one reason people don't salt enough is the bad taste of iodized salt.  If I give friends one tip, it is use kosher salt and toss iodized stuff in the trash.",
      "parent": "0",
      "gravatar_hash": "13e18356c7e44e47a189e87b1b23db45"
    },
    {
      "id": "619",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-04-18 19:40:37",
      "content": "@Chris - nope, I don&#39;t have any experience with EdgePro. Have you had good results with them?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "620",
      "author": "Emcollins2",
      "author_url": "http://profile.typepad.com/emcollins2",
      "date": "2011-05-01 20:52:48",
      "content": "I find almost all restaurants oversalt their food, there are a lot of flavours in food that get drowned out by salt and so many other ingedients I use e.g. tamari, miso, many cheeses already contain enough salt. As for knife grips, if your blade is properly sharpened and the spine of your knife has been properly fettled there is no problem with guiding the blade with your index finger on the spine.  I used a standard pinch grip for years until it became too painful, from a series of injuries unrelated to cooking, and have migrated to a grip with my index finger along the spine. My wrist couldn't be happier. But, do not use the index finger to force your blade, sharp is essential, and keep the grip relaxed and you'll be OK with your finger on the spine.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "621",
      "author": "Francis Sterling",
      "author_url": "",
      "date": "2011-05-19 20:22:57",
      "content": "Can't agree more about the Iodized salt.",
      "parent": "0",
      "gravatar_hash": "bed059abf67c22ef13996fc0a1548bf1"
    },
    {
      "id": "622",
      "author": "Francis Sterling",
      "author_url": "",
      "date": "2011-05-19 20:31:39",
      "content": "Micheal, I really love the tip about the salt. I have always used the pinch method. It is rather unscientific. I can usually get it to a suitable taste. However, a lot of times I am in too much of a hurry to do the taste and salt test. Using the .5% of total weight is a <b>great</b> idea. Thanks for saving my quick meal's taste!",
      "parent": "0",
      "gravatar_hash": "bed059abf67c22ef13996fc0a1548bf1"
    },
    {
      "id": "6344",
      "author": "J-step",
      "author_url": "",
      "date": "2011-11-30 23:08:30",
      "content": "I can't agree more!  Especially the part about knife skills.",
      "parent": "0",
      "gravatar_hash": "f35f655e7b4877325dfc001211e3ebfc"
    }
  ]
}