{
  "comment_count": 11,
  "comments": [
    {
      "id": "502",
      "author": "sweet road",
      "author_url": "http://www.asweetroad.blogspot.com",
      "date": "2011-03-14 08:07:23",
      "content": "This place sounds really awesome, thanks for sharing! I'll have to look for it next time I'm in the city, I'm always on watch for good vegetarian restaurants!",
      "parent": "0",
      "gravatar_hash": "eec3e0e058b7a2779222b9720b26acd7"
    },
    {
      "id": "503",
      "author": "Dani",
      "author_url": "",
      "date": "2011-03-14 09:23:43",
      "content": "I LOVE dirt candy- so cool to hear about the inside scoop too.",
      "parent": "0",
      "gravatar_hash": "3d25b2f841a12c76e315cde204d8c2e2"
    },
    {
      "id": "504",
      "author": "Mikaela Cowles",
      "author_url": "http://baguettetastewonderbreadbudget.com/",
      "date": "2011-03-14 16:59:50",
      "content": "Favorite quote from you so far, \"Jalapeno hush puppies with maple butter. Be still my Southern heart!\"\n\nYour descriptions made my mouth water. Thank you for sharing.",
      "parent": "0",
      "gravatar_hash": "cd2e90dca560fe13eea67fec08a2d31d"
    },
    {
      "id": "505",
      "author": "Alessandra",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2011-03-14 19:26:14",
      "content": "I saw their site and i so wish that there was a place like that in Auckland!!!",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "506",
      "author": "John",
      "author_url": "",
      "date": "2011-03-17 12:08:33",
      "content": "\"Intensely smoked cauliflower deep fried in a cornflake crust.\" Wow. That, and the hushpuppies, have me yearning to start experimenting to try to reproduce some of these ideas. My stomach is rumbling...",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "507",
      "author": "Sandy",
      "author_url": "",
      "date": "2011-03-19 13:57:21",
      "content": "well, getting Christmtas dinner for 3 on the table all together is 'interesting' enough, especially with stepson spending the afternoon updating software on our computers! Chef Amanda has my full admiration - and the BBW carrot bao sound wonderful, but jalapeno-flavored hushpuppies - I refuse to return to a particular steakhouse because of their jalapeno-flavored hushpuppies, about which (and the green chile in the German potato salad, and a few other unnecessary hot-pepper additions) the menu said NOTHING.  I hope everybody who eats at Dirty Candy understands beforehand what is meant by \"innovative.\"",
      "parent": "0",
      "gravatar_hash": "08b4d0e5fa36d027ffb36baf85fdf3e7"
    },
    {
      "id": "5665",
      "author": "Plastische Chirurgie",
      "author_url": "http://www.plastica.ch/",
      "date": "2011-11-29 09:43:58",
      "content": "Well the size of a shop doesn't necessarily dictate whether or not the food there is good or terrible. There are actually a few restaurants out there that do have the necessary equipment and operational station to do their thing but fails to deliver for they lack in the individual talented minds that'll make the food they serve magical.\n\nSurely Dirty Candy NYC is a great shop, for most, if not all, of the shops out there that started out as small-scale have quite of a reputation of serving good food!",
      "parent": "0",
      "gravatar_hash": "2a2ff20e24adccc2194c94d44508de43"
    },
    {
      "id": "10512",
      "author": "Helikopterflug",
      "author_url": "http://www.centralheli.ch/",
      "date": "2011-12-10 05:39:31",
      "content": "I've heard so much talk about Dirt Candy over at Facebook and decided to check it out for myself and I must say they don't fail to disappoint. Top notch service and food, I'll definitely come back for more! Though one comment, an increase in accommodation would definitely be appreciated. Since at the present, they can only seat 20 or so people.",
      "parent": "0",
      "gravatar_hash": "5f903a078cba43597146cfc4ce5420e2"
    },
    {
      "id": "25495",
      "author": "Zahnärzte Düsseldorf Dr. Blümin",
      "author_url": "http://www.dental-relax.de",
      "date": "2012-05-30 01:37:06",
      "content": "Wonderful, vivid report! Makes me wanna visit this place! P.S. When can you buy the cookbook?",
      "parent": "0",
      "gravatar_hash": "378f239c88f20afb43f5e56b43d4801e"
    },
    {
      "id": "25545",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-30 06:19:13",
      "content": "I think her book will be out in late August, at least according to Amazon.",
      "parent": "25495",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314187",
      "author": "Ben Freedman",
      "author_url": "",
      "date": "2016-07-19 05:41:19",
      "content": "I finally got to eat at Dirt Candy .... heavenly ... amazing .... i want to go back! Bought her cookbook, she even signed it for me. I can't say enough about Dirt Candy ... while there all i could say was \"wow\".\n\nHope all is well.\n\nI miss herbervoracious ....",
      "parent": "0",
      "gravatar_hash": "825a1e4c2a61919d1de8623b92eeed1d"
    }
  ]
}