{
  "comment_count": 11,
  "comments": [
    {
      "id": "1536",
      "author": "Feeding the Saints (A. C. Parker)",
      "author_url": "http://www.feedingthesaints.com/",
      "date": "2010-01-07 10:47:59",
      "content": "OK, so eggplant and okra are in my family x2: father from the south (OK, I guess that's really just the okra part) and my mom's family originally from Greece, where of course eggplants are big (or small; wonder if they have baby ones there, too?) and so is okra. My father loves okra, my mom is very \"okra negative\" as you put it: it's the slime factor. I read somewhere once a trick to cooking them that tames this quality, but of course I don't remember where now. I rarely cook either of these ingredients, but I love to eat them. And your tamarind and kaffir lime sounds like a fabulous twist.",
      "parent": "0",
      "gravatar_hash": "896f776c16496648f98713516d74a680"
    },
    {
      "id": "1537",
      "author": "Tina",
      "author_url": "",
      "date": "2010-01-07 23:45:13",
      "content": "I am okra-positive, lol! This looks like a yummy recipe with two veggies i love, thank you for a different take on them and I have never really had them together unless you count sambar! Nice blog and tempting pics :)",
      "parent": "0",
      "gravatar_hash": "6192a2efdaad0bc29542a75fdac4c5de"
    },
    {
      "id": "1538",
      "author": "Sharan",
      "author_url": "",
      "date": "2010-01-07 23:46:38",
      "content": "In my experience, the key to taming the slime factor of cooking okra is adding an acid to the game - fresh-squeezed lemon as well as dried mango powder have worked for me.\n\nAlso, my mom used to tell me that when cutting okra, be sure to wash AND DRY them _before_ cutting them.  This, too, helps reduce the slime that oozed from them.\n\nHope that helps!",
      "parent": "0",
      "gravatar_hash": "2b3ba29f89d13e2365d445ccbed0d34b"
    },
    {
      "id": "1539",
      "author": "Maya",
      "author_url": "http://myfeasts.blogspot.com",
      "date": "2010-01-08 03:07:55",
      "content": "I fry okra before adding it to most dishes, less slime that way.",
      "parent": "0",
      "gravatar_hash": "4fc8888346311aee84217b1e88e783e5"
    },
    {
      "id": "1540",
      "author": "Ivy Manning",
      "author_url": "http://www.blog.ivymanning.com",
      "date": "2010-01-08 16:19:41",
      "content": "Hi Michael\nNice recipe!  I did something similar in my column in the Oregonian, mine was stuffed with bulgur, so a more Syrian approach. I got an email from a reader who complained that her eggplant were terribly bitter, she blamed it on the size of them. I haven't found small ones to be any more bitter than large ones, though the esteemed Elizabeth Schneider in Vegetables A to Z says that mid size \"Indian\" eggplant are bitter and not worth buying. Know any botanists that love to cook to help clear up the matter? I'm perplexed.",
      "parent": "0",
      "gravatar_hash": "398d9a223280b1350d4db253ecccefe3"
    },
    {
      "id": "1541",
      "author": "Diana @ frontyardfoodie",
      "author_url": "http://frontyardfoodie.com",
      "date": "2010-01-09 09:50:31",
      "content": "Whoa! I've never seen eggplants that tiny! Is the skin as tough as the big ones?",
      "parent": "0",
      "gravatar_hash": "d637c04fa62080412fba51b62455918a"
    },
    {
      "id": "1542",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-13 09:09:20",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n@Diana - I&#39;d say the skin is not particularly tough - I left it on these guys and barely noticed it when eating them.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1543",
      "author": "Ambuja W",
      "author_url": "",
      "date": "2010-01-13 11:25:01",
      "content": "Hi,\nThis is very reminiscent of this traditional south Indian dish my mother makes called \"Ennai Kathirikai\" translates to Oil Eggplant. These eggplants are stuffed with a mixture of spices (coriander seeds, dhals, cumin, red chilli all ground up) and shallow fried. We take off the stalk and make a slit in the center to about 3/4ths of the way down. Then turn the eggplant onto the other side and make 2 slits 3/4ths of the way down and stuff it with the spices, let it marinate overnight and then cook it. It is one of my favorites!\n\nI found this blog while running a search for a mujadara recipe that i recently ate at a Mediterranean place. I am really looking forward to going through your recipes! i have been a vegetarian all my life and love cooking!",
      "parent": "0",
      "gravatar_hash": "65ea274f7954e60f35d6aef49cbf625a"
    },
    {
      "id": "1544",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-13 11:28:42",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n@Ambuja - wow, the Ennai Kathirikai sounds great.You are right, it is very similar. I like the idea idea of adding dhals to it.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1545",
      "author": "Rasa Malaysia",
      "author_url": "http://rasamalaysia.com",
      "date": "2010-01-20 14:09:50",
      "content": "Michael - this looks like a winning recipe for mini egg plants. :)",
      "parent": "0",
      "gravatar_hash": "e7c0a95157af2f0902f4792f0c613143"
    },
    {
      "id": "1546",
      "author": "Kathy - My Online Meals",
      "author_url": "http://myonlinemeals.com",
      "date": "2010-03-28 00:48:28",
      "content": "I love okra! I have an Asian friend who invited me and my family to dinner. We had stir fried eggplant, okra and string beans in coconut milk and it was out of this world delicious! so YES to okra. I don't mind that its slimy.\n\n<a href=\"http://myonlinemeals.com\" rel=\"nofollow\">http://myonlinemeals.com</a>",
      "parent": "0",
      "gravatar_hash": "04f0383e0a5ff577b599bbcb403b31a3"
    }
  ]
}