{
  "comment_count": 10,
  "comments": [
    {
      "id": "1029",
      "author": "Amber Shea @Almost Vegan",
      "author_url": "http://almostvegankc.blogspot.com/",
      "date": "2010-06-28 07:47:04",
      "content": "I've yet to be swayed to the ways of kimchee, but I'm still hoping to find one I like someday!  This sounds tasty though, and it looks like it belongs in a bento box (though kimchee + bento is probably an Asian-culture-clash; ah well!).\n\nThanks too for your comment on <a href=\"http://almostvegankc.blogspot.com/2010/06/raw-revelry-at-105-degrees.html\" rel=\"nofollow\">my 105 Degrees post</a>.  As I have told and will continue to tell everyone, 105 really is worth a trip, at least if you’re ever in or around the Midwest. And I know what you mean about bad raw experiences; <a href=\"http://almostvegankc.blogspot.com/2010/03/almost-vegan-in-los-angeles-iv.html\" rel=\"nofollow\">at Planet Raw in L.A.</a> my boyfriend Matt was nearly made sick by the foul smell of the place. 105 was nothing like that, though—it was clean, bright, beautiful, and above all delicious.",
      "parent": "0",
      "gravatar_hash": "b3851e0d7ea2ed1e2acc088257cd4f4c"
    },
    {
      "id": "1030",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-28 08:04:58",
      "content": "OMG! Planet Raw in LA  is exactly the same place I was referring to when I said I had a bad raw experience. That place is horrific. And expensive. And horrific.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1031",
      "author": "Samantha",
      "author_url": "http://bougiebelly.tumblr.com",
      "date": "2010-06-28 10:22:34",
      "content": "Ah, this is some comfort food! I've had a lot of trouble finding vegetarian kimchee, though I've just moved to Portland and I'm hoping that there are some options for me. Or I guess I could make my own? (maybe too ambitious...) I've asked my grandmother for recipes, but unfortunately for me hers includes beef broth and anchovies.",
      "parent": "0",
      "gravatar_hash": "c941bca90e77919fddc2b84f61a8d019"
    },
    {
      "id": "1032",
      "author": "Charissa - The Gifted Blog",
      "author_url": "http://www.thegiftedblog.com",
      "date": "2010-06-28 14:20:58",
      "content": "Looks good. We're running low on food in our house, but with some tofu and kimchi in the fridge, I'm going to give this a whirl tonight. Thanks for the idea!",
      "parent": "0",
      "gravatar_hash": "66a37045e1bb61c9f4bb17cf87eadb20"
    },
    {
      "id": "1033",
      "author": "Javakimichi",
      "author_url": "http://profile.typepad.com/javakimichi",
      "date": "2010-06-28 17:58:14",
      "content": "Amber Shea - Koreans have their version of lunchbox, called <i>dosirak</i>, that's very similar to the Japanese bento. Kimchi is commonly included.\n\nIf any vegetarians want to make their own kimchi, I'd suggest substituting sea salt for the fish sauce/shrimp paste. It won't taste quite the same, but it's a good alternative!\n\nTo the people who have only had a bad experience with kimchi--please don't be afraid to try a different kind. Kimchi comes in so many variations (although I know that it might be hard to find more than the Napa cabbage version), and I've found that many who say they dislike kimchi just need to be introduced to a different type. I've had the most success converting friends over with cucumber kimchi and, of course, homemade <i>makkimchi</i>, or \"quick\" kimchi.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "1034",
      "author": "Niki",
      "author_url": "http://melbourneveganesque.blogspot.com/",
      "date": "2010-06-28 20:18:18",
      "content": "Yum! I fell in love with kimchi after much persistence with it while I was teaching in Sth Korea.  I have never known how to recreate quickly anything Korean though, and usually just eat it straight out of the tub as a snack.\n\nThis looks great though! Will have to try it out.",
      "parent": "0",
      "gravatar_hash": "2f3a8dda43436b3d398e8e7d5bc33773"
    },
    {
      "id": "1035",
      "author": "John - Mormon Foodie",
      "author_url": "http://mormonfoodie.blogspot.com",
      "date": "2010-07-01 00:50:22",
      "content": "Micheal, you had me at kimchi. :-)\n\nI've never seen a non-vegetarian kimchi. I'll have to check the labels better. Have you ever tried making your own? It's pretty simple and the results can be fantastic. The recipe I use doesn't use fish sauce, and has an incredibly crisp, clean taste.",
      "parent": "0",
      "gravatar_hash": "a31679e1b2b49a1f2a8aeb0fbae3493a"
    },
    {
      "id": "1036",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-07-06 15:12:29",
      "content": "I&#39;d love to see your recipe! Maybe you should do a post about it if you haven&#39;t already.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "155135",
      "author": "sonja",
      "author_url": "",
      "date": "2013-06-04 20:26:56",
      "content": "I know this is an old post, but I thought you might like to know that this is similar to dubu kimchi, one of my comfort foods from when I was little.  the way my mother taught me was to lightly fry the slices of dubu on a non-stick griddle, not a lot (though I think others might serve it boiled and sliced, but bah! to not frying something when you can fry it), just enough to get a little skin and keep it's shape.  We're meat eaters, so she'd cook strips of pork in garlic, and then add the cabbage kimchi (slightly older kimchi is best) and cook it all together. I saw you like kimchi fried rice, so you know how good cooked kimchi is! Then she would add the sugar, sesame oil, soy sauce, etc, but if you have jarred ssamjang, you could just use that, if you don't mind the extra doenjang flavor.  You then mound the kimchi in the middle of a platter and then fan the dubu around it, no rice needed.  A garnish of sesame seeds and green onion is nice.  Wrap a piece of dubu around the kimchi and there you go.  This is a tradtional anju (like a bar food), so it's best to chase it down with a nice crisp beer and everyone just sharing from the platter.",
      "parent": "0",
      "gravatar_hash": "1dc62d1d18512c0d95916d4d77dbcac9"
    },
    {
      "id": "155499",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-06-05 10:31:32",
      "content": "Sounds fantastic to me! And I agree, why boil when you can fry???",
      "parent": "155135",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}