{
  "comment_count": 23,
  "comments": [
    {
      "id": "982",
      "author": "junecutie",
      "author_url": "",
      "date": "2010-07-19 08:00:06",
      "content": "What would you think about roasting the tomatoes first with a little salt, a handful of brown sugar, and a little olive oil?  I have been reading all sorts of posts that say roasting the tomatoes first before putting into all kinds of dishes really deepens the flavor.",
      "parent": "0",
      "gravatar_hash": "7f090a9f27858b7f9a2eccd827678738"
    },
    {
      "id": "983",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-07-19 08:06:11",
      "content": "Hey Julie - I don&#39;t think that would hurt anything, but I&#39;m not completely sure it is necessary in this case. The long slow cooking on the stove top seems to develop a lot of caramelized flavor, especially if you are careful to let it cook until it is quite thick at the end. In general I&#39;m a big fan of oven roasted tomatoes though. Here&#39;s a nice dish to try if you do roast some tomatoes: <a href=\"https://herbivoracious.com//2009/08/roasted-tomato-and-corn-risotto-recipe.html\" rel=\"nofollow\">https://herbivoracious.com//2009/08/roasted-tomato-and-corn-risotto-recipe.html</a> .",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "984",
      "author": "Mary M-S",
      "author_url": "http://www.MovingFromTheInsideOut.com",
      "date": "2010-07-19 08:56:11",
      "content": "Interesting idea! My hubbs made some once, but as something sweet to have on toast - yuk! [sorry!]  But I like your notion as kind of a chutney. What would you think of honey instead of sugar? I can't do sugar or dairy so always substitute. Nowadays it's hard to get agave that hasn't been processed till it's over the hill, so raw honey might be the best??? [Would it have to be thickened a bit with arrowroot?] Love your recipes - keep 'em coming!",
      "parent": "0",
      "gravatar_hash": "4d754bbf48e5e9ee7da4b6cf7d88a890"
    },
    {
      "id": "985",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-07-19 09:01:18",
      "content": "I agree, I wouldn&#39;t want to eat it on toast, at least not like the way I would eat a blackberry jam. On toast with sharp cheese, then you have something. Honey could be good but I&#39;d use the lightest, mildest one I could find for this recipe, because you don&#39;t want the honey flavor to overwhelm the other components.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "986",
      "author": "Lea",
      "author_url": "",
      "date": "2010-07-19 09:15:07",
      "content": "I agree with Michael that the honey would overwhelm the delicate flavor of the tomato. How about a bit of stevia instead? Available at most health food markets. And, Michael, this fabulous-sounding recipe would absolutely work to \"put up\" in jars. I have 14 heirloom tomato plants, so I will very soon be overwhelmed with fruit... I might just have to put up a few jars of this yumminess and save it for Christmas presents! It would be beautiful in fancy little jars!",
      "parent": "0",
      "gravatar_hash": "8cf4964ec7f9bad84f1ed2b80baa8959"
    },
    {
      "id": "987",
      "author": "Lea",
      "author_url": "",
      "date": "2010-07-19 09:22:49",
      "content": "P.S.\nHome canning is not only fun, it is NOT hard or complicated. Tons of great books out there with excellent tips and recipes, and cute little jars are available at grocery stores as well as upscale boutique kinds of stores. I could go on for a long time about how great canning is, but I will exercise a little restraint here! :) I will be anxious to hear about your experience when you finally do start canning.",
      "parent": "0",
      "gravatar_hash": "3400d32fbe9b8561e0c9b39e0e55ae1d"
    },
    {
      "id": "988",
      "author": "N",
      "author_url": "",
      "date": "2010-07-19 09:40:32",
      "content": "Sounds delicious... I would love to have this recipe canned...  Is it possible and what would need to be added/changed to make it \"cannable\"?",
      "parent": "0",
      "gravatar_hash": "ed7ca95d2d17f79569ca0ea39b5a05f8"
    },
    {
      "id": "989",
      "author": "Michael @ Herbivoracious.com",
      "author_url": "https://herbivoracious.com",
      "date": "2010-07-19 09:42:18",
      "content": "@Lea, @N - I don't know anything about canning safety, but if someone does, I'd love to hear how it would apply to this recipe. Is there a minimum sugar level required to make it safe?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "990",
      "author": "amanda",
      "author_url": "",
      "date": "2010-07-19 09:44:20",
      "content": "i LOVE canning, and i bet this can be done easily but it might need a bit more lemon juice, or some vinegar to increase the acidity so that it could be canned in a boiling water canner.  i dont know much about canning in a pressure cooker, but maybe theres another food preservation person out there that would know more?  canning fresh homegrown tomatoes is the most rewarding thing.  opening a jar in the dark wetness of february is like opening a jar of sunshine!",
      "parent": "0",
      "gravatar_hash": "aead76beb5fc7b762a6b4ddc234f6051"
    },
    {
      "id": "991",
      "author": "lisaiscooking",
      "author_url": "http://lisaiscooking.blogspot.com",
      "date": "2010-07-19 12:09:25",
      "content": "The jam sounds great with the saffron and chile flakes, and on a grilled cheese, wow! Can't wait to see the fritters.",
      "parent": "0",
      "gravatar_hash": "0a9a4542e87845b6596d9c41d7e3c257"
    },
    {
      "id": "992",
      "author": "Sandy",
      "author_url": "",
      "date": "2010-07-19 14:23:51",
      "content": "Many years ago (say, 40-45) my mother made (and canned - I think she got the proportions from the Agricultural Extension) a tomato jam that we ate on breakfast toast - I remember it as wonderful, but that could be because there was never very much of it, so it was a treat.  I may need to try this  . . . altho without the chili and pepper; my husband's allergic to them.  Maybe a few cumin seeds instead.",
      "parent": "0",
      "gravatar_hash": "08b4d0e5fa36d027ffb36baf85fdf3e7"
    },
    {
      "id": "993",
      "author": "Lea",
      "author_url": "",
      "date": "2010-07-19 23:42:40",
      "content": "Michael, I think the recipe looks cannable the way it is since you have the 2 T lemon juice to bring up the acidity of the tomatoes. Acidity is a concern when using the \"hot bath\" canning method, but not if using a pressure canner. I checked several of my canning books, and all add at least 2 T lemon juice to about 1 quart of tomatoes. Most of the recipes for tomato jam (or marmalade or butter) called for tons of sugar - some as much as equal parts tomato and sugar! In my experience, sugar is often a matter of taste - some like more, some like less. But in canning, the crucial issue usually is acidity. It looks like you have more than enough to address that issue. That being said, I would highly recommend checking out a couple of resources just to be on the safe side. Ball has a nice, all-purpose guide to start with. Canning is great fun and very rewarding, but not without some risks if you are not careful. (that's my \"fine print disclaimer\" part) I can tell you that I will definitely be trying this recipe out, and I will definitely can some using the hot bath method. I will let you know how it turns out.",
      "parent": "0",
      "gravatar_hash": "3400d32fbe9b8561e0c9b39e0e55ae1d"
    },
    {
      "id": "994",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-07-20 11:19:14",
      "content": "Lea  - thank you so much for the detailed and thoughtful analysis!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "995",
      "author": "Cajun Chef Ryan",
      "author_url": "http://cajunchefryan.rymocs.com/blog2/",
      "date": "2010-07-21 05:17:20",
      "content": "Michael, I too have been canning my garden bounty, and with both fresh tomatoes and rosemary in the garden this looks like a perfect candidate recipe with putting up in jars for preserving.\n\nOne question, is the 24 ounces quantity for the tomatoes a weight or volume measure?\n\nBon appetit!\nCCR\n=:~)",
      "parent": "0",
      "gravatar_hash": "9f3b5ef4294bafb575b419690b0d278d"
    },
    {
      "id": "996",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-07-21 08:07:04",
      "content": "Thanks Chef! The 24 oz. is by weight, I&#39;ll correct the recipe to specify that.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "997",
      "author": "Heather",
      "author_url": "http://www.whiskflipstir.com",
      "date": "2010-07-21 19:53:38",
      "content": "This sounds great! I have a little jar of saffron burning a hole in my kitchen apron ...",
      "parent": "0",
      "gravatar_hash": "5514bd90e811fd929b99c15f38241689"
    },
    {
      "id": "998",
      "author": "valen",
      "author_url": "http://al4food.blogspot.com",
      "date": "2010-07-23 09:50:08",
      "content": "I have been wanting to make tomato jam for a long time.  This looks so delicious!",
      "parent": "0",
      "gravatar_hash": "39e975898feb9f52c00d5d0d6ed6b134"
    },
    {
      "id": "999",
      "author": "lisa",
      "author_url": "",
      "date": "2010-07-24 16:52:55",
      "content": "FWIW,  I think the canning experts (I am not one) would nix this as a cannable recipe; although the acidity is brought up by the lemon juice, there is also a significant amount of very low-acid onions in there.  The experts usually say don't guess, and only use canning recipes from reputable sources, such as your local extension service or the Ball Blue Book.  Cannable or not, I'll be trying it when tomatoes are at their peak here!",
      "parent": "0",
      "gravatar_hash": "ad68dd420a7276d6acf8736111e082b1"
    },
    {
      "id": "1000",
      "author": "John - Mormon Foodie",
      "author_url": "http://mormonfoodie.blogspot.com",
      "date": "2010-07-25 22:25:40",
      "content": "I agree with the other \"canners\" here. I don't see a problem art all with canning it. Of course, I'd want to quadruple the recipe just to make it worth the time of sterilizing the bottles and such. :-)\n\nI'm not convinced it wouldn't be good on toast. Peanut butter and tomato sandwiches are classic Southern fare.",
      "parent": "0",
      "gravatar_hash": "a31679e1b2b49a1f2a8aeb0fbae3493a"
    },
    {
      "id": "1001",
      "author": "Lea",
      "author_url": "",
      "date": "2010-07-28 00:13:08",
      "content": "Hi Michael, here's a little update on the canning of this tomato jam recipe... I used tomatoes from my garden (all heirlooms, some yellow, mostly red) and doubled the quantity - if you're gonna put food up, you might as well make it worth the effort! I tripled the lemon juice, though, since many of my tomatoes are on the sweet side and seem a bit low on acid. I didn't quite double everything else, though, so as not to over sweeten or overwhelm the tomatoes. It turned out delicious! And... I now have half a dozen jars. I am going to let them sit in the pantry for a while to see what happens. My hunch is that everything will be just fine. There is plenty of acid in there to take care of the onion issue that Lisa was concerned about. As I was tasting it, I couldn't help thinking how delicious it would be with some fresh goat cheese. That is on my list to make this week... I'll let you know.  And I'll keep you posted on the jars.",
      "parent": "0",
      "gravatar_hash": "442e785c165a05ff7b50e50f01391355"
    },
    {
      "id": "1002",
      "author": "Lori",
      "author_url": "http://lipsmackinggoodness.blogspot.com",
      "date": "2010-08-02 04:02:31",
      "content": "I did some tomato jam last year.  After bringing it to some parties for people to smear on crackers- it is a very sought after jam.  Everyone is always surprised.  I like your recipe here and I will give it a go this canning season.  I did can mind btw and wow what a treat it was.",
      "parent": "0",
      "gravatar_hash": "84bc9dc781778bf37fddf1fe0cef5ebb"
    },
    {
      "id": "1003",
      "author": "David",
      "author_url": "",
      "date": "2010-08-10 15:14:57",
      "content": "My girlfriend makes a gorgeous warm tomato jam that goes brilliantly with pork chops. She claims it also tastes amazing in a salad with feta cheese and rocket, but I've never tried it, I'm more a sandwich lunch kinda guy...",
      "parent": "0",
      "gravatar_hash": "432834a49241e5dab91a67a20eef4928"
    },
    {
      "id": "45145",
      "author": "Diane",
      "author_url": "",
      "date": "2012-08-13 05:39:36",
      "content": "Refer to Ball canning book for water bath canning tomatoes safely. There is a guide to the amount of lemon juice per pint/quart, etc. I'm going to can my Tomato Jam for winter consumption. Yum.",
      "parent": "0",
      "gravatar_hash": "c96d0cf98219abcdc75e4c0dda22a536"
    }
  ]
}