{
  "comment_count": 30,
  "comments": [
    {
      "id": "20108",
      "author": "Marina",
      "author_url": "http://www.cowboycountryvegetarian.blogspot.com",
      "date": "2012-02-27 11:44:38",
      "content": "I didn't know this was a Spanish tortilla, my grandmother use to make this often for us when we were kids. It was a common breakfast in her home (she made it from night before leftover potatoes). During the summer, she would add tomatoes on the top. I often make this meal too, but I bake it in the oven and sometimes add cheese on the top. Interesting post Michael!  It brought so many good memories too...",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "20123",
      "author": "J-step",
      "author_url": "",
      "date": "2012-02-27 16:35:32",
      "content": "Looks great, what's the quenelle of pink stuff next to the Spanish Tortilla in the photo?  I didn't see any mention of it in the recipe.",
      "parent": "0",
      "gravatar_hash": "f35f655e7b4877325dfc001211e3ebfc"
    },
    {
      "id": "20124",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-02-27 16:45:21",
      "content": "I was wondering if someone would ask. Mayonnaise flavored with a healthy amount of smoked paprika (to taste, no measurement). A bit of lemon juice would be good too.",
      "parent": "20123",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "20127",
      "author": "Nancy",
      "author_url": "",
      "date": "2012-02-27 17:31:33",
      "content": "Michael,  I'm so excited to try this recipe!  My husband and I had a wonderful trip to Spain last October and, being a fussy vegetarian, I ate more than my share of Tortilla Espanola. Thanks for the version with spinach. Nancy",
      "parent": "0",
      "gravatar_hash": "53fd506dfb6253bc15106e1997ff1826"
    },
    {
      "id": "20131",
      "author": "Kanchan",
      "author_url": "http://personaltadka.blogspot.com",
      "date": "2012-02-27 18:33:59",
      "content": "I din't know this is called Spanis Tortilla, I prepare something on similar lines and call it potato omelette. Will give this a try too.",
      "parent": "0",
      "gravatar_hash": "70f089fcb9ea446013d15d3021d2e042"
    },
    {
      "id": "20237",
      "author": "amee",
      "author_url": "http://www.rabbitfoodrocks.blogspot.com",
      "date": "2012-02-28 07:04:56",
      "content": "I was just about to ask but J-step beat me to it.  We just went to Spain last year and found some wonderful vegetarian eats like this in Barcelona and Madrid...    PS - I really enjoyed the intro.  :)",
      "parent": "0",
      "gravatar_hash": "22476a0ce17918636d3355926c514729"
    },
    {
      "id": "20246",
      "author": "WithoutBacon",
      "author_url": "http://withoutbacon.wordpress.com",
      "date": "2012-02-28 09:12:18",
      "content": "Looks great!  It's always nice to get some ideas on vegetarian options to try while traveling.  Check out my blog -- withoutbacon.wordpress.com -- for some great vegetarian options at top restaurants, mostly in New York, but also elsewhere in the US and around the world (Belgium &amp; Paris coming up).",
      "parent": "0",
      "gravatar_hash": "40d55d895158b1e8e0da98639a5b614a"
    },
    {
      "id": "20324",
      "author": "Noelle (@singerinkitchen)",
      "author_url": "http://www.singerskitchen.com",
      "date": "2012-02-28 19:53:43",
      "content": "WOw this looks really delicious. This was probably one of my favorite dishes while in Spain. I have to say that I have never tried to recreate it but I will have to make your recipe for sure.",
      "parent": "0",
      "gravatar_hash": "fda8f6f17686d72fe2fd5f04dd8972ac"
    },
    {
      "id": "20331",
      "author": "eva @VegucatingMyKids",
      "author_url": "",
      "date": "2012-02-28 20:47:35",
      "content": "i made this recipe today!...we happened to have a Spanish Tapas dinner party this past Saturday...however, all the dishes were per my weekend chef's (husband) hands, and he has a tendency to be liberal with meat, cheese and oils...i was eyeing his tortilla he was making and it was lovely--again, just not my style...then i see your recipe come up through my email, and voila! it was kismet-now i could have my own version--which is is just easy on the oils...i also dropped the 6 eggs to 4....but that's it!...lovely dish...love the inclusion of spinach!",
      "parent": "0",
      "gravatar_hash": "b8db197b1128c281926bef4c91ad418b"
    },
    {
      "id": "20332",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-02-28 20:50:03",
      "content": "Good timing, glad it worked out for you!",
      "parent": "20331",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "20694",
      "author": "Ellie P.",
      "author_url": "",
      "date": "2012-03-03 13:35:22",
      "content": "Mmmm. I also studied abroad in Spain in college. As a vegetarian, I ate almost nothing but tortilla de patatas there, but I still love it. It's a staple in our house--we even bought a flipping plate that matches the size of our large frying pan. \n\nI love making it with a bit of zucchini in the summer, but I haven't tried spinach. Thanks for the idea!\n\nLeftover tortilla is also great on bocadillos (packable baguette sandwiches--maybe with a bit of manchego cheese and tomato.)",
      "parent": "0",
      "gravatar_hash": "3c065140be110f115eb5cd60bd291071"
    },
    {
      "id": "20711",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-03 23:13:46",
      "content": "Mmm, yeah, Txori (which I miss) used to serve tortilla on bocadillos with mayo. Yummy. I like the idea of manchego and tomato, that sounds great!",
      "parent": "20694",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "20804",
      "author": "angela@spinachtiger",
      "author_url": "http://spinachtiger.com",
      "date": "2012-03-05 17:26:07",
      "content": "I love the looks of this. I'm so into spinach with eggs and I've been wanting to make a tortilla for ages. How lucky you had a neighbor to bring this to you.",
      "parent": "0",
      "gravatar_hash": "813dc67a9d1df4ad31a84c463c10c4af"
    },
    {
      "id": "20806",
      "author": "susan",
      "author_url": "",
      "date": "2012-03-05 18:16:29",
      "content": "What's the difference between this and a fritatta exactly? Just the way the potatoes are mixed in vs. layered? We eat fritattas once a week and I love the idea of saving a little time of just tossing the potatoes in, but might miss the crispy potato crust. As usual, awesome recipe.",
      "parent": "0",
      "gravatar_hash": "b1623375114aa052e0ed157c857c8eb9"
    },
    {
      "id": "20811",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-05 18:44:03",
      "content": "Besides country of origin I would say that a frittata has a less definite definition. It seems to hold almost anything, and potatoes are only one of many options. A tortilla, on the other hand, almost always involves potatoes and a good amount of olive oil, and the vast majority of the time has no other vegetables and has thinly sliced taters. (This recipe is the exception, which is why I thought it was worth publishing... the standard Spanish tortilla has been pretty thoroughly explicated at this point). Also, the potatoes are generally not browned. But yes, both are members of that large family of oven-or-stovetop baked egg dishes with so many wonderful options.",
      "parent": "20806",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "20848",
      "author": "John",
      "author_url": "",
      "date": "2012-03-06 05:08:59",
      "content": "Delicious! I found it difficult to cook the potatoes without browning them a LITTLE, but that made for decent flavor. As a quicker and sure-to-not-brown alternative, I'll bet you could pre-cook them in the microwave (and perhaps warm the spinach as well, to speed the warming-up of the eggs). My only changes in re-doing the recipe would be (a) a little more smoked paprika (maybe mine's getting old!) and (b) sprinkling the paprika over the potatoes and stirring to distribute; when I put it in the beaten eggs, it clumped up and was hard to distribute evenly.  I really liked using the cubed potatoes rather than sliced ones -- it made mixing/distrubting the egg/spinach stuff much easier.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "20863",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-06 10:06:42",
      "content": "Thanks! I've incorporated your suggestions.",
      "parent": "20848",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21300",
      "author": "Nilam",
      "author_url": "http://khavanu.blogspot.com",
      "date": "2012-03-11 08:59:21",
      "content": "Hi Michael, this was delish. Just wanted to give you some feedback. Fresh spinach works well and tastes delicious. I used two pans; the first to wilt down the fresh spinach, and cook the potatoes with the garlic and onions. The second pan (cast-iron) was used to cook the tortilla. I would recommend using a non-stick pan to cook the tortilla. I used a well seasoned cast iron and it still stuck =(. My Spanish friends routinely cook the potatoes in the microwave to make the dish healthier before adding it to the egg mixture, although I love the olive oil. LOVE the smoked paprika mayo (curry powder is equally tasty in mayo).",
      "parent": "0",
      "gravatar_hash": "39a80437f59150fc64ae46179001398a"
    },
    {
      "id": "21304",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-11 09:14:20",
      "content": "Hey Nilam - good deal! I'm all for using fresh spinach, though I think by the time they are cooked, there isn't necessarily a whole lot of taste or nutrition difference. So whichever is most convenient is quite appropriate. And I agree, unless you *know*  your cast-iron skillet is so well seasoned that it won't stick, teflon is a safer choice. Good tip on the microwave, though I'm with you I like the taste of the olive oil",
      "parent": "21300",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21398",
      "author": "Michelle",
      "author_url": "",
      "date": "2012-03-13 17:59:02",
      "content": "Michale, I just made this tonight for dinner with the following modifications:  boiled the potatoes, then added a bunch of chopped asparagus at the last minute.  Blanched all with cold water.  Sauteed onion, garlic and mushrooms, then tossed in the potatoes and asparagus with a bit of smoked hot paprika.  Sauteed all until warm.  Added the eggs and salt, cooked as directed.  \n\nOMG.  It was soooooooo good. My husband says it was the best meal he's ever had.  Thanks so much for a simple dinner meal.",
      "parent": "0",
      "gravatar_hash": "a574ed0d2b29b4d0ffc45867374e610f"
    },
    {
      "id": "21399",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-13 18:42:55",
      "content": "That sounds like a terrific variation! Thanks for sharing.",
      "parent": "21398",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "34398",
      "author": "Kelly",
      "author_url": "",
      "date": "2012-07-05 17:36:22",
      "content": "Just found your blog and I love it! I am actually a vegetarian living in Spain and I've never seen this version of tortilla but it looks delicious (and it's a nice break from the usual)!  This is a great dish for summer and I would definitely suggest eating it with some salmorejo (similar to gazpacho).  It makes an amazing, make ahead meal great for those summer days when it gets up to 120 degrees in Sevilla!!!  Thanks for all your great recipes, can't wait to start trying them out! ; -)",
      "parent": "0",
      "gravatar_hash": "65dce2b105124c51a1b7c62f6d097812"
    },
    {
      "id": "34422",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-05 18:50:47",
      "content": "Ooh, that brings back memories... the only time I've been in Sevilla, it was indeed *roasting* hot, and we were staying in a cheap hotel with no A/C. Loved the city though. I have this memory of a tiny shop that sold sherry infused with orange peel that was quite amazing. Any idea if that is still there?",
      "parent": "34398",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "38169",
      "author": "Kelly",
      "author_url": "",
      "date": "2012-07-16 16:03:40",
      "content": "Hmm....not sure, I've never had infused sherry before but it sounds good!  There is a bar near the cathedral that sells a really great sweet orange wine, though.....I would definitely recommend it!  I'll keep my eye out for your sherry!!! ;-)",
      "parent": "0",
      "gravatar_hash": "65dce2b105124c51a1b7c62f6d097812"
    },
    {
      "id": "38173",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-16 16:07:16",
      "content": "Oh, I bet that is it! If you ever find the name of it, please tell me!",
      "parent": "38169",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "43504",
      "author": "Olga",
      "author_url": "",
      "date": "2012-08-03 05:45:47",
      "content": "We make it with green asparagus and onion, delicious!\nOr zucchini and onion.\nWe even sometimes do them with crisps instead of proper potatoes!\nBy the way, it's espinacaS ;)\nor that's how we've always said it in Barcelona. \nWonderful blog!",
      "parent": "0",
      "gravatar_hash": "ae9ca15a37a60d9d23a46a602afff0d6"
    },
    {
      "id": "43532",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-03 08:30:57",
      "content": "I've seen a video of Ferran Adria doing tortilla with potato chips I believe, so you are in good company! Google seems divided on whether to call it \".. de espinaca\" or \"... de espinacas\"; I think I'll change it. Thanks for that!",
      "parent": "43504",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "150333",
      "author": "John",
      "author_url": "",
      "date": "2013-05-22 06:29:25",
      "content": "We keep making this, and I keep loving it. After a year's experience, I can report\n\n(a) It may not be authentic, but if you let the potato cubes get a little browned, it's still really good. \n\n(b) The amounts don't matter a lot. To make a 1.5 recipe, I double the spinach, leave the potatoes the same and use 1.5 times the eggs. Seems to work fine. \n\n(c) For frozen spinach, getting the water out's a lot easier if you microwave it until it's warm but not hot, and then put it in a strainer and push it with your fingers to squeeze out water. If you cook it all the way to hot, this burns your fingers. \n\n(d) You can cook the potatoes, then add the onions and garlic, and then pour the egg/spinach mix over them in the pan and stir around a bit, and it still works, at least in a well-seasoned cast-iron frying pan. This saves one step of transferring stuff back and forth. although it results in a slightly less even mix. \n\nAnyhow, it's an absolute favorite in our household. It'd also be a great \"college student\" dish, I'd think -- few ingredients, stovetop cooking, easy cleanup. What's not to love?",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "150338",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-22 06:46:05",
      "content": "I love all of these refinements and simplifications... little details like these can greatly streamline a favorite dish.",
      "parent": "150333",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "195420",
      "author": "Kanchan",
      "author_url": "http://personaltadka.blogspot.in/",
      "date": "2013-09-11 01:55:23",
      "content": "Hi, I prepared this recipe and we love it too. Also posted about it. thanks for sharing :)",
      "parent": "0",
      "gravatar_hash": "70f089fcb9ea446013d15d3021d2e042"
    }
  ]
}