{
  "comment_count": 6,
  "comments": [
    {
      "id": "4052",
      "author": "C(h)ristine",
      "author_url": "http://muffintop.wordpress.com",
      "date": "2007-09-08 03:46:26",
      "content": "Amazing!  Next time we are in Israel, I am keeping my eye out for that falafel and pomegranate juice place.  I remember being in that exact spot, but mostly panting for survival in the crowded shouk, only coming upon the Church of the Holy Sepulchre by total chance.",
      "parent": "0",
      "gravatar_hash": "f5c745bdea307910ad8ff6e9b53b137c"
    },
    {
      "id": "4053",
      "author": "fruit species",
      "author_url": "http://fruitspecies.blogspot.com/",
      "date": "2007-09-08 15:02:25",
      "content": "I like pomegranate juice, it tastes great! Too lazy to juice it myself, so sometimes bought the packet juice but of coz it isn't that good Very nice blog. Cheers from Fruity",
      "parent": "0",
      "gravatar_hash": "a1e3111be950848fc9604d628acfee18"
    },
    {
      "id": "4054",
      "author": "Tofu Mom",
      "author_url": "",
      "date": "2007-09-09 00:52:10",
      "content": "I am loving the reports of the trip and every detail of onformation you've shared. I'm such a foodie-head.\n\nBut more than that I have to thank you for turning me toward your wife's blog and her incredible writing about the trip as a whole. I am fascinated by every word and keep checking for the latest \"installment\" from both you guys! GREAT JOB!",
      "parent": "0",
      "gravatar_hash": "1a0b4a32e20aa0dec8b1491f2bea1ad6"
    },
    {
      "id": "4055",
      "author": "molahs4",
      "author_url": "",
      "date": "2007-09-12 16:16:25",
      "content": "There is no street food better than an Israeli falafel.  I could eat one daily and be a happy man. I don't know if it's the balls or the incredible assortment of fresh salads that make them so special.  I'm leaning towards the salatim.",
      "parent": "0",
      "gravatar_hash": "3152eb9a826251ff5dd51e86fcb5a01d"
    },
    {
      "id": "48421",
      "author": "anon",
      "author_url": "",
      "date": "2012-09-03 04:40:37",
      "content": "Just FYI: The phone number should be listed as +972-54-.... and not +972-054-.... The zero at the beginning of cell phone numbers or when calling different zones in Israel - or various other countries - is used to leave your current zone. This is similar to our use of 1 before US phone numbers to call long-distance. When you're making the international call, you leave your country (011 for the US; 00 for many/most? other countries) and enter the country code (972). As you are not located in Israel, no additional preceding zero is necessary, and you can dial the number of your desired zone directly (2 for Jerusalem, 3 for the Tel Aviv area, 5-something or 6-something for cellphones, etc.).",
      "parent": "0",
      "gravatar_hash": "f6bd02170ce559a71919f18d80b97666"
    },
    {
      "id": "48442",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-03 07:20:22",
      "content": "Great, thank you! I'll edit the article.",
      "parent": "48421",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}