{
  "comment_count": 26,
  "comments": [
    {
      "id": "50763",
      "author": "Janice D'Agostino",
      "author_url": "http://mindfulpalate.blogspot.com/",
      "date": "2012-09-14 06:45:26",
      "content": "am perfectly cool with all that! Best of luck!",
      "parent": "0",
      "gravatar_hash": "3f221c5a6e80802171020b787cd0424c"
    },
    {
      "id": "50764",
      "author": "Emma",
      "author_url": "",
      "date": "2012-09-14 06:49:15",
      "content": "I never mind advertising on a blog.  How else is the blogger supposed to make money, other than charging a fee for the blog itself?  Support the artists, I say!",
      "parent": "0",
      "gravatar_hash": "3f544d7c14fe3a18aa646cd7c9ded030"
    },
    {
      "id": "50774",
      "author": "LeDesign",
      "author_url": "",
      "date": "2012-09-14 07:37:09",
      "content": "I think anyone who signed up for your newsletter and appreciate having wonderful new recipes for free, could make an effort to support your work.\nI shop regularly at Amazon and didn't know i could use your link to their site for any purchase I make.\nI'll sure will do it from now on. Thank you for sharing the information. I believe a lot of people will be glad to learn it and help.\nKeep up with the good work. Best of luck!",
      "parent": "0",
      "gravatar_hash": "cafae8d7cbf180fbcde043535c041ff4"
    },
    {
      "id": "50775",
      "author": "Pat Machin",
      "author_url": "http://ayorkshirecook.com/",
      "date": "2012-09-14 07:38:47",
      "content": "Well written and Go, You!  Especially with the plan for a restaurant.  Maybe I'll get there some day.  We usually travel over the pond every other year on a family holiday.",
      "parent": "0",
      "gravatar_hash": "05317225bb48fe72158483da32d90b57"
    },
    {
      "id": "50788",
      "author": "Susan @ Travel Junkette",
      "author_url": "http://traveljunkette.com",
      "date": "2012-09-14 08:43:18",
      "content": "Awesome! It's great that you can support yourself with this blog. Love all the recipes -- keep 'em coming! (And best of luck with the restaurant!)",
      "parent": "0",
      "gravatar_hash": "e18849e64bbd9e2c5c9662fff22ad8d9"
    },
    {
      "id": "50792",
      "author": "Marina@Picnic at Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-09-14 08:52:07",
      "content": "Hi Michael, I am more than cool with that. I prefer to read about the product from the blogger as most of the time it's tried and true, not just a simple advertising. Can't wait to read your review of pasta maker attachment for Kitchen Aid you've mentioned in one of your posts. I make my own pasta, and knowing how the attachment works, it's pros and cons, would be so helpful. And when I decide to buy it, I'll go to your Amazon store (we don't have anything local to buy it from, so I won't feel guilty). \nThank you for sharing this information with your readers, your transparency is greatly appreciated. It helps to see a real person behind the blog, with real life plans, questions, ambitions, and everything... I wish you good luck and all only the best! :)",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "50794",
      "author": "Lotte",
      "author_url": "http://www.abitastudio.com",
      "date": "2012-09-14 08:58:40",
      "content": "If you really like the product you promote, I think it is fine.  I like to read about actual products and why they are great- like good design, durable, made in the US, locally made or grown, sustainable, cruelty free etc. Personally I think there should be some sort of link to what you do on your site that makes sense for us to read about it here, but I know that may not be economically viable.",
      "parent": "0",
      "gravatar_hash": "c96142386811a26264cd0b7b3603e874"
    },
    {
      "id": "50892",
      "author": "ben",
      "author_url": "",
      "date": "2012-09-14 12:04:00",
      "content": "you're worth it! i'll use the link when i can for sure. happy to. thanks for al the great creations. \n\nshanah tova\n\nben",
      "parent": "0",
      "gravatar_hash": "825a1e4c2a61919d1de8623b92eeed1d"
    },
    {
      "id": "50895",
      "author": "Sharah",
      "author_url": "http://sharah.wordpress.com",
      "date": "2012-09-14 12:08:26",
      "content": "I appreciate the transparency and look forward to your recommendations!",
      "parent": "0",
      "gravatar_hash": "ca1261571cb31a7d4283f99ae9fd665c"
    },
    {
      "id": "50944",
      "author": "Patti Johnson",
      "author_url": "http://www.facebook.com/pabpaj",
      "date": "2012-09-14 14:23:23",
      "content": "Very cool with it!  I have bookmarked the Amazon.com link to help.  I love your blog and recipes.  I subscribe to your blog.  I share all your recipes with my twitter followers and FB friends.  Wishing you the best of luck with your restaurant and cookbook (which I hope to buy soon!) and this blog!  You ROCK my culinary world!  Blessings to you!  :)  &lt;3",
      "parent": "0",
      "gravatar_hash": "c9c88a8000f3c848b0de01e62c9d8d9a"
    },
    {
      "id": "50947",
      "author": "Dawn | KitchenTravels",
      "author_url": "http://www.kitchentravels.com",
      "date": "2012-09-14 14:31:58",
      "content": "I'm cool with it. Excited to see how the new restaurant venture develops. :)",
      "parent": "0",
      "gravatar_hash": "cdd3b28114324aafd93b1030244c92b7"
    },
    {
      "id": "51032",
      "author": "Stephie @ Eat Your Heart Out",
      "author_url": "http://eat-your-heart-out.net",
      "date": "2012-09-14 19:54:57",
      "content": "I totally appreciate your transparency! For one, because it's real. And for two, because I would love to support myself (even a little bit) off my blog someday, and hearing about how other bloggers are doing that is really helpful!",
      "parent": "0",
      "gravatar_hash": "452567ba90917c2bb858328dc8f8b842"
    },
    {
      "id": "51184",
      "author": "Emily",
      "author_url": "",
      "date": "2012-09-15 01:32:49",
      "content": "I think it's great that doing something I was going to do anyway can help you make a living doing something you're clearly good at.",
      "parent": "0",
      "gravatar_hash": "efbb5361d62dec6d06233f28cdd1c829"
    },
    {
      "id": "51312",
      "author": "Carolyn",
      "author_url": "http://www.whatsthemuck.blogspot.com/",
      "date": "2012-09-15 07:13:31",
      "content": "No one should have any problem at all with Herbivoracious (or any other free blog) doing product/giveaway posts. Or with advertising on the sidebar. Bring it on! If I subscribe to a cooking magazine, I have to PAY for the magazine, plus deal with ads. If the new business model becomes online blogs which I DO NOT have to pay for, but still get great content, with the commercial stuff still in attendance, that's even better! And it's WAY better if you are being the guinea pig and letting me know whether an untried product is worth trying.",
      "parent": "0",
      "gravatar_hash": "380d699e3ae9d44fa2e6dac67339e153"
    },
    {
      "id": "51331",
      "author": "Slammin' Salmon",
      "author_url": "",
      "date": "2012-09-15 08:36:35",
      "content": "Sounds a lot better than popup scripts, flashing banners, and other forms of advertising.  I don't mind seeing perspective on good products you use and I certainly don't mind you making some cash on this blog.  Considering I haven't found any other veg blog even close to the level of this one, it does a service to vegetarians and non-vegetarians alike by shattering the idea that vegetarians have to be relegated to side dishes and afterthoughts.",
      "parent": "0",
      "gravatar_hash": "f35f655e7b4877325dfc001211e3ebfc"
    },
    {
      "id": "51507",
      "author": "Crystal",
      "author_url": "",
      "date": "2012-09-15 16:48:23",
      "content": "Bookmarked! Good luck!",
      "parent": "0",
      "gravatar_hash": "d657396c64f2c3099f5271c72ce94d6a"
    },
    {
      "id": "51830",
      "author": "Amanda",
      "author_url": "",
      "date": "2012-09-16 09:26:48",
      "content": "I am okay with this, within limits. I have noticed that about 75% of the time when a blogger goes super commercial like this, I stop reading their blog. Not because I'm opposed to the occasional ad or whatever, but because most of the time their blog inevitably ends up ALL commercial and the content really suffers. I hope that's not the case with this blog, as I've really enjoyed it.\n\nI would personally prefer if your sponsored posts and reviews were clearly labelled as such (in the title, or at least a decent post-script). I feel like that is transparent and then I won't mind it a bit. But when there is no labeling, I start to wonder what's really true and what's been posted to make money, and I personally find that a turn-off.",
      "parent": "0",
      "gravatar_hash": "86eb4d2a4a308ae2bb836283d81bca0f"
    },
    {
      "id": "55591",
      "author": "Allison",
      "author_url": "http://urbanresearch.wordpress.com",
      "date": "2012-09-28 07:49:50",
      "content": "Definitely cool with it! Saving that affiliate link, too :)",
      "parent": "0",
      "gravatar_hash": "2b0d040664ab3df718102dc8c0fab22f"
    },
    {
      "id": "58266",
      "author": "Alana",
      "author_url": "",
      "date": "2012-10-02 18:48:20",
      "content": "I am so cool with it that I'd be happy if you had a category to take me to all the products you recommend! I was about to buy myself the spatula when i realized I'd get free shipping if I included something else. Then I discovered that you don't have a category link for product recommendations.  Also, just wanted to say congratulations on the new developments and thank you for all you have taught me over the years. In 2007, you wrote a post about how to combine flavours and textures -- i wish i could find that post again! -- and it started a big journey for me in learning how to cook instead of just following recipes by rote.  I am happy to support you any way I can, and I really appreciate your guidance.",
      "parent": "0",
      "gravatar_hash": "688f27e683e418bf82073fba81b0f095"
    },
    {
      "id": "58276",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-02 19:03:35",
      "content": "Thanks, Alana! You've been a supporter for a long time. You are right, I don't have a very good category for recommendations, but there is this: https://herbivoracious.com/category/shopping - and I do plan on building it out into something more useful. \n\nI wonder if this series is the what you were thinking of? 5 parts starting here: https://herbivoracious.com/2010/01/crunch-acid-salt-fat-1.html - if not, give me another clue about it and I'll try to find it for you.\n\nThanks,\nMichael",
      "parent": "58266",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "58281",
      "author": "Alana",
      "author_url": "",
      "date": "2012-10-02 19:12:40",
      "content": "Found it! It was this one:\nhttps://herbivoracious.com/2008/11/7-pasta-tips-conchiglie-with-chard-and-smoked-mozzarella.html\nAmazingly helpful.",
      "parent": "0",
      "gravatar_hash": "688f27e683e418bf82073fba81b0f095"
    },
    {
      "id": "58288",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-02 19:19:13",
      "content": "Oh wow, that really is a blast from the past. I'd forgotten about it completely except that as soon as you mentioned it, I remembered the photo which was taken in terrible light and then I had all kinds of trouble processing it. I'm really delighted that it helped you feel more confident as a cook. This would be a good topic to come back to, thank you!",
      "parent": "58281",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "63871",
      "author": "Kitty",
      "author_url": "",
      "date": "2012-10-17 18:50:01",
      "content": "This is such a great thing to read.\nI've often wished I could \"tip\" my favourite blogs. I tip for good service. I'll happily pay a little more at a local business if the staff can give me good advice.\nBlogs like this provide the advice and are a wealth of information, but before this I had no way to support it in return. I'm happy to be able to do so. \nAlso, I wonder if you would be able to put a \"tip the blog\" button on the page in a tasteful way?\nYou might be pleasantly surprised at the result :)",
      "parent": "0",
      "gravatar_hash": "a1d1f5ff4a0e0ef4c3cd614a99652352"
    },
    {
      "id": "147267",
      "author": "ck",
      "author_url": "",
      "date": "2013-05-14 11:52:15",
      "content": "I love to support you and thank you for all the wonderful writing and recipes.",
      "parent": "0",
      "gravatar_hash": "634dbb4a4a77b0c5f940b3f05e29c9c3"
    },
    {
      "id": "167322",
      "author": "Chezzie",
      "author_url": "",
      "date": "2013-06-30 00:56:49",
      "content": "I love the site and appreciate the helpful tips about products, I have put your Amazon link into my bookmarks bar but......as I am in the Netherlands I order from Amazon.co.uk I also have lots of friends here and in the UK who would be happy to buy via your links, could you arrange the the same deal with Amazon UK Michael?\n\nI am about to write a review on Amazon about your brilliant book so I hope that helps the UK sales.  Good luck with your new ventures.",
      "parent": "0",
      "gravatar_hash": "84086a9780de38c3b8ba95fa073787d0"
    },
    {
      "id": "167473",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-06-30 07:32:49",
      "content": "Thanks, Chezzie! I haven't set up international Amazon affiliates yet - i'd be curious if other readers would use them if I set it up. Anyone?",
      "parent": "167322",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}