{
  "comment_count": 79,
  "comments": [
    {
      "id": "155",
      "author": "John",
      "author_url": "",
      "date": "2011-09-13 05:32:36",
      "content": "You had me right up to the star anise. For those of us who have had enough anise/licorice/fennel flavor for a whole lifetime, it'd be really nice if there were a substitute.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "156",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-13 08:35:16",
      "content": "Ok, so I knew some folks would have that concern so I should have addressed it in more detail. When that reaction between the anisole and anisidine in the star anise and the sulfur in the onions occurs, it totally changes the flavor of the star anise, to the point where there is barely a whisper of typical anise flavor in the resulting broth. I fed it to a confirmed anise/licorice hater and she was drinking the broth down as fast as I could pour! As far as I&#39;ve been able to determine, there isn&#39;t a substitute, and you can certainly omit it, but I think you should give it a shot, the transformation is pretty amazing.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "157",
      "author": "Sandra",
      "author_url": "",
      "date": "2011-09-13 13:41:04",
      "content": "Hi, I don't have a pressure cooker. Can I still make this? If so, how? This sounds amazing and I'd be really bummed if I couldn't give it a try.",
      "parent": "0",
      "gravatar_hash": "383c5cd8cd812d90addc0700c7b9a5c9"
    },
    {
      "id": "158",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-13 13:43:01",
      "content": "Hey Sandra - Great question. Yes, you can definitely do this without the pressure cooker. At the stage where you would bring it to high pressure, instead bring it to a covered simmer, and cook for about 45 minutes instead of 20. You won&#39;t get the same level of flavor extraction, and you&#39;ll lose some flavor to the air that would otherwise remain trapped in the pressure cooker, but it will still be damn good!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "159",
      "author": "Nilam",
      "author_url": "http://khavanu.blogspot.com",
      "date": "2011-09-13 14:45:42",
      "content": "I just made a broth that looks very similar to this (can't wait to try this one) for a vegetarian vol-au-vent (I live in Belgium so it has become a challenge).  I can't wait to try the kombu and anise additions. Do you think the rosemary adds any bitterness? When I add dried rosemary it usually imparts a bit of a bitter flavor. A good tip is to freeze leftover stock in 1/2 cup increments.",
      "parent": "0",
      "gravatar_hash": "39a80437f59150fc64ae46179001398a"
    },
    {
      "id": "160",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-13 20:07:06",
      "content": "Hey Nilam - I didn&#39;t notice any bitterness, so I think you are safe on that count. Good tip about freezing stock in small increments. I&#39;ve seen some people freeze it as ice cubes too, but I&#39;ve never done that.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "161",
      "author": "Jill, The Veggie Queen",
      "author_url": "http://www.theveggiequeen.com",
      "date": "2011-09-13 22:49:55",
      "content": "John,\n\nI am with you on that. I am definitely not a fan of licorice type flavors. I like basil (but not the Thai type) and tarragon is OK in small amounts but star anise really turns me off.\n\nI'm also curious.",
      "parent": "0",
      "gravatar_hash": "e918dad880e60ff08b80eda51d7e2b0c"
    },
    {
      "id": "162",
      "author": "Jill, The Veggie Queen",
      "author_url": "http://www.theveggiequeen.com",
      "date": "2011-09-13 22:51:57",
      "content": "If you are only going to use a little bit of broth, then freezing in ice cube trays is ideal. You can add one or two to dishes that just call for a few tablespoons. It works out great.\n\nThanks for this recipe.",
      "parent": "0",
      "gravatar_hash": "e918dad880e60ff08b80eda51d7e2b0c"
    },
    {
      "id": "163",
      "author": "LE",
      "author_url": "",
      "date": "2011-09-14 08:00:21",
      "content": "For someone in the US, what is a Marmite sub?",
      "parent": "0",
      "gravatar_hash": "070017d22204f2ec1d90c624e08603ec"
    },
    {
      "id": "164",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-14 08:09:22",
      "content": "Hey LE - I&#39;m actually in the US (Seattle). Marmite is not too hard to find in the US. Whole Foods, or just about any health food/natural food store has it, as does Amazon (<a href=\"http://amzn.to/rrg5fD). \" rel=\"nofollow\">http://amzn.to/rrg5fD). </a>",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "165",
      "author": "Jay",
      "author_url": "",
      "date": "2011-09-15 04:01:48",
      "content": "I came across your link from Foodgawker.com; however, I m disappointed some blogs do not offer printer friendly. Vegan broth looks thoughtful; however, no printer friendly??? ;o(",
      "parent": "0",
      "gravatar_hash": "f95beb917200078cfb172eecb63f7381"
    },
    {
      "id": "166",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-15 07:11:28",
      "content": "Hi Jay - yes, the print problem is frustrating. I should be able to address it better when I move the blog to wordpress in a few months.\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Wordless Wednesday One",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "167",
      "author": "Telebrands",
      "author_url": "http://www.squidoo.com/telebrands-usa",
      "date": "2011-09-15 10:34:53",
      "content": "This unami-packed vegetarian broth sounds wonderful.  Thanks for the recipe.",
      "parent": "0",
      "gravatar_hash": "2d61b78b7ccaa6e871ff07ddd391e030"
    },
    {
      "id": "168",
      "author": "Carolyn",
      "author_url": "http://profile.typepad.com/ceblakeney",
      "date": "2011-09-16 19:06:15",
      "content": "OK, I'm confused here- it appears there is a print function- I just tried it with the PDF option and it works fine. It's just buried in the box below the recipe.\n\nBut anyway, thanks Michael for the recipe. I've been using a pressure cooker for years but recently acquired an electric version and have yet to use it! This recipe will justify the purchase, I believe.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "169",
      "author": "Cassandra@foodmyfriend",
      "author_url": "http://www.foodmyfriend.com",
      "date": "2011-09-17 05:20:16",
      "content": "Definately a cook and keep recipe. Freeze it in batches for when I have a mean soup craving!!",
      "parent": "0",
      "gravatar_hash": "7cb4fa7836bedbb73077f6f2f76ceb2d"
    },
    {
      "id": "170",
      "author": "mjskit",
      "author_url": "http://mjskitchen.com",
      "date": "2011-09-17 21:04:35",
      "content": "I'm not sure if this broth would make it to a soup! With all of those wonderful ingredients, it's got to be absolutely delicious just as is.  Great broth recipe!",
      "parent": "0",
      "gravatar_hash": "d63eea6f586d099da14b0ba43aeedbbf"
    },
    {
      "id": "171",
      "author": "James",
      "author_url": "",
      "date": "2011-09-23 13:37:50",
      "content": "Anybody know a good source for dried shiitake mushrooms?  I saw them at Whole Foods but it was $12 for what appeared to be maybe 1.5 cups.",
      "parent": "0",
      "gravatar_hash": "3136ffb97b958964c7b77a90c2e55b51"
    },
    {
      "id": "172",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-25 18:51:47",
      "content": "Oh, yeah, just head to your local Chinese, Japanese or Korean grocery and you&#39;ll find them for 1/4 that price or less :)",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "173",
      "author": "kreeg@unitehere11.org",
      "author_url": "",
      "date": "2011-09-28 20:44:56",
      "content": "How would this translate to a slow cooker?",
      "parent": "0",
      "gravatar_hash": "3d2854f013380cfc1fc8b7a715425dcc"
    },
    {
      "id": "174",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-29 20:54:01",
      "content": "I don&#39;t do any slow-cooking so I can&#39;t say for sure, but my guess is that it wouldn&#39;t work very well. I think you&#39;d lose a lot of the flavor in the wafting steam.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "175",
      "author": "Sigrid Trombley",
      "author_url": "http://profile.typepad.com/sigridtrombley",
      "date": "2011-09-30 12:07:22",
      "content": "Michael,\nThank you for this recipe. This is the best vegetarian broth recipe I’ve found. I’ve tried others as well as canned and powdered broths and they’re usually too bland and/or loaded with salt and not much better than using plain water. I’ve been looking for a vegetable broth that will contribute to the dish I’m making but not overwhelm it. I think I’ve found what I’m looking for in your broth.\n\nJohn and Jill, the Veggie Queen, I’m also not a fan of licorice-type flavors and I don’t care for anise at all.  And like you Jill, I can take tarragon in small amounts. However I thought I’d try the recipe once with the star anise. Next time I’d probably use half of one star anise but would not cut it out totally. I think it contributes in a subtle way but does in no way scream “this broth tastes like star anise.” I couldn’t find marmite or vegemite locally and didn’t want to bother ordering it online. The Veggie Queen suggested I substitute miso, which I did.\n\nA friend I shared the recipe with thought it would likely be too flavorful for most of what she’d use a vegetarian broth for.  Of course I don’t know her tastes and everything she’d add vegetarian broth to, but I think as long as the broth is diluted when used as an ingredient, it will work perfectly. It makes a nice broth for eating right from the pot, but because it’s nice and rich (a good thing!), it can be diluted.\n\nThanks again for the recipe, Michael.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "176",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-30 14:27:28",
      "content": "Thanks for sharing your experience, Sigrid! I think miso is a good thought as a sub for the marmite, especially one of the dark, powefully flavor misos. I&#39;m glad you went ahead and tried the star anise, too!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "177",
      "author": "Sudesh",
      "author_url": "",
      "date": "2011-10-20 18:53:03",
      "content": "I wonder how dried, unspiced, fermented vegetables work as an addition to the recipe? I have fermented spinach in my mind. Thanks for the recipe, never tried anise before, I'll def. try it.",
      "parent": "0",
      "gravatar_hash": "4e7aea9d124df039cf39802ffead2687"
    },
    {
      "id": "178",
      "author": "GMS",
      "author_url": "",
      "date": "2011-11-10 07:52:51",
      "content": "This came out excellent for me. I used it as a consommé, and a soup base. I will be making it again.\n\nThe flavor is very beefy. I may use some for a beef-less stroganoff.",
      "parent": "0",
      "gravatar_hash": "1a7d58998797e0d09a6773fc2b89ed56"
    },
    {
      "id": "179",
      "author": "aylsa",
      "author_url": "",
      "date": "2011-11-11 02:20:36",
      "content": "Beefy, hey? I'm thinking Pho. (Vietnamese soup.) Mmm..",
      "parent": "0",
      "gravatar_hash": "a5c6c4d487ebfdec1a0c4852d9e2606b"
    },
    {
      "id": "180",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-11-11 07:53:40",
      "content": "It might not be quite clear enough for pho, but I think the flavor would be good if you clarified it and diluted it just a bit.\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Vegetarian Thanksgiving Recipes",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "15848",
      "author": "Amy",
      "author_url": "",
      "date": "2012-01-02 10:38:28",
      "content": "Can you recommend a sub for the star anise? Regular fennel seed?",
      "parent": "0",
      "gravatar_hash": "649665b8ef179f7b439b7b3b7094118d"
    },
    {
      "id": "15865",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-02 14:20:01",
      "content": "I don't think fennel seed will work. There are some specific compounds in the star anise that react with the sulfur in the onions to create umami. So I would just omit the star anise if you can't get your hands on it.",
      "parent": "15848",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17203",
      "author": "goody-goody",
      "author_url": "",
      "date": "2012-01-16 21:42:58",
      "content": "Thank you for such a wonderful recipe and the perfect excuse to make a purchase. I love my new pressure cooker! I'm in Seattle, so I feel like I'm cooking with a friend when I follow your recipes. I used two cups of your broth (plus two cups of wild rice cooking water) for this wild rice and mushroom soup recipe http://www.thekitchn.com/recipe-minnesota-wild-rice-mushroom-soup-164295#comment_form and knocked it out of the park! \n\nThanks!!!",
      "parent": "0",
      "gravatar_hash": "1a417822b4f6759cdbc82a19592a136b"
    },
    {
      "id": "17241",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-17 09:01:24",
      "content": "Oh man, I bet that soup was amazing!",
      "parent": "17203",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21328",
      "author": "Paul",
      "author_url": "",
      "date": "2012-03-11 16:45:21",
      "content": "Unfortuantely this recipe cannot be considered \"vegan\", unless you're using a vermouth that is NOT produced with the aid of animal products. If you have one, could you please post the brand name, as it seems impossible to find one without the warning: \"This product is produced with the aid of fish and/or egg products, traces may remain\"",
      "parent": "0",
      "gravatar_hash": "337b9ec20976ce503b707e5ae88b3b41"
    },
    {
      "id": "21330",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-11 18:50:19",
      "content": "Hmm, I don't see that warning on my bottle of Dolin dry vermouth. Not to say that it might not have been \"fined\" (filtered) with animal products, I know that is a common practice with many types of wine. If that concerns you, you could omit it or subsitute a small amount of vodka. (The alcohol is useful in extracting flavors that aren't soluble in water.)",
      "parent": "21328",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22496",
      "author": "Alana",
      "author_url": "",
      "date": "2012-04-05 19:29:55",
      "content": "Michael, do you think I could use this as broth for matzoh ball soup?  I don't mind if it tastes nothing like the chicken broth my mom makes -- just want it to be tasty!",
      "parent": "0",
      "gravatar_hash": "688f27e683e418bf82073fba81b0f095"
    },
    {
      "id": "22497",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-05 19:47:27",
      "content": "It might be a little on the rich side for matzo ball soup; I think it is a closer analogue to a cow broth than chicken if I were going to make that kind of comparison. It would be killer for French onion soup though. I guess if I were going to use it for matzoh ball soup I would maybe clarify it (using this method: http://www.cookingissues.com/2010/07/20/simple-agar-clarification-1-year-anniversary-plus-a-rundown-of-current-clarification-techniques/)",
      "parent": "22496",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "74478",
      "author": "EnriqueB",
      "author_url": "http://dorarnosella.com/",
      "date": "2012-11-05 03:06:35",
      "content": "Hi Michael, this looks like a great stock, I must try it. Have you tried preparing it at a low temperature instead of a pressure cooker? I usually pressure-cook stocks, but in MC and MC at Home they recommended sous-vide 3 hours at 85ºC plus 12 hours cold infusion for vegetable stocks in order to obtain a more subtle and aromatic flavour. I recently did a side-to-side test with exactly the same ingredients (shown here, in Spanish I'm afraid: http://dorarnosella.com/2012/10/28/fondo-de-verduras-comparacion-entre-sous-vide-y-olla-rapida/ ). The SV stock was certainly more aromatic and delicate, whereas the pressure-cooked was stronger, more intense. I would rather have the SV version for a consommé, and the pressure-cooked version for sauces, rice bases, etc. Also the pressure-cooked is much faster and easier to prepare.",
      "parent": "0",
      "gravatar_hash": "6ef3694c86fd9382a2a1a310b2a33c38"
    },
    {
      "id": "74592",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-11-05 07:15:16",
      "content": "Great point! I haven't tried doing this stock SV, but I bet it would be delicious. I don't have a circulator, so I'd have to fake up some sort of rig, but presumably this isn't incredibly temperature sensitive the way some other SV jobs are.",
      "parent": "74478",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "98713",
      "author": "Emma",
      "author_url": "",
      "date": "2012-12-12 10:43:45",
      "content": "I made the excellent chickpea &amp; vegetable soup from the book last night and used a combination of vegan buillon cube and mushroom broth-- probably not as good as this stock, but easy and really tasty!",
      "parent": "0",
      "gravatar_hash": "3f544d7c14fe3a18aa646cd7c9ded030"
    },
    {
      "id": "117063",
      "author": "Jenny",
      "author_url": "",
      "date": "2013-02-13 02:29:06",
      "content": "I have used Marmite in broths before, and it definitely gives a deep, meaty flavor. My question is, how do you feel about its yeast extract content? There seems to be a quiet agreement that natural sources of glutamate like the kombu are acceptable, but I'm having a more difficult time finding a firm answer on yeast extract and the like.",
      "parent": "0",
      "gravatar_hash": "64ac4d62e21092b7462700bce0ffdc9e"
    },
    {
      "id": "117144",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-13 06:46:19",
      "content": "I don't know of any reason to be concerned about yeast extracts. For that matter, all the research on synthetic MSG is universally that it is harmless, and that people who think they are sensitive to it are experiencing a psychosomatic reaction. See the info on wikipedia (http://en.wikipedia.org/wiki/Monosodium_glutamate) for details.",
      "parent": "117063",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "117250",
      "author": "Heather",
      "author_url": "",
      "date": "2013-02-13 18:48:28",
      "content": "Hi,  \n\nI used your recipe as a sub for the bacon in Cooks Illustrated Hearty Lentil Soup and it was just wonderful.  \n\nI'm planning on making it again this weekend.  Is it possible to make it a few days ahead?  I'd freeze it, but I don't have a lot of room in my freezer right now.\n\nThanks!",
      "parent": "0",
      "gravatar_hash": "59dfc7a6147105d410e393bca20e5b28"
    },
    {
      "id": "117259",
      "author": "Jenny",
      "author_url": "",
      "date": "2013-02-13 19:03:46",
      "content": "Yeah, there doesn't seem to be much evidence - just a lot of unfounded accusations. Really, the only negative that I have experienced is the craving for more! Haha. So as long as it's put into something healthy or relatively benign I guess the downside seems to be pretty minimal. =)",
      "parent": "0",
      "gravatar_hash": "64ac4d62e21092b7462700bce0ffdc9e"
    },
    {
      "id": "117287",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-13 21:49:29",
      "content": "Yes, I think you could make it up to say 3 days ahead and refrigerate it and it should be just fine.",
      "parent": "117250",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "142991",
      "author": "James",
      "author_url": "",
      "date": "2013-04-30 13:16:23",
      "content": "What do you think about adding lapsang souchong and/or Scherlenka Rauchbier (which incidentally is the greatest thing to come out of Germany in all of history) to this? \n\nI'm going to try exactly that when I next make this.",
      "parent": "0",
      "gravatar_hash": "f9547e6880ce63f2aaea64bb11a10246"
    },
    {
      "id": "143013",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-04-30 15:00:55",
      "content": "I'm more attracted to the idea of the smoky beer than the tea in this particular application. Never had that beer but it sounds amazing. I do use the tea in this dish though: \n\nhttps://herbivoracious.com/2013/04/maitake-mushrooms-in-smoky-tea-broth.html",
      "parent": "142991",
      "gravatar_hash": "18b93ab19ab9e4835b8e854e043deb0c"
    },
    {
      "id": "143441",
      "author": "James",
      "author_url": "",
      "date": "2013-05-02 07:33:21",
      "content": "Oh yeah, that beer is unreal. \n\nI made that the other day, but I had to use shitake instead as I couldn't get maitake, which was a shame because I love maitake. It was still great.",
      "parent": "0",
      "gravatar_hash": "f9547e6880ce63f2aaea64bb11a10246"
    },
    {
      "id": "189300",
      "author": "Nathan",
      "author_url": "http://www.eatingsmaller.com",
      "date": "2013-08-18 04:58:37",
      "content": "This broth was delicious. I've just had gastric sleeve surgery and have been struggling with finding decent flavour in soups that are thin enough to have while I'm in transition for the first month. Thanks Michael, you've saved my palate, and I'll definitely be making more of your recipes once I'm on solids. \n\nI'm blogging about my new food experiences and discoveries (including a post about this broth).",
      "parent": "0",
      "gravatar_hash": "7bb7a30d6e6bccd030e9774dcfebca59"
    },
    {
      "id": "189441",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-08-18 21:45:11",
      "content": "I'm delighted to hear that this broth was helpful to you during your recovery! Best of luck with everything.",
      "parent": "189300",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "193445",
      "author": "Jackie",
      "author_url": "",
      "date": "2013-09-02 13:45:31",
      "content": "Although I've been making this every weekend for the past two months since discovering your site and then rushing out to buy your book, it wasn't until today that I made it with my new pressure cooker (PC).  I don't know why it took me so long to come around to pressure cooking--well, yes, I do--exploding visions haunt me, but I got the WMF Perfect Plus stove-top at a 40% discount and it kept screaming, \"pick me pick me!\" -- one of my favorite kitchen staples now.  The difference between making this broth on regular stove top and PC is surprising.  Who knew that so much deliciousness was escaping?  It's still a great broth if you don't make with PC, but start saving for your own PC.  Only exclusion on my part is the marmite--I really don't like the taste of it, and if it makes the broth \"meatier\" tasting, it's not for me.",
      "parent": "0",
      "gravatar_hash": "60c4c9b51d65231ecd74bf201da4a564"
    },
    {
      "id": "193450",
      "author": "Jackie",
      "author_url": "",
      "date": "2013-09-02 13:53:56",
      "content": "ps...for those adverse to licorice flavor, I use the star anise (liberally) and I do not detect any licorice flavor in the final product",
      "parent": "0",
      "gravatar_hash": "60c4c9b51d65231ecd74bf201da4a564"
    },
    {
      "id": "193452",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-09-02 13:55:08",
      "content": "That makes me so happy to hear you are making it so regularly! And I'm happy to hear you've got the pressure cooker now, it really does make a big difference.",
      "parent": "193445",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "199577",
      "author": "Diane",
      "author_url": "",
      "date": "2013-10-08 10:34:45",
      "content": "Hi.The only star anise I find is dried.So do you mean fresh star anise or dried and where can you find fresh?",
      "parent": "0",
      "gravatar_hash": "2a1517e1815153df8fea68bf8817b356"
    },
    {
      "id": "199579",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-10-08 10:37:18",
      "content": "Dried. I've never seen it fresh either.",
      "parent": "199577",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "206593",
      "author": "Heather",
      "author_url": "",
      "date": "2013-10-22 16:43:26",
      "content": "Oh my gosh!!!\n\nI made this in a pot, like the directions said, but after awhile I added a little more salt- no sweet vermouth so I used some lemon for acid. Ended up putting in a Serrano chili. Added extra water and another piece of kombu. Let it simmer with a lid on the stove for 2 hours. Watered it down a little bit, strained it, picked some really soft shitakes from the mix and threw in some fresh sliced button mushroom. Added in some rice noodles, some baby swiss chard leaves. Served with chive flower buds on the chives and lots of fresh thai basil from the garden... I think I am in heaven. I wish all this made more... Next time I'm making a gallon of this delicious stuff!",
      "parent": "0",
      "gravatar_hash": "0192b11191798057d7b065bcd9733f52"
    },
    {
      "id": "307834",
      "author": "msmaddiep",
      "author_url": "",
      "date": "2013-12-13 02:02:53",
      "content": "Do you think this would work with Asian soups? I've been looking for a vego replacement for a Chinese Chicken Stock...",
      "parent": "0",
      "gravatar_hash": "77067557c178f3dd8e24213d7ac6f5f8"
    },
    {
      "id": "309208",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-12-13 06:46:49",
      "content": "I think it would be a good starting point; you might find you'll want to adjust the balance a bit. I think it tastes closer to a beef stock than chicken (to whatever degree I remember, it has been 30 years :). I might skip the marmite and halve the tomato paste.",
      "parent": "307834",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "551155",
      "author": "Doug",
      "author_url": "",
      "date": "2014-01-12 13:30:41",
      "content": "Is 13g of Kombu correct?  I have Hime Brand Roasted Seaweed Shushinori and 13g is about 5 full sheets of the stuff. It's hardly the 1 small piece you put in parenthesis.\n\nThanks.",
      "parent": "0",
      "gravatar_hash": "59f1a7f666e62b99af5d4c884ca50ebb"
    },
    {
      "id": "551166",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-01-12 13:34:20",
      "content": "You've got nori; the recipe is calling for kombu which is a different (and much denser) seaweed often used to make broths. It won't work to use nori in this I'm afraid.",
      "parent": "551155",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "552598",
      "author": "Doug",
      "author_url": "",
      "date": "2014-01-12 19:25:28",
      "content": "If I wanted to use MSG in this, would I substitute it gram per gram for the salt, or go half and half, or what? Any thoughts? Seems like MSG would increase the umami even more.",
      "parent": "0",
      "gravatar_hash": "59f1a7f666e62b99af5d4c884ca50ebb"
    },
    {
      "id": "571176",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-01-14 19:34:31",
      "content": "No, definitely don't substitute it gram for gram with salt... keep the full quantity of salt, and use MSG at about 0.1% of the total recipe weight - so about 1 gram for the whole batch. I'd start at even less than that and then adjust to taste.",
      "parent": "552598",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "680536",
      "author": "Celesta",
      "author_url": "",
      "date": "2014-02-05 15:56:27",
      "content": "Hello and big thanks,\n\nWhile casting around for a tasty veggie broth for wonton soup, I discovered your recipe  and couldn't resist.  It is divine.  You suggest French onion soup and I may, but I'm also thinking pho.  For sure I deserve a delicious reward for not just standing at the counter and drinking it right down.  It is that good.\n\nSo, thank you for your inspirational recipe, and I look forward to perusing your site.  I recognized from the ingredients that it would be very good, and had everything on hand but the marmite, and miso filled in quite nicely.  But, what sold me was your rap on Marcella's minnestrone.  Aha!!!  A man of taste.\n\nCheers, Celesta",
      "parent": "0",
      "gravatar_hash": "9bc131cf33d87d4ca06d26070d55b542"
    },
    {
      "id": "681573",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-02-05 20:49:44",
      "content": "I'm glad you like it! The miso is a solid idea for replacing the marmite.",
      "parent": "680536",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "764380",
      "author": "Evan",
      "author_url": "",
      "date": "2014-02-26 18:05:12",
      "content": "Hey guys, I live in Australia where Kombu is not sold because of import laws, does anyone have a online shop link where I might be able to purchase some and mail to Australia. \nCheers.",
      "parent": "0",
      "gravatar_hash": "92a31c57a04014f7d3284b243a0f1739"
    },
    {
      "id": "1161174",
      "author": "Art K",
      "author_url": "",
      "date": "2014-11-27 15:09:25",
      "content": "Made this stock and then used it to make a gravy for my vegetarian friends this Thanksgiving. Maybe the use in the gravy highlighted this but even though I like the Anise flavor, for what I was doing it was way too dominant. Next time I'll probably leave it out. Still the gravy was appreciated by all and I really liked being able to offer them something traditional for their mashed potatoes.",
      "parent": "0",
      "gravatar_hash": "9cf86d10a4aad0836d9beb5baa726b34"
    },
    {
      "id": "1281973",
      "author": "Nina P",
      "author_url": "",
      "date": "2015-03-22 03:02:49",
      "content": "Evan, you can order some kombu from chefsarmoury.com which is based in Melbourne I think?",
      "parent": "764380",
      "gravatar_hash": "0553bf53806df069020a3e473df8fe2f"
    },
    {
      "id": "1314135",
      "author": "tias",
      "author_url": "",
      "date": "2016-04-04 19:01:29",
      "content": "I don't eat mushrooms.  Would simply leaving out the shiitakes and adjusting the portions work?",
      "parent": "0",
      "gravatar_hash": "2ce53d661288182ea495afd994a06b53"
    },
    {
      "id": "1314136",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2016-04-04 21:55:53",
      "content": "Mmm, i'm not sure. The mushrooms are a substantial part of the flavor in this one. If you try it, let us all know how it turns out.",
      "parent": "1314135",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314191",
      "author": "mg",
      "author_url": "",
      "date": "2016-07-28 05:26:15",
      "content": "Would it be possible to replace the tomato paste by fresh tomatoes? Does the past have richer umami flavor or is it simply more convenient? Thanks.",
      "parent": "0",
      "gravatar_hash": "203a2477a464af2c1c1a9aeae4beb6a6"
    },
    {
      "id": "1314192",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2016-07-28 06:50:51",
      "content": "The umami flavors (glutamates) are more concentrated in the tomato paste.",
      "parent": "1314191",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314245",
      "author": "Lori",
      "author_url": "http://uniqnewyork.com",
      "date": "2016-12-13 13:12:29",
      "content": "Hello. Loved the resulting broth. I don't eat onions so I used shallots instead which do agree with me. What do you think about the chemistry of onions vs shallots working as you describe in this recipe?",
      "parent": "0",
      "gravatar_hash": "3468647471db49d0bf1ef5f716f8020e"
    },
    {
      "id": "1314246",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2016-12-14 07:48:40",
      "content": "It's an interesting question; I don't really know whether you'll get the same reaction and to the same degree.",
      "parent": "1314245",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314258",
      "author": "Lori",
      "author_url": "http://uniqnewyork.com",
      "date": "2017-01-09 08:28:09",
      "content": "I want to buy a pressure cooker. It does not need to be large.. I mostly cook for one or two.. can you recommend one that is less than $100? I'm confused. I see T-fal and Fagor as two preferred brands.. what do you think??\nThanks\nLori",
      "parent": "0",
      "gravatar_hash": "782d6292c8861edde5596801bd4a5076"
    },
    {
      "id": "1314259",
      "author": "Lori",
      "author_url": "http://uniqnewyork.com",
      "date": "2017-01-09 08:29:55",
      "content": "I want to buy a pressure cooker. It does not need to be large.. I mostly cook for one or two.. can you recommend one that is less than $100? I'm confused. I see T-fal and Fagor as two preferred brands.. what do you think??\nThanks\nLori\n\nps that would be stovetop and not electric.",
      "parent": "0",
      "gravatar_hash": "782d6292c8861edde5596801bd4a5076"
    },
    {
      "id": "1314260",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2017-01-09 08:37:23",
      "content": "I'd suggest taking a look at http://www.hippressurecooking.com/, Laura has reviews for every imaginable brand there and she really knows what she's talking about.",
      "parent": "1314259",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314275",
      "author": "caroline phillips",
      "author_url": "",
      "date": "2017-02-17 12:26:43",
      "content": "I am in love with this broth. Holy crap.  I'm on a liquid diet for an illness called gastroparesis, and I've done bone broths and veggie broths and bullion for years, but i've gotten so tired of them, and felt like I'd exhausted my options for switching up the flavors.  I found this, though, and it's so, so delicious!  Instead of marmite, I used a salt-free yeast extract (basically marmite without the sodium - too much salt bothers me) that I'm obsessed with, cut out the salt, and instead added the juice from a can of black olives for a little sodium and even more flavor.  Black olive juice sounds weird, but don't knock it 'til you try it!  I'm almost out of my current batch, and am going out for ingredients tomorrow.  Obviously this wouldn't work for vegetarians/vegans, but do you think bonito flakes would be good in this, too?  Thanks so muh for this recipe - I'm so happy to have found a totally new and delicious broth option.  :)",
      "parent": "0",
      "gravatar_hash": "ededd8f93c6f6042d66ddd331f58b736"
    },
    {
      "id": "1314276",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2017-02-17 14:16:14",
      "content": "Glad to hear it is a new option for you! The black olive juice sounds tasty. As a veg I don't really know about bonito, but having accidentally tasted it enough times I'd probably think you don't want fish flavor in this one - but to each their own!",
      "parent": "1314275",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314314",
      "author": "Anna",
      "author_url": "",
      "date": "2017-05-29 10:53:11",
      "content": "Hi Michael\nFantastic flavour for a vegetable broth, will definitely be making it again, thank you so much for sharing. I made it pretty much as you indicated, including star anise ;)\nI have a question though, when shopping for kombu, the closest thing I found was \"konbu\" - Laminaria angustata - do you know if that's the same seaweed or not?",
      "parent": "0",
      "gravatar_hash": "f27dbb339ca5ed063f130ec831abd7f5"
    },
    {
      "id": "1314315",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2017-05-31 14:22:53",
      "content": "Yes, that's an alternate spelling. Glad you liked the broth!!",
      "parent": "1314314",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314461",
      "author": "Richard",
      "author_url": "",
      "date": "2017-10-13 10:12:21",
      "content": "Broths like this one can be made elegant by clarifying. You link to Dave Arnold's agar method but it isn't as easy as it's described and it really doesn't produce crystal clear results. Almost nothing does. But I have found that using PTFE or polypropylene filters will give results similar to agar if done right. The filters are used for industrial purposes and come right down to 1 micron in filtering diameter. I just heat up..only to warm..what I want clarify and pour it through a stack of a strainer or chinois  with a layer of 1 micron filter below it. The results are a very clear broth and fast. The filters come as \"socks\" or tubes about 10 inches in diameter and 24 to 36 inches long.  I cut them into manageable squares or rounds and 1 sock will yield a lifetimes filters. They can be hand washed or put in the dishwasher. Cheap too.",
      "parent": "0",
      "gravatar_hash": "7d12f639b35738db4c64e5a8a5368790"
    },
    {
      "id": "1314463",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2017-10-16 05:43:49",
      "content": "Cool! Will you post a link to those filters?",
      "parent": "1314461",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}