{
  "comment_count": 77,
  "comments": [
    {
      "id": "2883",
      "author": "Eric LeVine",
      "author_url": "http://www.cellartracker.com/",
      "date": "2009-02-02 21:58:17",
      "content": "Wow Michael, thank you for writing this up. Very intense stuff.",
      "parent": "0",
      "gravatar_hash": "e8876d51fc531c6979a21cba12630549"
    },
    {
      "id": "2884",
      "author": "Angela",
      "author_url": "http://www.alopecianmuse.com",
      "date": "2009-02-02 23:21:19",
      "content": "I loved your article! Awesome...four thumbs up. Two from me and two from my very allergic grand baby Simone.",
      "parent": "0",
      "gravatar_hash": "54e91142ee1219b01ebc40b20d0d28d8"
    },
    {
      "id": "2885",
      "author": "Jana",
      "author_url": "http://www.washingtonfoodallergy.org",
      "date": "2009-02-03 07:46:18",
      "content": "Thank you!!!!!!!\nIf any of your readers are looking for a greater Seattle area support group, please visit www.washingtonfoodallergy.org",
      "parent": "0",
      "gravatar_hash": "452c02516b63c328806af70c37a968c5"
    },
    {
      "id": "2886",
      "author": "Allergy Cases",
      "author_url": "http://allergycases.org/2008/11/food-allergen-avoidance.html",
      "date": "2009-02-03 07:49:44",
      "content": "Thank you for the helpful tips and for sharing your personal experience.\n\nI updated our article on Food Allergen Avoidance with a link to your post:\n<a href=\"http://allergycases.org/2008/11/food-allergen-avoidance.html\" rel=\"nofollow\">http://allergycases.org/2008/11/food-allergen-avoidance.html</a>",
      "parent": "0",
      "gravatar_hash": "891b1280595aacfb9e1ef57778c2a972"
    },
    {
      "id": "2887",
      "author": "Daily Spud",
      "author_url": "http://www.thedailyspud.com",
      "date": "2009-02-03 08:10:50",
      "content": "Excellent article. One of my cousins has a severe nut allery and has come close to dying because of it. It's scary stuff and the more that can be done to promote awareness the better. Well done.",
      "parent": "0",
      "gravatar_hash": "574ac8e528f96dc53d671e1d6f19b0e0"
    },
    {
      "id": "2888",
      "author": "anita",
      "author_url": "",
      "date": "2009-02-03 10:40:12",
      "content": "\"Is this a very serious allergy or an intolerance?\"\n\nI'd be careful with this question. If you communicate anything other than a serious allergy to the kitchen, they may not care.",
      "parent": "0",
      "gravatar_hash": "34900c580f0e6582f548fba23b043606"
    },
    {
      "id": "2889",
      "author": "Elaine",
      "author_url": "http://www.nutfreeliving.blogspot.com",
      "date": "2009-02-03 12:42:53",
      "content": "This is great.  I have a son allergic to peanuts all tree nuts and eggs.  It would be so nice to feel more comfortable eating out.  We do, but like you said, we have that fear with us always.  I have been to a few places recently that really are starting to get it...",
      "parent": "0",
      "gravatar_hash": "b54963f7613a397c00b2cbff7163d446"
    },
    {
      "id": "2890",
      "author": "veronica",
      "author_url": "http://wheredidmysaucego.wordpress.com",
      "date": "2009-02-03 13:04:45",
      "content": "Fantastic article! I don't myself have any serious allergies, but I'm a waitress, haven't work much as one but I always try to ask what they use, for instance, I know a lot of Asian cooking use rice or other gluten free flour in the deep fried mix, and when working in an Indian restaurant they didn't use wheat flour for deep frying or anything else there. Good to know!\n\nI do have IBS/irritable bowel, so certain things make me worse. The doctor even thought it could be celiacs at first, because I got so much better without wheat. So I know how to read labels! And have read a lot about several food allergies. It's just ridiculus to give an answer without thinking, or the waiters don't ask at all. They should be fired! Or forced to drive the person to the hospital, to wait there with them and see the agony. I get enough agony with \"just\" an irritable bowl.  Luckely I know a lot about food and wheat is farly noticable. Only problems are sauces and stuff like that, but that's not enough to make me really ill if I'm having one of those days.. Just avoid bread with the soup, and I'll be fine.\n\nAnd by the way, you talk about peanuts like they are nuts. Peanuts are in fact a legume (look it up in wiki of you want!), so people with peanut allergy, can usually eat nuts. And the other way around. But some, like your wife, can't eat legumes nor nuts. So that causes some problems and confusion. It's a shame to avoid ALL nuts just because you can't eat peanuts. And to then be scared to death when eating out. Remember that!",
      "parent": "0",
      "gravatar_hash": "7a90225d85da424c333ab343a6677df4"
    },
    {
      "id": "2891",
      "author": "Rational Jenn",
      "author_url": "http://rationaljenn.blogspot.com",
      "date": "2009-02-03 13:28:51",
      "content": "Thanks so much....the life saved might also be my son's.\n\nPlease consider submitting this post to the Living with Food Allergies Blog Carnival.  I guarantee it will be passed around!  Here's the link:  <a href=\"http://blogcarnival.com/bc/submit_2597.html\" rel=\"nofollow\">http://blogcarnival.com/bc/submit_2597.html</a>\n\nThanks again!",
      "parent": "0",
      "gravatar_hash": "497d9e31c7a8a166d8ca8380a0ff0b02"
    },
    {
      "id": "2892",
      "author": "Becky",
      "author_url": "http://www.noslivershere.wordpress.com",
      "date": "2009-02-03 19:28:09",
      "content": "Thank you so much for educating your readers.  I have an allergy to walnuts that has gotten worse with age.  I can usually tell within moments if I have eaten a walnut.  I have an epipen but I pray that I will never have to use it.  As a teacher I am trained in how to use one if I need to on my students.  There is nothing scarier than having a reaction.  I know that a lot of people miss eating the food that they are allergic to but I don't miss the reactions one bit!\nThanks again!",
      "parent": "0",
      "gravatar_hash": "fe576ae42b4230b94ebe0468eba2768b"
    },
    {
      "id": "2893",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-02-03 22:49:23",
      "content": "Hey Anita - as you and I discussed via email, I appreciate your comment and\nI definitely take your point. There is no easy answer here. From my\nperspective, I want everyone's health issues to be treated with respect, and\non the other hand I know that it is difficult for most restaurants to\nfunction if every ticket involves special requests, so it is important to\nprioritize those requests that are very serious or life threatening over\nmilder consequences. I think it basically comes down to individual\nconscience and comfort in the discussion you have with your server.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2894",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-02-03 22:55:46",
      "content": "Thanks Becky... and remember, reactions can get worse as you've had more\nexposures. Don't be afraid to use the epipen - I've done it on Sarina and it\nreally isn't that bad. Not nearly as bad as having your throat close down,\nthough at least in our case we still have to go to the hospital and do the\nwhole IV thing as well.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2895",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-02-03 23:08:03",
      "content": "Veronica - I appreciate your perspective as a waitrees, and you are absolutely right that tree nut and peanut allergies are different, althoug there is a significant number of people who have both (including my wife). I've heard a number like 20% overlap, though I don't know the scientific explanation.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2896",
      "author": "CVS",
      "author_url": "",
      "date": "2009-02-04 00:02:24",
      "content": "Servers can cut down on cross contamination by washing hands before handling plates for special request tables.  I have celiac sprue (gluten intolerance). There is one restaurant where I can order takeout but had contamination problems almost every time I dinned in.   My best guess is that since bread baskets were routinely taken to tables by the servers that hands/plates were contaminated  by touch.",
      "parent": "0",
      "gravatar_hash": "7f4a41b1759e97f01462aa23ced61c37"
    },
    {
      "id": "2897",
      "author": "Barbara Stewart",
      "author_url": "http://profile.typepad.com/workingrelationshipscoach",
      "date": "2009-02-04 03:03:28",
      "content": "This is a great article...as always. Sorry to hear of your recent experience.\n\nFor those with such life threatening allergies, a suggestion I have is to carry postcards/3x5 cards with the exact allergens on them to hand to the wait staff to be passed to the kitchen staff with the order for your table. It may also be possible to ask your doctor for a similar size card with the information on it and their signature in order to emphasize the point.\n\nWith the electronic ordering systems in place, this may require a \"special\" trip to the kitchen, but would also aid in making the point and getting the attention needed to the order.\n\nAlthough I know many people who do not want to bring undue attention to themselves and their food allergies, I believe bringing attention to the situation in order to avoid the hasty departure/giving an epi shot etc. is the preferable route.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2898",
      "author": "Wendy",
      "author_url": "",
      "date": "2009-02-04 04:41:08",
      "content": "As someone with many food allergies... I always ask questions before ordering out. It always surprises me how often the restaurant staff ignores what could be a life threatening situation.",
      "parent": "0",
      "gravatar_hash": "740f6c47f7e73d9a743c7e70b5e012b4"
    },
    {
      "id": "2899",
      "author": "Chef Lady",
      "author_url": "",
      "date": "2009-02-04 08:49:27",
      "content": "As a restaurant worker for the past 20 years both FOH and BOH, and someone with a (albeit minor)shellfish allergy, I have to say this is a great article! May I add a couple small points?\n\nWhen working as a chef, I have always, always really appreciated a customer detailing any allergy requirements when they make their reservation, if at all possible. The chef is much better able to make accomodations when they know ahead of time, and the customer can be much more secure in the special preparations of the dish if the cooks aren't in the weeds when they prep for it. Even if a restaurant doesn't make reservations, calling ahead to let the kitchen know you're coming makes a world of difference in their ability to make accomodations. We want to make you happy, and keep you safe! Calling ahead helps us help you.\n\nFor chefs: Set aside your egos and willing to make a dish differently. Sometimes a lot differently! If a customer brings in their own pasta and asks you to cook it due to a wheat allergy, for crying out loud don't cook it the same water! Same goes for their veggies. You have no idea how many times I've seen chefs do things like throw veggies for a fish allergy ticket into a steamer previously used for lobster. Silly as it may seem to the cook, it is not silly for the customer.\n\nThanks for this! I know that all too many of my peers don't take allergies seriously unless they suffer from them also.",
      "parent": "0",
      "gravatar_hash": "9fdcdcf36e140102d83611a3c7e9ded2"
    },
    {
      "id": "2900",
      "author": "LindsayE",
      "author_url": "http://krabstitch.blogspot.com",
      "date": "2009-02-04 14:12:36",
      "content": "This is a great article!  Personally I just don't go out to dinner anymore, it just isn't worth it to me with a corn allergy.  Do you know how many times waiters just treat you like a freak because you ask if something is in the food or ask for them to keep something out?  You know that by the end they're ignoring you and you get sick and have to leave the restaurant without finishing the meal.\nThis article is great.  Hopefully people in the food industry will take it to heart!  Thanks for writing it!",
      "parent": "0",
      "gravatar_hash": "8db8e04505ad654e8c5afb998cb5bc30"
    },
    {
      "id": "2901",
      "author": "JimK",
      "author_url": "http://www.madeofawesome.net",
      "date": "2009-02-04 14:21:37",
      "content": "Great article and I will be passing it around.  On another topic, if only people treated alcohol with the same seriousness as they do wheat and nuts.  The myth that it cooks off still permeates the business and no one takes my wife's deathly serious allergy (actual anaphylaxis reaction to alcohol itself, not anything in beer, whine or spirits) to it seriously.  We've been outright lied to in the past by staff. Always a fun night when that happens.",
      "parent": "0",
      "gravatar_hash": "3b958f096657096d57bb5c11e85c52cf"
    },
    {
      "id": "2902",
      "author": "JimK",
      "author_url": "http://www.madeofawesome.net",
      "date": "2009-02-04 16:10:28",
      "content": "Okay that \"whine\" slip was totally Freudian, I swear. :)",
      "parent": "0",
      "gravatar_hash": "3b958f096657096d57bb5c11e85c52cf"
    },
    {
      "id": "2903",
      "author": "Mark",
      "author_url": "http://profile.typepad.com/markthink",
      "date": "2009-02-05 17:08:14",
      "content": "Thanks for the thoughtful post.\n\nI've had some scary moments with food allergies at restaurants with my family. Asking the right questions is the responsibility of the guest, but knowing the right answer and being aware of the issues is the responsibility of the restaurant.\n\nI've noticed big improvements over the last few years as awareness of the issue has improved.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2904",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-02-05 22:28:28",
      "content": "Thanks Barbara - you are absolutely right - much better to bring a little extra attention to yourself than to get poisoned! There is a little company that will make cards like this for you in any language as well, if anyone is interested I can try to track down the link.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2905",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-02-05 22:28:59",
      "content": "That made me laugh!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2906",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-02-05 22:30:15",
      "content": "<i>Asking the right questions is the responsibility of the guest, but knowing the right answer and being aware of the issues is the responsibility of the restaurant.</i><br><br>Well said!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2907",
      "author": "Maggie",
      "author_url": "http://doghillkitchen.blogspot.com",
      "date": "2009-02-08 11:38:46",
      "content": "Great post!  I think the awareness about food allergies is increasing and things are definitely improving.",
      "parent": "0",
      "gravatar_hash": "0e135e68740f32d56b94538034bcd94d"
    },
    {
      "id": "2908",
      "author": "nut-freemom",
      "author_url": "http://nut-freemom.blogspot.com",
      "date": "2009-02-08 15:08:22",
      "content": "I love this post--my daughter has severe tree nut and peanut allergies like your wife does and I frequently worry in restaurants--though we still go to them.\n\nI like the chef's suggestion that you mention the allergies when you make the reservation. Great idea! Also, I would suggest letting a manager know about it once you get there and also make sure either you or the manager talk to the chef.\n\nIt may seem like a lot, but once you've done it a few times, it seems routine. And it's a lot better than staying home all of the time or winding up in the ER if you can avoid it!",
      "parent": "0",
      "gravatar_hash": "7dc338c45641efd46df95da09c495e33"
    },
    {
      "id": "2909",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-02-09 06:38:49",
      "content": "I completely agree. Don't be shy about communicating with the staff. Most\nrestaurants will be happy to talk with you, and if they aren't, do you\nreally want to be there?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2910",
      "author": "Lisa",
      "author_url": "",
      "date": "2009-02-09 14:51:35",
      "content": "This is a great article, many thanks for making such clear and careful points.  While your article focuses mainly on nut allergies, the guidelines for restaurants need to be kept in mind for other food allergies such as shellfish (my mother's allergy), and fruits.  Having a severe allergy to cherries, it never fails to amaze me how prevalent these damned fruits can be.  And since this is a really odd allergy, more often than not I'm given a weird look when I ask whether a particular dish contains cherries.",
      "parent": "0",
      "gravatar_hash": "8cc59e2200fbcc411c6b8af418e9fe23"
    },
    {
      "id": "2911",
      "author": "Janna W",
      "author_url": "http://www.secretsalts.com",
      "date": "2009-02-10 12:39:14",
      "content": "Very informative article.  As someone who works in the food service industry, I always make it a point to address a guest's allergies, if any.\n\nI also always ask market-goers at the Ballard farmers market, where I serve samples.  Though our Almond Cardamom salt says it on the label, I am always surprised when someone dives right in, and then says something along the line of \"oh, I didn't know this had nuts in it.\"  Customers too, have a  responsibility to inform others of their allergies.\n\nLike you already stated, communication is key.",
      "parent": "0",
      "gravatar_hash": "d84e1cff1539eeaeb5c8b2df82639148"
    },
    {
      "id": "2912",
      "author": "Ruth Smith",
      "author_url": "http://www.bestallergysites.com/",
      "date": "2009-02-12 16:29:23",
      "content": "Michael-so glad your wife is still with us. Sounds like she's had some scary times. I want to thank you for your thoughtful and thorough article. As a mother of a child with multiple life threatening food allergies, I know how every challenging it can be. And it's always work to get the non food allergic to see. I hope your article is helpful to the food allergic and non food allergic alike. And thanks for stopping by at Green Peony.",
      "parent": "0",
      "gravatar_hash": "f29af7d4404a4986a1bcf47ff5be59db"
    },
    {
      "id": "2913",
      "author": "barb",
      "author_url": "http://barbfeick.com/vaccinations/",
      "date": "2009-02-21 09:45:12",
      "content": "Another place of hidden peanuts is vaccines. They use peanut meal in culture medium and peanut oil in vaccine adjuvants. This is a trade secret and there is no way you can find out which vaccines may be contaminated with peanut protein. This also is the main cause of peanut allergy and why there is an epidemic of peanut allergy among young children who are being heavily vaccinated these days.",
      "parent": "0",
      "gravatar_hash": "f82f18b37b1c0367238330276f43c9e8"
    },
    {
      "id": "2914",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-02-21 20:34:28",
      "content": "Interesting, I haven't heard that before. Can you point me at a reference so\nI can learn more about it?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2915",
      "author": "bill",
      "author_url": "",
      "date": "2009-03-08 19:57:36",
      "content": "Pepole who have food allergies shouldn't eat out.",
      "parent": "0",
      "gravatar_hash": "09ade4c138e49dfdb8d6411ddea15d24"
    },
    {
      "id": "2916",
      "author": "George",
      "author_url": "",
      "date": "2009-04-08 20:57:18",
      "content": "I've had very similar experiences, and found the recommended advice to restaurant workers very useful. At the moment I'm 24 hours into a pine nut allergy attack from being poisoned at a Spanish restaurant in Oakland where we discussed the menu and my allergy in detail with the waiter. My wife saw the pine nuts in a meatball dish after I'd taken a bite. We rushed to the hospital and were in the ER before the symptoms were serious. The symptoms struck twice with increasing severity two, and then three hours later, inside the ER. They had refrained from giving me epinephrine at first, because of a fear of endangering my heart. The result: the allergy progressed to a crisis phase with only the benadryl and prednisone treatment. After the second alarming rush of heat, perspiration, and inability to breathe, they did give me the epi, and things subsided. All told I was in the ER for ten hours before being released. Now 24 hours after first contact with the pine nuts, I'm still taking benadyl and still flushed.\n\nAlso, I'm pretty furious at the waiter, who could have included the dish that got me when he listed the dishes containing pine nuts, but did not.\n\nI'm beginning to understand the wisdom of what Bill wrote above. Eating out is risky business.\n\nGeorge, 61 in Oakland",
      "parent": "0",
      "gravatar_hash": "b86c4a74f8a4eb1478d2497c675e0f58"
    },
    {
      "id": "2917",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-04-10 22:19:17",
      "content": "George - Thanks for sharing your story. That must have been a horrible\nexperience. I can't even imagine how much it must have sucked to keep all\nthat poison in you without the epinephrine. Glad to hear you came through it\nok.\n\nMichael\n\n\nHi Michael Natkin,",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2918",
      "author": "Geralyn",
      "author_url": "",
      "date": "2009-04-30 14:37:32",
      "content": "My advice as someone who has waited tables for 10+ years?  Don't trust the waitstaff.  If you have an extremely serious allergy, go straight to the top and make sure that the manager and chef on duty know of your situation.\n\nAn Asian diner I worked at had a string of people that would come in with claims of cilantro, onion, mushroom, and garlic allergies.  Is it possible all these people had these allergies?  Sure.  Is it possible that some of these people had an aversion to these foods and claimed they were allergic for extra security to try and keep them out of their dinner?  You betcha.  Annoying.  Translation:  servers hear countless dramatic tales of food woe every day.  They aren't paid to take each one of these as their personal cause.  Managers are!\n\nI saw countless waiters/aspiring actors/college coed fellow employees of mine edit tickets with NO CILANTRO or NO PEANUT at which point the kitchen staff/recent immigrants/college coed back of the house would prepare the dish as per usual and then leave of the cilantro or peanut or whatever that was PART OF THE GARNISH.  Never mind the cilantro and peanuts that were cooked into the soup, spring roll, etc.\n\nPersonally, I would never deliver a plate to a guest with the claim that it was 'allergen free' despite what I may have been told about it.  If I didn't make it, I'm not going to make any promises about it.  Do you wanna know how many times I've delivered a steak that I was told was 'well done' that was sent back bloody?  Same principle.\n\nIn my current position I hear my fellow employees incorrectly describe menu ingredients to their guests EVERY DAY.  I'm sure I've unintentionally done it myself on occasion, and I consider myself to be very food savvy.  BE WARY!",
      "parent": "0",
      "gravatar_hash": "a8b3a46396574f224b39e0d351c56f10"
    },
    {
      "id": "2919",
      "author": "Natalie",
      "author_url": "",
      "date": "2009-05-17 22:00:39",
      "content": "This is an awesome article! I have a 3 year old son w/ severe food allergies to tree nuts, dairy, soy, eggs, and oats.  I have learned to always speak to the manager. I used to feel like that pesky person asking to talk to the manager, but I know it is a matter of life and death for my son and so I don't care.  I carry a card w/ his allergies written out and ask the manager to talk to the chef to see what they recommend. In some of the restaurants (such as Disneyland) the chef will come out and talk to us and give my son options. Then after deciding we talk about cross contamination.  Thank God I have had good experiences. And attentive people.  I live near Six Flags Magic Mountain and my son loves to eat their French Fries, there is only one restaurant there that has a dedicated fryer for them and the manager there knows us and always makes a fresh batch of fries for him.\n\nI am going to print this article and distribute it to the managers of the restaurants that I freqently go to! Thanks for writing it!",
      "parent": "0",
      "gravatar_hash": "fd4f7bb0db6ab413e2d251632b3488d0"
    },
    {
      "id": "2920",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-05-17 22:34:57",
      "content": "Wow Natalie - good for you for taking such good care of your son! I\nknow it isn't always easy to put yourself out there, but as you say,\nwhen your child's life is at stake, who cares if someone misjudges you\nfor pesky? I really appreciate your willingness to pass this article\non to restaurants that you frequent, and I hope it helps them to\nunderstand your situation better and keep their staff up to speed.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2921",
      "author": "Karen",
      "author_url": "",
      "date": "2009-05-20 10:25:10",
      "content": "My sister has some pretty severe food allergies so we printed up business cards that list not only the allergy (wheat for example) but all the ingredients that are made of wheat (monosodium glutamate, graham, durum, etc). That way they wait staff doesn't have to try and memorize a list of ingredients and doesn't miscommunicate to the chef. We did this after she told a waiter she was allergic to wheat and he told the kitchen she was allergic to the noodles and she ended up getting really sick from some chicken that was marinated with a wheat product. The cards are small and easy to carry, it clearly communicates the allergies to the kitchen. It is worded in a way that conveys the seriousness of her allergy and also thanks them for accomodating her. We recently started printing the same thing in Spanish on the opposite side since there is a lot of kitchen staff who don't speak English fluently.",
      "parent": "0",
      "gravatar_hash": "b6349063885c9e451ee053c1c5d06ffc"
    },
    {
      "id": "2922",
      "author": "Anne",
      "author_url": "",
      "date": "2009-06-01 13:14:58",
      "content": "My best friend has celiac disease.  While it's not immediately life-threatening, ingestion of any gluten causes her to go into a rheumatoid arthritis flare.  For that reason, she only eats at restaurants which specify they have a gluten-free menu.  If more restaurants catered to allergic customers, they'd probably get more business.",
      "parent": "0",
      "gravatar_hash": "e0bd43b54dc322459f0653036b8cd998"
    },
    {
      "id": "2923",
      "author": "melinda",
      "author_url": "",
      "date": "2009-07-01 14:59:51",
      "content": "Excellent article. My daughter has a severe wheat allergy and an egg allergy, and we hold our breath when she starts to eat at a restaurant. We never 100% trust what is being served, even if we have taken precautions and questioned the heck out of the staff. I always wonder if my husband and I are just really paranoid people, but seeing your article and the many comments from others who feel the same way, I am so comforted. With all the people with food allergies these days, surely restaurant staff will start to become more attuned to meet our needs. Keep up the great work!",
      "parent": "0",
      "gravatar_hash": "bacf5900c3ea9705b18e61ba90b84b5e"
    },
    {
      "id": "2924",
      "author": "Virginia",
      "author_url": "",
      "date": "2010-01-12 13:26:43",
      "content": "Wow, I am really in awe of how brave people are in eating out, particularly allowing their kids to eat out, when they have severe allergies. It is a normal part of life, and it would be a pity to miss out. Kudos for all the brave souls!\n\nI just want to throw out one problem that I have run into as a chef. Every restaurant gets at least some product whose processing they can't vouch for. When I do my absolute best to make sure that allergens are not served to allergy sufferers, that means I won't be able to use some ingredients. Is the flour we use for the pasta processed in a plant that also does nuts? It isn't labeled as such, but who really knows? Did a farm worker or delivery guy eat a peanut butter sandwich before he loaded up our order? I get very nervous serving ANYTHING, especially to nut allergen folks, because I can't guarantee the chain of processioning and distribution.\n\nHappily in 13 years, I have never had a problem.",
      "parent": "0",
      "gravatar_hash": "8b78e4f9b7025082e5590b4183d63957"
    },
    {
      "id": "2925",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-15 22:28:32",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\n@Virginia - You raise very goods points. I think every eater with severe allergies has to decide for themselves whether they can eat food with the &quot;processed in a facility that also...&quot; type labels. I think the fact that you do your best with the materials you work with in-house is the most important thing, and very commendable.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2926",
      "author": "Kirsten",
      "author_url": "",
      "date": "2010-01-20 21:25:01",
      "content": "Thanks very much for your article. Several people in my family have wheat allergy -- such that they have debilitating \"food poisoning\" for weeks after eating it because the immune system overreacts. The worst was a fancy restaurant that swore up and down that the chocolate mousse had no wheat at all. The next day, my mom, extremely ill, called the restaurant back and finally tracked down the head chef who admitted the mousse did have flour. Despite the best intentions of waitresses, I think it's easy sometimes for them (or the chef) to not think of something as being \"wheat\".\n\nWhat are the best experiences for us? There are so many \"hidden\" sources of wheat that be difficult for someone else to do an exhaustive search for them (ex. soy sauce, food starch and bran are all usually wheat-based). It's hard to expect someone else to know how to search food sources if they haven't dealt with a food allergy. They'll say the sauce is fine, even if they haven't looked -- because why would there be wheat in barbeque sauce or soy sauce or salad dressing? (Unfortunately, it's in a large number of processed foods) If a restaurant has the sauce bottles for the dishes we're considering or a book that lists ingredients for the dishes, we can scan it in a matter of seconds and say, \"Perfect!\" or \"These aren't safe for us. Can you just make a salad with balsamic vinegar instead, no croutons?\" I think it's a lot less running for the waittress if there's an updated binder of ingredients for each of the dishes they serve... and also a lot less scary for people who are allergic.",
      "parent": "0",
      "gravatar_hash": "c18d1af9efe9bc728868b808d74d3ffa"
    },
    {
      "id": "2927",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-22 20:09:04",
      "content": "@Kirsten - Thank you for your note. I understand all too well what you guys go through. I think celiac must be even harder than nut allergies in terms of finding hidden ingredients. I&#39;m glad there are most restaurants that are specifically offering gluten-free options.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2928",
      "author": "Nath",
      "author_url": "",
      "date": "2010-01-27 13:10:13",
      "content": "Great article! I can relate and I share the same stress every time we go out to eat; my boyfriend is anaphylactic to every kind of tree nuts. I’m always more stressed about it than he is; he is used to the whole ER process by now! I do miss my cashews and nutella but my boyfriend’s life is worth so much more.\nWay too often people are unaware how serious this is and or just don’t care; they don’t want to put the extra effort into assuring the meal is nut-free or even verify if a dish has nuts in it or not. We never really had any problems with the kitchen itself or cross-contamination but rather bad waiters. A few times the waiters didn’t even want to go check with the cook about the frying oil or the salad garnishes and bluntly told us to choose something else that isn’t fried or a salad. I met a waiter who argued with us that pecans are not real nuts and therefore we can eat the dessert that had them. On another occasion we had to rush to the ER because a waiter assured us the dish was nut free but it contained hidden pine nuts in a pesto-type sauce. In his mind pine nuts were not really nuts like peanuts since it came from a pine tree, so he didn’t mention them even after we insisted on being allergic to all and every nuts.\nWe had some wonderful waiters too over the years but the bad ones leave a more durable impression. And yes, the tips are much bigger if they make even the smallest efforts. When we notice a waiter makes real efforts we usually take his/her name and ask for that waiter the next time; so the tips keep coming too!",
      "parent": "0",
      "gravatar_hash": "22816768a31e82c13cc5447946ce80a3"
    },
    {
      "id": "2929",
      "author": "melinda",
      "author_url": "",
      "date": "2010-01-27 17:48:33",
      "content": "i have a friend with severe food allergies to a number of different things. she has these special cards made up with her picture, the foods she is allergic to, and a note explaining exactly how serious her allergies are. She makes up these cards in, like, 15 different languages and hands them to the waiter at restaurants to give to the chef.",
      "parent": "0",
      "gravatar_hash": "2e295d2703646e8b1c52c5e6aa5a54c7"
    },
    {
      "id": "2930",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-27 22:04:36",
      "content": "Thanks for relating your stories... pesto *absolutely* is one of the most common danger items. We've had one ER visit and numerous close calls due to\nit.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2931",
      "author": "Chris",
      "author_url": "http://www.roadwarriorchick.blogspot.com",
      "date": "2010-02-02 16:07:22",
      "content": "<a href=\"http://the-health-gazette.com/830/peanut-allergy-vaccinations-link-consumer-concerns/\" rel=\"nofollow\">http://the-health-gazette.com/830/peanut-allergy-vaccinations-link-consumer-concerns/</a>\n\nIn an earlier post someone mentions ingredients such as peanut oil in vaccines. It is an interesting concept as I wonder why it seems there is almost an epidemic of people now with allergies that are life threatening. The above link has some information for anyone who might want to explore it further. I used two words in my search - peanuts vaccines",
      "parent": "0",
      "gravatar_hash": "db1e62860feae691697300db9520c95c"
    },
    {
      "id": "2932",
      "author": "Nath",
      "author_url": "",
      "date": "2010-02-08 15:54:45",
      "content": "Here's a link I found that is useful if you travel and don't know the local language very well. You select your allergies in the list and the language you want, then it translates them all for you in a card you can handout when needed.\n\n<a href=\"http://www.allerglobal.com/index.php?sl=en\" rel=\"nofollow\">http://www.allerglobal.com/index.php?sl=en</a>",
      "parent": "0",
      "gravatar_hash": "22816768a31e82c13cc5447946ce80a3"
    },
    {
      "id": "2933",
      "author": "Gabrielle",
      "author_url": "http://peanutfree.blogspot.com",
      "date": "2010-02-25 11:46:58",
      "content": "Great post!  As a mom of a peanut allergic child - thank you!!!",
      "parent": "0",
      "gravatar_hash": "e2b3d9ebd6bf8807f741450feb57b8a2"
    },
    {
      "id": "2934",
      "author": "Jbal",
      "author_url": "http://toastandcereal.com",
      "date": "2010-05-14 12:12:53",
      "content": "Thanks for this informative post. I hope restaurant staff everywhere read and take it to heart.\n\nOne suggestion: include sesame in your future posts on the subject. We found out the hard way that our daughter was severely allergic to all forms of sesame after feeding her tahini at 9 months. The ER staff told us that sesame allergy is on the rise in the U.S. and that it won't be long before it's in the top 10.\n\nNow that she is a toddler who eats and enjoys most everything we give her (though of course we haven't tried peanuts, nuts, or any other seeds), we're beginning to navigate the restaurant scene and finding that wait staff sometimes have no idea that sesame is used in oil form and paste form (tahini) as well as in seed form. People aren't nearly as aware or as careful with sesame as they are with nuts or peanuts, which scares the crap out of me. We made the mistake of eating at a Korean place a couple weeks ago (one of my absolute favorite foods), and after extensive discussions with the owner and the chef, ordered a sushi roll for our daughter. After she was halfway done with it, I noticed sesame seeds embedded in the rice on one of the remaining pieces. I've never felt fear like that in my gut. I guess we won't be eating at Korean restaurants ever again!\n\nThere's still hope she'll grow out of it, though a recent skin test came back very, very positive for the allergy still. In the meantime, we will definitely take your and your readers' advice to be unapologetic in our questioning.",
      "parent": "0",
      "gravatar_hash": "addaf8ec62d68d0e0de63f8f57c4316f"
    },
    {
      "id": "2935",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-05-14 14:12:25",
      "content": "@Jessica - thanks for sharing your story. I wasn&#39;t aware at all about a rise in sesame allergy or even that it was a major allergen, so I appreciate you passing that information on. I sympathize with the difficulty in eating out with your daughter, that can be a huge challenge.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2936",
      "author": "Mia Valcarcel",
      "author_url": "http://knitplaywithfire.wordpress.com",
      "date": "2010-05-17 17:45:21",
      "content": "As some one with a severe allergy to strawberries, you would be surprised to hear how many people look at me like I am nuts when I try to explain that I am really allergic to strawberries. Most people can understand nut allergies but not that you can be allergic to a very common berry. And what is funny is that after you explain that even a tiny bit of it could possible kill me, they go 'oh so-and-so is allergic to strawberries too but they eat them anyway.' For me the issue is when desserts are ordered because strawberries are often used as a garnish.\n\nThere is one chain that my whole family can go out to eat and I can safely eat the dessert. The kitchen staff there is always happy to either leave off the sauce or use something else to garnish the plates with. And one new chain restaurant in town was super accommodating. The waitress made a special note on the order and went into the kitchen to make sure that the kitchen knew that it required special attention.\n\nI think the message is getting through in many places. But I am still very careful. I have a few favorite places where I can safely go out to eat and not have to worry about it.",
      "parent": "0",
      "gravatar_hash": "42b3f2340ad13b335a8d41a1cd63ceb8"
    },
    {
      "id": "2937",
      "author": "Veggie",
      "author_url": "http://www.veggiesvillage.com",
      "date": "2010-06-01 13:37:08",
      "content": "Hi Michael,\n\nGreat article! I have a family member with a severe nut allergy too. While we have learned to work around his allergy and live a normal life, traveling continues to be a nightmare. We travel a lot to visit family and the feeling of helplessness when you are trapped on a plane over a vast ocean is overwhelming. Regarding restaurants, Ming Tsai has done some great work educating restaurant staff in Massachusetts.",
      "parent": "0",
      "gravatar_hash": "00992fa751e85356d1fbea2deecccf69"
    },
    {
      "id": "2938",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-01 13:40:35",
      "content": "Yes indeed, Ming Tsai is a hero to anyone with a food allergy, whether they know it or not!\n\n\n\n\n\n\n\n\n\n\n\n\n\n<img height=\"53\" src=\"cid:1275424630.C88B1525.2530@oak-tp-worker006\" width=\"640\" />\n\n\n\n\n\n<img height=\"1\" src=\"cid:1275424630.03E6523.2530@oak-tp-worker006\" width=\"1\" />\n<img height=\"1\" src=\"cid:1275424630.03E6523.2530@oak-tp-worker006\" width=\"1\" />\n<img height=\"1\" src=\"cid:1275424630.03E6523.2530@oak-tp-worker006\" width=\"18\" />\n\n\n\n\n<img height=\"10\" src=\"cid:1275424630.03E6523.2530@oak-tp-worker006\" width=\"600\" />\n\n\nHi Michael Natkin,\nVeggie (info@veggiesvillage.com) has left you a comment:\n\n\nHi Michael,\n\nGreat article! I have a family member with a severe nut allergy too. While we have learned to work around his allergy and live a normal life, traveling continues to be a nightmare. We travel a lot to visit family and the feeling of helplessness when you are trapped on a plane over a vast ocean is overwhelming. Regarding restaurants, Ming Tsai has done some great work educating restaurant staff in Massachusetts.\n\n\n\n\n<img height=\"7\" src=\"cid:1275424630.03E6523.2530@oak-tp-worker006\" width=\"600\" />\n\n\n\n\n<img height=\"1\" src=\"cid:1275424630.03E6523.2530@oak-tp-worker006\" width=\"18\" />\n<img height=\"1\" src=\"cid:1275424630.03E6523.2530@oak-tp-worker006\" width=\"1\" />\n<img height=\"1\" src=\"cid:1275424630.03E6523.2530@oak-tp-worker006\" width=\"1\" />\n\n\n\n\n<img height=\"5\" src=\"cid:1275424630.7DeDC10e524.2530@oak-tp-worker006\" width=\"640\" />\n\n\n<img height=\"27\" src=\"cid:1275424630.8e65e522.2530@oak-tp-worker006\" width=\"48\" />\n\n\nSix Apart, creators of Movable Type, Vox and TypePad.\n\n\n548 4th Street, San Francisco, CA 94107\n\n\nManage Notifications |\nSupport |\nTerms of Service |\nPrivacy Policy",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2939",
      "author": "kc",
      "author_url": "http://www.livingitupcornfree.com",
      "date": "2010-06-12 23:30:15",
      "content": "I have a non-life threatening allergy to corn and I can't imagine eating out. I don't even buy processed foods because of the hidden allergens and cross-contamination issues. Trying to avoid a miserable reaction (ingesting corn does not result in anaphylaxis but it does make me extremely miserable for days) requires diligence and control of my surroundings. I can't imagine how anyone with a life-threatening food allergy could work up the nerve to eat out. There are so many possibilities for cross-contamination and the allergic have zero control in a restaurant situation, it seems a little too much like playing Russian roulette to me. I would like to be able to go to restaurants or buy something quick and easy for dinner occasionally, but I don't think I could ever want it enough to risk my life for it.",
      "parent": "0",
      "gravatar_hash": "9ed3495d1d14de8b7598ea1a84181b12"
    },
    {
      "id": "2940",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-06-15 10:19:41",
      "content": "I can only imagine how hard a corn allergy must be. The Omnivore&#39;s Dilemma really opened my eyes to how corn is in everything.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2941",
      "author": "Elise",
      "author_url": "",
      "date": "2010-07-25 08:53:17",
      "content": "My 7 year old son has life-threatening peanut and tree nut allergy along with asthma and our family eats out often with him. We pick high end restaurants where the chef uses fresh ingredients and it's easier for the chef to prepare a safe meal for my son. We also never order desserts at any restaurants. We will also stay away from the salads too if we see they have a salad on the menu that contains nuts. We would never eat at an Asian restaurant because the risk of cross-contamination is too high. We have a restaurant card that we always give the chef and we when we make a reservation we always let them know about his allergy.\nMy son always orders meals off the adult menu too because he loves fine foods! The chef's generally enjoy cooking for him because he loves their food! We always tip a minimum of 20% and  are repeat customers to great restaurants.",
      "parent": "0",
      "gravatar_hash": "b80fb3c1d4eba7cb014a670fc0b6f601"
    },
    {
      "id": "2942",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-07-27 09:14:52",
      "content": "Thanks for the note, Elise! Sounds like you have developed a very sensible approach to eating out with your son that still let&#39;s you enjoy good restaurants.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2943",
      "author": "AiXeLsyD13",
      "author_url": "http://aixelsyd13.wordpress.com",
      "date": "2010-08-07 12:16:56",
      "content": "Wow, this is more thorough than I could have ever hoped to convey the message.  It's well-written, and ought to be required reading for anyone who works in a restaurant, cafe, deli, road-side-stand, or even a snack bar.\n\nAbout the tip thing... I tell you, it's true.  Ha ha ha.  I spend a ridiculous amount of time trying to find \"safe\" restaurants and form that safe menu items.  I barely make enough to pay my bills... but when I go out to eat, have a good time, and don't die... I tip like a madman.  Especially if I have to ask the server about any allergens and then talk to a manager or cook from there.  It's a certain level of embarrassing/awkward to bring up... even if it shouldn't be.  Anything that you do as a server to make it less awkward is REALLY appreciated, and I try to convey that in the gratuity.",
      "parent": "0",
      "gravatar_hash": "be4b918fd3911ae51389989f347b8fe4"
    },
    {
      "id": "2944",
      "author": "AiXeLsyD13",
      "author_url": "http://aixelsyd13.wordpress.com",
      "date": "2010-08-07 12:22:01",
      "content": "Re:\"...'oh so-and-so is allergic to strawberries too but they eat them anyway.'\"\n\nI <i><b>HATE</b></i> that!  Ha ha ha.  It's so frustrating because of the so many levels of \"allergic\" and the \"intolerant\" people usurping \"allergic\" as a synonym... it waters down the seriousness.  I often use the phrase \"deathly allergic\" but get looked at like I'm being over-dramatic.",
      "parent": "0",
      "gravatar_hash": "be4b918fd3911ae51389989f347b8fe4"
    },
    {
      "id": "2945",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-08-07 13:24:52",
      "content": "Yes. When we are explaining my wife's nut allergies to a server we'll say \"very serious nut allergy, like epipen, straight to the emergency room\". Which is completely true, and gets their attention. The hardest cases are where there is a language barrier.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2946",
      "author": "Siobhan",
      "author_url": "http://www.rabbitsfootmeadery.com",
      "date": "2011-02-15 13:19:06",
      "content": "I'm really glad to see someone write about this. I think that too frequently people overlook food allergies. My little brother, like your wife, is deathly allergic to all tree nuts, shellfish, cats, dogs etc. We have to be super careful eating out and too many times there has been an unknowledgeable wait staff and I'm usually the one to notice something is a little off about his food.. (He's 10 years younger than me, and for whatever reason I've become the ultra paranoid big sister!)",
      "parent": "0",
      "gravatar_hash": "101e599417ec64c32dffa73c2186d49f"
    },
    {
      "id": "2947",
      "author": "Jared",
      "author_url": "",
      "date": "2011-09-22 20:25:09",
      "content": "Getting emotional reading this.  My wife had very severea allergies to peanuts and tree nuts (almonds are her worst).  We live in a foreign country and it's frustrating because the locals just don't understand allergies.",
      "parent": "0",
      "gravatar_hash": "fd28e54d94fa724b0e2a22c479ad7614"
    },
    {
      "id": "2948",
      "author": "Jared",
      "author_url": "",
      "date": "2011-09-22 20:26:00",
      "content": "oops, sorry, I meant to write \"has\" severe allergies.",
      "parent": "0",
      "gravatar_hash": "fd28e54d94fa724b0e2a22c479ad7614"
    },
    {
      "id": "2949",
      "author": "falconoverlord@hotmail.com",
      "author_url": "",
      "date": "2011-10-08 13:07:03",
      "content": "I really appreciated the article. I see this from the viewpoint of the kitchen and I know how difficult/impossible it can be to guarantee a safe dish.\nFor that reason, at least in the middle-class establishment I work for, I think we should absolutely refuse to serve patrons with severe food allergies. To do otherwise is simply irresponsible.\nFor those fine establishments that can strive to provide an allergen-free dish, the suggestions of this article are excellent.",
      "parent": "0",
      "gravatar_hash": "45b74ce34257518b3d3dfc03475319ee"
    },
    {
      "id": "17168",
      "author": "Stephanie",
      "author_url": "",
      "date": "2012-01-16 13:17:08",
      "content": "I was glad to read this article but did find it a little frustrating as someone with a severe allergy, who has worked in food service for many years. As a waiter I am never willing to tell a customer that I am 100% sure their food does not contain an allergen. As a customer I realize I am risking my health every time I eat in a restaurant that serves the food I am allergic to (mussels). Heck, I risked my health every day I went to work at a restaurant that serves them.\n\nI have had customers who claimed to have an \"allergy,\" but when they learned that meant that we would not only leave off the offending item but also be unable to serve them the sauce they wanted, the allergy mysteriously dissappeared. I have also had customers who, when they learned I could not 100% guarantee that their food was safe, refused to accept that answer and also refused to leave. I am going to do everything in my power to make sure your food is safe - but as an above poster said, I didn't harvest the food myself so I dont really know for sure. Take the risk or eat at home! At least I'm not lying to you.",
      "parent": "0",
      "gravatar_hash": "f7ee8b0e8033406fc4fdf58093b7599b"
    },
    {
      "id": "17170",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-16 13:28:09",
      "content": "I agree with you completely. No restaurant can ever make a 100% guarantee that any given allergen isn't present; even if they don't buy any product with a given allergen, cross contamination is always a possibility however remote. So you are quite right to tell a customer \"the kitchen is aware of your allergy, and we use good food handling practices, but of course we can't absolutely guarantee it.\"",
      "parent": "17168",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22082",
      "author": "Kathryn",
      "author_url": "http://chachasgfkitchen.blogspot.com",
      "date": "2012-03-27 05:56:31",
      "content": "We have nut allergic nieces on both sides of our family and know how important your comments are. \n\nWhile I get very sick for a few days if I'm \"glutened\" because of kitchen mistakes; it's nothing compared to deadly food allergies.\n\n I wish this could be forwarded to every restaurant and read by every old new employee.",
      "parent": "0",
      "gravatar_hash": "33395e12b44ec9a40bb32295bd0a1039"
    },
    {
      "id": "43263",
      "author": "Min Min",
      "author_url": "http://hiihavehives.blogspot.com",
      "date": "2012-08-02 04:44:57",
      "content": "Thanks for the information here.\n\nI had anaphylaxis last November, due to ant bite. About a month after that I started to have hives every evening. Then I discovered I am allergic to meat, especially chicken and beef. Even a sunny-side-up fried with oil that was previously used to fry chicken also triggered hives in me.\n\nI am very careful with what I eat nowadays. Whenver possible I would go to vegetarian restaurant. If I am at a non vegetarian I would inquire carefully. If I have doubt, I'd rather go hungry than to have hives outbreak.",
      "parent": "0",
      "gravatar_hash": "306e9efae17a14f36b4c67d8b0d4ab94"
    },
    {
      "id": "82206",
      "author": "Saul clamen",
      "author_url": "",
      "date": "2012-11-18 11:45:16",
      "content": "I would like to commend you on the services you do for your community .You are more than just a chef you are a mensch",
      "parent": "0",
      "gravatar_hash": "4dc40bd113bd4158aa567d218b15dd49"
    },
    {
      "id": "102306",
      "author": "Mary Beth Flynn",
      "author_url": "",
      "date": "2012-12-25 03:04:53",
      "content": "Last night, Christmas Eve, i attended a party at my aster,s with my two kids,,,Kathryn being the one who has a severe nut allergy. first o noticed two salads with nuts and then on the dessert table , as i was passing by, i heard the word, peanut butter cookies\" and i froze. I approached my sister who said...\" I am not having two separate tables at Katie is 13 and should know better.\nBut someone could have told me, quietly , as her mom, these are the dishes to avoid, let me show upi, instead she said if you do not like  the set up,,,then do not eat at my table .,w\nYour daughter, who is in 8th grade, can handle it and figure it. My very own sister.....hlp",
      "parent": "0",
      "gravatar_hash": "f443509dec5624efc0069ad6198f476a"
    },
    {
      "id": "127522",
      "author": "Mary",
      "author_url": "",
      "date": "2013-03-17 09:57:02",
      "content": "Another allergy less known, but just as deadly, is a tick-borne allergy to anything mammal.  This allergy is caused by the the bite of a seed or deer tick.  Several years ago, I woke up during the night scratching all over from the bites of almost microscopic seed ticks.  In appearance, they resemble chiggers, but they are black instead of red.  Over the course of several months, the titer levels in my body increased resulting in an anaphylactic response about three hours after eating catered food at a banquet.  It took quite a few months of tracking everything I ate and several anaphylactic episodes with accompanying trips to the emergency room to narrow down the culprit as anything with four legs and fur.  I traveled to the University of VA for further testing and to participate in a mammalian allergy study where my suspicions as to the cause of the reaction were confirmed.  Basically what happens is that if I ingest meat, it takes about three hours to go through the digestive process.  After this amount of time, all that is left is a sugar chain called alpha-gal.  Alpha-gal so closely resembles the tick venom in chemical make-up that my body goes into anaphylactic shock.  Eating at restaurants can be very tricky, especially since so many people are unfamiliar with this allergy.  Interestingly, I can eat milk products, but cheese is an issue if it is made with animal rennet.  So just because a restaurant may say a dish is vegetarian, the cheese can still be a culprit.  Sometimes, my biggest challenge has been convincing restaurants to prepare my fish on a separate griddle from other meats.  At home we primarily eat a vegan diet now, but as there are few vegan options at most restaurants in my hometown, I am very limited in the restaurant options in our hometown.",
      "parent": "0",
      "gravatar_hash": "04ba446fbc3c8a98e4e4e25c1fcb848f"
    },
    {
      "id": "127723",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-03-18 07:51:45",
      "content": "Wow, what a nightmare!",
      "parent": "127522",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "728653",
      "author": "Cw",
      "author_url": "",
      "date": "2014-02-18 17:36:13",
      "content": "Yo man, this is on point! Yeah allergies can take u out. Be safe!",
      "parent": "0",
      "gravatar_hash": "54484cde5db0b199ba3553f226cb820b"
    },
    {
      "id": "1314025",
      "author": "Steve Todd",
      "author_url": "",
      "date": "2015-08-28 02:59:53",
      "content": "Went to a local McDonald's with a friend who has severe, near-anaphylactic-level allergy to white onions.\n\nTold the cashier specifically \"please do not put onions on this burger -- it could kill my friend because she is very allergic to them.\"\n\nSo, naturally, she got a burger loaded with onions, but unfortunately trusted it not to have them.  After taking one bite, she began to cough and gag, her face going blue as the oxygen failed to flow and her throat closed up to a drinking-straw's diameter.\n\nI nearly got run over in rushing out across the drive-through lane to the car to get said friend's epinephrine inhaler and keep her from having to endure an ER visit. \n\nYes, restaurateurs of all sorts -- PLEASE give allergies the due diligence they deserve, just because the very worst service is that of ending a customer through negligent behavior, or even just making them uncomfortable for having eaten your food.",
      "parent": "0",
      "gravatar_hash": "f1cb305772b199a589f74a7d9459ecde"
    }
  ]
}