{
  "comment_count": 4,
  "comments": [
    {
      "id": "4023",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2007-10-06 20:09:32",
      "content": "Follow up info: I've eaten there a few more times since the original review, including twice in the past two days. Here's a few dishes:\n\nSesame tofu - fried tofu with a soy glaze and lots of sesame seeds and a few bits of red bell pepper. Very nice with rice.\n\nTofu Pho - nice broth, served with the usual platter of bean sprouts, lime, and basil leaves, very good, but the soft tofu was kinda bland. Next time I'd try the House Special Vegetarian Pho.\n\nTofu Sour Soup - very interesting soup with bitter melon, pineapple, okra, tomato, tofu and a slightly sour tamarind broth. This one is more something you'd want to share as a side dish, not as a whole meal for one person.\n\nCurry Tofu - similar to a Thai Yellow curry with potatos and tofu. I ordered it mild to share with Mini-Me. I think I'd like it a lot if I got it spicy.\n\nI'll add more as I work my way through the menu.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "4024",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2008-01-04 08:15:06",
      "content": "Yellow Noodle Soup with Tomato Broth (approximate name) - really interesting two-part soup. Big bowl of thin egg noodles in the typical slightly sweet tomato broth with many different fake meats, lime, romaine and jalapeno slice, and a separate small bowl with a clear tasty broth. You don't mix them, I asked :). Good one.\n\nVegan Garden Rolls - outstanding crispy fried rolls. Gotta have em.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "4025",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-18 15:53:57",
      "content": "Followup, early 2010 - this place has been renamed to \"Loving Hut\" but is still under the same ownership. I think the quality has gone down, and the menu has gotten shorter. I no longer eat here on any sort of regular basis.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "109652",
      "author": "Craig Brown",
      "author_url": "http://growingupjamaican.com",
      "date": "2013-01-23 08:38:55",
      "content": "That looks awesome i've always wanted to try this type of food! but there are no restaraunts around my area that i know of. vietnamese food sounds awesome!",
      "parent": "0",
      "gravatar_hash": "8a2ef9dcc56663a0b771ca457b8481e3"
    }
  ]
}