{
  "comment_count": 25,
  "comments": [
    {
      "id": "701",
      "author": "Kris B",
      "author_url": "",
      "date": "2010-12-20 08:30:39",
      "content": "Sounds and looks delicious! Thanks!",
      "parent": "0",
      "gravatar_hash": "157d86ffc3201a66d16cfb159ec8477f"
    },
    {
      "id": "702",
      "author": "Masala Mama",
      "author_url": "http://profile.typepad.com/6p013483f01136970c",
      "date": "2010-12-20 11:20:27",
      "content": "Sounds good!  I imagine that my vegetarian hubby would enjoy this!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "703",
      "author": "Tofu Mom",
      "author_url": "http://tofu-n-sproutz.blogspot.com/",
      "date": "2010-12-20 13:04:33",
      "content": "I am TOTALLY going to try this!! (As you know) I'm a HUGE gravy fanatic - I have a couple gravy recipes using Marmite and they truly do have the best, most rich flavor of any of my gravies... but the addition of mushrooms sounds divine!! I'll check back and let you know how it fares among the non-vegetarians haunting my house this week!!!",
      "parent": "0",
      "gravatar_hash": "1a0b4a32e20aa0dec8b1491f2bea1ad6"
    },
    {
      "id": "704",
      "author": "Jennifer (Delicieux)",
      "author_url": "http://www.ledelicieux.com",
      "date": "2010-12-20 14:22:13",
      "content": "I'm a huge fan of vegemite and have it on my toast every morning, but would never have thought of using it as a base for gravy.  I will have to try this.",
      "parent": "0",
      "gravatar_hash": "a41aacc5cc6f594d4dfbccf414e6137d"
    },
    {
      "id": "705",
      "author": "Kate",
      "author_url": "http://www.relishtherussian.com",
      "date": "2010-12-20 17:00:09",
      "content": "Wow, what a great recipe.  I've been struggling with turning some holiday favorites into vegetarian dishes.  Great idea!",
      "parent": "0",
      "gravatar_hash": "f9d7ca964945a25861de2b9fedb2df9f"
    },
    {
      "id": "706",
      "author": "buywowaccount",
      "author_url": "http://www.buywowaccountsforsale.com",
      "date": "2010-12-20 22:11:40",
      "content": "Glad to make this one for my not so healthy-eating nephews. I'm sure they wouldn't know the difference. Thanks for the share!",
      "parent": "0",
      "gravatar_hash": "17249cdf1fa6c5fcba06e4d91efd5a95"
    },
    {
      "id": "707",
      "author": "Melinda",
      "author_url": "http://www.icookwithwine.com",
      "date": "2010-12-21 09:51:25",
      "content": "Thank you for this! Gravy is one of the things I miss most about my old carnivorous lifestyle and this sounds perfect. I've done a couple mushroomy versions before but it was always missing something - the marmite is genius.",
      "parent": "0",
      "gravatar_hash": "9d51f9c6c7087220db0c60a186457ba1"
    },
    {
      "id": "708",
      "author": "alessandra@clear.net.nz",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2010-12-21 12:38:36",
      "content": "Golly, here people are crazy for marmite and veggiemite, some prefer one and some the other (usually Australians go for marmite and New Zealanders for veggiemite... to me they taste the same!).\n\nI don't understand what you mean by biscuit and gravy... biscuit to me is a cookie or a cracker... can you tell me what do you mean?\n\nciao\nAlessandra\n\nPS\nand happy holidays!!!",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "709",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-12-21 12:58:48",
      "content": "Oh yeah, I never thought about how odd biscuits and gravy must sound to anyone from Europe, where biscuit means a cookie! A biscuit in America is somewhere between a croissant and a muffin, and they are hugely popular especially in the American South. They are raised with baking soda, and the butter is added with a pastry-style techique so they come out both tender and flaky. Here&#39;s a post I wrote about them a million years ago: <a href=\"https://herbivoracious.com//2007/07/flaky-biscuits.html\" rel=\"nofollow\">https://herbivoracious.com//2007/07/flaky-biscuits.html</a>",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "710",
      "author": "Lael Hazan",
      "author_url": "http://www.giulianohazan.com/blog",
      "date": "2010-12-22 06:34:03",
      "content": "I was first introduced to Marmite in Italy and worked hard, but never quite understood why it was so beloved.  However, I bought a bottle of it that has been sitting in my pantry ever since.  Now I have a reason to but it to good use!",
      "parent": "0",
      "gravatar_hash": "3f513a08ba12dd91fd9177912008f47a"
    },
    {
      "id": "711",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-12-22 11:44:32",
      "content": "I&#39;m surprised that many Italians would like Marmite, it doesn&#39;t seem their style! Let me know if you try it out in gravy. I think it does a nice job of amping up umami without changing the flavor profile to be Asian the way shoyu, shiiitake or miso might.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "712",
      "author": "Carolyn",
      "author_url": "http://whatsthemuck.blogspot.com/",
      "date": "2010-12-29 20:08:43",
      "content": "One of my very first, and most beloved, vegetarian cookbooks (by Rose Elliot, published in the late 1980's or early 1990's) taught me to use Marmite and mushrooms for really good gravy, and I frequently do a variation using both (but there are always onions and garlic included in the recipe). I would not dream of eating Marmite straight away on toast, however I also go into a mild panic when it runs out. It's a seasoning, people, not a food group! Luckily the behemoth chain grocery stores in my area carry it in their 'international' sections, so it is always available.",
      "parent": "0",
      "gravatar_hash": "380d699e3ae9d44fa2e6dac67339e153"
    },
    {
      "id": "713",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-12-29 20:34:09",
      "content": "Interesting! I learned about it in the spring of 1986 when I was living at Green Gulch Farm, part of the SF Zen Center. Sounds like that recipe and the one from Rose Elliot might have had a common ancestor.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "714",
      "author": "Veggie",
      "author_url": "http://www.vegetarian-zone.com",
      "date": "2010-12-30 00:02:20",
      "content": "To the best of my knowledge  broth is absolutely not vegetarian ingredient.\n<a href=\"http://vegetarian-zone.com\" rel=\"nofollow\">http://vegetarian-zone.com</a>",
      "parent": "0",
      "gravatar_hash": "adaa5725d92b94fc689a1d0433300380"
    },
    {
      "id": "715",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-12-30 06:37:39",
      "content": "Broth simply means a thin infusion of flavorful ingredients; there are dozens of vegetarian broths on the market, made mostly from onions, carrots, leeks, celery and often yeast extracts. My favorite brand is Seitenbacher.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "716",
      "author": "Jean",
      "author_url": "http://profile.typepad.com/morbidomega",
      "date": "2011-01-14 06:17:10",
      "content": "I tried this recipe last night on belgian waffles topped with portobella mushroom planks and walnuts (an approximation of something my grandmother used to make with poached chicken).  It was wonderful- even my skeptical other half enjoyed it.  Thanks for the tip about Marmite; I never would have touched it, otherwise.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "717",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-01-14 14:07:00",
      "content": "I&#39;ll be darned! Were you following the twitter discussion of vegetarian chicken &amp; waffles or is this just serendipity?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "718",
      "author": "Kimbo",
      "author_url": "",
      "date": "2011-02-17 13:13:39",
      "content": "UK Marmite, NZ Marmite and Australian vegemite are different things though (listed here in order of taste strength from high to low). All will work well in stock though :) I just bought a large tub of NZ marmite over to a friend in the US and she loves it. The problem is that most people assume that you eat it like Nutella. Start with a small amount on toast with butter and to make it even more palatable grill it on toast with cheese, you will love it in no time!",
      "parent": "0",
      "gravatar_hash": "34311498c44f917505d882349df4dbb8"
    },
    {
      "id": "719",
      "author": "Jay",
      "author_url": "",
      "date": "2011-02-18 13:15:09",
      "content": "Actually, NZ and Australian Marmite are exactly the same.  It's all made in the same factory in NZ!  However, Vegemite is different although available in both countries as well.",
      "parent": "0",
      "gravatar_hash": "6122d62beea75dc068be7e393382bdc6"
    },
    {
      "id": "720",
      "author": "Saskia",
      "author_url": "",
      "date": "2011-07-12 10:08:42",
      "content": "I often put Marmite in my gravy, but then I am in the UK where it is a widely available ingredient. I also frequently use it when making roast potatoes - it adds that savoury umami flavour that meat eaters get from roasting the meat in the same pan. My usual veggie roast potato recipe goes: parboil the potatoes until they are cooked at the edges but still crunchy in the middle, drain & add 2-3 tsp butter, 1\\2 tsp marmite & black pepper (maybe a little salt but you don't desperately need it as the butter & marmite both contain salt, and if you've boiled them in salted water or stock you definitely won't need extra salt), then shake them gently until they are well coated in the marmite & butter mixture. Transfer to a preheated roasting dish containing a little vegetable oil & roast until crispy (at least 40 mins).\n\nA tip for people who think they don't like Marmite: spread it REALLY thinly on buttered toast and you'll probably appreciate it a lot more - it is a bit overwhelming if you try to spread it thickly like other spreads! Give it another try as it's a really great source of B vitamins (better than Vegemite!).",
      "parent": "0",
      "gravatar_hash": "1667253fc7c0c9a3b05923c14a11cd0b"
    },
    {
      "id": "721",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-07-12 10:16:14",
      "content": "That is a very interesting recipe for the potatoes! I could see how that would be delicious. Thanks for sharing.\n\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Vegetarian Frijoles Charros - Mexican Cowboy Beans with Smoked Onion - Recipe",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "46308",
      "author": "Maria Jette",
      "author_url": "http://www.mariajette.com",
      "date": "2012-08-20 09:32:46",
      "content": "Working my way through the myriad wonders of your site-- I love it! \n\nJust a thought, long after Alessandra's original query: I'd say a biscuit is much more like a SCONE, and really not at all like a muffin (which is more of a cake) or a croissant (which uses rolling and folding with butter to achieve its layers).\n\nActually, a classic American biscuit pretty much IS a classic (unfruited) scone. It's just that Americans have been confused by gigantic, leaden, packed with everything-but-the-kitchen-sink doorstops which are termed \"scones\" in coffee shops here. I first had scones while living in Johannesburg as a child-- they weren't even sweet, and I think that would be a shock to lots of Americans. I recall thinking they were biscuits-- and of course, they were!",
      "parent": "709",
      "gravatar_hash": "304c75d3e8367784f0cad81dc3629056"
    },
    {
      "id": "46309",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-20 09:40:14",
      "content": "You are absolutely right, the things that pass for scones in most American coffee shops are just free form, oversweet muffins. A true scone is flaky and basically the same technique as an American biscuit.",
      "parent": "46308",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "78906",
      "author": "Emma",
      "author_url": "",
      "date": "2012-11-12 15:30:14",
      "content": "I love Marmite!  I like Vegemite too, but to me, Marmite is the shizz.  :)  I think you either love it or hate it.",
      "parent": "0",
      "gravatar_hash": "3f544d7c14fe3a18aa646cd7c9ded030"
    },
    {
      "id": "84676",
      "author": "Charlie",
      "author_url": "",
      "date": "2012-11-22 19:40:15",
      "content": "I made this for Thanksgiving this year, and it was a big hit! I expected a passable substitute for meat gravy, but this was genuinely delicious.  Also, this was my introduction to marmite, which took some effort to track down here in Idaho. I can't say I'll be eating eating it on toast anytime soon, but I'll definitely come back to this gravy.",
      "parent": "0",
      "gravatar_hash": "6d8866fc07c14e48ff62986941fab6d9"
    }
  ]
}