{
  "comment_count": 26,
  "comments": [
    {
      "id": "888",
      "author": "lisaiscooking",
      "author_url": "http://lisaiscooking.blogspot.com/",
      "date": "2010-09-07 07:40:03",
      "content": "This sounds incredible. And, I'm visiting Arizona right now. It seems like I should be able to find something very much like this here, but I haven't seen fry bread on any menus yet.",
      "parent": "0",
      "gravatar_hash": "0a9a4542e87845b6596d9c41d7e3c257"
    },
    {
      "id": "889",
      "author": "Trippytexan.blogspot.com",
      "author_url": "http://profile.typepad.com/trippytexanblogspotcom",
      "date": "2010-09-07 13:07:21",
      "content": "It's been too long since I've had fry bread.  I'm too much of a wimp to try it on the stove at home, though... maybe I can convince a friend to try it.  Thanks for sharing this recipe!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "890",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-09-07 19:45:27",
      "content": "@Lisa - you might have to seek out a a pow-wow, or more of a street-food scene, might be hard to find in a restaurant especially in the city. Although try googling &quot;phoenix indian tacos&quot; if that is where you are, I see someplace called &quot;The Fry Bread House&quot; and a few others that sounds interesting.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "891",
      "author": "alessandra@clear.net.nz",
      "author_url": "http://alessandrazecchini.blogspot.com/",
      "date": "2010-09-08 09:28:14",
      "content": "Initially I thought of Indian from India... I suppose that we say Native American (or at least this is what you say if you live outside the USA) and refer to Indians for the Indian Subcontinent ethnic people only (wherever they may live. Is it different in the USA?\n\nI love fried bread... I could eat it everyday...good to have a Navajo recipe :-)",
      "parent": "0",
      "gravatar_hash": "1d5879742202cb4c70bf1581416c7dfd"
    },
    {
      "id": "892",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-09-08 09:43:27",
      "content": "@Alessandra - it is a funny thing! The &quot;politically correct&quot; term is Native American in the US as well, however the majority of Native Americans call themselves Indians. And this dish is universally known as Indian Tacos by the people that make and eat them. I thought about calling them Native American Tacos but no-one has ever heard of those, so it would just be confusing.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "893",
      "author": "Chef Jay",
      "author_url": "http://www.chile-pepper-sauces.com/canning-salsa-recipes.html",
      "date": "2010-09-08 23:18:15",
      "content": "I love the idea of combining two cultures, Mexican and Indian cuisines. I am doing some cooking myself on canning salsa recipes and I think I'll try this one out one of these days.",
      "parent": "0",
      "gravatar_hash": "c549c377638db2a3151c9a7dd3357ec9"
    },
    {
      "id": "894",
      "author": "Sarah",
      "author_url": "http://goofygourmet.blogspot.com",
      "date": "2010-09-09 17:58:48",
      "content": "I'm glad you stood up for iceberg. I'm right there with you. I'm going to make this recipe some day, maybe with a different hot sauce (chili peppers still intimidate me) because every time I think about it my mouth waters. Biofeedback is on your side, buddy.",
      "parent": "0",
      "gravatar_hash": "1b5914997e41c46e67f1f9304eee1a85"
    },
    {
      "id": "895",
      "author": "Chili-Diva",
      "author_url": "http://www.chili-everyway.com/vegetarian-chili-recipe.html",
      "date": "2010-09-10 06:33:13",
      "content": "Absolutely delicious. The hot sauce is to die for. I made it just like you suggested with the iceberg lettuce. I will admit I usually do not eat iceberg anymore usually romaine or other dark lettuces. I do agree that iceberg has gotten a bad rap. This recipe felt more traditional with the iceberg.\n\nVery tasty.",
      "parent": "0",
      "gravatar_hash": "cfcf505e171ae8777039d59cfe48a9c9"
    },
    {
      "id": "896",
      "author": "jodye @ 'scend food",
      "author_url": "http://sendfood.wordpress.com",
      "date": "2010-09-10 10:50:21",
      "content": "The name alone makes me want to try this recipe! This sounds absolutely wonderful; I especially like the part about the poblano peppers",
      "parent": "0",
      "gravatar_hash": "15ffce83eb1ce3e46d5be4dea7c98e6b"
    },
    {
      "id": "897",
      "author": "rebecca",
      "author_url": "",
      "date": "2010-09-10 14:13:54",
      "content": "Looks good and I like your site, but to be fair, the problem with iceberg lettuce is not that people are snobs against it, but the fact that it has virtually zero nutrients, while other kinds have loads. I do like the crunch, but the inside portions of romaine lettuce have that also.",
      "parent": "0",
      "gravatar_hash": "e13ef2557e2809dc9faedbde8d2eeefa"
    },
    {
      "id": "898",
      "author": "carol - ley de atraccion",
      "author_url": "http://www.cambiatusresultados.com.ar/",
      "date": "2010-09-12 14:35:01",
      "content": "thanks for the recipe! it looks delicious!",
      "parent": "0",
      "gravatar_hash": "1ce6cdbe4443b4bf143d9da3494d2297"
    },
    {
      "id": "899",
      "author": "Elizabeth Swigar",
      "author_url": "",
      "date": "2010-09-19 07:17:15",
      "content": "My mouth is watering just looking at these recipes. - Elizabeth Swigar",
      "parent": "0",
      "gravatar_hash": "a8fca7cbb086f34bbbf9584e226b7792"
    },
    {
      "id": "900",
      "author": "Stephanie",
      "author_url": "",
      "date": "2011-03-02 19:38:13",
      "content": "Ooh, I can't wait to try this, I haven't had fry bread since my trips to the Navajo reservation in the 80's, I loved it though! We ate it both savory with beans and sweet with honey, delicious both ways :)",
      "parent": "0",
      "gravatar_hash": "18112fefe795ff5109254e3866db1b66"
    },
    {
      "id": "901",
      "author": "ChicagoCook",
      "author_url": "",
      "date": "2011-04-14 07:56:52",
      "content": "Yum! Made this last night for myself and the boyfriend. I think my dough could have come together better--for some reason, dough never really works for me. So I ended up having to knead it a bit more than called for. But it still turned out really well. I added a mix of sauteed onions, garlic, summer squash, spinach and corn on top, along with guac and some pinto beans. My boyfriend quickly named it \"one of the best things I've ever made.\" Of course, that could be because I almost never fry anything, but, hey, I'll take it. Thanks!\n\nP.S. Iceberg lettuce, while I don't eat it often, is PERFECT with Mexican foods--lots of crunch and coolness that doesn't intrude on any flavors.",
      "parent": "0",
      "gravatar_hash": "572bc11cf507aeb623dbaf2aa958ec90"
    },
    {
      "id": "902",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-04-18 19:55:04",
      "content": "@ChicagoCook - I&#39;m so glad it was a hit for you! If the dough isn&#39;t coming together, sometimes you may just need to add a bit more liquid. It can depend on humidity and the exact type of flour you have and how you measure it. And I totally agree with you about the iceberg. It has a place!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "903",
      "author": "Jen @ Shakeology",
      "author_url": "http://www.shakenutrition.com/",
      "date": "2011-05-03 10:27:21",
      "content": "Made these last night for my husband, and they were delicious Michael. Great recipe, highly recommended!",
      "parent": "0",
      "gravatar_hash": "1aedb381bda0449937e61e8cfcc162bc"
    },
    {
      "id": "904",
      "author": "Amalia Marks",
      "author_url": "http://profile.typepad.com/amaliamarks",
      "date": "2011-10-27 04:00:09",
      "content": "Wow, my mouth is just watering from looking at these great recipes! I love how you have mixed two different types of cuisines together - Navajo and Indian. The origins of this dish is also very interesting to read about. Tonight will be my first attempt at fry bread, hope it comes out as well as yours!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "18209",
      "author": "Jenny@VegetarianHatesVegetables",
      "author_url": "http://vegetarianhatesvegetables.blogspot.com/",
      "date": "2012-01-30 09:42:54",
      "content": "I can't believe I never saw this on here before!  My omni husband is always raving about indian tacos and I've been meaning to make a vegetarian version.  These look fantastic!  Yes, you definitely want to wear gloves when seeding those little devils.  My 16 month old son can attest to that.  I had washed my hands 3 times and the oils still made it into his eyes (and with company over, no less.)  Okay I got a little off track there, just wanted to say thanks for a great recipe!",
      "parent": "0",
      "gravatar_hash": "efd63fa22c1a4cd1b5e1e7c8fc2b99bb"
    },
    {
      "id": "18211",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-30 09:48:55",
      "content": "Oh, ow! That is one of those parenting moments you wish you could roll back.",
      "parent": "18209",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "19119",
      "author": "AZlady",
      "author_url": "",
      "date": "2012-02-12 13:14:08",
      "content": "There aren't a lot of Native American dishes on menus anywhere in the parts of Arizona you are likely visiting.  You will have to go to specific fry bread houses to get tacos like this, there are a couple in the Phoenix Metro area.  I can't guarantee you will find anything in any other city, unless you are visiting a reservation (though some parts of the Navajo rez might be you bet bet bc its the most tourist-friendly with Canyon de Chelly and other attractions, many other reservations are not tourist-friendly).  Just educate yourself before visiting anywhere, not all areas of the reservations are friendly to non-Natives, and there is still a lot of anger held towards white people due to the long-storied history of Native American persecution.",
      "parent": "888",
      "gravatar_hash": "1889d1aea61bf8a06b4f9c9bcdaaf8b6"
    },
    {
      "id": "159773",
      "author": "Adrienne",
      "author_url": "",
      "date": "2013-06-15 09:59:16",
      "content": "The fry bread was a disaster for me...apparently you need to let it sit for half an hour before frying and knead them super well. I found a video that explains very well how to do this http://www.youtube.com/watch?v=LUSel5VpiiI",
      "parent": "0",
      "gravatar_hash": "cad1b1edb49f6441c80a2a650cab4863"
    },
    {
      "id": "159905",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-06-15 17:23:29",
      "content": "I'm sorry to hear it was a disaster! Can you tell me how it went wrong? I haven't had any problems with it myself.",
      "parent": "159773",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "160108",
      "author": "Adrienne",
      "author_url": "",
      "date": "2013-06-16 07:45:55",
      "content": "The bread came out super hard, like the texture of a cookie, and tasted like plain flour. I used whole wheat flour instead of white, I don't know if that makes a difference.",
      "parent": "159905",
      "gravatar_hash": "cad1b1edb49f6441c80a2a650cab4863"
    },
    {
      "id": "160114",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-06-16 08:32:47",
      "content": "Ah, yes, I wouldn't think 100% whole wheat would work well in this recipe, I'd expect it would come out dense and tough. Maybe like 20% whole wheat, 80% white might be ok. Also, you might want to check and make sure your baking powder is still active.",
      "parent": "160108",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "160201",
      "author": "Adrienne",
      "author_url": "",
      "date": "2013-06-16 11:57:06",
      "content": "The powder is definitely active, I baked with it last week. You may want to add in the recipe it's important to use finely ground flour if that's important to getting the bread right, there are some out there like me who use whole wheat. Thanks for getting back to me.",
      "parent": "160114",
      "gravatar_hash": "cad1b1edb49f6441c80a2a650cab4863"
    },
    {
      "id": "1158419",
      "author": "Grickles",
      "author_url": "",
      "date": "2014-11-25 18:18:50",
      "content": "My gal and I have made this dish twice! It is freakin delish! Even the kids love it. Thanks for the great recipe :D",
      "parent": "0",
      "gravatar_hash": "28ba83a97f4e2386a2884c139a7258fb"
    }
  ]
}