{
  "comment_count": 45,
  "comments": [
    {
      "id": "2616",
      "author": "John - Mormon Foodie",
      "author_url": "http://mormonfoodie.blogspot.com",
      "date": "2009-04-01 21:22:08",
      "content": "What do you need fakey meat replacements for when chili is bursting with flavor, anyway? Nicely done, as always, Micheal.",
      "parent": "0",
      "gravatar_hash": "0750826129ee44caebb3eba7010ade18"
    },
    {
      "id": "2617",
      "author": "Jodye",
      "author_url": "http://coupleofvegans.blogspot.com",
      "date": "2009-04-01 22:47:57",
      "content": "Oh, I'm always up for some good chili, this sounds amazing!",
      "parent": "0",
      "gravatar_hash": "15ffce83eb1ce3e46d5be4dea7c98e6b"
    },
    {
      "id": "2618",
      "author": "jd",
      "author_url": "http://veggie-terrain.blogspot.com",
      "date": "2009-04-02 01:49:57",
      "content": "Wow - what a gorgeous picture! I was actually just commenting on another blog that I've been in the mood for chili lately.  Looks like I'll have to give your recipe a try...\n\nAlso, I love your new blog style/layout. Although I have to confess that I haven't visited for a short while (I'm a bit behind), so I'm not sure how \"new\" it really is.  Either way, it looks GREAT :)",
      "parent": "0",
      "gravatar_hash": "8b9b8b076895cb86afd040429ac5bc38"
    },
    {
      "id": "2619",
      "author": "The Italian Dish",
      "author_url": "http://www.theitaliandish.blogspot.com",
      "date": "2009-04-02 07:25:05",
      "content": "I try to fix at least two meatless dinners a week and one of them is always a vegetarian chili.  It's one dish where you don't miss the meat. I'll have to try the chili pod method.",
      "parent": "0",
      "gravatar_hash": "3e4e3826bf4c9300ffc14fd965fa8026"
    },
    {
      "id": "2620",
      "author": "Barbara",
      "author_url": "http://www.synchronicitycoaching.com",
      "date": "2009-04-02 08:49:47",
      "content": "Mmmm - this looks delicious Michael.\nI love the photos of the dishes you post - they make it very enticing to try the recipes.",
      "parent": "0",
      "gravatar_hash": "35a0844a632079f9c80145caa1fbbe0e"
    },
    {
      "id": "2621",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-04-02 10:42:21",
      "content": "Thanks JD! The new layout was done by my\nbrother<<a href=\"https://herbivoracious.com//2009/03/welcome-to-our-new-design.html rel=\"nofollow\">.\">https://herbivoracious.com//2009/03/welcome-to-our-new-design.html>.</a>\nI'm glad you like the look of it. Let me know if you try the chili.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2622",
      "author": "Joanna",
      "author_url": "http://scalloped-edge.blogspot.com",
      "date": "2009-04-04 08:35:35",
      "content": "Oh this looks delicious!  Chili is one of those dishes where I often prefer vegetarian versions to meaty ones - there's so much flavor already, the meat just seems sort of unnecessary.  I had a delicious veggie chili a few weeks ago that included chick peas along with pinto and black beans that I've been wanting to try to recreate, thanks for sharing your method so I have a great starting point!",
      "parent": "0",
      "gravatar_hash": "162fb33db8c91df1cb51af7780965c65"
    },
    {
      "id": "2623",
      "author": "www.google.com/accounts/o8/id?id=AItOawmSZrR8QBjfArerKLDpV7lBq1x_SKYA_3s",
      "author_url": "http://profile.typepad.com/6p011570dda6e7970b",
      "date": "2009-06-08 18:05:46",
      "content": "As we are in winter Down Under, your great chili recipe was a delicious find. So, many thanks for developing & sharing. I needed a GF, veggie meal for some new friends this weekend, & after many days trolling the net found your great site.\nNow you say this is easy - in Seattle, fantastic city that it is, I'm sure it would be, but here in rural Tasmania, Australia, not so easy! First finding dried beans was a task! I had assorted beans, which I tested, used & seemed fine, but the available purchase from the supermarket warned they could contain gluten! Oh NO!\nIn my nearest town I found a grocers with just 2 bags of red kidneys left, but no black or pinto, so had to substitute Grt Northern &  Borlotti, which with their red striped shells added visual texture as well as flavour.\nDuring my research, I was reminded that un-soaked dried beans carry certain toxins & ingestion is not recommended, and it was advised that to reduce flatulence multiple rinsing & over-night soaking was recommended. I also remember my Gran using bicarb of soda in her 1st soaking (boiling) water (which I believe aids color retention while reducing the gaseous effects! I think my beans were really fresh, as I only soaked them 6-hrs, rinsing & replacing the soaking water twice, and I suspect the beans were cooked in around 30 minutes, so the 1-hr+ was much too much for my beans!\nNow to the Pepper! I loved this idea of smoked pepper flavor, but I was unable to locally source Chiptole - can you advise a suitable substitute? There were NO smoked chili's in my supermarkets or grocers, so I cooked up extra as per recipe, and highly recommend this method for adding a wonderful depth & warmth to any dish requiring a bit of heat, with none of that nasty bitterness which I find with reg store-bought ground chili. I cooked up extra, removed the seeds & ground the pods to pepper for extra garnish & to now add heat to other dishes. I found reg bottled whole chilies & jalapeño peppers, which I de-seeded & used instead of your (unavailable!) suggestions, together w/a few dashes of Tabasco, which I think worked really well, and let the dish mature for a good 24hrs.\nI then split the dish, adding my GF mince base to the half for those that liked it & leaving the veggie as was, although as the beans were over-done added some corn & chopped sweet peppers for fresh texture & color, put them all in the oven till ready to feast, then served with all the fixings, incldg: rice, grated carrot, assorted gf & wheat tortillas, guacamole, sour cream, shredded lettuce, parsley-chopped tomatoes AND fried polenta coyotes & cactus shapes for the kids to dip & sup - Hum Hummmmmmmm looked fab & was delicious - completed with my GF Bakewell Cake & Ice cream! What a Feast! So many thanks for this great site and a wonderful recipe that could make me the Chili Queen of Tasmania! :)",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2624",
      "author": "www.google.com/accounts/o8/id?id=AItOawmSZrR8QBjfArerKLDpV7lBq1x_SKYA_3s",
      "author_url": "http://profile.typepad.com/6p011570dda6e7970b",
      "date": "2009-06-08 18:17:33",
      "content": "As we are in winter Down Under, your great chili recipe was a delicious find. So, many thanks for developing & sharing. I needed a GF, veggie meal for some new friends this weekend, & after many days trolling the net found your great site.\nNow you say this is easy - in Seattle, fantastic city that it is, I'm sure it would be, but here in rural Tasmania, Australia, not so easy! First finding dried beans was a task! I had assorted beans, which I tested, used & seemed fine, but my next available purchase from the supermarket warned the beans could contain gluten! Oh NO!\nIn my nearest town I found a grocer's with just 2 bags of red kidneys left, but no black or pinto, so had to substitute Grt Northern & Borlotti, which with their red striped shells added visual texture as well as flavor.\nDuring my research, I was reminded that un-soaked dried beans carry certain toxins & ingestion is not recommended, and it was advised that to reduce flatulence multiple rinsing & over-night soaking was recommended. I also remember my Gran using bicarb of soda in her 1st soaking (boiling) water (which I believe aids color retention while reducing the gaseous effects!) I think my beans were really fresh, as I only soaked them 6-hrs, rinsing & replacing the soaking water twice, and I suspect the beans were ready in around 30 minutes, so the 1-hr+ was much too much for my beans! So cooks, you might want to check your beans reg after 1/2hr for doneness!\nNow to the Pepper! I loved this idea of smoked pepper flavor, but I was unable to locally source Chiptole - can you advise a suitable substitute? There were NO smoked chili's in my supermarkets or grocers, so I cooked up extra as per recipe, and highly recommend this method for adding a wonderful depth & warmth to any dish requiring a bit of heat, with none of that nasty bitterness which I find with reg store-bought ground chili. I cooked up extra, removed the seeds & ground the pods to pepper for extra garnish & to now add heat to other dishes. I found reg bottled whole chilies & jalapeño peppers, which I de-seeded & used instead of your (unavailable!) suggestions, together w/a few dashes of Tabasco, which I think worked really well, and let the dish mature for a good 24hrs.\nI then split the dish, adding my GF mince base to the half for those that liked it & leaving the veggie as was, although as the beans were over-done added some corn & chopped sweet peppers for fresh texture & color, put them all in the oven till ready to feast, then served with all the fixings, incldg: rice, grated carrot, assorted gf & wheat tortillas, guacamole, sour cream, shredded lettuce, parsley-chopped tomatoes AND fried polenta coyotes & cactus shapes for the kids to dip & sup - Hum Hummmmmmmm looked fab & was all delicious - completed with my GF Bakewell Cake & Ice cream! What a Feast! So many thanks for this great site and a wonderful recipe that could make me the Chili Queen of Tasmania! Ha!! Vee :)",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2625",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-06-11 16:44:38",
      "content": "Sounds like you had an amazing meal. I don't think I have much input as far as substitutions that would work in Tasmania, no idea what is available way Down Under!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2626",
      "author": "pb",
      "author_url": "http://kamalkitchen.blogspot.com",
      "date": "2009-08-21 22:42:05",
      "content": "Hello Michael,\n\nWhat a great blog. Its great the way you write detailed steps. I once got a huge can of chilli powder from sams that has a chilli blend and varoius spices like cumin etc. SO Far I have mostly used that for the chilli. But using a chilli combination sounds really fresh and much more flavourful..\n\nThis almost makes me wish cold weather was here soon.\n\nThanks",
      "parent": "0",
      "gravatar_hash": "2b2aeef3ee84e2dcb66ae609be627642"
    },
    {
      "id": "2627",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-08-21 22:50:54",
      "content": "Thanks PB! That kadhi you have on your blog looks delicious to me. I wish\nthere was more variety at the Indian restaurants we have in Seattle (there\nis better luck out in the suburbs, but I can't get out there very much).",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2628",
      "author": "Anna",
      "author_url": "",
      "date": "2009-10-18 13:50:59",
      "content": "I made this vegetarian chili for a birthday party yesterday.  I am not a vegetarian, and I usually don't like vegetarian dishes (sorry!).  But, I was doing it for a very important friend and wanted the vegi chili to be DELICIOUS.  And, I was looking for a recipe where you build the flavors from scratch.\n\nMy friends, this is a good recipe.  It is incredibly flavorful.\n\nI was so impressed with the simplicity of this recipe as well.  Aside from soaking the beans, this recipe takes hardly any time.  I was able to find all the ingredients at my local grocery store, too.\n\nToasting the chilies in a pan gave such a beautiful deep flavor to the sauce, and the texture of the beans and other vegetables was very pleasing.  I agree that using soaked beans instead of canned is the way to go.  I may never use canned beans again, unless I have to - the texture is so much better.\n\nThank you so much for sharing this recipe.  You have introduced a new winter staple into our house, and several others.  You know everyone asked for the recipe because is was soooooooo delish!!",
      "parent": "0",
      "gravatar_hash": "2c2ce0b146f09b3b712eddbccd5dda0e"
    },
    {
      "id": "2629",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-10-18 20:12:56",
      "content": "@anna - So glad to hear it was such a hit! And I&#39;m glad we&#39;ve got you converted to soaking and cooking your own beans, it really is a big difference, isn&#39;t it? I plan to buy a pressure cooker soon so I can have both the speed and the improved texture.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2630",
      "author": "Danielle",
      "author_url": "http://zombieloveaffair.blogspot.com",
      "date": "2009-10-18 20:25:37",
      "content": "This is such a great recipe!!  I have prepared this dish twice now, once on the stove and once in the slow cooker and it was a perfect mid week dinner.\n\nThanks for sharing the recipe!",
      "parent": "0",
      "gravatar_hash": "1c60bd9ba3baef808352e3963e104a43"
    },
    {
      "id": "2631",
      "author": "Jenifer",
      "author_url": "",
      "date": "2010-03-18 09:13:09",
      "content": "Sounds delish. I'd love to see the weeknight version if you have it. Thank you!",
      "parent": "0",
      "gravatar_hash": "6629367804ca9307281839611861bdc8"
    },
    {
      "id": "2632",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-03-18 09:18:33",
      "content": "Oh yeah, I never did publish that weeknight version I promised! Well, basically I would substitute canned beans - roughly 3 pinto, 2 black, 1 kidney but of course you can adjust as you see fit. I'd also skip using the dried chilis and just mash more chipotle with a fork and stir it right in until it was the heat level I liked.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2633",
      "author": "cynthia",
      "author_url": "",
      "date": "2010-03-23 23:01:17",
      "content": "you could use some smokey paprika for instead of chipotle\nI make veg chile with black beans only,  ground cumin and toasted cumin seed, jalepeno, onions, tomatoes and garnish with cilantro blended in sour cream or yogurt and lime juice,more fresh cilantro on top",
      "parent": "0",
      "gravatar_hash": "137774b4704ed99f7a1fd2151298c9c6"
    },
    {
      "id": "2634",
      "author": "Heidi",
      "author_url": "",
      "date": "2010-03-29 01:37:44",
      "content": "I've been looking for a really good vegetarian chili for some time. Nothing so far has met the mark. I want to try your recipe, but am scared it will blow our heads of with the heat. I guess we would like it extremely mild by your standards. Our normal supermarkets only have dried chili flakes (hot). They don't specify the type of chili. Is this okay to use? Or should I tried to hunt down some of the specific types you mentioned to get the right flavour? I'm fairly certain we can't get canned chipotle either.\n\nAlso, does type of bean matter? I have red kidney, but not pinto or black. I don't think we can even buy black beans (dried or can) around here (Australia). I have Adjuki, Navy/Haricot, Blackeye and Soy. Would using red kidney and substituing any of the other 2 I do have be okay?\n\nIf I end up with a chili that is perfect, I will make the effort to locate the right ingredients.",
      "parent": "0",
      "gravatar_hash": "5be1a9dc73c95728b27bf86e055f9dec"
    },
    {
      "id": "2635",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-03-31 05:47:15",
      "content": "Hi Heidi - I&#39;m pretty sure if you start with 3 ancho chilis, which are quite mild, you won&#39;t have your head blown off. Don&#39;t try to do this with dried chili flakes, they are typically quite hot by volume. Given your choices of substitution I&#39;d probably use only the kidney and blackeyed peas. I&#39;ve heard from others that the ingredient selection in Australia can be a lot smaller / different than what I&#39;m used to in the states. Good luck and let us know how it turns out!\n\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2636",
      "author": "Mo",
      "author_url": "http://www.vegetariansalmon.wordpress.com",
      "date": "2010-10-07 17:49:56",
      "content": "Thanks for the great recipe. I am always trying new veggie chilis, especially in the Fall/ Winter. I will definitely try your recipe next!\n\nChili is also an easy satisfying meal for non-veg dinner guests, and when you reminded them they had a filling meal without meat, they laugh! I posted two chili recipes on my small time vegetarian blog if you are interested (www.vegetariansalmon.wordpress.com). They are less spicy, but good for crowds where you don't know if people like spice.\n\nThank you!",
      "parent": "0",
      "gravatar_hash": "4b49e27b1a660ea5247fe4fe8ca1aba3"
    },
    {
      "id": "2637",
      "author": "Marnie",
      "author_url": "",
      "date": "2011-01-02 18:15:01",
      "content": "I just made this recipe using my pressure cooker. It turned out great. After cooking for 20 minutes, the beans turned out perfectly cooked and not mushy. I love this chili!",
      "parent": "0",
      "gravatar_hash": "dacf886452c43219a7ba373b99b24b45"
    },
    {
      "id": "2638",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-01-03 09:08:16",
      "content": "Thanks, Marnie! Glad it was a winner for you.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2639",
      "author": "nenece2@yahoo.com",
      "author_url": "",
      "date": "2011-01-20 13:44:49",
      "content": "Would this chili work well if other veggies instead of carrots/celery. Would vegetables such as green/red bell peppers, zuchinni and mushrooms work? I just want to make sure other vegetables would blend well with this recipe.",
      "parent": "0",
      "gravatar_hash": "d3a94db2d5926fc8828c8a27b2ccb8e2"
    },
    {
      "id": "2640",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-01-20 13:47:47",
      "content": "It wouldn&#39;t be a disaster at all! The way the onions, carrots and celery are used in this dish, they are sauteed first to lay down a base of aromatic flavors. Peppers can be used that way too. If I was doing zucchini and mushrooms, I&#39;d probably add them after the onions and peppers have cooked a bit, and cut them up fairly small, then let them brown before going on to the next step.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2641",
      "author": "Victoria",
      "author_url": "",
      "date": "2011-02-05 18:37:33",
      "content": "My family and I are newly vegetarians and we've been trying to find easy vegetarian recipes to make during the week. This looks delicious and my family loves chili! Thanks for posting!! :-)",
      "parent": "0",
      "gravatar_hash": "60ad2681ed813c8bfe987ef3d5842bb7"
    },
    {
      "id": "2642",
      "author": "Miss Bianca (the healthy foodie)",
      "author_url": "",
      "date": "2011-03-09 01:22:12",
      "content": "I tried this recipe a while ago and it was AMAZING! It is so full of flavor! It is pretty heavy, but so, so good that I find myself serving more than I should eat in one serving! I had to make a last minute chili for superbowl and I used canned beans, and the sauce for this recipe but it did not compare. Slow cooking the fresh beans allows the beans to absorb all of the sauce a lot better, and it just gives the chili so much more body to it. I could go on and on about how great this chili is, but I just better start making another pot to serve for my mother-in-law's birthday...any excuse to show off your recipe!",
      "parent": "0",
      "gravatar_hash": "207c0a75ad126afbffefc623f0421a9b"
    },
    {
      "id": "2643",
      "author": "Sabrina",
      "author_url": "",
      "date": "2011-08-02 12:48:06",
      "content": "Hi Michael,\n\nInstead of cooking the beans, could I just use canned beans?",
      "parent": "0",
      "gravatar_hash": "3036a8c884687362e4c794156ff5ee84"
    },
    {
      "id": "2644",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-08-02 13:41:22",
      "content": "Absolutely. It won&#39;t be *quite* as good but it is a whole lot quicker. I do that sometimes, especially if I haven&#39;t planned ahead.\n\n\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Strawberry &quot;Shortcake&quot; with Cornbread and Tarragon Whipped Cream - Recipe",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2645",
      "author": "Sabrina",
      "author_url": "",
      "date": "2011-09-25 15:20:16",
      "content": "Hi Michael,\n\nI made this last weekend and it was delicious-made with dry beans (that were soaked over night). It came out fabulous! Thanks for the wonderful recipe!!!",
      "parent": "0",
      "gravatar_hash": "3036a8c884687362e4c794156ff5ee84"
    },
    {
      "id": "2646",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-25 18:49:45",
      "content": "Good deal! I ate some vegetarian chili at a kids camp this weekend and I was really missing this recipe :) :)",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "5452",
      "author": "Melissa",
      "author_url": "",
      "date": "2011-11-28 16:21:14",
      "content": "Chili was delicious, but the chipotle pepper in the adobo sauce shouldn't be used if anyone has a wheat/gluten sensitivity due to the ingredients in the sauce...we had a reaction to it...making it again tonight with only the fresh ingredients...yummm...",
      "parent": "0",
      "gravatar_hash": "d8c94d12d813965a1065b2ba557d0b0c"
    },
    {
      "id": "5454",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2011-11-28 16:34:35",
      "content": "Oh, that's a great point! I've updated the ingredient list to note this and offer a suggested alternative.",
      "parent": "5452",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17268",
      "author": "Chihana Schiffer",
      "author_url": "",
      "date": "2012-01-17 16:23:02",
      "content": "Hi Michael! I am making this chili recipe right NOW. It's really rich and flavorful and I am so excited to eat it tomorrow as we will be snowed in. However, I am now wondering if I can add anything to the mixture as it  cooks to tone down the spiciness a bit. Any suggestions?\n\nI only added half the chipotle peppers in sauce and toasted and put in 3 guajillo peppers....\n\nThank you so much in advance. I love your blog. Say HI to Sarina and girls ;-)\n\nBest,\nChihana",
      "parent": "0",
      "gravatar_hash": "365daeeb7ed325a1a33b70c950496303"
    },
    {
      "id": "17270",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-17 16:34:50",
      "content": "Hi Chihana - there really isn't anything you can do to remove spiciness once a dish is spicy. The heat comes from the capsaicin in the chile peppers and there is no way to filter it out. You can maybe add a small bit of sugar to reduce the perception of spiciness. Or you can try to dilute it somewhat, but that will affect the other flavors. Or you can serve it with a dairy product like sour cream which is good at removing some burn.",
      "parent": "17268",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "18427",
      "author": "Carrie",
      "author_url": "",
      "date": "2012-02-02 16:34:41",
      "content": "This recipe looks great!  I will be trying it out for the Superbowl and can't wait to make it.  As for dried Chile pods, I purchased anaheim and ancho.  How many of each do you suggest I use?\n\nThanks!!",
      "parent": "0",
      "gravatar_hash": "d8fa7fb3f3431491d63d618f7a8e6b3e"
    },
    {
      "id": "18431",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-02-02 18:11:56",
      "content": "I'd start with a couple of each if you like a moderate spice level. If that isn't enough, you can always puree more with a small amount of boiling water and mix them in.",
      "parent": "18427",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "18483",
      "author": "Carrie",
      "author_url": "",
      "date": "2012-02-03 15:41:55",
      "content": "Will do.  Thank you!",
      "parent": "18431",
      "gravatar_hash": "d8fa7fb3f3431491d63d618f7a8e6b3e"
    },
    {
      "id": "22983",
      "author": "Michelle Mc.",
      "author_url": "",
      "date": "2012-04-18 09:57:25",
      "content": "Hi Michael - We are having a chili cook off at work and I have never made chili.  Fortunately we do have a few vegetarians in the office (other than mysefl) so making something would be worth it.  Since I have enjoyed so many of your recipes, I am defintily going to make this!  :)",
      "parent": "0",
      "gravatar_hash": "f155ed4b90ab1febfb1bd08575e73287"
    },
    {
      "id": "23247",
      "author": "Michelle Mc.",
      "author_url": "",
      "date": "2012-04-24 16:08:32",
      "content": "Woo Hoo, I won I won I won! This recipe was so delish, especially with the toppings, yum yum yum. I really didn't anticipate winning, but this is tops!! Thanks Michael for yet another  fabulous recipe!!",
      "parent": "22983",
      "gravatar_hash": "f155ed4b90ab1febfb1bd08575e73287"
    },
    {
      "id": "23254",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-24 19:40:58",
      "content": "That's awesome! I love that you won a chili cookoff with vegetarian chili!",
      "parent": "23247",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "107760",
      "author": "sam g",
      "author_url": "",
      "date": "2013-01-17 16:26:14",
      "content": "have you posted the \"weeknight version\" of this? I've tried to find it but can't, and I'd really like to make this recipe, but since I live in a college dorm and have to borrow my friends kitchen to make it I can't really make something that will take so much time.",
      "parent": "0",
      "gravatar_hash": "693192e2b84383922ac711ba6c3d7bc1"
    },
    {
      "id": "108067",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-01-18 11:04:53",
      "content": "Hey Sam - I never did publish the weeknight version - basically, just use canned beans. Rinse them first, don't use the \"bean snot\" in the can. Add water as needed at step 8, and if you don't feel like dealing with the chili pods, use all dried chili powder (preferably individual varieties like ancho, but even a mixed chili powder will do in a pinch.",
      "parent": "107760",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "143456",
      "author": "nterese",
      "author_url": "",
      "date": "2013-05-02 10:37:44",
      "content": "It is May in MO and we are expecting snow tonight. My last chili attempt was horrible and I didn't do it all winter and made taco soup instead. I don't have the ingredients you suggest. I have instead used 4 cans of beans, 2 cans of tomatoes, and I have some bell pepper and onion cooking to all go in my crock pot with some spices. Would you recommend any tomato sauce with that?",
      "parent": "0",
      "gravatar_hash": "49818e04f40899cd352aaf6af532e557"
    },
    {
      "id": "143460",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-02 11:00:53",
      "content": "I would break up the canned tomatoes, let it simmer a bit, and then add sauce if it seems like it is needed - trust your instincts!",
      "parent": "143456",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}