{
  "comment_count": 20,
  "comments": [
    {
      "id": "275",
      "author": "TJ Ellis",
      "author_url": "http://profile.typepad.com/ellistj",
      "date": "2011-07-11 10:19:39",
      "content": "Have you ever used liquid smoke? It seems that would give a similar result with much less work...",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "276",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-07-11 10:47:03",
      "content": "Hey TJ - liquid smoke is definitely an option. It tends to have more of a one-dimensional flavor compared to fresh smoke, but clearly has a convenience advantage. Some folks may be concerned about health issues, though that could be a concern for fresh smoke as well. By the way, there are more professional versions of liquid smoke than the grocery store types. See the discussion in Modernist Cuisine (<a href=\"http://t.co/VnaQ4r4)\" rel=\"nofollow\">http://t.co/VnaQ4r4)</a> for more info on that. I think you can order them online.\n\n\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Vegetarian Frijoles Charros - Mexican Cowboy Beans with Smoked Onion - Recipe",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "277",
      "author": "John",
      "author_url": "",
      "date": "2011-07-11 14:54:34",
      "content": "For this kind of thing, I often do the smoking on the gas grill outdoors -- it works well, avoids the need to disable the smoke-detectors, and keeps even the residual smoke outside the house.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "278",
      "author": "Tanvi @ The Hathi Cooks",
      "author_url": "http://thehathicooks.blogspot.com/",
      "date": "2011-07-11 15:00:29",
      "content": "This is a wonderful idea!  My parents, when they ate meat, loved beans like this.  Now that they are vegetarian it is difficult to get the smoky elements that the bacon imparts.  I love the idea of smoking the bacon.  I bet this would work great for other bean soups that use bacon to add a smoky complexity.  I agree with you about the unidimensional quality of store bought liquid smoke.  I have used it in the past, but never found it to be entirely satisfying. Thank you for the recipe.",
      "parent": "0",
      "gravatar_hash": "fbe4607375b0690142ede262e3678a68"
    },
    {
      "id": "279",
      "author": "jess white@athriftyfoodie",
      "author_url": "http://athriftyfoodie.wordpress.com",
      "date": "2011-07-12 04:34:00",
      "content": "These look gorgeous, i love pinto beans, very few mexican restaurants serve them these days! could i use barlotti beans instead, they're not readily available where i live.",
      "parent": "0",
      "gravatar_hash": "8ca848d85e0feb897d920d070fadaf43"
    },
    {
      "id": "280",
      "author": "jess white",
      "author_url": "http://athriftyfoodie.wordpress.com",
      "date": "2011-07-12 04:34:00",
      "content": "These look gorgeous, i love pinto beans, very few mexican restaurants serve them these days! could i use barlotti beans instead, they're not readily available where i live.",
      "parent": "0",
      "gravatar_hash": "8ca848d85e0feb897d920d070fadaf43"
    },
    {
      "id": "281",
      "author": "Medifast Coupon",
      "author_url": "http://www.medifasthealth.org/blog/latest-coupon-codes/",
      "date": "2011-07-12 06:15:47",
      "content": "I can't wait to try these Mexican beans, recipe is calling to me to make.  Thanks so much, they look great!",
      "parent": "0",
      "gravatar_hash": "66701c3c718f2af5c2b6ce9cdc0b0b2d"
    },
    {
      "id": "282",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-07-12 07:07:00",
      "content": "Hi Jess - I&#39;m not that familiar with borlotti beans to be able to tell you whether they would make a good substitute. If you try it, please let me know!\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Vegetarian Frijoles Charros - Mexican Cowboy Beans with Smoked Onion - Recipe",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "283",
      "author": "zerrin",
      "author_url": "http://www.giverecipe.com",
      "date": "2011-07-12 07:49:00",
      "content": "Sounds so appealing to me! I have been looking for new ideas with beens. Thanks!",
      "parent": "0",
      "gravatar_hash": "eed46d95dbe550b06a386c72c3242ebc"
    },
    {
      "id": "284",
      "author": "Charissa",
      "author_url": "http://www.colourfulpalate.com",
      "date": "2011-07-12 08:21:31",
      "content": "I've been dreaming of making my own healthy vegan bean dish for a while now.....and you have showed me such a gorgeous photo...I know I will be making some soon! Thanks for the inspiration!",
      "parent": "0",
      "gravatar_hash": "c25eae70376d612c6a2cd79a5fe3130a"
    },
    {
      "id": "285",
      "author": "Nilam",
      "author_url": "",
      "date": "2011-07-25 13:30:55",
      "content": "Thank you for this delicious recipe! I made these with just chipotle peppers (1 and a half to be exact) and a bit (~1 tsp) of adobo sauce. I wanted to comment b/c at first I didn't think it would turn out well, and it's changing the recipe a lot. They lend a subtle smokiness and can be easier than smoking chips. They turned out really spicy and delicious. Pinto beans prepared like these have been a favorite! I served these with your arroz verde recipe. Will add to my future cooking lists!",
      "parent": "0",
      "gravatar_hash": "39a80437f59150fc64ae46179001398a"
    },
    {
      "id": "286",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-07-27 11:18:07",
      "content": "Thanks, Nilam! Chipotles are a nice option if you don&#39;t have time to do the fresh smoking.\n\n\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Hongos en Escabeche - Mushrooms Sauteed with Sherry Vinegar - Recipe",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "25778",
      "author": "zendegy",
      "author_url": "",
      "date": "2012-05-31 15:12:19",
      "content": "I do a lot of Indian cooking, which has introduced me to sooo many amazing spices and pulses and beans...one thing I've found that I quite like to lend smokiness to food is the black (or brown) cardamom. It's an entirely different animal from green cardamom (my favorite flavor of all time!!) - a savory addition to the spice cabinet. Check it out!!",
      "parent": "0",
      "gravatar_hash": "0a2ef63978a789dd1d8911ebf6f4ecae"
    },
    {
      "id": "38006",
      "author": "Angela",
      "author_url": "http://www.bumblelush.blogspot.com",
      "date": "2012-07-16 05:00:50",
      "content": "Thanks for posting this! I have not been able to perfect my refried bean recipe (can't get them to come out as good as grandma's), but maybe I can make this my dish instead.",
      "parent": "0",
      "gravatar_hash": "db470aeb3cfe504f737d786a6682fa23"
    },
    {
      "id": "42267",
      "author": "Scott",
      "author_url": "",
      "date": "2012-07-29 07:07:53",
      "content": "I made these verbatim. Flavor was very good, but they were way too salty with 1TBL. salt. I would start with 1 tspn. and go from there. Other than that, I will definitely make these again.",
      "parent": "0",
      "gravatar_hash": "12661a00561a93ae22d4fa1f497c61c0"
    },
    {
      "id": "42285",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-07-29 08:10:14",
      "content": "Hey Scott - sorry about that! I suspect the issue is that i use Diamond Crystal kosher salt, which weighs around 3 grams / teaspoon, and I'm betting you used Morton's, which is nearly twice as dense. I'll update the recipe to clarify this.",
      "parent": "42267",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "112588",
      "author": "Amy Laney",
      "author_url": "http://www.facebook.com/#!/groups/273324986039710/",
      "date": "2013-02-01 09:27:36",
      "content": "I shared this one on my Facebook food page, Occupy My Plate, to make this weekend with enchiladas (which I'll be doing a variation on your swiss chard and onion recipe so I might put some smoked onion in there too).  My husband is a meat eater so whenever he has the smoker going I always experiment with throwing some of my veg recipes in for a bit.  I definately want to try this stovetop method.  My favorite smoked veggie recipe recently was finishing off my ratatouille in the smoker.  Came out awesome!",
      "parent": "0",
      "gravatar_hash": "1491dfd6058640bbc1f2f178ec30ea7e"
    },
    {
      "id": "168966",
      "author": "adeu",
      "author_url": "",
      "date": "2013-07-02 21:53:16",
      "content": "My mum uses a good alternative to bacon in vegan mexican recipes; fry 100g mushrooms in a 1 TBP Canola Oil, 1/4 tsp Hot Smoked Paprika, 1/8 tsp All Spice and 1/4 tsp Table Salt.  It provides a ready-to-go alternative to bacon that can be stored in the fridge for 3-4 days.\n\nAwesome recipe.",
      "parent": "0",
      "gravatar_hash": "88b3d273fb8c7e4bea80b6317033e310"
    },
    {
      "id": "169072",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-07-03 05:45:10",
      "content": "Interesting!",
      "parent": "168966",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "195607",
      "author": "AimeeG",
      "author_url": "",
      "date": "2013-09-11 18:47:38",
      "content": "My husband made this dish tonight and it came out wonderfully! The smokey taste of the beans really complemented the spicy enchiladas he made with them. We will be making these again!",
      "parent": "0",
      "gravatar_hash": "7e705c812898083236153e5d03bc2b66"
    }
  ]
}