{
  "comment_count": 13,
  "comments": [
    {
      "id": "121300",
      "author": "heather",
      "author_url": "",
      "date": "2013-02-25 09:14:29",
      "content": "this may sound like a silly question, but which way do you cut th shallots? lengthways or across into rounds?",
      "parent": "0",
      "gravatar_hash": "26dbce0ce1b410ebfd1790c972d9779b"
    },
    {
      "id": "121301",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-25 09:17:32",
      "content": "Not silly at all! Across, into rings.",
      "parent": "121300",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "121306",
      "author": "Kris",
      "author_url": "",
      "date": "2013-02-25 09:36:55",
      "content": "Did you see the article on the Banhs in the March issue of Sunset? Includes their cucumber salad recipe w/ shallots fried in a deep pan at 275*. Yum!",
      "parent": "0",
      "gravatar_hash": "157d86ffc3201a66d16cfb159ec8477f"
    },
    {
      "id": "121308",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-25 09:39:59",
      "content": "Nope, I'm not a regular Sunset reader though it always has some beautiful stuff in it. I got to spend a day with Eric and Andrea Nguyen a few months ago, touring restaurants and a small rice noodle factory. Those two seriously know their food.",
      "parent": "121306",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "121323",
      "author": "val",
      "author_url": "http://dinkydoover.blogspot.com/",
      "date": "2013-02-25 11:37:58",
      "content": "Yum--I've been making a lot of cabbage salad inspired by the book Burma, and those shallots so make all the difference. I like this version because I am growing rau ram--and provided it comes back from a harsh winter, I'll need ways to use it.",
      "parent": "0",
      "gravatar_hash": "a617f5bba5ca5cc86f2ab5e7f2a9252e"
    },
    {
      "id": "123531",
      "author": "Vince",
      "author_url": "http://www.codecooker.com",
      "date": "2013-03-03 18:00:55",
      "content": "Michael, I am a big fan of cabbage salads and made this one last night.  It is a taste sensation.  Thanks for sharing it. \n\nBy the way, my partner in educational endeavors just wrote a review of your cookbook for our web site:\n\nwww.literatelearner.com",
      "parent": "0",
      "gravatar_hash": "a555c667b0132490e95034c56047c03d"
    },
    {
      "id": "123724",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-03-04 08:50:36",
      "content": "I'm so glad you liked the salad, and please tell Steve how much I appreciate his review!!",
      "parent": "123531",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "124235",
      "author": "amy@currylime",
      "author_url": "http://www.currylime.com",
      "date": "2013-03-05 11:47:22",
      "content": "This looks so fresh and lovely!",
      "parent": "0",
      "gravatar_hash": "dade4534ba42774757d7b9efe954b8be"
    },
    {
      "id": "125007",
      "author": "Alan",
      "author_url": "",
      "date": "2013-03-08 01:00:07",
      "content": "Michael, I have to be completely honest with you. When I first started reading your blog, my most frequent response was....anger.  I was angry that your recipes featured exotic ingredients (even for me), and that they generally weren't accessible to a financially restricted college student such as myself. The more I sifted through your recipes, however, I discovered that they weren't miles away in terms of being a realistic option for a budget cook with limited time, but just around the corner. You've inspired me to strive for that next culinary step and have shown me just how close it really is.\n\nThis recipe exemplifies just how achievable great cooking is for anyone with a passion for food.  As involved as it appears for a salad, I made this at 2 in the morning (after several adult beverages) with minimal difficulty. Ever better, mine featured a hefty amount of rau ram which I picked up at an Asian market down the street for just over a dollar. After smelling that pot full of beautifully fried shallots, I knew that I had created something beautiful. Thank you for doing what you do.",
      "parent": "0",
      "gravatar_hash": "d0f753456fe05a4807e5e056f3f6dec2"
    },
    {
      "id": "125098",
      "author": "Brandon Elijah Scott",
      "author_url": "http://www.eyeandpen.com",
      "date": "2013-03-08 07:14:53",
      "content": "Great blog, loving this! :)",
      "parent": "0",
      "gravatar_hash": "5e858342c0312750367e1db641b98ce6"
    },
    {
      "id": "125131",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-03-08 09:05:21",
      "content": "Thanks, Alan! I read your comment to one of my kids this morning and her face just lit up. I love what you said, and I hope it inspires other people to step just a little outside of their comfort zone to try new markets and new ingredients that might be a little less familiar, but actually are quite accessible.",
      "parent": "125007",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "172186",
      "author": "sarah",
      "author_url": "",
      "date": "2013-07-11 06:51:57",
      "content": "delicious! I've made this twice and it's a great recipe. The leftovers are especially tasty from marinating in the dressing - personally I add chili flakes to heat up the dressing a little, and add more lime juice, and less salad oil. Really tasty.",
      "parent": "0",
      "gravatar_hash": "6ece7105a5c32b81db70f7e333884253"
    },
    {
      "id": "1189533",
      "author": "Karen",
      "author_url": "http://Karenrubado.com",
      "date": "2014-12-17 00:55:48",
      "content": "This recipe is not only delicious, it's addictive and after reading the comment above I'm really looking forward to lunch!",
      "parent": "0",
      "gravatar_hash": "54dde47ff81d00baa17f418f0728a3c8"
    }
  ]
}