{
  "comment_count": 26,
  "comments": [
    {
      "id": "22591",
      "author": "Marina",
      "author_url": "http://www.picnicatmarina.com",
      "date": "2012-04-09 08:37:03",
      "content": "It is very easy when you see it. Thank you for the video recipe! The only question I have: is it too sweet? I am not a big fan of too much sweet in my food, even desserts, and I always reduce  sugar to 1/3 of recommended amount.  I guess, I have a sugar phobia... :)",
      "parent": "0",
      "gravatar_hash": "8e1565ea2a6e22a58f9d461f2938c35d"
    },
    {
      "id": "22597",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-09 12:54:22",
      "content": "Hey Marina - when it is cooked correctly, it isn't *cloyingly* sweet, but it is definitely sweeter than your typical entree. So it might not be the recipe for you if you have an aversion to that kind of flavor in a savory dish.",
      "parent": "22591",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22626",
      "author": "Tyra",
      "author_url": "",
      "date": "2012-04-10 07:23:00",
      "content": "That looks quite delicious.  Thank you!  Must try soon.  Might make a side of rice to go with it and also a sesame romaine salad which is Korean.  I got the recipe from Ani Phyo who is a raw foodist.  It is so yummy. I'll share:  3 Tbs toasted sesame oil, 1 Tbs tamari, 1 Tbs of liquid sweetener( honey, agave, maple syrup,date syrup) 1/8 tsp Korean chill pepper or cayenne to taste.\nSalad is\" 6 cups bite size crispy romaine pieces and 2 Tbs sliced white onion.  Believe me you will love it.  Enjoy!!!",
      "parent": "0",
      "gravatar_hash": "6abfa421a25081c3a3533d4d7f4e9db1"
    },
    {
      "id": "22652",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-10 21:49:58",
      "content": "That sounds like a tasty salad to me!",
      "parent": "22626",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22786",
      "author": "Jenny@vegetarianhatesvegetables",
      "author_url": "http://vegetarianhatesvegetables.blogspot",
      "date": "2012-04-13 16:40:22",
      "content": "Looks awesome!",
      "parent": "0",
      "gravatar_hash": "efd63fa22c1a4cd1b5e1e7c8fc2b99bb"
    },
    {
      "id": "22825",
      "author": "LunaCafe",
      "author_url": "http://thelunacafe.com",
      "date": "2012-04-14 08:55:44",
      "content": "What a wonderful technique. Love the video. Can't wait to try it. ...Susan",
      "parent": "0",
      "gravatar_hash": "596864910293feaad61045bfae96534c"
    },
    {
      "id": "23532",
      "author": "sarah",
      "author_url": "",
      "date": "2012-05-03 14:20:01",
      "content": "Made this for dinner tonight (just estimated on the measurements) and it was amazing! So easy to make and delicious. Thanks Michael! I can't wait to get your book!",
      "parent": "0",
      "gravatar_hash": "7ad4494dd098d7f48415391b9287a6ad"
    },
    {
      "id": "23640",
      "author": "Patrick",
      "author_url": "",
      "date": "2012-05-06 19:00:26",
      "content": "I made this for dinner tonight. It was terrific.",
      "parent": "0",
      "gravatar_hash": "fb24a1c28fdf757f54e5aa8025082ae1"
    },
    {
      "id": "23641",
      "author": "sophie",
      "author_url": "",
      "date": "2012-05-06 21:30:11",
      "content": "hello,\nthat looks fantastic! i'm just curious as to what type of tofu is used in the recipe? (ie firm, silken, firm silken, soft etc.)\n:)",
      "parent": "0",
      "gravatar_hash": "bd547df061856646e677b3e534304742"
    },
    {
      "id": "23647",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-07 04:29:56",
      "content": "Hi Sophie - you'll want to use extra firm tofu for this or at least firm, so that it can get brown and crisp before you add the sauce.",
      "parent": "23641",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "23682",
      "author": "Anh",
      "author_url": "",
      "date": "2012-05-08 03:09:12",
      "content": "Hi,\nI am a Vietnamese and although I find this dish really fantastic, I don't think it is cooked in Vietnamese way. It may be some other country's cooking method, but not Vietnam's. Especially the caramel sauce, I have never tried anything like that in my home country :(. \nBut again, it looks great :)",
      "parent": "0",
      "gravatar_hash": "f5bde70fc1831c0bf4fe2eb283814299"
    },
    {
      "id": "23683",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-08 04:33:45",
      "content": "I'm surprised you haven't run into it! It is called <em>nuoc mau</em>, you can read more about it here: http://www.vietworldkitchen.com/blog/2007/10/caramel-sauce.html .",
      "parent": "23682",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "24306",
      "author": "Martin",
      "author_url": "",
      "date": "2012-05-22 14:16:41",
      "content": "Made this for dinner and it tasted great - except I only got small amounts of the caramel sauce because I cooked it too long. My wife wasn't on time for dinner and by the time she was there the caramel sauce had turned into rock hard candy. Next time I'll be more careful.",
      "parent": "0",
      "gravatar_hash": "1e79d148a0865365d213cfc6d25f16f6"
    },
    {
      "id": "24399",
      "author": "John",
      "author_url": "",
      "date": "2012-05-23 04:44:58",
      "content": "I've made this two or three times now, and each time I've cut back a bit more on the sugar. I think I'm now using about 1/2 or 1/3 what the recipe calls for. It's still great. Not as sweet, of course, but when even your kids say \"this is good...but I think it could be less sweet,\" it's a message from a higher power that maybe you can cut back on the sugar. Even with the reduced amount, I still get nice caramelization. But I do add a little more liquid at the end so that there's a slightly larger volume of sauce, to make up for the reduced volume of sugar. But everyone in the house agrees \"This one goes into the short rotation!\"",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "38499",
      "author": "Emily",
      "author_url": "",
      "date": "2012-07-17 12:11:00",
      "content": "This is the best tofu I've ever had. It's also my first time trying one of your recipes. It's so delicious, I immediately thought: I need to buy that book! I will be making this one often.",
      "parent": "0",
      "gravatar_hash": "ec8456c63a6afb97cd92d7feacc4bcd7"
    },
    {
      "id": "44953",
      "author": "Jen",
      "author_url": "",
      "date": "2012-08-11 18:36:17",
      "content": "I just made this for dinner (with some substitutions) and it was really easy and delicious! \n\nI fried the tofu in coconut oil in a stainless steel pan. It stuck and didn't work well, next time I'll press it without oil in my grill like I usually do. I didn't have sesame oil so I went without and I added sambal olek. Soooo good!\n\nI have a feeling it would taste good made with just sugar, soy sauce, any vinegar, garlic, and ginger if you don't have the other ingredients on hand. Reminded me of agadashi tofu. \n\nI ate it over rice with spinach.",
      "parent": "0",
      "gravatar_hash": "12e7bd181c924d4462b618dcabe49cac"
    },
    {
      "id": "52262",
      "author": "Kristen | Pixelated Crumb",
      "author_url": "http://pixelatedcrumb.com",
      "date": "2012-09-17 18:33:24",
      "content": "I knew I had to get your cookbook when I saw this recipe. I've had it for a few weeks but we didn't get around to making this dish until tonight and I am so in love. I can't wait to make it again!",
      "parent": "0",
      "gravatar_hash": "6555ca6bfe37e0e2b55da456da24d10b"
    },
    {
      "id": "55382",
      "author": "Joshua Decosta",
      "author_url": "",
      "date": "2012-09-27 10:54:41",
      "content": "Bought your book for this recipe yesterday, tried it out. I was wondering if I am supposed to strain the onions out of it first. I tried it with a non-stick pan and it seemed like the onions ended up rock hard and sticky. Did I do something wrong?",
      "parent": "0",
      "gravatar_hash": "2e33f2fccba283faece7fe3d4949ed56"
    },
    {
      "id": "55384",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-27 11:04:31",
      "content": "Hi Joshua - nope, you don't need to strain the onions out. I think you just cooked the caramel a little too long, until it became like a candy, not sauce. You want it to be a somewhat thick sauce but definitely not that firm. I've also got a video of this recipe: https://vimeo.com/39953289 that might help you see just how to do it - actually in the video I should have cooked it maybe 30 seconds longer.",
      "parent": "55382",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "61194",
      "author": "Becky",
      "author_url": "",
      "date": "2012-10-09 12:11:57",
      "content": "Hey, I've just got to say, I love your recipes. I am transitioning into veganism and I stumbled across your site. This recipe is delicious! I appreciate your use of actual flavor for tofu and not just hiding it in or under something. Thank you for sharing your recipes!",
      "parent": "0",
      "gravatar_hash": "6f65e880c54386d3ff0fee46f47dd90d"
    },
    {
      "id": "61195",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-09 12:14:19",
      "content": "Thanks, Becky, and good luck with your transition! Just let me know if I can help answer any questions etc.",
      "parent": "61194",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "120881",
      "author": "Christine",
      "author_url": "",
      "date": "2013-02-24 12:12:57",
      "content": "Just had to say thank you for showing me how to cook tofu so it is lovely and crispy on the outside and creamy on the inside. Perfect!\n\nPreviously I have either a sloppy mess or a dried out disaster.\n\nI tried soaking it in salt water as you suggest elsewhere on your site. It worked out wonderfully. \n \nThe recipe is a nice balance of heat and sweet :) Love it, and will definitely make it again.",
      "parent": "0",
      "gravatar_hash": "1933215e86515830660b9823aa7c48d3"
    },
    {
      "id": "121044",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-02-24 20:47:05",
      "content": "Oh, good, I'm glad to hear you've mastered the art of pan-frying tofu!",
      "parent": "120881",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "197794",
      "author": "sebastian",
      "author_url": "",
      "date": "2013-09-26 17:08:44",
      "content": "Amazing cooking, in loved off your art :D thank you so much!",
      "parent": "0",
      "gravatar_hash": "e11f336725d0f785a391521116cb0d8f"
    },
    {
      "id": "1204867",
      "author": "Koujokakyuu",
      "author_url": "",
      "date": "2014-12-28 19:08:01",
      "content": "I am in a mixed marriage: one of us is a lifelong vegetarian and the other a meat lover, but we both loved this meal. I subbed Thai kitcheb roasted red chili paste and siracha for the dried chili, which I did not have on hand. I also added cooked, drained rice noodles towards the end. Next time I am cutting the tofu smaller, doubling the green onions, and adding broccoli and red bell peppers for a little more veg.",
      "parent": "0",
      "gravatar_hash": "f67acfc20f5725b402c6789ff1c384c8"
    },
    {
      "id": "1314279",
      "author": "Arielle",
      "author_url": "",
      "date": "2017-03-04 17:00:13",
      "content": "This has become one of my favorite all time recipes and I can't think you enough, Michael, for sharing it with the world.  It is almost insanely delicious.  I am a vegan and my husband is full omnivore and he is crazy for this.  I would not change a thing in this recipe.  It is absolutely perfection.",
      "parent": "0",
      "gravatar_hash": "a2f5c56ab9e21f79c17154cd2220678d"
    }
  ]
}