{
  "comment_count": 16,
  "comments": [
    {
      "id": "2684",
      "author": "Jay",
      "author_url": "http://www.gastrolust.com",
      "date": "2009-03-12 08:48:39",
      "content": "Sounds good. I'll need to compare this to the Long Beans and Tofu Stir Fry recipe recently posted on Serious Eats (<a href=\"http://www.seriouseats.com/recipes/2009/03/dinner-tonight-long-beans-and-tofu-stir-fry-recipe.html).\" rel=\"nofollow\">http://www.seriouseats.com/recipes/2009/03/dinner-tonight-long-beans-and-tofu-stir-fry-recipe.html).</a> Maybe a bean battle next week!",
      "parent": "0",
      "gravatar_hash": "8c2059f47ddb1b7420fa668166fc412c"
    },
    {
      "id": "2685",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-03-12 09:10:10",
      "content": "Vietnamese vs. Chinese bean & tofu battle. Sounds like there will be no\nlosers.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2686",
      "author": "A&amp;N",
      "author_url": "http://reluctantchefs.blogspot.com/",
      "date": "2009-03-12 09:32:15",
      "content": "I did notice the Tofu pieces in the coconut rice post :D Glad you gave the recipe. the picture looks really fresh and lively :)",
      "parent": "0",
      "gravatar_hash": "50de5463f411bb5bad4710eb70af07f3"
    },
    {
      "id": "2687",
      "author": "Dana",
      "author_url": "http://www.danatreat.blogspot.com",
      "date": "2009-03-12 09:41:59",
      "content": "I think I am in a protein deficiency since I am craving tofu constantly.  This is one of my favorite ways to eat it.  Thanks!",
      "parent": "0",
      "gravatar_hash": "7e044150f12fee222a380d0d5f8b717e"
    },
    {
      "id": "2688",
      "author": "Jennifer",
      "author_url": "http://www.slim-shoppin.com",
      "date": "2009-03-12 19:10:48",
      "content": "Green beans are by far my favorite veggie.  I bookmarked this page so I can try this recipe.\n\nI've never worked with lemon grass, so that's kind of exciting to try!",
      "parent": "0",
      "gravatar_hash": "95c3937e7fa0937b94982885a8d5246f"
    },
    {
      "id": "2689",
      "author": "shayna",
      "author_url": "",
      "date": "2010-01-01 12:57:31",
      "content": "I am new to your site and I just stumbled across this recipe. I made it with a brown rice version of the coconut rice  (which I baked ala Alton Brown), it was so good!\n\nI am a new vegetarian; have been eating vegetarian meals but have recently cut out all meat and need all the help I can get with tofu. For the longest time I have been having difficulty browning it. Your tip to have it on the highest heat possible gave me the brilliant idea to use my cast iron pan (which is by far my favorite) and it worked out really awesome! Thanks!",
      "parent": "0",
      "gravatar_hash": "d4cb6a6fd3a56a9add49da89b2f34203"
    },
    {
      "id": "2690",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-01 14:40:29",
      "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\">\nHey Shayna - glad you liked it! You&#39;ll like this article: <a href=\"https://herbivoracious.com//2009/11/my-skillet.html\" rel=\"nofollow\">https://herbivoracious.com//2009/11/my-skillet.html</a>",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2691",
      "author": "john",
      "author_url": "",
      "date": "2011-08-11 17:18:30",
      "content": "Have you tried using mushroom broth for umami?  If you're around a Vietnamese community, you can usually find it alongside the dried meat broths.  (I recently went to an Asian market, and they started a vegetarian section, and it was in there instead, so look around.)\n\nYou have to pay attention to the ingredients to get one that isn't all MSG though.",
      "parent": "0",
      "gravatar_hash": "ffeeea7b8142388a82fbbf0f8b326fbb"
    },
    {
      "id": "2692",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-08-15 08:31:07",
      "content": "Hey John - I haven&#39;t used a mushroom broth powder, but I do often use a broth made by soaking dried shiitakes and it is indeed a wonderful source of umami. Here&#39;s an example use: <a href=\"https://herbivoracious.com//2009/04/soba-in-shoyu-broth-with-asparagus-leeks-and-tofu-recipe.html\" rel=\"nofollow\">https://herbivoracious.com//2009/04/soba-in-shoyu-broth-with-asparagus-leeks-and-tofu-recipe.html</a>\n\n\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Watermelon and Sweet Onion Gazpacho - Recipe",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2693",
      "author": "Mike",
      "author_url": "",
      "date": "2011-10-15 17:34:23",
      "content": "How do you get such a serious char on your tofu? It looks like a new orleans blackened dish. Is there some other trick than to just crank up the gas to max? Actually, i've tried this and it doesn't work too well.",
      "parent": "0",
      "gravatar_hash": "6d147c6fa69951f6a18aa625becd78f6"
    },
    {
      "id": "2694",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-15 17:50:39",
      "content": "Hey Mike - the keys to getting a good char on your tofu are:\n\n\n(1) use extra firm tofu\n(2) pat all the surfaces thoroughly dry\n(3) use a good amount of oil in the pan\n(4) use very high heat\n\n(5) don&#39;t crowd the pan, make sure they have plenty of room, so work in batches if needed\n(6) be patient, don&#39;t keep turning them, wait until they brown, then flip",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "95659",
      "author": "Martha",
      "author_url": "",
      "date": "2012-12-08 06:29:06",
      "content": "This was delicious and now I finally know how to use lemongrass!  I made it once and then thought it would be fun to make it as part of green curry.  I used almost a can of coconut milk and some green curry paste.  I wish I had some lime leaves...BTW, I live in Dubai but I'm from Seattle and coming across your website was a real find.  Thanks!",
      "parent": "0",
      "gravatar_hash": "190816d44535d81ab10ef29ebd34ca2f"
    },
    {
      "id": "95732",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-12-08 08:17:17",
      "content": "Good deal, I'm glad we've got you up to speed on lemongrass now. Dubai must be an interesting place! Glad to have you as a regular on Herbivoracious now.",
      "parent": "95659",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "139007",
      "author": "jigna",
      "author_url": "",
      "date": "2013-04-18 06:37:55",
      "content": "michael - thanks for the great recipe idea. i tried it last night. it looked yum, and tasted almost as just as yum :)\n\ni was a bit disappointed that i barely tasted the lemongrass and wondering if you could give us more specifics on how to make that happen.\n\ni used sesame oil to cook - it has a nice clean flavor.\n\ni also used low fat coconut milk for the rice - which was super, but i added a spoonful of sugar bc the milk was unsweetened. do you recommend any particular type of mile.\n\nas for your tips on getting a good char on the tofu - that worked well - thanks!",
      "parent": "0",
      "gravatar_hash": "403145628e92de5726fc504f02e0e1e8"
    },
    {
      "id": "139028",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-04-18 08:24:29",
      "content": "Hey Jigna - for the lemongrass, you should feel free to use more stalks of it if you want to amp up the flavor. Be sure to bruise it really well and mince it fine, as that is what releases the aromatic compounds. For coconut milk, I like any of the Thai brands. They will all have a preservative (usually sodium benzoate), but I avoid ones with any thickeners. I do prefer full fat myself, but the low fat can be ok.",
      "parent": "139007",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "139031",
      "author": "jigna",
      "author_url": "",
      "date": "2013-04-18 08:37:26",
      "content": "hi michael - thanks for the speedy response and tips! \n\nbtw - ever since i came upon your site from a google search for a lemongrass tofu recipe, i have been perusing through every inch of it for ideas - you're very innovative and yummy - i'll be sure to have licked the site clean in no time :)\n\nthanks again!\n\nps - loved your post on amanda cohen's cookbook as well as her post on you :)",
      "parent": "0",
      "gravatar_hash": "403145628e92de5726fc504f02e0e1e8"
    }
  ]
}