{
  "comment_count": 14,
  "comments": [
    {
      "id": "150319",
      "author": "Liz @ EatingPlaces",
      "author_url": "http://www.eatingplaces.wordpress.com",
      "date": "2013-05-22 06:14:31",
      "content": "I love these! When we make them we set up an assembly line with different people at each station. So yummy and perfect for the summer. A note about your serving sizes - I've been known to have 5 or 6 as a meal, but I might just like them a little too much ;)",
      "parent": "0",
      "gravatar_hash": "ef9fc6c4c9f605ad45cbb9eae1105ee1"
    },
    {
      "id": "150324",
      "author": "Talya B",
      "author_url": "",
      "date": "2013-05-22 06:19:24",
      "content": "Once you've got the hang of these, they can be made very quickly. I made a very similar version today, for my lunch and my kids' packed lunches. I made peanut sauce and prepped yesterday evening, soaked the (mung bean) vermicelli while I had a shower this morning, assembled the kids' rolls while they had breakfast and mine in my lunchbreak. And we often have them for a weeknight dinner - I prep while everyone does homework, but we all roll our own at the table as we eat. Healthy, tasty and fun. I buy tofu already fried.",
      "parent": "0",
      "gravatar_hash": "4043ab0a9e73c1c81bd863d33f10b053"
    },
    {
      "id": "150329",
      "author": "John",
      "author_url": "",
      "date": "2013-05-22 06:22:34",
      "content": "I love these things. And I like you dipping sauce recipe -- definitely will get added to our list of things to make. This recipe is also one where too many cooks is a good thing -- the prep work can be easily done by 4 or 5 people working together, although it helps to have a couple of cutting boards. And the assembly is similar -- much easier with several hands. \n\nWhen I make these, I do it on a plate that's a little larger than the wrapper. The plate ends up wet, which helps soften the wrappers, but also helps contain the mess. I also use moderately warm water rather than hot, and it seems to work fine. \n\nFinally, in our household we like to add either shredded basil or whole thai-basil leaves, perhaps as an alternative to the mint that you use.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "150358",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-22 07:46:16",
      "content": "Very good point about letting everyone roll their own at the table. Good fun, and it makes it a lot faster too. Plus with kids they can customize which ingredients they like, which is always a plus.",
      "parent": "150324",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "150359",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-22 07:47:06",
      "content": "The assembly line is a good approach too! If you have enough hands to make short work of the job, that is all to the good. Yeah - I could probably eat that many and call it dinner too.",
      "parent": "150319",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "150392",
      "author": "Miro - Dose of Dash",
      "author_url": "http://doseofdash.com",
      "date": "2013-05-22 10:53:34",
      "content": "Yum! I learned how to make something similar last year. Spring rolls always looks so fancy but they're not hard at all once you get the hang of it. Excited to try your recipe!!",
      "parent": "0",
      "gravatar_hash": "8f5ec42b07bdf83b3868474164b1fe1e"
    },
    {
      "id": "150417",
      "author": "Irina @ wandercrush",
      "author_url": "http://www.wander-crush.com",
      "date": "2013-05-22 13:42:51",
      "content": "Lovely! There's nothing quite as refreshing as vietnamese spring rolls on a sunny day.",
      "parent": "0",
      "gravatar_hash": "1e179180d2834b59edc664ddb2c508a5"
    },
    {
      "id": "150838",
      "author": "Maria Zimmerman",
      "author_url": "http://www.whoamaria.com/",
      "date": "2013-05-23 20:26:59",
      "content": "Loyal follower first time commenter.... It is so serendipitous that you posted a spring roll recipe. I was just about to make some tonight. I was going to make a peanut sauce for it, but I just so happen to have some chili sauce base I could use to try yours.",
      "parent": "0",
      "gravatar_hash": "9b16431995c8ed580a9b4107eedd1e52"
    },
    {
      "id": "150860",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-23 21:51:02",
      "content": "Thanks for taking the time to comment! Let me know what you think of the sauce. I love the peanut sauce too, but I can't make it at my house b/c my wife is allergic. Maybe I could do it with sunflower butter.",
      "parent": "150838",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "151070",
      "author": "Ava",
      "author_url": "http://www.distancelearning.com/universities/",
      "date": "2013-05-24 05:57:49",
      "content": "I can't wait to grab all the ingredients, thinking about adding a slice of ripe mango (California maki style) hmmm. Thanks for sharing this easy Vietnamese recipe!",
      "parent": "0",
      "gravatar_hash": "c0d8f0d4835b8f1f30d674b0a992fb1b"
    },
    {
      "id": "151108",
      "author": "Richard",
      "author_url": "http://crockpotslowcooker.org/",
      "date": "2013-05-24 07:22:00",
      "content": "These are so tasty. When I make them they just don't come out so perfectly round and wonderful (like you have them). The taste is incredible and thanks for the sauce. I've used peanut sauce or Thai red sauce, so this is a nice new addition. Thanks so much.",
      "parent": "0",
      "gravatar_hash": "b870c31bb9b38f956a3967961ed4cbde"
    },
    {
      "id": "151496",
      "author": "Janie",
      "author_url": "http://hedgecombers.com/",
      "date": "2013-05-25 05:21:02",
      "content": "They look utterly divine. I've never worked with rice paper before, it is now on the shopping list.\n\nIt is my first time visiting your site, and I'm hooked! I hope you don't mind a non veggie visiting.\n\nJanie x",
      "parent": "0",
      "gravatar_hash": "0ffd67cb46ced44d17550366333e91a1"
    },
    {
      "id": "151547",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-25 07:08:29",
      "content": "Thanks, Janie! I think a lot of my readers aren't vegetarians - one time when I asked I think it is around 50% or more. Everyone needs to eat their veggies :)!",
      "parent": "151496",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "152150",
      "author": "Marie",
      "author_url": "http://www.cautiousvegetrian.ca",
      "date": "2013-05-27 00:55:19",
      "content": "These are delicious.  I usually have peanut sauce with mine, but really liked your sauce idea.  Thanks for this yummy recipe.",
      "parent": "0",
      "gravatar_hash": "c46e220ba0b6d58655076db68daf5490"
    }
  ]
}