{
  "comment_count": 20,
  "comments": [
    {
      "id": "53",
      "author": "Jenni",
      "author_url": "http://theplumpalate.com",
      "date": "2011-10-21 17:12:24",
      "content": "I discovered the child slave labor-chocolate link a couple of years ago and have refused anything but fair trade chocolate ever since. Carol Off's book Bitter Chocolate is a fantastic investigative and very readable book on this subject. I tweeted you the link. Thanks for bringing attention to this issue.",
      "parent": "0",
      "gravatar_hash": "cb94b0c2a32a4fdf3c6917aff1c48f84"
    },
    {
      "id": "54",
      "author": "Justin",
      "author_url": "",
      "date": "2011-10-21 18:40:26",
      "content": "I've been buying fair trade coffee for years but for some reason chocolate was not on my radar (probably because I buy a lot less of it than coffee). Thanks for the info - our family is going to try to switch over to fair trade chocolate!",
      "parent": "0",
      "gravatar_hash": "0f0e2ae9432ecb6d458f1a10274665d9"
    },
    {
      "id": "55",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-21 19:06:37",
      "content": "Thanks, Jenni! All - here is the book Jenni is talking about: <a href=\"http://amzn.to/qrKxea \" rel=\"nofollow\">http://amzn.to/qrKxea </a>",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "56",
      "author": "Kathleen",
      "author_url": "",
      "date": "2011-10-21 20:15:47",
      "content": "What will you hand out for Halloween?  I've been debating about this and would love to hear your ideas.  It seems just about any huge, commercial, conventional product these days involves some form or another of enslavement.  It's so sad.  I agree with you about the power of money to change things, and I vote with my dollars this way, too.",
      "parent": "0",
      "gravatar_hash": "1ea4b5a6e347e926817bc6696a576065"
    },
    {
      "id": "57",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-21 20:30:01",
      "content": "Hey Kathleen - here are a couple of ethically traded brands that make mini chocolate bars which would work for Halloween: <a href=\"http://amzn.to/rcvTaS\" rel=\"nofollow\">http://amzn.to/rcvTaS</a> and <a href=\"http://bit.ly/qRvgA0\" rel=\"nofollow\">http://bit.ly/qRvgA0</a> - and then of course there is always the option of non-chocolate candies. \n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Was Your Chocolate Made with Child Slave Labor?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "58",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-21 20:34:48",
      "content": "Actually, there is a better deal on one of those chocolates direct from the manufacturer in Halloween worthy quantities: <a href=\"http://bit.ly/nlnBuW\" rel=\"nofollow\">http://bit.ly/nlnBuW</a>\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Was Your Chocolate Made with Child Slave Labor?\n\n\n\n\n\n\n\nOn Fri, Oct 21, 2011 at 8:29 PM, Michael Natkin &lt;michaelnatkin@gmail.com&gt; wrote:\nHey Kathleen - here are a couple of ethically traded brands that make mini chocolate bars which would work for Halloween: <a href=\"http://amzn.to/rcvTaS\" rel=\"nofollow\">http://amzn.to/rcvTaS</a> and <a href=\"http://bit.ly/qRvgA0\" rel=\"nofollow\">http://bit.ly/qRvgA0</a> - and then of course there is always the option of non-chocolate candies. \n\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\n\nThe latest from my blog, Herbivoracious:  Was Your Chocolate Made with Child Slave Labor?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "59",
      "author": "Terri Sue",
      "author_url": "",
      "date": "2011-10-22 14:45:34",
      "content": "i have known of tis dor years but do not have a blog platform to speak from , though our friends and family know where my husband and i stand.  years ago we started buying only fair trade coffee, chocolate, sugar and tea.  while the child slave labor is only as i know it in the chocolate, the other luxeries i named all come at a high price also, if you don't know your sources.  the paltry wages that men and women get for picking these luxuries that we can buy so cheaply is appalling.  my husband and i do not have a very large income.  in fact we are lower middle class.  so if we can't afford to buy fair trade coffee we don't have coffee in the morning.  i might add here we are both addicted to our morning cup of coffee.  yet how can i drink say folgers and know that somewhere someone is working a long day seven days a week and can't afford to feed his children, or get medical care, or send them to school.  so if we can't afford fair trade, we can't afford it.  they really are luxuries after all.",
      "parent": "0",
      "gravatar_hash": "7d46e820da4e4b67e39dfcad03e5448d"
    },
    {
      "id": "60",
      "author": "angela@spinachtiger",
      "author_url": "http://www.spinachtiger.com",
      "date": "2011-10-23 06:00:23",
      "content": "Thank you for bringing this to my attention. Chocolate sugar and coffee are luxuries and we can eat less of them and do what is right in this world. I often lie sleepless at night knowing how good I have it and that this is not true for many children (and adults) in this world. I have a special heart for children and I will indeed pay attention. We have some chocolate makers here in my town and I think I will just support them as much as I can.",
      "parent": "0",
      "gravatar_hash": "813dc67a9d1df4ad31a84c463c10c4af"
    },
    {
      "id": "61",
      "author": "Carol",
      "author_url": "http://thenotquitevegan.wordpress.com",
      "date": "2011-10-23 13:26:50",
      "content": "Thanks for bringing this issue to light! I have known about this for a few years now. I wrote an article about it in college, about 6 years ago. I think it's something that most people don't think about or know about. Usually we buy fair trade chocolate, but I often forget about it when I'm buying chocolate chips, for instance, for baking something. Thanks for the reminder!",
      "parent": "0",
      "gravatar_hash": "4dd39f6aa153115f4cd5ebf6d27fd435"
    },
    {
      "id": "62",
      "author": "ben",
      "author_url": "",
      "date": "2011-10-24 04:10:58",
      "content": "excellent post michael! Thanks, we all need awareness. and we can make a statement by what and where we buy. may your life be enriched! I will certainly be more aware of where the chocolate comes from that i buy, and other products too!\n\nthanks,\n\nben",
      "parent": "0",
      "gravatar_hash": "825a1e4c2a61919d1de8623b92eeed1d"
    },
    {
      "id": "63",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-24 07:28:16",
      "content": "Thanks, Ben - I know this is outside of the sort of think I usually post, good to know it ok with the regulars! I ordered myself 3 kilos of a fair trade variety from Valrhona last night, that should keep me pretty happy :)\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Braised Fennel - Recipe",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "64",
      "author": "Kathleen",
      "author_url": "",
      "date": "2011-10-24 09:46:33",
      "content": "Thanks for those links, Michael!",
      "parent": "0",
      "gravatar_hash": "1ea4b5a6e347e926817bc6696a576065"
    },
    {
      "id": "65",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-24 10:49:15",
      "content": "Hey Terri Sue - thanks for your note. I admire your degree of commitment. And I&#39;ve noticed this many times in life, that those who don&#39;t have very much often make bigger commitments and sacrifices than those who have everything.\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Braised Fennel - Recipe",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "66",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-24 10:52:06",
      "content": "Thanks for the note, Angela. I think just allowing yourself to be open to the empathy towards other people even when it seems like the problems are too big to solve is such an important first step, and makes it seem like these relatively simple choices to pay attention to what we buy are the very least we can do!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "67",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-24 10:53:51",
      "content": "Thanks Carole Anne! You are so right about how easy it is to let little things slip by the wayside.\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Braised Fennel - Recipe",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "68",
      "author": "Heather",
      "author_url": "",
      "date": "2011-10-24 18:45:05",
      "content": "Hello!\n\nAlso, I recently found Annie's bunny fruit snacks in 24 packs for Halloween - even better b/c they're a nice treat but not quite candy. <a href=\"http://www.annies.com/bunny-fruit\" rel=\"nofollow\">http://www.annies.com/bunny-fruit</a>",
      "parent": "0",
      "gravatar_hash": "8d19b1f0af13c62f82aca7401f339b8b"
    },
    {
      "id": "69",
      "author": "Terri Sue",
      "author_url": "",
      "date": "2011-10-25 07:54:24",
      "content": "a note to carol. as far as chocolate for baking i have found an excellent resource,\nchocosphere.com\nyou can get unsweetened cocoa, bittersweet chocolate, and unsweetened chocolate bars all fair trade and organic.  they also have dark chocolate cookie chips just fair trade.\nthey are just a slight bit sweeter than a semi-sweet, but i have as yet to find a fair trade semi-sweet.  i believe they also have the others i mentioned just fair trade, but i tend to go with organic if it is available.  chocosphere also has fair trade chocolate candy bars.  several years ago we bought bulk in every section.  now fall or spring i might need to buy one thing.  just don't buy in the summer. lol!",
      "parent": "0",
      "gravatar_hash": "7d46e820da4e4b67e39dfcad03e5448d"
    },
    {
      "id": "70",
      "author": "Jennifer @ Raisin Questions",
      "author_url": "http://raisinquestions.wordpress.com",
      "date": "2011-10-25 18:15:41",
      "content": "Thanks for the interesting post. I agree that awareness of social justice in all things is important. One of the biggest problems I think regarding chocolate is that most often cocoa-producing countries such as the Ivory Coast only have a place in the global market with raw products. The premium charged for your finished, even fair trade, chocolate does not go back to the original producers but to Western chocolatiers. Even while there could be no chocolate without cocoa, the farmers who make it possible are not properly rewarded, neither directly nor indirectly through profits returned to their countries through manufacturing. There is a chocolate company called Omanhene chocolate (<a href=\"http://omanhene.com/)\" rel=\"nofollow\">http://omanhene.com/)</a> that I think addresses this underlying social justice issue through their \"beyond fair trade\" policy. The chocolate is delicious to boot! I really recommend it! I think it's important to remember that many companies in countries where child labor is an issue also need the economic investment of consumers to whom they export goods in order to pull themselves out of the cycle of poverty and underdevelopment... and there are companies that deserve our support!",
      "parent": "0",
      "gravatar_hash": "a21cf4044023be15475d6379ecaed26f"
    },
    {
      "id": "71",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-10-31 19:16:16",
      "content": "That&#39;s interesting, Jennifer. My understanding was that Fair Trade certification does require an elevated level of payment to the farmer, though of course there can be companies that go even above and beyond the requirement.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "59665",
      "author": "Shelly Owen",
      "author_url": "",
      "date": "2012-10-04 16:31:14",
      "content": "I want to take a strong stand against this also. I want to be responsible in finding out the source of the chocolate I purchase. Thank you for the information.",
      "parent": "0",
      "gravatar_hash": "e8c8b1bcd11fb782168588e737185669"
    }
  ]
}