{
  "comment_count": 12,
  "comments": [
    {
      "id": "221",
      "author": "The Green Beet",
      "author_url": "http://www.thegreenbeet.com",
      "date": "2011-08-15 17:26:50",
      "content": "Painful when the recipe doesn't do justice to the flavor of the food. :) This soup sounds perfect for Summer. Thanks for sharing your inventive recipes!",
      "parent": "0",
      "gravatar_hash": "bcc2dbdae5e656388616702df1953b35"
    },
    {
      "id": "222",
      "author": "Tres Delicious",
      "author_url": "http://www.myfudo.com",
      "date": "2011-08-17 02:38:54",
      "content": "never tried this soup before but it looks delicious. This is a must try. Love your photo.",
      "parent": "0",
      "gravatar_hash": "735aac1e27d263ce746da7afe4fb3e64"
    },
    {
      "id": "223",
      "author": "Sam @ H.V.R.",
      "author_url": "http://www.healthyveganrecipes.net",
      "date": "2011-08-17 05:21:45",
      "content": "This is a pretty interesting recipe because of the watermelon... :) The photo made me want to try it now, too! :)",
      "parent": "0",
      "gravatar_hash": "dff8ad0cfd7df559957ab85da1d102ea"
    },
    {
      "id": "224",
      "author": "Lee Craft Table",
      "author_url": "http://leecrafts.blogspot.com/",
      "date": "2011-08-19 10:06:46",
      "content": "Sounds great! The sweetness from the melon and the heat from the peppers would work well together. Never really had cold soups though. I know, not even gazpacho (which I think is a sin since I love to cook and love food.)\n\nThanks for the recipe!\n\nCrystal Lee\nThe Lee Craft Table\n<a href=\"http://leecrafts.blogspot.com/\" rel=\"nofollow\">http://leecrafts.blogspot.com/</a>",
      "parent": "0",
      "gravatar_hash": "8aebefbf703bcfb78b6ff19b0bcecc39"
    },
    {
      "id": "225",
      "author": "ben",
      "author_url": "",
      "date": "2011-08-20 19:37:34",
      "content": "Michael, you've done it again!  even my mother who does not like watermelon asked for more! The others all enjoyed it too. One even writing down the recipe. I'll send her the link too, one can never have too many followers!\n\nBy the way, i didn't use the \"gum\" it seemed like why use an additive (well, i understand why). it didn't hurt to have a delicious watermelon to make it with. great flavors.\n\noh, i also made the chickpea cakes and the tomato jam (i hope those titles are correct). They were so good last year when i made them and they were enjoyed just as much this time.\n\nThanks again for another delicious creation.\n\nben",
      "parent": "0",
      "gravatar_hash": "825a1e4c2a61919d1de8623b92eeed1d"
    },
    {
      "id": "226",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-08-21 07:45:21",
      "content": "Thanks, Ben! I&#39;m glad your mom liked it, too.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "227",
      "author": "VRecipes",
      "author_url": "http://profile.typepad.com/vrecipes",
      "date": "2011-08-21 10:08:48",
      "content": "I love the idea to use xanthan gum -- I didn't know it was readily available, and it would be so handy to keep things blended. Thanks for the tip!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "228",
      "author": "Nordic Track Nate",
      "author_url": "http://www.nordictrackcoupons.com",
      "date": "2011-09-23 11:47:05",
      "content": "My wife loves gazpacho and always wants to make it, but I hate tomatos so we never do. But I do love watermelon, so this will be perfect! She will be so impressed! Thank you for sharing this recipe, I cannot wait to try it out tonight!",
      "parent": "0",
      "gravatar_hash": "1c7af15a3f8fffc9ceb28da1b69a73f3"
    },
    {
      "id": "161034",
      "author": "John",
      "author_url": "",
      "date": "2013-06-18 17:41:13",
      "content": "Loved this. Made it without the xanthan, and it was a bit too watery; next time, I'd include the xanthan. I also used more avocado (about a whole small avocado). And while I really liked the flavor overall, I tried a small addition once I'd eaten half: I tossed in a little generic chili powder (i.e., the stuff you make \"chili con carne\" with, not the stuff called \"chili\" in some indian cookbooks, which is more like Cayenne). The amount I used was probably the equivalent of 1.5t in the whole recipe. I found I really liked the addition. I was also instructed that \"This goes on the 'things to make all summer' list, John!\" by my wife, so I guess she agrees. :)",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "161061",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-06-18 18:49:18",
      "content": "The chili powder sounds like a nice addition. I know exactly the stuff you mean. Xanthan is great for things like this where you just want to reduce syneresis without thickening it unduly.",
      "parent": "161034",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "173581",
      "author": "John",
      "author_url": "",
      "date": "2013-07-14 11:29:54",
      "content": "I've made it twice more now. I think that for a single batch, I'd add about 1t - 1T Chili powder, depending on taste. I also found that by putting about 1/3 of the stuff in the blender and running it (on low speed), with the blender top open, I could sprinkle in the salt/xanthan nicely so that there was no \"clumping\". \n\nOne more thought: although I really liked this, I found it too sweet. I think I might try adding a cucumber next time just to reduce the concentration of sweetness; if I did so, it'd go in last, and get relatively little blending, so it'd retain some \"crunch\" as well.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "174296",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-07-16 11:00:36",
      "content": "Those variations all sound great to me! And yes, hydrating the xanthan by sprinkling it into the vortex of the running blender is a great way to do it.",
      "parent": "173581",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}