{
  "comment_count": 9,
  "comments": [
    {
      "id": "1471",
      "author": "redman",
      "author_url": "",
      "date": "2010-01-28 09:49:56",
      "content": "I think amuses have gotten totally out of whack for the reasons you describe.  classically they were always something a touch salty or a touch sour- to not just amuse the palate but to excite it, literally to make the mouth water and get your body thinking it's time to eat to make you appreciate even more what was to come.  they would not have been based on something fatty, since that only serves to tire the palate.  now chefs interpret it as a fancy little dish, and they try to fancy it up with all sorts of inappropriate things.  I ate at a certain Seattle French restaurant in which they serve a platter of several amuse, including a demitasse of soup based upon foie gras.  luxurious perhaps, but totally inappropriate.",
      "parent": "0",
      "gravatar_hash": "70ef388fbf05eb453271997925a8d650"
    },
    {
      "id": "1472",
      "author": "zerrin",
      "author_url": "http://www.giverecipe.com",
      "date": "2010-01-28 14:33:20",
      "content": "Thanks for explaining what an amuse is. Is it served just in a spoon as in the picture here? It's not a part of our cuisine. So I don't know much about it. But as you say, we alwayslearn a lot through our experiments. And the picture above is still so stunning!",
      "parent": "0",
      "gravatar_hash": "eed46d95dbe550b06a386c72c3242ebc"
    },
    {
      "id": "1473",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-28 14:42:28",
      "content": "@zerrin - An amuse isn&#39;t necessarily served in a spoon; it could just as well be on a bit of bread or right on a plate with a small fork, or even a shot glass. But the spoon presentation is very popular. Some folks make special &quot;amuse bouche spoons&quot;, but they are the soup spoons used at many Asian restaurants work great and are available very inexpensively.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1474",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-01-28 15:32:13",
      "content": "@Paul - &quot;a platter of several amuse&quot; ?!? I agree, that just seems wrong for any sort of traditional French meal. Taken to the extreme, you can have a meal that is essentially nothing but a series of amuse, like the 30+ courses you would have at Alinea or El Bulli. But in the context of a &quot;normal&quot; meal, it sounds both too precious and too filling.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1475",
      "author": "Cajun Chef Ryan",
      "author_url": "http://cajunchefryan.rymocs.com/blog2/",
      "date": "2010-01-29 04:52:51",
      "content": "And the great thing about experimentation is learning from them and making small changes to improve, in the process you learn a lot about the ingredients and your style and technique!",
      "parent": "0",
      "gravatar_hash": "9f3b5ef4294bafb575b419690b0d278d"
    },
    {
      "id": "1476",
      "author": "Jami Moss Wise",
      "author_url": "http://www.thenewlyfeds.blogspot.com",
      "date": "2010-01-29 15:51:33",
      "content": "Thanks for posting your failures too--these happen to all of us and they can be so useful!",
      "parent": "0",
      "gravatar_hash": "4a664421ac28ea4627d5e5319c396ed0"
    },
    {
      "id": "1477",
      "author": "Carsten",
      "author_url": "http://www.tasteandshare.com",
      "date": "2010-01-29 17:54:17",
      "content": "Hi, take it easy, we all fail sometimes. I just re-tweeted this post. If you like, connect with us on <a href=\"http://TASTEandSHARE.com\" rel=\"nofollow\">http://TASTEandSHARE.com</a>",
      "parent": "0",
      "gravatar_hash": "4772f704e37837049b9175aec4c7d92a"
    },
    {
      "id": "1478",
      "author": "Deborah Soffel",
      "author_url": "http://grapesandgreens.blogspot.com/",
      "date": "2010-01-30 17:54:12",
      "content": "It seems to me that the five ingredients you chose for your amuse each have such a distinct personality that they would inevitably clash. everything was pulling in a different direction. Perhaps if you had limited the palate to two main players like kumquat and mint, and then filled in with supporting players (like chopping them up and tossing them with some couscous and then rolling it up in a lettuce leaf and drizzling it with a kumquat infused simple syrup) you would have had a hit.",
      "parent": "0",
      "gravatar_hash": "352796ee244fa395788f9284c2dbed82"
    },
    {
      "id": "1479",
      "author": "French Cooking for Dummies",
      "author_url": "http://frenchcookingfordummies.com",
      "date": "2010-01-31 15:41:48",
      "content": "There has to be a way to make this amuse bouche work, flavor combination sounds amazing! I would try mixing cream cheese with a lot of mint and kumquat juice and top it with a tiny dice of avocado, green onion and jalapeno pieces.\nI posted a very similar amuse bouche spoon recipe not long ago. My avocado cream was served with grapefruit and crab <a href=\"http://ow.ly/1mPIjC\" rel=\"nofollow\">http://ow.ly/1mPIjC</a>",
      "parent": "0",
      "gravatar_hash": "3c6dd7eca0c8207646e0391865b528c4"
    }
  ]
}