{
  "comment_count": 9,
  "comments": [
    {
      "id": "173280",
      "author": "Jill, The Veggie Queen",
      "author_url": "http://www.theveggiequeen.com",
      "date": "2013-07-13 16:52:22",
      "content": "I have not made this dish but I can tell you how long it would take to cook dried , soaked flat favas or marrowfat beans in the pressure cooker. My best estimate is that they would take between 6 and 8 minutes at pressure. I would add 3/4 to 1 cup water for each cup of dried beans that have been soaked. It most likely be about 2 1/2 cups water total to cook.\n\nIf you ever want to know more about pressure cooking, I am your go-to person. I have been teaching pressure cooking for more than 17 years. All the info is also in my book The New Fast Food which has all pressure cooking recipes.\n\nI love cooking beans. Thanks for sharing this recipe.",
      "parent": "0",
      "gravatar_hash": "e918dad880e60ff08b80eda51d7e2b0c"
    },
    {
      "id": "173588",
      "author": "Erik P.",
      "author_url": "",
      "date": "2013-07-14 12:01:58",
      "content": "Those are tricky sounds to describe for an English speaker. The closest I can easily get is \"cup ee siners\".",
      "parent": "0",
      "gravatar_hash": "de9cd458b335ab8818467060e6d51769"
    },
    {
      "id": "173592",
      "author": "Razzy 7",
      "author_url": "",
      "date": "2013-07-14 12:32:07",
      "content": "Jill, thanks for posting pressure cooking instructions for flat favas and marrowfat beans. I think Michael’s recipe looks and sounds delicious. I’m eager to try it using a pressure cooker. \n\nI also want to second what Jill said about her being a go-to person for info about pressure cooking. She definitely is my go-to pressure cooking expert.  I own more than 50 pressure cooking cookbooks and I refer to Jill’s more often than any I own. Her recipes are wonderful and it’s a great reference as well. \n\nMichael’s Herbivoracious (which I also own) and Jill Nussinow’s The New Fast Food are two books that are well-worth owning.",
      "parent": "0",
      "gravatar_hash": "1208f8137b244fb0b70078499336f898"
    },
    {
      "id": "173729",
      "author": "Melané Botha",
      "author_url": "http://melsmilieu.wordpress.com",
      "date": "2013-07-15 00:30:28",
      "content": "Hi I finally learned the English word for kapucijner. Literally translated it wou like d mean Capuchin like the monks. What interest me is the fact you say they are brown whereas here in Holland they are definitely grey-green.  Rarely eaten in soup but cooked and then doused with rendered smoked pork fat and eaten with chopped gherkins, fried and chopped  raw onions, picallilly and the crispy pork rins, the whole is called a  captain's dinner. Definitely winter food!\nHowever when you say soup my thoughts turn to a hearty brown bean version of the traditiional pea soup but NOT vegetarian and a whole different ball game altogether. Having said all this I'm going for your recipe it looks grest:-)",
      "parent": "0",
      "gravatar_hash": "2dd3f559847e8a18c815b448e14150ea"
    },
    {
      "id": "173966",
      "author": "Irina @ wandercrush",
      "author_url": "http://www.wander-crush.com",
      "date": "2013-07-15 17:44:49",
      "content": "I love the idea of Ful Medames and always felt like it would be one of those foods I'd fall instantly in love with if I went to Egypt. Might start with this recipe, though! ;)",
      "parent": "0",
      "gravatar_hash": "1e179180d2834b59edc664ddb2c508a5"
    },
    {
      "id": "175471",
      "author": "David Hogman",
      "author_url": "http://www.foodonclick.com",
      "date": "2013-07-19 02:19:13",
      "content": "healthy and filling..looks delicious. Thanks for sharing",
      "parent": "0",
      "gravatar_hash": "57fb9684fe36721affa8b20e724372d2"
    },
    {
      "id": "907477",
      "author": "Demet Guzey",
      "author_url": "",
      "date": "2014-05-14 13:07:32",
      "content": "Believe me, I have never had them served in holland looking so appealing. This is usually served as a side dish made with with bacon, onions and other vegetables to make the menu sound more sophisticated, as many people don't know what kapucijners are. Well they also don't know how to make good cappuccinos but that's another story!",
      "parent": "0",
      "gravatar_hash": "76973b7027c414cb575a9f8735411e0a"
    },
    {
      "id": "908076",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-05-15 05:42:02",
      "content": "Thanks, Demet! That's interesting to know that they aren't especially well known even on their home turf.",
      "parent": "907477",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1314312",
      "author": "Miekelien",
      "author_url": "",
      "date": "2017-05-24 14:44:54",
      "content": "I'm from the Northern part of the Netherlands. We called de kapucijners 'raasdonders'; they tend to effect some flatulation :)\n\nAn old maritime tradition, but we had it at home too:\n\"Captain's dinner\"\nIt consisted of; \n\ncooked kapucijners, slices of potatoes &amp; onion rings, fried in butter (gebakken aardappelen met uitjes), lettuce salad garnished with tomatoes, domino's size pieces of layered, cured pork, fried in butter, sweet/sauer (zoet zuur) gherkins,",
      "parent": "0",
      "gravatar_hash": "1e343b9ffc102287e3d88a3d74f2f46d"
    }
  ]
}