{
  "comment_count": 293,
  "comments": [
    {
      "id": "2195",
      "author": "sig",
      "author_url": "http://blog.sigsiv.com",
      "date": "2009-07-06 08:45:42",
      "content": "I am a carnivore to the core. But I have to say that this is one of the very few articles on this topic (that I've read) that comes across as honest and completely non-judgemental.  Very well-written!",
      "parent": "0",
      "gravatar_hash": "7a78d583fe079079ffda9ec79f301d57"
    },
    {
      "id": "2196",
      "author": "Ellen",
      "author_url": "",
      "date": "2009-07-06 09:17:13",
      "content": "i'm mostly vegan, but i eat meat/fish on occasion. i was a lacto-ovo vegetarian for awhile when i found out that i was allergic to eggs, dairy and soy. obviously, that made me a vegan that couldn't even eat most vegan meals! i love food too much to go there. my diet is isolating enough as it is that i've had to make sacrifices. in my ideal world, the animal sources of protein would come from sustainable seafood and humanely raised whole chickens.\n\ni think any efforts to cut out animal products is commendable, whether it is eating less meat, better meat, no meat, no animal products, etc. thanks for sharing your thoughts!",
      "parent": "0",
      "gravatar_hash": "458ac01b003f1a3d7211aae8e16a9b16"
    },
    {
      "id": "2197",
      "author": "Chris",
      "author_url": "http://www.weheartfood.com",
      "date": "2009-07-06 10:12:21",
      "content": "Omnivore, though we probably cook about 50% vegetarian meals.  Echoing sig's kudos on the honesty and lack of judgement.  I have to admit, however, that I chuckle/sigh at a couple vegetarians I know who don't eat meat \"for health reasons\" and eat nothing but pizza, macaroni & cheese, and alfredo sauce.  Mmmmm, healthy.\n\nRE: Vegetarian meals/menus in general, I much, much prefer meals that don't use \"meat substitutes\" and that just simply showcase the veggies themselves.  I've always wondered who the intended clientele are at vegetarian restaurants like Bamboo Garden that serve Kung Pao \"Chicken\" or \"Beef\" Fried Rice -- recent converts to going veg?  Who else would crave that stuff?  Anyway...\n\nAs for rattling off the URL, might want to use a URL shortener first.  ;)",
      "parent": "0",
      "gravatar_hash": "73da1a4df67b2ba1fda7724385c68d1d"
    },
    {
      "id": "2198",
      "author": "Heidi",
      "author_url": "http://peacockmodern.blogspot.com",
      "date": "2009-07-06 10:43:06",
      "content": "Very well put - I agree on all points. I became a vegetarian about 21 years ago for all of the same reasons, although I occasionally eat fish now, so I'm actually pescetarian.\n\nI hope you do open a restaurant someday. I typically avoid vegetarian restaurants, because most of them don't really seem to appreciate food. I much prefer to good to a good restaurant, even if my choices are limited to one or two vegetarian items. I would love to see a place in town that was vegetarian AND had great food. Good luck!",
      "parent": "0",
      "gravatar_hash": "2c44b4443fe7d130357be6867d374622"
    },
    {
      "id": "2199",
      "author": "Nora",
      "author_url": "",
      "date": "2009-07-06 10:49:30",
      "content": "This is one of the best responses I've ever read.  I have been a vegetarian for 20 years for much the same reason.    When people ask me why I'm a vegetarian, my quick response is \"I would not be able to kill an animal to eat them, so why should I be okay with someone else doing it for me?\".  They usually don't care enough to press me further, but if they do, I'll direct them here.\n\nThanks for taking the time and care to express yourself so eloquently.",
      "parent": "0",
      "gravatar_hash": "ec19570e4513f64d179bc0df70e3da7e"
    },
    {
      "id": "2200",
      "author": "Chris Q",
      "author_url": "",
      "date": "2009-07-06 11:06:03",
      "content": "I liked this article a lot, it matches many of my feelings about vegetarianism, especially the chocolate part.\n\nI wish you the best in opening a restaurant, I've cooked some of your recipes before and enjoyed them very much.\n\nWhile I find more vegetarian restaurants or vegetarian entree choices lately, about 50% miss the mark when it comes to providing diners with enjoyment and delight from thoughtful and well-done plates. I would love to see more vegetarian competitors on shows like Top Chef, too.",
      "parent": "0",
      "gravatar_hash": "c4ce35292c5146ff54bec4e140b03760"
    },
    {
      "id": "2201",
      "author": "malinky",
      "author_url": "http://malinky.co.nz",
      "date": "2009-07-06 13:45:03",
      "content": "Excellent article Michael and I totally get where you are coming from. I am mostly vegetarian. On the rare occasion I will eat chicken or fish but I have a sense of guilt that accompanies those meals and I think it's only a matter of time before I completely give up meat all together. I was a vegetarian for nine years before I started eating meat again and since then I'm unable to digest red meat properly. It's an odd side affect but perhaps a blessing in disguise.",
      "parent": "0",
      "gravatar_hash": "54dde47ff81d00baa17f418f0728a3c8"
    },
    {
      "id": "2202",
      "author": "Mae Bird",
      "author_url": "http://www.maebird.blogspot.com",
      "date": "2009-07-06 13:55:50",
      "content": "Good job articulating this...  I get asked that same question - a lot, over and over. I enjoyed reading what you had to say.\n\nFor me, its a mixture of all the reasons, the environment, health, and animal care.\n\nI've recently been a bad vegetarian - well, I don't think it's bad, but I guess I can't myself a vegetarian anymore... I've been ordering grass fed pasture raised bison meat once every couple of months... I don't think there is anything inherently wrong with eating meat - its what we have done to it - the treatment of the animals, creating factories instead of farms... etc. etc.",
      "parent": "0",
      "gravatar_hash": "bdab7a0f3603d3c5e09a9b571c40b684"
    },
    {
      "id": "2203",
      "author": "Traci",
      "author_url": "",
      "date": "2009-07-06 14:59:05",
      "content": "Weird reading this because you just wrote out all of my exact beliefs/feelings. I am (and have been veg for 14 years) for the same reasons and work in the food industry with goals of my own restaurant. It's nice to hear someone share my core beliefs. Rock on!",
      "parent": "0",
      "gravatar_hash": "112d7790f8eba6dd8ebb3708257c65e5"
    },
    {
      "id": "2204",
      "author": "Dana",
      "author_url": "http://www.danatreat.com",
      "date": "2009-07-06 15:47:01",
      "content": "I feel like I was reading my own writing here.  I have been a vegetarian for 23 years (no fish for 19) and I still have trouble answering that question.  My husband and almost everyone I know eats meat and I have no problem with that.  I am raising my boys to be veg until the day they can tell me they want to be otherwise.\n\nI feel the same tugs toward meat that you do although I have no desire to every actually eat it again.  As a foodie, cook, and personal chef, I realize there is small but very important (in our culture) part of the puzzle that I am not sharing in.  And yes, putting together a vegetarian feast is vastly more complicated than throwing a steak on the grill.  At times I feel frustrated by these things and often I feel frustrated by our crazy lack of any good veg food in Seattle.  So, why don't you and I open something?  :)",
      "parent": "0",
      "gravatar_hash": "7e044150f12fee222a380d0d5f8b717e"
    },
    {
      "id": "2205",
      "author": "Barbara",
      "author_url": "http://www.gonepie.com",
      "date": "2009-07-06 16:03:05",
      "content": "First of all. let me say that I am a vegan.  I was really loving this post, but in the back of my head I kept wondering when you would get to the dairy and egg questions.  \"I'm simply not willing to go vegan\" really left me feeling robbed.  You have some very moral stances then this huge cop out.  I think you should challenge yourself a little more.  You say you never want to support cruelty to animals and then you justify so-called kinder cheese and eggs.  Do you think the animals are happy to be there in this \"kind\" world?  No.  Your conscience is just relieved of its guilt.  You lost me.....\nAny animal life saved is a good thing.  And I applaud any efforts.  But challenge yourself.  Aim higher!  For yourself and for the animals.",
      "parent": "0",
      "gravatar_hash": "095faf9cfa53045b27d0bf73e56be53c"
    },
    {
      "id": "2206",
      "author": "Lea",
      "author_url": "http://risemedusa.blogspot.com/",
      "date": "2009-07-06 23:04:53",
      "content": "Amazing! When I became a vegetarian at 13 years of age it wasn't for health or the environment, it was because I couldn't separate the living, feeling animals that I love from the food that was going in my mouth. Now, 16 years later, I feel like you - the health and environmental reasons are a bonus! It's interesting how so many of us vegetarians are always worried that people will think we're judging them for eating meat. I have been judged, made fun of, and given the 3-degree about my vegetarianism on more occassions than I can count. However, I think now that vegetarianism is more \"main stream\" than it was 16 years ago, it's more accepted. Plus more meat eaters are happy to enjoy vegetarian meals. So go for your restaurant dream! Veggie heads and meat eaters will be there licking their lips.",
      "parent": "0",
      "gravatar_hash": "390a5bef8d67ff8704373d7f15d645f0"
    },
    {
      "id": "2207",
      "author": "Tavolini",
      "author_url": "http://www.tavolini.blogspot.com",
      "date": "2009-07-07 05:38:43",
      "content": "This is a great post!  I've been vegetarian / pescetarian for the last 15 years, and am often asked about it.\n\nThe most interesting quandary with my diet is usually the backlash I receive from strict vegetarians or vegans.  The biggest benefit is that many non-vegetarians really enjoy my vegetarian meals--I have a lot of people say, \"I've never had this vegetable before!\"\n\nI cooked in restaurants for years, and even ran the grill most recently.  So, I will cook meat for my husband, trying again to go the most ethical route in the meat case.  Weird little mind games, I guess.  Its fairly convoluted, all together ;)",
      "parent": "0",
      "gravatar_hash": "e30760f989306670726f7b9002e890a3"
    },
    {
      "id": "2208",
      "author": "Spanish Steps",
      "author_url": "http://spanish-steps.blogspot.com/",
      "date": "2009-07-07 08:49:23",
      "content": "Good philosophy & great post!\n\nI started about 21 years ago when my husband's aunt got colon cancer. She was a heavy meat eater. She died -- suffering a lot- a year and a half after doctors discovered her illness.\n\nI grew up in a country where meat was the main ingredient... the traditional culture about getting protein and things like this. We always had veggies on the side but not enough. I have never liked the killing of animals but was said it was only for food.\n\nIt took some time to realized the importance of eating more vegetables, fruits, and whole grains but finally made it.\n\nI was lucky to have my children at a right age to make the change. They learned the lesson well and even improved it. They care not only for their own health but also for animals and the environment.\n\nSo here I am cooking healthy for my family... no refined or processed foods... almost everything from scratch. I have being making my own whole wheat bread for all these years. I am also learning how to cook tons of veggie recipes from all over the world... all cultures have something good according to my diet.",
      "parent": "0",
      "gravatar_hash": "b9dfaa75ac880dc496999c2ff65d2d49"
    },
    {
      "id": "2209",
      "author": "Brian Fuchs",
      "author_url": "http://brianfuchs.com",
      "date": "2009-07-07 13:51:04",
      "content": "I didn't count on that question when I decided to stop eating meat.  And there are days when I'd rather people just not even know I'm a vegetarian, because I get so sick of that!  More than the questions over why, when people work out what I might eat instead -- outloud, in front of me, but not to me -- it drives me insane.  And if one more person tells me to make sure I combine beans with rice to get all the nutrition I need... I might explode.  Okay, rant over.\n\nI've stopped eating meat twice.  Somehow, I got dragged back into complaisance over time.  But my reasons were more abstract then.  It was during high school and college, when student union veggie burgers were kinda gross, but I still loved them.  And then a few years ago, I recommitted to it.  I was eating lamb when it happened.  I was overcome with the realization that what I'd just put into my mouth was not only a living creature, but that it had thoughts.  It could have loved its mother, found joy in life.  I couldn't bear having that inside of me... being a part of what seems so barbaric to me now.  That was the last time I ate meat.  I don't think it is necessarily right for everyone, but I cannot bring myself to consume animals.  It was concrete and more pronounced that the first time around.\n\nThere does seem to be some sort of perception of zealotry.  But I'm a very do-what-feels-right-for-yourself kind of person.  While I wish other people felt the way I do, I don't judge them for not.  So many people don't think of animals while eating their burgers -- sometimes I envy that.  Not thinking about it might have made my life easier.\n\nThere is a need for a restaurant that serves great food and also happens to be vegetarian.  I'd eat there!  I hate all these overly granola places looking down their noses at me because I like a bit of cheese on my food.  Great post.  Made me think!",
      "parent": "0",
      "gravatar_hash": "ace72d50f5ac2186f3cf2d6c9f71e73e"
    },
    {
      "id": "2210",
      "author": "Kristin",
      "author_url": "http://theveggiebowl.blogspot.com/",
      "date": "2009-07-07 16:47:30",
      "content": "How eloquently you put into words something which is often so hard to express. Guaging by the responses, so many of us share in a similar view. Having been vegetarian for most my life, I found in my younger years I had to defend my reasons for being so. However,it seems today, that many people have explored meatless diets, or are more open to the idea of vegetarianism. I know a lot of people around the world are struggling financially at the moment and can no longer afford to eat meat and have thus become vegetarian out of ncessity. Often though, they are unsure of how to expand their cooking repertoire to include meals which have a good balance of nutrients, including protein. This is why authors of vegetarian blogs like yours should be congratulated - for freely sharing your knowledge and experience of vegetarian cooking. Personally I have followed your blog for quite some time and find it inspiring. Your words in this post were affirming and encouraging.",
      "parent": "0",
      "gravatar_hash": "918af5c22af0f8f443e1a5a5f6a9bf16"
    },
    {
      "id": "2211",
      "author": "Tofu Mom (aka Tofu-n-Sprouts)",
      "author_url": "http://tofu-n-sproutz.blogspot.com/",
      "date": "2009-07-07 20:41:51",
      "content": "Very interesting post, I enjoyed your straightforwardness and honesty! I really do understand where you're coming from and have much the same viewpoint in regard to the reasons behind WHY I eat what I do. I do happen to be vegan, partially because I'm allergic to milk, but I also think the egg and dairy industries are perhaps even more awful and cruel even than other animal production. To each their own. I'm not out to convert anyone to the dark side either.\nI think you're totally correct that being vegetarian (or vegan) requires more creativity in the kitchen, but that's something I am very proud of. I absolutely LOVE stretching my mind a bit to come up with things that are tasty, appealing and yet animal free. My greatest enjoyment comes from taking a recipe and thinking to myself... \"hey, I can make this vegan!!\".\nYour recipes are always so beautiful and creative though, I really am surprised you feel there's a \"significant downside\" to being vegetarian. THAT, my friend, I really don't get!!! You are brilliant at what you do, and the world could USE a few more vegetarian chefs/fine restaurants. Why be like everyone else? There's a meat-filled dining establishment on every corner.",
      "parent": "0",
      "gravatar_hash": "81ef51240635fcb2a72761ad0360b3d7"
    },
    {
      "id": "2212",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-07 21:11:40",
      "content": "Hah! As uncool as it is to admit liking &quot;meat substitutes&quot;, I do actually like some of them in extreme moderation. Not because they taste like meat (they generally don&#39;t, with the possible exception of veggie bologna and tofu dogs, which taste like the elementary school versions of those meat products as best I remember :). I just like them as something different with a bit of &quot;chew&quot; to them. Most of the time I prefer some form of tofu in the dishes where that sort of thing would be found. Amen about vegetarians who subsist entirely on cheese and white bread, that will kill you.<br />",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2213",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-07 21:16:00",
      "content": "Thanks Chris! I asked the Top Chef producers if they would consider having a vegetarian contestant, but they said no, that all contestants have to do the same challenges and obviously a lot of them involve meat. (Which admittedly makes some sense). Too bad, it would be awesome to be able to even be able to make the attempt to get on the show.<br />",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2214",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-07 21:19:45",
      "content": "Hey Traci - thanks so much - it has been really cool to hear how many people have similar thoughts or reasons for being vegetarian. I appreciate you taking the time to comment!<br /><br />Michael<br />",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2215",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-07 21:21:39",
      "content": "Hey Dana - I&#39;m on the same page with you re: the kids. Our plan is to have ours be veg until they have enough context to decide for themselves. Any idea what you think that will be for your boys?<br /><br /><div>",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2216",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-07 21:25:46",
      "content": "Hey Barbara -<br /><br />I don&#39;t disagree with what you say at all. I think I need to do a lot more reading about how dairy and eggs are produced to know how I really feel about it. Especially with regard to organic and small local producers - I should just go visit some and see how it feels face to face to know whether it is &quot;right by me&quot;. It would take a lot to make that change though - I respect the efforts I see to veganize so many things, but honestly I just have never had vegan baked stuff in particular that tasted more than sorta half good (and I&#39;ve tried lots), and eggs and cheese of course have incredible culinary versatility. But I certainly don&#39;t feel qualm-free about eating them.<br />",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2217",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-07 21:29:33",
      "content": "<br />Hey Lea - thanks so much - it has been really cool to hear how many people have similar thoughts or reasons for being vegetarian. I appreciate you taking the time to comment!<br /><br />Michael<br />",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2218",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-07 21:38:21",
      "content": "Isn&#39;t that hilarious when people try to figure out your diet and solve your protein &quot;problem&quot; for you? Cracks me up. I&#39;ve had some other folks email me with stories similar to your lamb incident. Interesting to see how different folks have that realization hit them.<br />",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2219",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-07 22:28:06",
      "content": "@everyone - thanks so much for all of the replies on this post (and by all means keep them coming)! It is cool that so many people are so thoughtful about what they eat, regardless of what they ultimately choose. The more perspectives, the better.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2220",
      "author": "Calico",
      "author_url": "",
      "date": "2009-07-08 11:23:26",
      "content": "I understand what you're saying, but you seem to have a big blind spot:  you forget dairy and eggs also come from animals.\n\nTo produce an egg, you have to first create laying hens. 50% of chicks are male, so either are disposed off immediately (killed, ground, then rendered) or are a huge cheap source of meat for the poultry industry.  For the laying hens while they're producing, there is NO government standard to what \"free range\" or \"all natural\" meals.  They could be in the same cramped cages most of their time.  They could be \"cage free\" in a dark chicken house with 5000 other hens, crammed beak to butt.  They can still have beaks cut off as chicks.  Forced starvation cycles are the norm to keep production higher.  And remember, as soon as laying hen stops producing, she's shipped to slaughter.\n\nDairy means you're supporting the meat industry, especially the worst of the worst: veal.  Without dairy creating a cheap source of calves, veal would be unaffordable.  Even the \"happy cow\" dairies must keep the females pregnant every year (forcible impregnantion).  The effort of producing milk and being pregnant drains alot out of an animal ,year after year, and we're so used to seeing the sunken-in look of dairy cows we think it's normal.  In a few years when she can't meet quota, she's shipped to slaughter.   Because dairy cows need milked about 2x a day, they can't have a big range to roam out on; they're far more likely to be chained to a stanchion or living on a small cement-lined pen.\n\nCooking awesome food without eggs/dairy isn't any harder.  I hope you'll consider trying some vegan foods, at least occasionally.   The egg and dairy industry is just as cruel, dirty, and unnecessary as meat production.  It's not just about the killing but the daily suffering we put livestock animals through in the name of culinary pleasure.\n\nThanks for considering my point of view.",
      "parent": "0",
      "gravatar_hash": "17d552d8402cee274c1f543fd358125f"
    },
    {
      "id": "2221",
      "author": "Jenni",
      "author_url": "http://www.atheisttoolbox.com/forum/",
      "date": "2009-07-08 11:47:06",
      "content": "I became a vegan last year for basically the reason you are a vegetarian. \"When I look in the eyes of an animal, I simply feel this sense of empathy, and there isn't a doubt in my mind that they feel pain, can and do suffer, and want to live.\" That's a very good way to describe it. I don't need an animal sacrifice to eat. The way animals are treated in factory farm situations is deplorable to me.\n\nI agree that it is definitely not about health. After all, Airheads candy is vegan- or so I read- hardly the healthiest diet!\n\nI do find it hard to like people who can enjoy especially mean to produce food like veal. I would like to be as non-judgmental as you, and I can fake it, but I don't feel it. I judge a person based on stuff like that.\n\nI did enjoy the article, I'll have to memorize that URL too, lol!",
      "parent": "0",
      "gravatar_hash": "06fb51055a15a97f7242954b56f7c364"
    },
    {
      "id": "2222",
      "author": "Tony",
      "author_url": "",
      "date": "2009-07-08 11:54:24",
      "content": "Wow, vegetarian for 25 years and no progression into a vegan lifestyle... I must say, you're either willfully ignorant or your claims about animal welfare are nothing short of bullshit. Have you seen a happy dairy cow? Debeaked chickens exist in egg farms too. Not to mention that the dairy industry is the reason that fast food meat is so cheap and readily available. So you see, while your dietary choices may help <i>you</i> sleep at night, they are still feeding the capitalist death machine directly. Go <b>VEG</b>etari<b>AN</b>- cut out the bullshit, because your excuses won't change a thing.",
      "parent": "0",
      "gravatar_hash": "2b418f13ba2e3cf315e2158d605a9976"
    },
    {
      "id": "2223",
      "author": "Emily",
      "author_url": "",
      "date": "2009-07-08 12:10:32",
      "content": "I've been all organic and vegan (strict: no gelatin, no honey, etc) for five years and you pretty much said it all. Its funny how many people are threatened by my choice to not eat animal products. I think that's what stems their questioning: they typically feel a need to justify their choice to not be vegetarian. In fact, many people can be quite vicious about it. But I try to say what you said: I am not a judging vegan. I accept what other people choose to eat and how they choose to live. I say: Animals eat animals all the time. (Now, I can go into my views on the meat industry and the real human 'need' for meat in survival but that would taint the loving and pacifying nature of Michael's article).",
      "parent": "0",
      "gravatar_hash": "800190693247c594b58fe67b70ce6270"
    },
    {
      "id": "2224",
      "author": "Dawn",
      "author_url": "http://www.sustainabletable.org",
      "date": "2009-07-08 12:14:48",
      "content": "Hi Michael, everything you said was so right on with my vegetarian eating habits - including not liking to have to put a worm on a fishing hook when I was a child (oh I cried!) and loving eating in India where I had so many choices! The health factor has become an important aspect for me, but not what got me started.\n\nNow I work for an organization (Sustainable Table) where we teach people about sustainable food. We help people to make educated decisions about what they consume and where they buy it. If a person wants to be a vegetarian, vegan or a carnivore - an especially important issue is - where does the food come from? Buying local, sustainable food (and of course consuming moderate amounts) is very important for our personal health and the health of the planet. All important pieces to consider! I see you have some vegans here making comments about the horrors of factory farming - I totally agree that we need to be conscious about where our food comes from - trying to shop at farmers markets or getting your food through a CSA is very helpful, you can have a chance to ask the farmer what their practices are.\n\nMichael, like that you aren't judgmental about what a person eats, it's wonderful to see so many people making thoughtful decisions about their choices! Thanks for starting this conversation.",
      "parent": "0",
      "gravatar_hash": "2d6d871f7dd5790ee2ae522c72161e70"
    },
    {
      "id": "2225",
      "author": "Anthony",
      "author_url": "http://www.ihealthtube.com",
      "date": "2009-07-08 12:18:47",
      "content": "Great blog post. Why do people always feel the need to defend their choice of diet. I eat meat, but not a lot of it. For health reasons, I think fruits, veggies, nuts and seeds should be the main part of the diet. There is no diet that is perfect for everyone. You should eat what makes you happy and feel good. Some people get so protective over their 'vegetarian' or 'vegan' labels that they attach to their diet, but in reality, I think that everyone should just eat what they want for whatever reasons they want (health, environment, taste, animal cruelty).",
      "parent": "0",
      "gravatar_hash": "e537d31d2a4e00f7633d47804b99fa54"
    },
    {
      "id": "2226",
      "author": "Brenda",
      "author_url": "",
      "date": "2009-07-08 12:29:00",
      "content": "This writer is a vegetarian.  In our Western throw-away society, that is saying a lot.  We vegans can show such self-righteous arrogance at times.\n\nApplaud people for what they do right.  Don't be so quick to nit-pick.  When people know better, they do better.  Educating people about animal issues are important.  But, what can be gained from attempting to educate through anger and attacks?  All that does is to make people defensive.",
      "parent": "0",
      "gravatar_hash": "61ff820b0290025fbda134136d9641a2"
    },
    {
      "id": "2227",
      "author": "VeggieVeggie",
      "author_url": "",
      "date": "2009-07-08 12:52:10",
      "content": "Thank you! Exactly what I have wanted to say to the thousands of inquires about my diet but have such difficulty with putting it into words without being judged.",
      "parent": "0",
      "gravatar_hash": "032d20510ec145a9c97d8467d10588ca"
    },
    {
      "id": "2228",
      "author": "indigoocean@gmail.com",
      "author_url": "",
      "date": "2009-07-08 13:03:28",
      "content": "It sounds like you have no idea what the word \"vegan\" means. There is no such thing as \"almost\" vegan because veganism is not simply a diet, it's an entire lifestyle based upon an ethical principle, which is that using animals as a means to our own ends is wrong.\nIf you were a vegetarian who was allergic to dairy, then why on earth would that mean you couldn't eat most vegan meals? Vegan food has no animal products in it, and every vegan I know is an absolute food-loving glutton.\n\nI simply don't see the reason people have to squeeze themselves into categories and labels that simply don't fit. You are an omnivore. Deal with it.",
      "parent": "0",
      "gravatar_hash": "0e989baebe867a478124a6731699e70c"
    },
    {
      "id": "2229",
      "author": "Sam",
      "author_url": "",
      "date": "2009-07-08 13:07:14",
      "content": "I'm 28 and have been a lifelong veggie, raised by my dad (vegan) and mum (veggie).  The things you write are pretty much spot on what I think, though I'm in the relatively unusual position of having never eaten or even considered eating meat (the only thing that ever tempted me was the smell of oysters and mussels, but meh, I can do without).  I'm still amazed at how many people think that being raised like this takes away my choise, some have even said that it is child abuse! Absurd, of course, I usually propose the opposite arguement (about choise, not abuse ;-) ) and that usually gives pause for thought.\n\nGreat article, thanks!\nSam",
      "parent": "0",
      "gravatar_hash": "b1856d0403abd6fef860e9bda615136d"
    },
    {
      "id": "2230",
      "author": "Brian",
      "author_url": "",
      "date": "2009-07-08 13:37:36",
      "content": "Ha, this one guy is a nut (indigoocean@gmail.com).  Fundamentalist Vegan judgementalism, so who says that religion has a corner on the market of zealotry?  Ish, exactly what this article was trying to take a more moderate and well informed stanch against.",
      "parent": "0",
      "gravatar_hash": "4507cc6bd1860687c869ad77a23661e7"
    },
    {
      "id": "2231",
      "author": "Jane",
      "author_url": "",
      "date": "2009-07-08 13:51:10",
      "content": "Thank you so much for this wonderful and articulate explanation of your vegetarianism. It really resonated with me; as I've only been veg for two years I find my reasons are still evolving. I struggle with the fact that I still eat cheese and eggs too, and a large part of that is because I know I would face problems with my family, friends, and the world at large if I chose to become vegan. I know it's a cop-out to say that I hope someday it's \"easier\" to be vegan...but sometimes that's what I find myself thinking.\n\nOh, and one more thing...why, 9 times out of 10, is the question \"So why are you a vegetarian?\" posed by someone about to take a bite out of a huge burger/steak/turkey leg?! Dude...do you really want me to tell you about factory farming NOW?",
      "parent": "0",
      "gravatar_hash": "b3b8c8351d4ec372d327745c63454daf"
    },
    {
      "id": "2232",
      "author": "MP",
      "author_url": "",
      "date": "2009-07-08 13:58:26",
      "content": "They said they were <b>ALSO</b> allergic to soy. As a vegan myself, being allergic to soy would certainly make the diet of vegans slightly more complicated. Read the comment over before flying off at the mouth.",
      "parent": "0",
      "gravatar_hash": "00e35a2627c7d93933985de1e29a3c04"
    },
    {
      "id": "2233",
      "author": "indigoocean@gmail.com",
      "author_url": "",
      "date": "2009-07-08 13:59:20",
      "content": "Why on earth should vegans try to downplay the fact that they live according to an ethical principle? I believe animal exploitation is wrong, categorically. If you have to start name-calling to be able to deal with that, then that's your prerogative.",
      "parent": "0",
      "gravatar_hash": "0e989baebe867a478124a6731699e70c"
    },
    {
      "id": "2234",
      "author": "indigoocean@gmail.com",
      "author_url": "",
      "date": "2009-07-08 14:02:35",
      "content": "I know several vegans who are allergic to soy. It's not a staple of my diet, either. Unless you want to live on what you find in the freezer section then soy doesn't have to be a part of any diet.",
      "parent": "0",
      "gravatar_hash": "0e989baebe867a478124a6731699e70c"
    },
    {
      "id": "2235",
      "author": "Tser",
      "author_url": "",
      "date": "2009-07-08 14:05:19",
      "content": "There are an infinite number of soy-free vegan meals. I have several vegan friends who are allergic to soy or have thyroid problems so they can't eat soy.\n\nIf you eat meat, you're not a vegan. You're not a vegetarian. You are by definition an omnivore. Go ahead and call yourself a flexitarian or something if it makes you feel better.\n\nI agree that eating less meat is great. The less animals that suffer, the fewer resources wasted, etc. all good. But don't appropriate someone else's label. It adds to the difficulty for those of us trying to communicate our choices to others. I can't say how tired I am of getting the question, \"But you eat chicken/fish/etc. right?\" or going back and forth and back and forth with caterers who keep putting \"vegan\" options on the meal plan that include cheese or something.",
      "parent": "0",
      "gravatar_hash": "87fd16b83014c7492f2c40732a47875d"
    },
    {
      "id": "2236",
      "author": "Cody",
      "author_url": "http://www.myspace.com/bytheeyeofodin",
      "date": "2009-07-08 14:16:18",
      "content": "Good article.\nIt's always interesting to hear other peoples' perspectives.\nI am an ovo-lacto vegetarian as well and I base my views on a similar viewpoint.. but really after 26 years it's no longer a philosophy or a conscious decision--I simply cannot pallate meat. My body rejects it fiercely.\n\nI am certain that this is because of my moral dislike for the cruel treatment of animals, on some level, but it goes deeper: I simply do not enjoy the taste or smell of cooked meat.\n\nI could argue all day and night about the benefits of vegetarianism but it doesn't matter. If someone wants to eat meat, they will; as our ancestors did. Whatever reason you choose, you should be free to do just that: choose.\n\nPeople need to stop worrying what other people do in their spare time.\n\nThere",
      "parent": "0",
      "gravatar_hash": "4cae83b6840502405fde008b9bf23e1b"
    },
    {
      "id": "2237",
      "author": "a guest",
      "author_url": "",
      "date": "2009-07-08 14:51:23",
      "content": "She also said she was allergic to soy.  We've all been omnivores at some time in our life, deal with it.",
      "parent": "0",
      "gravatar_hash": "87bbd70a746f63bc03a9e2a10ecc0aa2"
    },
    {
      "id": "2238",
      "author": "Vesper Sprockett",
      "author_url": "",
      "date": "2009-07-08 15:06:29",
      "content": "Wonderful article! My husband and I eat meat, eggs, and dairy products, but we've found that the best way to do so ethically is to eat only those animal products that we are 100% certain come from ethical sources. Of course, the simplest way  for anyone to do this is to have a few chickens. Trust me, just a few lay plenty of eggs for a family. In fact, we have family members who end up giving eggs away every week! While there are many people for whom this would be impossible (apartment dwellers, those in big cities or strictly relegated neighborhoods), the fact that a few ethically treated hens can lay so many eggs means that it isn't at all hard to find fresh, guilt free products at, say, farmers markets.\nThe hardest thing that we have found to work around ethically is dairy- we don't want our OWN cow, and it's quite a bit harder to find like-minded, permacultural friends who keep cows than it is to find those who have chickens.\nAnyway, wonderful, clear article on the ethics of vegetarianism!",
      "parent": "0",
      "gravatar_hash": "8c38bd34b44fc48eda038e639941218e"
    },
    {
      "id": "2239",
      "author": "Dave",
      "author_url": "",
      "date": "2009-07-08 15:19:28",
      "content": "1,400 words or thereabouts. I guess that's why I'll never be a blogger--my  ego's not big enough for me to believe anybody anywhere gives two shits about what I eat or why. But I CAN answer the same \"why I'm a vegetarian\" question with 1,396 fewer words: I don't like meat.",
      "parent": "0",
      "gravatar_hash": "a69c6c574e20bcbb34f85c91f40b5a9c"
    },
    {
      "id": "2240",
      "author": "Andie",
      "author_url": "",
      "date": "2009-07-08 15:26:33",
      "content": "She cannot eat soy and thus cannot eat most vegan meals.",
      "parent": "0",
      "gravatar_hash": "5b84b846a71e54ff06caba4079537bdb"
    },
    {
      "id": "2241",
      "author": "Don Gray",
      "author_url": "",
      "date": "2009-07-08 15:36:35",
      "content": "While it's great to be able to stand up in front of the world and proclaim vegetarianism for altruistic reasons, it is also a hard fact that there are many out in the world that are suffering irreversible damage to their health by attempting to adopt a vegetarian lifestyle.\n\nSince the \"O\" blood type is still the dominant blood type, at roughly 60% of the entire population of the planet, all of the \"O\"'s have a genetic need for meat in their diet.\n\n\"O\" people also have the added problem of inheriting an intolerance to wheat and corn.  The early hunter gatherers were of the \"O\" blood type and did not cultivate grains.  Instead they killed animals and found food in the wild, therefore, the \"O\" have no tolerance for grains and develop autoimmune disorders like diabetes and crohn's.\n\nBasing dietary choices on ethics alone, is a foolhardy solution.  The genetics of your ancestors holds the key to everything you should and should not eat. Find out who you really are.  Base your dietary choices on your blood type, not your love for animals.",
      "parent": "0",
      "gravatar_hash": "8d25136c753a8c6724697aeb3a346331"
    },
    {
      "id": "2242",
      "author": "Erin Loraditch",
      "author_url": "",
      "date": "2009-07-08 15:39:35",
      "content": "I stumbled on your spectacular article and I agree wholeheartedly on the points made. I have been a vegetarian for 3 years since I was 13.  By converting my lifestyle to do without meat, it also encouraged me to refrain from drinking carbonated beverages like sodas and cokes and sparkling water. I am in great shape and I enjoy being healthy!",
      "parent": "0",
      "gravatar_hash": "7eda6cdaac43bed7f30d452a98027dfa"
    },
    {
      "id": "2243",
      "author": "Erin Loraditch",
      "author_url": "",
      "date": "2009-07-08 15:43:59",
      "content": "agreed. harsh instigation isn't enjoyable.",
      "parent": "0",
      "gravatar_hash": "7eda6cdaac43bed7f30d452a98027dfa"
    },
    {
      "id": "2244",
      "author": "Don Gray",
      "author_url": "",
      "date": "2009-07-08 16:02:41",
      "content": "As was pointed out to me, I neglected to include a little scientific information in my earlier comment.  <a href=\"http://www.dadamo.com/\" rel=\"nofollow\">http://www.dadamo.com/</a> at this site, you'll be able to find all the information you need.",
      "parent": "0",
      "gravatar_hash": "8d25136c753a8c6724697aeb3a346331"
    },
    {
      "id": "2245",
      "author": "Jonathan H",
      "author_url": "",
      "date": "2009-07-08 16:09:19",
      "content": "A brilliant read, it's great to read other peoples stories on what made them veggie. I'm 19 and been Lacto-Ovo Vegetarian for around 18 months now after seeing documentaries on the production of meat and it genuinely shocked me, before then I'd had no idea of the cruelty and poor conditions the meat industry forces upon animals, I've yet to feel any temptation to go back to meat and find it very easy to find a good, tasty vegetarian alternative to most foods.\n\nI'm also sick of having to explain to every person I meet why I'm a vegetarian, I think it's strange how I feel I have to justify my choice every time someone asks and yet if you asked someone why they ate meat they'd think you were asking a dumb question.",
      "parent": "0",
      "gravatar_hash": "b91438bbf9660e59ef6ea201b07e4115"
    },
    {
      "id": "2246",
      "author": "trephinix",
      "author_url": "",
      "date": "2009-07-08 17:17:14",
      "content": "I am a strict vegan, but i occasionally eat beef, chicken, fish, cheese, milk, and eggs.",
      "parent": "0",
      "gravatar_hash": "c2a8ad35069a77c779813b26d6987876"
    },
    {
      "id": "2247",
      "author": "Kellie",
      "author_url": "",
      "date": "2009-07-08 17:29:55",
      "content": "I'm a vegetarian and I'm so glad I found your article!! I felt like you read exactly what I was thinking! I am so sick of people asking \"Why are you a vegetarian?\" and then either A. not listening or B. making fun of me.  I accept an individual's choice to consume meat, so why is it so difficult for people to accept my choice? Again, thanks for writing this article and putting it so clearly to those who don't understand.",
      "parent": "0",
      "gravatar_hash": "b8db5e8e6fc53e512d7b90deb9150137"
    },
    {
      "id": "2248",
      "author": "lovelydarkness333",
      "author_url": "",
      "date": "2009-07-08 17:56:21",
      "content": "Why can't they just do Tofu as the secret ingredient, muaha!",
      "parent": "0",
      "gravatar_hash": "b177b1c65bd7c77e0246ef9dac63b6da"
    },
    {
      "id": "2249",
      "author": "Cassie",
      "author_url": "http://www.cassieskitchen.com",
      "date": "2009-07-08 18:37:12",
      "content": "Thank you for this great blog post. I totally understand your point of view. I follow a vegetarian diet, and my primary motive is my health and the environment. The treatment to animals, although important, is not my primary motivator. I too am fed up with the question. I saw myself having to justify why by having to disclose a very private health issue time and time again. Every time, I feel like I've revealed too much and wished I hadn't crossed that line.  I recently decided I wouldn't discuss my choice. I haven't been challenged yet. Let's see how that goes.\n\nAnd good luck in opening that restaurant! I helped a friend open a vegetarian place, after taking her cooking lessons and I have to say, it was an awesome experience. Vegetarian food doesn't have to be bland at all! :)",
      "parent": "0",
      "gravatar_hash": "959e6ddb4723637ede316c4b3e011913"
    },
    {
      "id": "2250",
      "author": "Jen",
      "author_url": "",
      "date": "2009-07-08 19:25:37",
      "content": "I recently became a vegetarian in Nov. of 2008. I'm 16 going on 17 and August and I come from an Indian meat-eating family.\n\nThis article was veryy interesting! I love your respect for all people...there are too many vegetarians who cannot sit down with people as they are eating meat without making a comment. We have made a choice, and there are better ways of advocating than at the dinner table.\n\nSimply, I'm a vegetarian because of the inhumane treatment of animals. When I was exposed to the terrors that take place on farms, I slowly weaned myself off meat. I just couldn't bring myself to eat something that I knew was tortured just because it was easier and cheaper that way.\n\n\nI still eat eggs and dairy just like you..it would make things very difficult if I moved away from those two products! I'm hoping to do some research and find meats that are possibly kosher or that are proven to be from farms that use humane practices. Until then...I havent touched meat in many many months and do not feel any temptation (thank god haha ).\n\nDo you have any more articles?",
      "parent": "0",
      "gravatar_hash": "1a83a3bbf9f72852b6b61883d076fecd"
    },
    {
      "id": "2251",
      "author": "Jen",
      "author_url": "",
      "date": "2009-07-08 19:26:31",
      "content": "I recently became a vegetarian in Nov. of 2008. I'm 16 going on 17 and August and I come from an Indian meat-eating family.\n\nThis article was veryy interesting! I love your respect for all people...there are too many vegetarians who cannot sit down with people as they are eating meat without making a comment. We have made a choice, and there are better ways of advocating than at the dinner table.\n\nSimply, I'm a vegetarian because of the inhumane treatment of animals. When I was exposed to the terrors that take place on farms, I slowly weaned myself off meat. I just couldn't bring myself to eat something that I knew was tortured just because it was easier and cheaper that way.\n\n\nI still eat eggs and dairy just like you..it would make things very difficult if I moved away from those two products! I'm hoping to do some research and find meats that are possibly kosher or that are proven to be from farms that use humane practices. Until then...I havent touched meat in many many months and do not feel any temptation (thank god haha ). I think we",
      "parent": "0",
      "gravatar_hash": "1a83a3bbf9f72852b6b61883d076fecd"
    },
    {
      "id": "2252",
      "author": "annie",
      "author_url": "",
      "date": "2009-07-08 19:31:35",
      "content": "I agree with you completely. All you said was basically my thoughts on this. I just went vegetarian about 3 months ago and the thing I've found to be  the most difficult is not adjusting to this lifestyle but dealing with people. I've been called anorexic, crazy, that I don't love myself etc. It gets annoying. I don't understand it. You would think people would be more accepting of the fact that no animals have to die in order for me to eat.",
      "parent": "0",
      "gravatar_hash": "297d35b06ed8e3ddb44e835fb3319f52"
    },
    {
      "id": "2253",
      "author": "lindsaywyatt07@yahoo.com",
      "author_url": "",
      "date": "2009-07-08 19:38:35",
      "content": "I really appreciate your ability to say exactly what I wanted to say every single time someone asks me that. I have never been able to say it so eloquently. I completly agree. I don't really care about my health or the environment(I mean of course I do but not enough for a dramatic lifestyle change) and I care deeply about animals but that not really it. It just doesn't seem natural to eat a burning piece of flesh. It seems so unatural to me. Looking into an animals eyes is so similar to looking into another human being's eyes. That is the farthest thing from anything I want to put in my mouth. I am a 20 year old that has been a vegetarian since I was 5. My family never encouraged it but it has just always been a natural part of my soul. I will definitely tell people about your article\nThanks again, Lindsay",
      "parent": "0",
      "gravatar_hash": "8d6d75adb50c6d0683aeff6f0945d29b"
    },
    {
      "id": "2254",
      "author": "Adam",
      "author_url": "http://qualitybrew.blogspot.com/",
      "date": "2009-07-08 20:04:32",
      "content": "Why do you think animal exploitation is categorically wrong?  When you go to work (if you even have a job), aren't you being exploited in a similar sense?  And when you purchase any good or service, be it an ear of corn, a book about sex, or getting your air conditioner fixed, are you not exploiting another person somewhere up the chain?  You are!  You are exploiting their labor, taking their time, giving your time and labor, and it all works together.  There is not a loser and a winner behind every transaction, there is a symbiotic relationship at play where all parties achieve a gain.  The same is true for animals that are treated with compassion and allowed to live comfortable lives on farms.  They too are paid in a sense as their lives are protected by farmers.  They get to live without the fear of being eaten, and they are cared for when they are hurt.  They are granted extra years to live, and that is truly the only way you could pay an animal.\n\nAh, but they didn't really have much of a choice now did they?  But at the same time neither does anybody else.  Sure we get to choose HOW we are exploited but we must choose to be exploited in some way nonetheless.  It seems every living animal on earth must be exploited in some fashion or another.",
      "parent": "0",
      "gravatar_hash": "5a3a6a8acea596f15c71a528e0682f13"
    },
    {
      "id": "2255",
      "author": "lisa",
      "author_url": "",
      "date": "2009-07-08 20:12:39",
      "content": "Great post. I've been a vegetarian for 21 years. I think eating meat is absolutely gross (been a picky eater my whole life). It's not a lifestyle choice for me in any sense of the word. Politically,I'm a conservative. Can't be vegan and don't wanna be a vegan. I love chocolate and cheese far too much for that. So I get hate from both sides. Bring it on.    :-)",
      "parent": "0",
      "gravatar_hash": "24380875c52ed567e23ef0a28ca7fe06"
    },
    {
      "id": "2256",
      "author": "helen",
      "author_url": "",
      "date": "2009-07-08 20:52:39",
      "content": "i have been a vegetarian my whole life and im 15 now im happy being one and proud that my family is too....i hate it when i meet someone they always have to argue wont let me change the subject .... or you know their favorite \"oooo look im eating meat its delicious mmm meaty blah blah blah ...\" gets on my nerves .... or when i wear one of my peta shirts or my save the animals dont eat me or wear experiment etc. on... people are stupid and have to pick an argument not worth arguing about .. u have ur opinions i have mine .... same goes for religion ... im athiest so what! ................\n\none of my goals/wishes.... one day i can meet someone who wont start arguing rub meat in my face ... whatever ! because there seems to be no one like that yet.. sadly i have to wait...",
      "parent": "0",
      "gravatar_hash": "c5fd668fa7b395440fa1899efa70e14a"
    },
    {
      "id": "2257",
      "author": "Synergy",
      "author_url": "",
      "date": "2009-07-08 21:14:55",
      "content": "I tell people I am a vegetarian because I can be happy and healthy without eating meat, so why should another living being have to die to satisfy my taste buds?\n\nI started out for environmental  & Spiritual reasons, and then as I learned more about it, the health reasons and the AR stuff kicked in too.\n\nI do eat dairy occasionally, just because I am far more at peace with myself and my diet if I don't restrict that completely (other wise I wind up binging).\n\nGreat article by the way.",
      "parent": "0",
      "gravatar_hash": "08b0b97ed0c640ecd3d7b7d42bef2e78"
    },
    {
      "id": "2258",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-08 21:37:02",
      "content": "Hey Synergy - thanks so much - it has been really cool to hear how many people have similar thoughts or reasons for being vegetarian. I appreciate you taking the time to comment!<br /><br />Michael<br />",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2259",
      "author": "Patel",
      "author_url": "",
      "date": "2009-07-09 00:36:00",
      "content": "I am a vegetarian for the same reasons...well written",
      "parent": "0",
      "gravatar_hash": "d7b1bf2af42180d0b680a37ee061976e"
    },
    {
      "id": "2260",
      "author": "cw",
      "author_url": "",
      "date": "2009-07-09 01:13:57",
      "content": "\"So there you go. Now you know why I'm a vegetarian, and next time someone asks I can just rattle of this URL, right?\"\n\nHahaha, I was actually jokingly considering doing this because you've said many things in this piece that I've thought before and said them quite well.",
      "parent": "0",
      "gravatar_hash": "b98eec0be26e29192dc8ced5c5491eb2"
    },
    {
      "id": "2261",
      "author": "parakalien",
      "author_url": "http://profile.typepad.com/6p011570eec55d970c",
      "date": "2009-07-09 02:13:14",
      "content": "wow man,\ni have never seen this site before\ni am an ex vegetarian\nbut really just a lazy one\ni went 8 years without meat products a little while without dairy. mainly always ovo lacto\nso somewhere i started eating meat again as if it never happened that i drew a line in the sand about my feelings toward animals and eating them\n\nexactly the same as you\nlove animals\ndont want to ride them, bet on them, hurt them at all, or eat them really, i just get lazy.\n\ni am the person who pays a jillion dollars for my meat at whole foods and will eat halal and kosher because i think its 'nicer' but it does break my heart that they pray for the animal and give it food before killing it... because it brings to light the reality of the death... the kill.\n\nyou said some stuff that might have converted me back\nyour right\ni dont want to kill it and having someone else do it for me isn't much different\nfurthemore\ni have never thought of eating meat as eating muscle?!\nbut your right.\nfor some reason fish doesn't gross me out as much but would i kill one? probably not... good thing i got a lot of black beans and brown rice today : )\n\nyou moved me\nyou inspired me\nim coming back later to find out if you have a recipe for healthy cake : )\n\n'a nation's greatness can be judged by how they treat their animals'.  -Gandhi",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2262",
      "author": "Bill",
      "author_url": "http://www.geektrap.com/bill",
      "date": "2009-07-09 06:46:10",
      "content": "Opinionated much?  Not all of us can walk on water like you apparently do.  I've been a vegetarian for 30 years.  I give to all sorts of animal causes, and I do my best to treat animals with respect and kindness.  I still eat dairy and egg products, although they're slowly being phased out.  Silk instead of milk, egg replacer instead of eggs in recipes and so on.  Unless you live in a place where there are lots of vegan restaurants (we don't), or are willing to cook _every_ meal at home (we aren't) then it's pretty tough to find anything you can eat.  I haven't eaten anything that's predominantly egg (like quiche and scrambled eggs) for years, because I don't like to support that industry, but it's awfully hard to avoid egg ingredients when you eat out.  Hell - it's usually hard enough just to find out if something has meat in it.  I've never worn fur, and I haven't owned anything made of leather for 15 years.  I don't support animal use in research, hunting, fishing, sports, and so on.  A number of other people are life-long vegetarians because of my influence.  I feel like I'm doing pretty well for someone descended from a long line of cowboys and ranchers, who grew up in the middle of Nebraska.  None of us are perfect, but instead of attacking people for it, maybe you could direct your energies in a more positive direction.\n\n-Bill",
      "parent": "0",
      "gravatar_hash": "f12a1fdb09c8f6d7873d3d5ee6759e88"
    },
    {
      "id": "2263",
      "author": "Bill",
      "author_url": "http://www.geektrap.com/bill",
      "date": "2009-07-09 06:52:02",
      "content": "First time I've ever heard of type-O's _requiring_ meat in their diets.  And \"Base your dietary choices on your blood type, not your love for animals\"?  So you're saying you should always do what's best for you, regardless of the impact that has on other living things?  Seems pretty selfish.",
      "parent": "0",
      "gravatar_hash": "f12a1fdb09c8f6d7873d3d5ee6759e88"
    },
    {
      "id": "2264",
      "author": "Nancy",
      "author_url": "http://www.countdowntomexico.com",
      "date": "2009-07-09 08:17:18",
      "content": "Thanks for this!  I am very similar to you - I am just tooooo visual to be able to eat meat.  I see the poor thing when I look at the plate.  And, like you, I've been vegetarian for about 25 years.\n\nMy trouble is that I live in Mexico now (originally from the US) and people just  don't have any knowledge of vegetarian cooking outside of Mexico City or Guadalajara or Morelia.  In the provinces (I live in Mazatlan) food is considered more tasty with meat or fish stuff added to it.  When I eat in a restaurant I need to make sure I tell them I am a vegetarian, that I don't eat meat or seafood, and I'd like \"whatever\"...the waiter usually says then that they can bring me chicken!  SOmehow chicken isn't meat!\n\nBut I have found a few places that are reliable for me and there is always pizza or cooking for myself.  One natural food store has tofu dogs and you can buy tofu in the grocery store.  But no vegie burgers or that kind of thing here.\n\nANyway, I am bookmarking your site and really looking forward to making some of your recipes.",
      "parent": "0",
      "gravatar_hash": "5e2ccf3f1217a2a3c0bec24bb0d0d24a"
    },
    {
      "id": "2265",
      "author": "Patrick",
      "author_url": "",
      "date": "2009-07-09 09:37:26",
      "content": "I also admire the honesty and nonjudgementalism of this post.\n\nHowever, there is no need to tread softly around moral issues simply because they're moral issues. This, for instance, is undeniable:\n\nThe decision to eat meat, if one could survive perfectly well without it, necessarily amounts to a decision to value the satisfaction of one's tastebuds over and above the life of an animal.\n\nSince animals have feelings and can suffer, this valuation falls at the \"extremely dubious\" end of the moral spectrum. Conscious eaters of meat must accept that they make this dubious valuation with every meal, with the consequence that animals die in order to satisfy their personal preferences.\n\nThe word \"should\" has not been used at all in this post. It's not judging, just reasoning.",
      "parent": "0",
      "gravatar_hash": "1161cc41692b1b5e5a63b3b0e410ae6c"
    },
    {
      "id": "2266",
      "author": "Glaeken T.",
      "author_url": "",
      "date": "2009-07-09 09:46:16",
      "content": "Wow, took you a lot of words to explain/justify your position.\n\nI eat meat because I like it and it's good for the human body.  That's why we have the teeth we do.  Simple 3rd grade science..",
      "parent": "0",
      "gravatar_hash": "db5eb5d986a137b4b220f3cc13a1e550"
    },
    {
      "id": "2267",
      "author": "Tony",
      "author_url": "",
      "date": "2009-07-09 14:14:46",
      "content": "\"Unless you live in a place where there are lots of vegan restaurants (we don't), or are willing to cook _every_ meal at home <b>(we aren't)</b>\"\n\nThat's what I'm talking about. You know the atrocities that happen in all aspects of animal enterprise, but out of convenience you aren't willing to make changes. I am by no means perfect, but I also don't use pathetic excuses (such as preference for taste or convenience) to justify knowingly supporting an industry that tortures and murders animals whilst claiming animal welfare as my one of my main concerns.",
      "parent": "0",
      "gravatar_hash": "2b418f13ba2e3cf315e2158d605a9976"
    },
    {
      "id": "2268",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-09 14:25:56",
      "content": "Thanks for commenting Jonathan! It does get old having to answer the questions, but sooner or later everyone that knows you will already know :)<br />\n<br />\nMichael<br />\n<br />",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2269",
      "author": "lisa",
      "author_url": "",
      "date": "2009-07-09 16:27:41",
      "content": "Hi! I am a pescetarian.\nI always get the question \"Why do you eat fish and not other animals? Isn't just as bad?\"\nWell frankly i don't eat meat because it disgusts me.\nYou hardly have to ever fry fish or bread it or do anything to it.\nAnd thats why I'M a vegetarian.\nBut most people don't get that like carnivores... vegetarians are picky too.\nWe all eat what we eat. Some of us just don't like to eat other animals.\nLoved your article!",
      "parent": "0",
      "gravatar_hash": "efe1b66bbc909d3a7befacf5e6f48c72"
    },
    {
      "id": "2270",
      "author": "Christine McGrath",
      "author_url": "",
      "date": "2009-07-09 17:55:32",
      "content": "I've been a vegetarian for 5 years and everything you said is exactly how I feel.",
      "parent": "0",
      "gravatar_hash": "ca834c7654ea983690c97fb149a7bd6d"
    },
    {
      "id": "2271",
      "author": "Taylor",
      "author_url": "",
      "date": "2009-07-09 21:41:50",
      "content": "Hello,\nI just wanted to say that I enjoyed your article immensly. I am a vegetarian for environmental reasons but I related to your \"anthromorphizing\" a great deal. I have always loved animals and felt a strong connection to them, however animal rights have never been a part of my vegetarianism. While I respect every creature's desire to live, I also recognize that there is a natural cycle of life and that some things will be consumed by others. I became vegetarian beacause humans disrupt this cycle with mass production and genetic alteration etc. - a disruption made evident by the effects on the environmet.\nAnyway, thank you for letting me say my little blurb and for your open minded article. It was a delight to read.",
      "parent": "0",
      "gravatar_hash": "1cf8475fea239eb1f4387d79f5b86ae8"
    },
    {
      "id": "2272",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-09 21:53:07",
      "content": "Yes! I think about the disruptive nature of humans a lot too. Very good point.<br />\n<br />",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2273",
      "author": "Relation K",
      "author_url": "http://www.relation-amoureuse.net/",
      "date": "2009-07-10 00:45:39",
      "content": "I got question regarding vegetarianism - could you eat milk , cheese and etc ? I mean the products of the animals ?",
      "parent": "0",
      "gravatar_hash": "255e2d07f2cf14687393bb96df167f42"
    },
    {
      "id": "2274",
      "author": "Terry",
      "author_url": "http://bcchick.blogspot.com",
      "date": "2009-07-10 00:46:11",
      "content": "My sentiments EXACTLY!",
      "parent": "0",
      "gravatar_hash": "bdfe38812c3cb33f0b8dc47380456dc4"
    },
    {
      "id": "2275",
      "author": "Alison",
      "author_url": "",
      "date": "2009-07-10 09:46:20",
      "content": "Great article. Environmental factors were my main motivation to stop eating meat, but I definitely understand how you feel about the animals' welfare. It has never made sense to me that someone can look at a piglet or a chick or a calf and say, \"Look how cute it is!\" Then, suddenly, that same animal is on their plate and they're saying, \"It tastes so good!\" It just seems sort of twisted.\nI won't go into my biggest reason for becoming vegetarian because it tends to confuse and embroil people when I get them started on it.",
      "parent": "0",
      "gravatar_hash": "5c343457d24abfc332e6099a31abdda9"
    },
    {
      "id": "2276",
      "author": "Catherine",
      "author_url": "",
      "date": "2009-07-10 18:36:02",
      "content": "I'm totally on the same page with you. Great post!",
      "parent": "0",
      "gravatar_hash": "39141e1d18aeed835b5096a2c21e7b17"
    },
    {
      "id": "2277",
      "author": "Trish",
      "author_url": "",
      "date": "2009-07-10 19:23:37",
      "content": "First of all, I love your post!\n\nBut I am concerned about the dairy. I hope you choose dairy products carefully, because very sadly supporting the dairy industry is supporting the veal industry.  Cows can only lactate for so long, and once they dry up, they are inseminated and the calf is usually used for veal.",
      "parent": "0",
      "gravatar_hash": "7a92582fab347881ae4b348171b6b607"
    },
    {
      "id": "2278",
      "author": "Gigi",
      "author_url": "",
      "date": "2009-07-10 22:16:13",
      "content": "Vegetarian is such a loose term, you're all just picky, and you use the term vegetarian so you don't sound rude when you don't want to eat something that someone makes for you. It's not that you CANT eat it because of your food allergies, diet or personal beliefs, it's that you DO NOT WANT TO. Stop causing trouble for everyone else and just eat your side dishes and shut the hell up.",
      "parent": "0",
      "gravatar_hash": "9a04caccfe2e1c910c672546afa27d02"
    },
    {
      "id": "2279",
      "author": "Amber",
      "author_url": "",
      "date": "2009-07-11 00:09:25",
      "content": "I've been a vegetarian for 4 years. I'm only 17, so I seem to get more flack from meat-eaters about my decision. It's always pretty hard for me to get my point across to people who ask because I tend to get angry or flustered and I just drop the subject before I start crying or yelling. This article explains exactly why I made my decision and continue to live by it. So, when people ask me from now on, I do believe I will tell them the URL to this article. Thank you, and I will also be checking out this website from now on.",
      "parent": "0",
      "gravatar_hash": "d5107b46cbee9a70b7a323cfee15fb37"
    },
    {
      "id": "2280",
      "author": "frantic foodie",
      "author_url": "http://www.franticfoodie.com",
      "date": "2009-07-11 03:54:18",
      "content": "Michael, love the way you wrote this one, was a vegetarian for 5 years. You should print this and wear it on your forehead, that way people won't even have to ask",
      "parent": "0",
      "gravatar_hash": "e0605e1425a24bf59d6c35d9c87fae44"
    },
    {
      "id": "2281",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-12 08:37:45",
      "content": "Thanks Amber! I started when I was 18, so I remember well how much flak you take at that age. For what it is worth, it gets a lot easier as you get older and the people around you are more accepting.<br />\n<br />\n<div>",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2282",
      "author": "Sarah",
      "author_url": "",
      "date": "2009-07-12 10:34:01",
      "content": "My reasons are similar to yours, but slightly different. I just find the idea of eating the flesh of another living creature, a creature that can feel pain, and has free will, simply barbaric. We're all connected, I don't see a tremendous difference between eating a cow and eating a human, both disgust me beyond belief. I don't think we should be feeding ourselves on death, it just seems wrong. Armed with this, I can combat any possible circumstance people hypothetically construct for meat eating.\nIt frustrates me when people demand explanations for my choice, and mock me for my lifestyle, thank you for writing such a well voiced and intelligent article that helps to combat the antipathy many meat eaters seem to feel towards vegetarians.",
      "parent": "0",
      "gravatar_hash": "ddb381d2fd61b1ca5c21df5233bdcfba"
    },
    {
      "id": "2283",
      "author": "renato",
      "author_url": "",
      "date": "2009-07-12 11:02:31",
      "content": "I've always seen myself as a \"potential vegetarian\" or an omnivore with vegeterian tendencies, or whatever, but that was never something I gave thoughts about.\n\nSince childhood I've prefered salads and vegetables over meat - with the exception of fish. But you know, living with people who eat meat all the time, you end up eating meat too, even not liking it at all.\n\nWell, I went to Argentina, my favorite neighbour country (time to say, I'm Brazilian). In Argentina all they eat is meat. They are much more carnivores than omnivores. So, that was ok for me, cause since then I didn't have any concern about eating meat, except its taste. But one week of it made me so sick.\n\nWhen I returned to Brazil I thanked so much God or the deities or the powers of nature (you see, I have no standard religion) for the incredible amount of vegetables we have here - I believe it doesn't compare to anywhere in the world. Fresh vegetables! I decided to stop eating meat. Many of my friends were going vegetarian at the same time. Thanks to the Universe and its forces, or to simple coincidence. And most importantly, add to that that my pet dog was run over by a bus and I could see all that suffering and trauma in her eyes. And my own despair. There came the realization that there are feelings between us umans and animals. \"Do animals have feelings?\" is not a necessary question for me, since I have feelings towards them, and that's enough. For your curiosity's sake, she recovered very very well. Dogs are so resistant!\n\nI do very ocasionally eat fish and seafood - so I'm actually pescetarian, which is a specific kind of omnivorism. But meat... since I made my decision I tried meat one more time, but it tasted quite rotten, like a dead thing (which indeed it is). I can't stand the smell of animal fat anymore.\n\nHard to put up with people that think you'll die or get terribly sick if you don't eat meat. So to deal with it I started reading a lot about vegetarianism, and related issues. You know, a little database to try to argue with meat lovers. Most of the texts I've found are just ideological pamphlets, just too irate to be valid. Yours, Michael, is one of the few that address the issue in a nonpassionate, tolerant way. It made me realise that a diet is a matter of choice and should be adressed in a simple, natural way. It's as simple as choosing a pair of shoes to wear (assuming you're not a girl), especially when you feel good about it.",
      "parent": "0",
      "gravatar_hash": "c45b247feffb12af76fdb8880ec11552"
    },
    {
      "id": "2284",
      "author": "renato",
      "author_url": "",
      "date": "2009-07-12 11:04:37",
      "content": "When I say umans, I'm meaning HUMANS.",
      "parent": "0",
      "gravatar_hash": "c45b247feffb12af76fdb8880ec11552"
    },
    {
      "id": "2285",
      "author": "Jim Fowler",
      "author_url": "",
      "date": "2009-07-12 22:23:09",
      "content": "Thanks for honest and thoughtful writing on this subject. I am very like you but not as eloquent...  Jim",
      "parent": "0",
      "gravatar_hash": "5bc080e0980d722ef83c73c439584762"
    },
    {
      "id": "2286",
      "author": "Bill",
      "author_url": "http://www.geektrap.com/bill",
      "date": "2009-07-13 07:29:21",
      "content": "I'm sorry we can't all do the right thing 100% of the time.  By not buying meat products, fur, or leather, I feel that I'm doing a significant amount to keep animals from being exploited on my behalf.  By comparison, I don't think that the small amounts of dairy products I eat are going to support a huge, evil industry.  I'd just as soon go vegan, but my housemates (an ovo-lacto vegetarian, and an omnivore) would make that very difficult.  We take turns planning and preparing meals, and while there are never any meat products included, it would be awkward to expect them to limit their cooking to my preferences.  We very much enjoy cooking and eating together, so I'm not sure what the answer is.  I suppose I could make my own vegan meal every night, but that would sort of take the fun out of our dinner nights.  On a related note, do you feel that it's right to force your beliefs on other people via financial means?  I've always let people make their own choices, even if I'm buying dinner at a restaurant.  I don't eat meat myself, but if they choose to, is it right for me to refuse to pay for it, especially knowing that they can't afford to eat out if I don't?  If you can put aside your hostility for a moment, I'd like to know what you would suggest.",
      "parent": "0",
      "gravatar_hash": "f12a1fdb09c8f6d7873d3d5ee6759e88"
    },
    {
      "id": "2287",
      "author": "Gwen McCauley",
      "author_url": "http://www.ouicoach.com",
      "date": "2009-07-13 09:13:10",
      "content": "Hiya  Saw your posting on the ProBlogger site and I have an opinion about why you got such fabulous response to this posting.  I think it is because you shared yourself with the world!  I'm not a vegetarian, but your recipes look great as does your website.  But recipes don't invite people to share deeply.  This post that reveals you and what makes you tick is a huge invitation for people to interact with you.  Way to go!\n\nIn my coaching practice I spend huge amounts of time and energy with folks helping them to realize that people don't buy products or services ...they buy people!  So the more you reveal yourself, the more attractive a sales proposition you become.  ...and that revealing process is terrifying more most people.  We've all been pretty well trained to protect ourselves by shielding our 'true' self, our authentic self.  It is so much easier to say \"see, look at this great product I can offer you\" than to say \"here I am world, how do you like me?\"\n\nI encourage you to do more of these 'philosophical' postings.  I bet your clients will love it.\n\nCheers\n\nGwen McCauley\n<a href=\"http://www.ouicoach.com\" rel=\"nofollow\">http://www.ouicoach.com</a>\nfollow me at www.twitter.com/gwenmccauley",
      "parent": "0",
      "gravatar_hash": "2de832da216e6d592d4783c7c87f5331"
    },
    {
      "id": "2288",
      "author": "Anne",
      "author_url": "",
      "date": "2009-07-13 11:15:21",
      "content": "I think a piece of the puzzle that some of the vegan arguments are missing, is that not all farming is factory farming.\n\nMy neighbors in our two-family house just built a beautiful, comfortable coop for their three chickens directly below my bedroom. I know the birds by name and personality. In a few weeks, they'll start laying eggs each day, a normal, natural process with no pain or suffering involved; and since the chickens have no need for the unfertilized eggs, my neighbors will eat them. In exchange for that, the birds get free room, board, medical care, and safety from predators, plus lots of petting and treats from our two families. I think that's a pretty sweet deal for a chicken.\n\nI also buy vegetables, herbs, and goat cheese from a local farm where the goats are treated like members of the family, and each goat has her own glamour shot and bio on the farm's Web site. When a goat has kids, the kids stay with her and she's taken out of the milking rotation. They don't sell any of their animals to buyers who are planning to slaughter them. Again, it's a pretty nice life for a goat, in exchange for a little gentle milking.\n\nFactory farming is a horror, and I do my best not to contribute to it - but I don't feel at all guilty about enjoying surplus eggs and milk from well-cared-for animals. If I want to, I can even personally thank them by name.",
      "parent": "0",
      "gravatar_hash": "5cdecc447861b205659b26b2585302fb"
    },
    {
      "id": "2289",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-13 11:44:01",
      "content": "Anne - Well said. I really appreciate that perspective. I&#39;m not able to quite look out the window and see chickens, but I&#39;m sure trying to buy more and more from farmer&#39;s that are that gentle.<br />\n<br />\n<div>",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2290",
      "author": "Vicki",
      "author_url": "http://profile.typepad.com/6p011572028274970b",
      "date": "2009-07-14 04:12:13",
      "content": "What a splendid post. You put many thoughts I share very eloquently. We're just beginning to transition to vegetarianism; it's unlikely our household will ever move completely vegan since we have a couple of confirmed carnivores.\n\nI despair a bit that the perfect is the enemy of the good; most of us live in the great gulf between meat-centric industrial food and perfectly vegan; civility is always appreciated and you catch more flies with, well, I'll say agave nectar, then.\n\nI look forward to exploring your site further and trying out some of your recipes.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2291",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-14 07:24:03",
      "content": "Thanks Vicki - I totally agree. Perfection in this area is definitely not attainable. Even diehard vegans step on bugs, pay for crops that have been harvested by combines that kill lots of rodents and small animals and so forth. I think if we each do what our conscience guides, it is a big improvement.<br />\n\n<br />",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2292",
      "author": "Kimberly",
      "author_url": "",
      "date": "2009-07-14 11:23:43",
      "content": "Sorry it has taken me so long to post, but I just wanted to drop a line and say that I eat meat but have no problem with going to a vegetarian restaurant.  In fact, I often make the dishes you post here at home, always to rave review from friends and family.  I hardly notice that this is a vegetarian blog, but just that it is a good food blog, because you approach vegetarianism with no self-righteousness attached.  I would go to a restaurant for the same reason:  vegetarian meals without attitude.",
      "parent": "0",
      "gravatar_hash": "988fddd0fde142f5686e50999c1d160b"
    },
    {
      "id": "2293",
      "author": "IrishCarrie21",
      "author_url": "",
      "date": "2009-07-15 00:21:26",
      "content": "A thoughtful and eloquent article. I applaud you for speaking about vegetarianism in a non-judgemental manner. Whatever our own beliefs are, maybe we can all learn from Michael's article.",
      "parent": "0",
      "gravatar_hash": "3ad1790c5db65f6e649779875f1e69c6"
    },
    {
      "id": "2294",
      "author": "jen",
      "author_url": "",
      "date": "2009-07-15 18:19:23",
      "content": "that's like saying you don't beat your kids... you just beat them on holidays or special occasions.",
      "parent": "0",
      "gravatar_hash": "b8d647de3bf36e54d93825abc9a17a9e"
    },
    {
      "id": "2295",
      "author": "Jen",
      "author_url": "http://www.localappetite.blogspot.com",
      "date": "2009-07-17 17:18:13",
      "content": "Thank you for writing this. As an on and off vegetarian / pescatarian for about 10 years, I have struggled with these same issues.\n\nI completely agree with your reasoning...actually they're my viewpoints exactly. It's all about the humane aspect for me, with the environment coming in a close second. I actually have justified eating meat by only choosing to consume the most humanely raised I can find, but in the end even that's not really humane either.\n\nI actually do not like soy or soy products much, and think all those processed fake meat things are just as unappealing. Hence, why I can never stick with it for long. But I want to thank you for writing this, it has just renewed my interest in giving vegetarianism another go.",
      "parent": "0",
      "gravatar_hash": "6b0080b7be1416d162a437828a9d0088"
    },
    {
      "id": "2296",
      "author": "Ayrabella",
      "author_url": "http://profile.typepad.com/6p01157124c007970c",
      "date": "2009-07-19 11:24:36",
      "content": "This is exactly how I feel and think about being a vegetarian.  I've been a vegetarian (I do eat dairy and eggs) since 1998 now.  I often wonder why it took me so long (I'm 33) to become one since I've never really liked or enjoyed it; eating meat was just a habit.  At first I still ate fish and shrimp and foods cooked in meat, etc.  But as time went on, I became stricter and stricter, until now I am a VERY strict vegetarian.  How come there are no fast food vegetarian chains?  LOL  Thank you so much for this article!",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2297",
      "author": "Maggie",
      "author_url": "http://www.vanillalatte.com",
      "date": "2009-07-20 01:52:50",
      "content": "This is a fabulous post! I almost want to send it out to all my friends with a disclaimer \"please pretend I am writing this and it will all make sense\". I really admire that you offered explanations for all the other reasons why people go vegetarian or vegan. I agree with your thoughts completely and come from a similar situation. I've been a vegetarian for 15 years and I often stick with a simple answer \"I just don't want to eat animals\". I think you've summed it up perfectly here - Still, when I see a pig or a chicken, a cow or a goat or a fish, I just never think \"boy, I'd like to cut your head off, skin you and eat your muscles\". :)\n\nI completely understand how you feel when traveling to places that have amazing food but due to language barriers or cultural differences, sticking to a vegetarian diet may be difficult. That said, with a little patience, I've never had to eat meat because there was nothing else. I think at the end of the day everyone makes their own choice. And we simply choose not to eat meat and that should be respected. Good luck on your culinary adventures!",
      "parent": "0",
      "gravatar_hash": "939df1bad74db32832729682b5046112"
    },
    {
      "id": "2298",
      "author": "Colleen Cheechalk",
      "author_url": "http://farmatnanticokecreek.com",
      "date": "2009-07-20 06:30:20",
      "content": "I would venture that at least 90% of our meals are vegetarian in my family. Over the years I too have been asked those million times...so you don't even have to \"say\" you are vegetarian to get pounced on. :)\n\nyou summed up so well what so many of us feel and want to say...THANK YOU!",
      "parent": "0",
      "gravatar_hash": "29caad60e56eb723cf2a60422e5820a8"
    },
    {
      "id": "2299",
      "author": "PJ",
      "author_url": "",
      "date": "2009-07-20 09:28:09",
      "content": "I have been a vegetarian for 9 1/2 years and I have just recently started eating fish again. I don't eat a lot of fish and I try to avoid it when possible but there are times when one gets into a situation where one does not have many other choices.\nI agree with you about the animal cruelty. If you go into a slaughter house you and get the smell, it is enough to make anyone quit meat. Then, there are films like \"Fast Food Nation.\" While the movie was slightly convoluted, the ideas and some of the incidences are very real.\nI agree that the environmental and health reasons are perks but I would rather stick to my \"No Kill Diet.\" One of these days, I would like to go back to quitting fish. But not until I get out of school....",
      "parent": "0",
      "gravatar_hash": "e9f8b305b7b542d6ab63386c06000c06"
    },
    {
      "id": "2300",
      "author": "Sarah Washburne",
      "author_url": "http://vegetarianperspective.wordpress.com",
      "date": "2009-07-20 10:18:37",
      "content": "Hi Michael, I enjoyed reading your piece about why you are vegetarian; I thought it was thoughtful and thought provoking. I was raised as a vegetarian and as an athiest. My parents always believed that both God and meat should be chosen through the careful deliberation that only an adult can possess. It's not to say that these two ideas have anything in common with each other, it is just coincidentally the two things about which my parents believed I should be able to consider and consent to. I studied religion in my Catholic Prep school years, and also ate some meat. Both of these things made me uncomfortable! I suppose familiarity helps, but the idea of believing in something just from pure faith and no concrete evidence seems ludicrous to me, and the idea of eating animals with blood, fat and bones utterly disgusts me.\n\nI often think about my religious beliefs when I am thinking about the diet I have chosen for myself. I can't understand how people can have blind faith, and sometimes I question whether it is that exact faith that leads me to be a vegetarian. Michael Pollan's book, In Defense of Food, explains how scientists have \"nutritionalized\" the foods we eat. Because scientists say it is true, many of us believe it. I often question my beliefs about food as they are based on what I read from scientific research. What we believe today may be disproved tomorrow.\n\nConsidering this, I try to have an open mind about real food. I would never condemn anyone's choice to eat meat. I do think it is time to stand up to the large food companies who study what the American palate enjoys and then create lots of non-food for our consumption. I am really bothered by the obesity epidemic and feel strongly enough to take a stance on that.\n\nBlogging is really a scary thing and you have to have a tough skin. You expose yourself to people who love you as well as to those who may get joy from taking anonymous digs. I admire anyone who is willing to go out on a limb for their ideas. You are perpetuating our innate and unique human traits of free will and consciousness - we choose and we think. I thought about eating meat, and I chose not to. It's really as simple as that!\n\nCheers!",
      "parent": "0",
      "gravatar_hash": "3e5674127fbf835db72ea803eaa7077d"
    },
    {
      "id": "2301",
      "author": "Scott",
      "author_url": "",
      "date": "2009-07-20 10:57:02",
      "content": "They actually did have tofu as an ingredient. If you recall, Chef Richard Blais got it and used an animal fat marinade to make it taste like beef. So much for that idea. Just as an aside, @RichardBlais, one of the most creative chefs on the show, just finished a 21 day vegan/no gluten/no sugar diet experiment and declared that it was \"inspiring.\"",
      "parent": "0",
      "gravatar_hash": "3152eb9a826251ff5dd51e86fcb5a01d"
    },
    {
      "id": "2302",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-20 10:58:38",
      "content": "Thanks for the thoughtful comment, Sarah. You are lucky to have had parents who trusted you to come to your own conclusions about such important issues.<br />\n<br />",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2303",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-07-20 11:01:03",
      "content": "I remember that beef-infused tofu from Top Chef! Even though I&#39;d never eat it, I did think it was a pretty hilarious idea. Did Blais write about his vegan experiment anywhere other than twitter? I&#39;d like to hear more about it.<br />\n\n<br />",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2304",
      "author": "molahs",
      "author_url": "http://profile.typepad.com/6p01156f76d95c970c",
      "date": "2009-07-20 11:05:43",
      "content": "Michael, I think veg kids are worthy of their own post. I anticipate that by the time our kids are old enough to choose for themselves they will be adequately brain washed. I had a similar experience with my family religion (and yes, there are a lot of similarities between my choice to be vegan and other people's choice of faith. Another topic...). My parents gave me their best guidance and then let me decide on my own when I was old enough. But we aren't cooking meat for dinner, and my parents never put a cross in the family room.\n\nI am also expecting that my kids' adolescent rebellion will involve tartares and carpaccios, although I can think of much worse things that a teenager could do.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2305",
      "author": "Nithya",
      "author_url": "http://nithya13.blogspot.com",
      "date": "2009-07-21 05:01:40",
      "content": "I really loved reading this. I'm an Indian and am a vegetarian by religion, but I like to think that I would still choose vegetarianism even if I wasn't born to it. I really appreciate the way you've written it, too often both vegetarians and non-vegetarians become far too vociferous while defending their lifestyles.\nI ate a piece of chicken once, because I was eight and wanted to spite my parents. But as I chewed it all I could think of was the animal that had died to provide this meal, that I wasn't even hungry for.",
      "parent": "0",
      "gravatar_hash": "c1366f07b9ea762c5bc2f080dcc0d8a1"
    },
    {
      "id": "2306",
      "author": "Krys",
      "author_url": "http://www.twoveganboys.wordpress.com",
      "date": "2009-08-11 08:33:52",
      "content": "Great article.  I am vegan and have answered the \"why are you vegan\" question a thousand times over as well.",
      "parent": "0",
      "gravatar_hash": "f348d5b81579e5b840fef3cfacac0c6f"
    },
    {
      "id": "2307",
      "author": "Karen",
      "author_url": "",
      "date": "2009-08-12 14:09:21",
      "content": "Hi Michael,\n\nThank you a million times for writing this article.\n\nI've been a vegetarian for nearly 4 years, but have found myself wavering in the past couple of months. I can't think of any event that precipitated the questioning of my beliefs, I just one day started wondering \"Why am I doing this? Am I depriving myself? Is it really *that* bad to eat meat?\"\n\nYou, and many of the comments here, reminded me why I made this choice in 2005. Thank you!",
      "parent": "0",
      "gravatar_hash": "ac6d1ea40052ef75542cc4eac31dc1ae"
    },
    {
      "id": "2308",
      "author": "Amber Lynn",
      "author_url": "http://profile.typepad.com/6p0120a4f9b714970b",
      "date": "2009-08-15 19:51:08",
      "content": "This article was written so well that I just had to post. I stumbled upon your blog, and am grateful to stumbleupon.\n\nI'm a very recent vegetarian (about five months now!) and this is basically how I feel. I'm home visiting family over summer holiday and they didn't take too kindly my choice to not eat me. They say they support me, but are silently judging me. Now I can quote you!\n\nNo judgments, understanding. That's all I'm asking for, and that's what I will give in return. And that's EXACTLY what you gave.\n\nI applaud anyone who has made the choice, and no mater what people say the decision to become veg*n is hard and changing your lifestyle is harder, and that is what people are forgetting. By judging the fact that you sometimes eat eggs/milk products and call lacto-ovo vegetarians idiots, ignorant, etc are forgetting the difference we are still making in the world.\n\nEveryone has the choice, and by being hateful and judgmental (whether to an omnivore, vegetarian, vegan, flexitarian, pescetarian) will get you NO WHERE in this world.\n\nSide not: My best friends and I (most of us are vegetarian or vegan, but as well as the omnivores) are going to open a veg*n cafe, educational camp, and happy farm (although we won't be killing animals...just to be cute)\nand I'm excited that others are wanting to open vegetarian/vegan places too! I live in a state with very little options.\n\nThank You",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2309",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-08-18 22:12:00",
      "content": "Thanks for the thoughtful note, Amber, and best of luck with your cafe /\nfarm project!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2310",
      "author": "Debrah",
      "author_url": "",
      "date": "2009-08-26 19:05:38",
      "content": "I have a video for you Michael, that will show you why you need to give up the dairy if you really and truly don't want to be the cause of suffering in the animal kingdom.  <a href=\"http://animalrights.change.org/blog/view/pregnancy_at_slaughter_what_happens_to_the_calves_part_3_graphic\" rel=\"nofollow\">http://animalrights.change.org/blog/view/pregnancy_at_slaughter_what_happens_to_the_calves_part_3_graphic</a>\n\nI will warn you, it is sad, it is graphic and it is the end result, even on the little local farm that must breed its cows constantly so that they can provide the milk that you think is \"kinder\" in origin.  From being constantly pregnant and lactating, the average life of a cow lasts 5 or 6 years, even though they have a natural lifespan of 25 years.  The calves usually last at the most, for 3 or 6 months and sometimes, as in this case, they don't even get a chance to stand up.  Is cheese really worth it?",
      "parent": "0",
      "gravatar_hash": "764f2cadde01889c2dc734bdc66a29e5"
    },
    {
      "id": "2311",
      "author": "Debrah",
      "author_url": "",
      "date": "2009-08-26 19:14:56",
      "content": "For all you vegetarians and for Michael, I have a video for you that will show you why you need to give up the dairy if you really and truly don't want to be the cause of suffering in the animal kingdom. <a href=\"http://animalrights.change.org/blog/view/pregnancy_at_slaughter_what_happens_to_the_calves_part_3_graphic\" rel=\"nofollow\">http://animalrights.change.org/blog/view/pregnancy_at_slaughter_what_happens_to_the_calves_part_3_graphic</a>\n\nI will warn you, it is sad, it is graphic and it is the end result, even on the little local farm that must breed its cows constantly so that they can provide the milk that you think is \"kinder\" in origin. From being constantly pregnant and lactating, the average life of a cow lasts 5 or 6 years, even though they have a natural lifespan of 25 years. The calves usually last at the most, for 3 or 6 months and sometimes, as in this case, they don't even get a chance to stand up. Is cheese really worth it?",
      "parent": "0",
      "gravatar_hash": "764f2cadde01889c2dc734bdc66a29e5"
    },
    {
      "id": "2312",
      "author": "Debrah",
      "author_url": "",
      "date": "2009-08-27 07:44:11",
      "content": "Michael you seem like a nice guy with good intentions and as a result are teetering on the brink of really making the full commitment.  People don't seem to understand that their cup of milk in a recipe, or little dish of ice cream after dinner are the cause of suffering that is awful.  The following video says it all.  I will warn you that it is sad, infuriating and yes, graphic, but then isn't suffering graphic no matter who's being violated, be it man, woman, child or animal?\n\n<a href=\"http://animalrights.change.org/blog/view/pregnancy_at_slaughter_what_happens_to_the_calves_part_3_graphic\" rel=\"nofollow\">http://animalrights.change.org/blog/view/pregnancy_at_slaughter_what_happens_to_the_calves_part_3_graphic</a>",
      "parent": "0",
      "gravatar_hash": "764f2cadde01889c2dc734bdc66a29e5"
    },
    {
      "id": "2313",
      "author": "Debrah",
      "author_url": "",
      "date": "2009-08-27 13:18:32",
      "content": "Michael, I'll just bet you are going to delete my comment again, just as you did the last two times that I posted (successfully) a video that demonstrates all to clearly why consuming dairy is no less cruel than having a steak.  I'm not going to go into a huge rant because I can see that your committment to cruelty free eating has its limits, you are obviously digging in your heels and refusing to face the reality of your choices.  I do hope though that when you are questioned in the future about your lifestyle choice that you qualify your remarks by saying that you aren't too concerned about dairy cows and calves and of course chickens who lay eggs or at least admit that you are a slave to your appetite and/or too weak to give up dairy and eggs.  Or maybe you should just say that you don't like eating meat because obviously avoiding cruelty isn't really high on your list of priorities.",
      "parent": "0",
      "gravatar_hash": "764f2cadde01889c2dc734bdc66a29e5"
    },
    {
      "id": "2314",
      "author": "Debrah",
      "author_url": "",
      "date": "2009-08-27 14:39:19",
      "content": "I am here to apologize publicly to Michael for my last post, wherein I called him out for deleting  a post(s) with video link.  Because I failed to see the More Comments button, I mistakenly thought that I'd done something wrong when leaving a comment and so left it again.  At that point, still not seeing the second comment (and I was sure that I'd done it right this time), I assumed that he was deleting them and would subsequently delete my \"tongue lashing\" left at 1:18.  So I'm here to say I'm sorry for the obnoxious tone of that last post because it was all my mistake, not him.  Sorry.",
      "parent": "0",
      "gravatar_hash": "764f2cadde01889c2dc734bdc66a29e5"
    },
    {
      "id": "2315",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-08-27 14:43:57",
      "content": "Apology accepted, and I do intend to watch your video!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2316",
      "author": "Sam",
      "author_url": "",
      "date": "2009-09-02 12:35:52",
      "content": "With posts like this all you do is damage your cause.",
      "parent": "0",
      "gravatar_hash": "b1856d0403abd6fef860e9bda615136d"
    },
    {
      "id": "2317",
      "author": "Claire",
      "author_url": "",
      "date": "2009-09-02 16:00:18",
      "content": "I'll freely admit to being one of those people who asks people why they chose to be vegetarians.  I've heard so many interesting stories as replies to that question.  Some have told me that they grew up in vegetarian households, and one day had a lot of meat, and got awfully sick, and then had a revulsion towards meat, even if they had no ethical/etc.  qualms with eating meat.  Others have seen animals slaughtered and didn't want to partake in meat eating after that.  Others (often boomers) were put on vegetarian diets by their doctors to prevent heart attacks. And yet others are vegetarians for different environmental reasons.\n\nI guess, as an omnivore (although one whose diet is largely plant-based), I tend to be curious as to why people make the choices they do about food.  I don't tend to ask as much as I did when I was in high school/college, and I guess it hadn't occurred to me that vegetarians are asked that question so often that it could get annoying to answer it.\n\nWith regards to some of the comments, I hate it when people are aggressively defensive about the choices they make.   I've seen that in a wide cross section of people-- in the food world, I've seen it heavy meat eaters, vegetarian/vegans, people who eat only organic foods, and people who eat mostly processed foods.  I guess sometimes people are so insecure about the choices they make, that they feel that they must put down people who make different choices in order to show that their own choices are \"right,\" but I think that tactic typically backfires.",
      "parent": "0",
      "gravatar_hash": "46fc7cbd67b8322e48746e454e3d2a1d"
    },
    {
      "id": "2318",
      "author": "karen",
      "author_url": "",
      "date": "2009-09-05 11:36:28",
      "content": "Really interesting conversation.  The push-pull between vegetarian and vegan.  My reasons for going veggie are exactly like Michael's.  Having learned about how dairy and eggs are produced makes me choose vegan the majority of the time.  Still buy free-range eggs and buy greek yogurt (for the hubby), but know that these choices still contribute to animal suffering.\n\nInteresting too about the back and forth charges of 'being judgmental.'  It certainly is relative, isn't it?  Yes, we can try to justify eating eggs and dairy as more compassionate than meat eating, but the truth is that it really is part of the same overall animal industry that puts animals in unnatural and cruel conditions in order to keep up the human food supply.  The only exception I can think of would be to keep a couple of hens as pets and then eat their unfertilized eggs  when they are laid.\n\nOver the years I've gone back and forth between the kind and tolerant view that Michael has and generally express that to my omnivore friends.  However, at the back of my mind, knowing what I know, I cannot justify my own dairy and egg consumption.  When not expressed, it feels like I'm not being entirely honest with myself and my friends.  So, I can definitely relate to what the accused 'hardliners' like Tony are expressing.\n\nSo, perhaps we can all be kinder to one another, but also acknowledge and understand what the 'hardliners' are expressing?  Sometimes a difficult but real presentation of the awful truth can at least make people think.  Although some people say it's not  'nice' but rather 'harmful to the cause', it really does get to the truth of the matter.  Whether or not we can handle the truth is our own problem.",
      "parent": "0",
      "gravatar_hash": "21b6a0e55cb859f03ce9d8812650f9c7"
    },
    {
      "id": "2319",
      "author": "Shelly",
      "author_url": "http://experimentalculinarypursuits.wordpress.com",
      "date": "2009-09-07 19:32:37",
      "content": "Hi Michael,\n\nI stumbled upon your blog while searching for veggie food blogs (i just recently started a food blog of my own) and find myself really resonating with your thoughts. I've been a vegetarian since I was 14 and haven't turned back since. While i'm not one of those animal-hugging lovers, I just instinctively feel that it's wrong to kill these animals and eat them for my own pleasure. But again, 80% of the people I live and interact with are Omnivores and I don't judge them for decisions and lifestyle choices they make either.\n\nI've also experienced the \"inconveniences\" of being a vegetarian. It's extremely difficult to have people consider you a true connoisseur of food, and there are some amazing restaurants I can never try because they don't offer any vegetarian options. My dreams of ever competing on The Next Food Network Star, or Top Chef are also shattered everytime I see that the challenge involves cooking some kind of animal!\n\nAnyways, I just thought I'd drop a line and give my 2 cents. It's great to be able to connect with other people who share a passion for food, esp fellow vegetarians. If you get the chance, check out my site: <a href=\"http://experimentalculinarypursuits.wordpress.com\" rel=\"nofollow\">http://experimentalculinarypursuits.wordpress.com</a>\n\nCheers!",
      "parent": "0",
      "gravatar_hash": "13d9cc91213fe6f7f27ea883fc607054"
    },
    {
      "id": "2320",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-09-07 20:39:40",
      "content": "Hey Shelly - thanks for the thoughtful note and best of luck with your new\nblog. Btw, if you find yourself in the SF Bay Area again it is totally worth\na drive up to Ubuntu in Napa - that truly is a great veg. restaurant. I\nskipped MIllenium because I looked through their cookbook and it scared me,\nyour meal makes me think I made the right choice.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2321",
      "author": "Emily",
      "author_url": "",
      "date": "2009-09-20 09:57:05",
      "content": "I don't think fish can \"gasp for air.\"  Very well written piece. I was vegetarian for about a year and a half. I did it mainly out of boredom. I usually get annoyed with the animal rights argument because it's so accusatory. I don't think I'm committing murder by eating meat. A cow is not a human and I think it's important to realize the differences.  That said, I respect your empathy for animals and your nonjudgmental viewpoint. I eat meat now, but not that much. My vegetarian stint kinda got me out of the habit.",
      "parent": "0",
      "gravatar_hash": "500cbcb5daf35595e428e754f4ecccbb"
    },
    {
      "id": "2322",
      "author": "Elia Kaninchen",
      "author_url": "",
      "date": "2009-09-26 08:22:30",
      "content": "I don't have a huge desire for big hunks of meat. You won't find me eating a steak or a heap of bacon. (I have eaten steak very willingly twice. I had an immense craving for it despite normally not wanting it at all, and figured my body knew something I didn't, maybe a temporary iron deficiency) As far as the environment goes, I know that beef and pork are much worse than chicken, so I pretty much eat as much chicken as I want, and avoid the other two. Actually, if I go to a restaurant and am equally attracted to an option involving meat and an option without, I will choose the option without.\n\nI have a lot of vegetarian and even vegan friends, and I respect their choices, although I have to say that I find it much, much easier to be around vegetarians at meal time. For example, to feed them in my home, or to take them to a restaurant - I can be happy with a vegetarian meal, I tend to struggle to be satisfied with a vegan meal. I feel apologetic and trapped when I have little to offer a vegan.\n\nI should maybe mention that I am allergic to almost all raw fruits and vegetables, which makes it even harder. I would probably die on a raw food diet.",
      "parent": "0",
      "gravatar_hash": "27a8cacaf65b64f22dd31639987abda3"
    },
    {
      "id": "2323",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2009-09-29 09:41:05",
      "content": "That must be terrible to be allergic to all those raw foods! Thanks for the\nthoughtful note, I think it is important to hear from people who aren't\nhardened into a position one way or the other.\n\nThanks,\nMichael",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2324",
      "author": "Liza",
      "author_url": "",
      "date": "2010-01-06 19:45:03",
      "content": "I do believe I understand your point, although I'd like to note that the vast majority of farmed animals are <i>not</i> treated to comfortable lives with compassionate owners. The vast majority of farmed animals live on industrial farms, where industry is characterized by the quest to achieve maximum output for minimum input. It's not joyful, I think.\n\nI think you're confusing livestock with pets, actually. My impression, although this may not be fact, is that livestock is most likely to be killed young, as the meat is understandably most tender in younger animals. Dairy cows and goats are an exception. Veterinary care is expensive, so I think I am right in my belief that minor injuries generally go unnoticed and uncared for, and major injuries and illnesses are stopped via death. So nix that, thank you.\n\nFurthermore, the exploitation as you describe it by humans on humans is a result of the society that we, humans, have built up around ourselves. We exploit each other for the benefit of the comfort of the middle and upper classes. Animals are uninvolved in this. Exploitation of an uninvolved party caused by bitterness about being exploited by another human seems slightly unreasonable.",
      "parent": "0",
      "gravatar_hash": "66f3368e14a6d8951243786a79be7254"
    },
    {
      "id": "2325",
      "author": "Pielette",
      "author_url": "",
      "date": "2010-02-01 23:07:29",
      "content": "I found this website in an answer you left at YA. I thought I'd get it a read.\n\nI was a pescetarian for over a year and a half and I finally gave in and started eating white and red meat because my family members were bothering me. \"Oh, my cooking isn't good enough for you?\" \"Why won't you try the lamb?\" \"Fish is all you eat? Aren't you bored.\" Nag nag nag. I got tired of it and let them all have what they wanted and they all smiled and said, \"We knew you couldn't do it.\" The only people who were understanding about my decision were my parents. My mother eats chicken very seldom, but loves seafood and vegetables (especially yams). My father drinks tea and eats rice..and that's about it. So, they understood me completely.\n\nLately, my health has been a wreck. I'm in and out the hospital, gone through a CAT-scan or two and I'm done with it. So, I decided to choose the vegetarian lifestyle a few days ago.. and I was doing good until we took the corned beef that we had been brining for week out the oven and make Reuben's during class (I happen to go to culinary school... it's hard not eating meat). I ate 3 sandwiches and some fat (gags) and wanted to choke myself by the end of the night. Eww.\n\nI got serious. I signed a pledge that said I would go vegetarian for 30 days... or so I thought. It really said \"vegan,\" but that didn't matter. I would be vegan for 30 days. No one in my school believes I can do it because I'm a carnivore, but I have faith in myself. ^__^ It's been only two days, yet I'm happy and full and I fell back in love with kalamata olives and artichokes. Yum! When the 30 days are over, I will become a full-fledged vegetarian and will (hopefully) not look back on my carnivore days and be nostalgic. Wish me luck!\n\n...Sorry for the wall of text. I don't have many people to talk to about this because they all shut me down. -sigh- Thanks for listening! ^_^",
      "parent": "0",
      "gravatar_hash": "4bf7687590c02b4796523d1e8a0d8797"
    },
    {
      "id": "2326",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-02-01 23:18:24",
      "content": "Thanks for commenting, Pielette, and best of luck with making the transition. I can only imagine that culinary school is a tough environment in which to do it. I hope that you can find some more supportive or at least non-judgemental friends!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2327",
      "author": "constance",
      "author_url": "",
      "date": "2010-05-10 19:58:22",
      "content": "the term holier than thou comes to mind, and I don't mean Michael.",
      "parent": "0",
      "gravatar_hash": "ce08a0b468aec69d2b00f5dfb51e294e"
    },
    {
      "id": "2328",
      "author": "jen",
      "author_url": "",
      "date": "2010-05-11 08:50:29",
      "content": "Hi Michael, I found your blog recently and just saw this post. Thanks for summing up my feelings on vegetarianism pretty much word for word.\n\nOn the vegan thing...I was a vegan for a few years in the early 90s. I found that my heady feelings of self righteousness eventually wore off and since I'd convinced no one around me to go vegan (they were veg though) I became more resentful and ultimately grouchy because I really missed cheese and eggs.\nI figured the animals and vegetarianism in general needed a happy vegetarian rather than a bitter vegan.\n\nMy husband went back to meat eating long ago but our kids 7 and 9 are happily vegetarian. well...mostly.\nLast year the 7 year old expressed an interest in \"chicken fingers\" and sadly he likes them. It was pretty painful for me to watch but we had agreed that when a kid wanted to try meat we had to let him. He still thinks of himself as a vegetarian and maybe he will end up there but that will be his choice.",
      "parent": "0",
      "gravatar_hash": "20ae4a6861028fe7a8f00cddf9533789"
    },
    {
      "id": "2329",
      "author": "nicoledgraziano@yahoo.com",
      "author_url": "",
      "date": "2010-07-16 11:28:05",
      "content": "Michael,\n\nI am curious as to why your website is named Herbivoracious when you consume animal products. I wont go over the cruelty involved in the egg and dairy industry with you as I am pretty sure that you are knowledgeable on this matter. An herbivore does not eat animal products. I mistakenly stumbled upon this website looking for a vegan resource.",
      "parent": "0",
      "gravatar_hash": "c6e7aac93f7e138b024892d9cc011537"
    },
    {
      "id": "2330",
      "author": "Lea",
      "author_url": "",
      "date": "2010-08-01 20:53:59",
      "content": "Like you, Michael, I have been a vegetarian for about 25 years, although for extended periods of time throughout the year, I adopt a \"vegan\" diet (for religious reasons). My choice to go to a vegetarian diet was clinched when, following one of these \"vegan periods\" I came to the realization that I felt so much better when I consumed no meat. I never went back, nor do I miss meat at all. I do miss fish, but not enough to eat it. But the main reason for excluding meat from my diet was the animals - such sweet and gentle creatures.  I just hate the thought of putting them through such horrific treatment so we could fill our bellies with their flesh. Finding good-tasting food was not much of a challenge, though, because of our \"fasting\" periods throughout the year. Lots of beans and greens and veggie dishes - creative and outrageously delicious!\nI really like tofu and want/need to work on creatively using it more in my cooking.  I also enjoy using the meat substitutes on occasion, especially when I am converting some of our traditional (Greek) dishes to accommodate my daughter's vegan diet and my vegetarian diet. A challenging task, but fun - and often surprisingly successful!\nI am not a big dairy consumer, but when I do use eggs I go for the more \"humanely\" produced eggs. I wish I could have my own egg-laying chickens, though! And I do eat a fair amount of yogurt.\nBecause most of my friends and family are omnivores, I will sometimes prepare meat dishes.  Perhaps that is hypocritical. It's complicated...\nLike you, too, my goal is to one day open a restaurant or a catering business. I wish you all the best in your endeavor - you certainly are well on your way to amassing great menu possibilities with the recipes you've been posting! Thanks for sharing them!",
      "parent": "0",
      "gravatar_hash": "442e785c165a05ff7b50e50f01391355"
    },
    {
      "id": "2331",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-08-04 21:26:37",
      "content": "Thanks for the thoughtful comment, Lea! I wish I could taste some of your vegified Greek classics. Any particular successes we should all know about?",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2332",
      "author": "Anonymous",
      "author_url": "",
      "date": "2010-08-26 22:02:29",
      "content": "This is a fantastic post! Keep on doing what you're doing, Micheal. :)\n\nI'm an omni who's trying to eat more veggies and less meat. Will I go completely veg in the future? It's hard to say. I think that it's the little things (eating less meat, not wearing animal skins, bu etc) that count as well. If you want to be a high-raw vegan, that's fine by me. If you want to eat meat, that's fine by me too. This might sound kind of sad, but it's wonderfully refreshing to see a veg*n who is very respectful of other people's choices, and one that does not preach.\nI only wish I could say the same for some of the comments on this post...",
      "parent": "0",
      "gravatar_hash": "05ff349b8b41ad616ad5154045b11a50"
    },
    {
      "id": "2333",
      "author": "Jayanth",
      "author_url": "",
      "date": "2010-09-12 11:56:36",
      "content": "To eat meat, an animal - a living thinking creature - must die. Luckily I have never eaten meat on purpose in my whole life (born vegetarian! because im hindu).\n\nUnfortunately its incredibly difficult to avoid meat - at my school lunch everything is non-vegetarian except for a bland tasteless burrito and a disgusting pizza in which the cheese is twice as hard as the crust. :(",
      "parent": "0",
      "gravatar_hash": "0b8871725904916084cf8fc613a941a4"
    },
    {
      "id": "2334",
      "author": "Jayanth",
      "author_url": "",
      "date": "2010-09-12 11:58:46",
      "content": "yeah theres no point being a preachy vegetarian - its not like telling people animals die when you eat meat will change much. :( I respect other peoples' food choices although it would be nicer if people cut down on the meat.",
      "parent": "0",
      "gravatar_hash": "0b8871725904916084cf8fc613a941a4"
    },
    {
      "id": "2335",
      "author": "Rini",
      "author_url": "",
      "date": "2010-09-18 16:09:32",
      "content": "I just came across this blog/post today. I usually am a silent reader of other blogs. I was compelled to say something because your reasons of being vegetarian are so similar to mine.\n\nI've grown up in India, so yes, always having lots of veg options was great. Living in the US now I do miss my options however can't justify any sort of animal killing. You can see the pain in their eyes!\n\nI also plan on raising my future veg until they choose otherwise.",
      "parent": "0",
      "gravatar_hash": "ab23db92a3ec450d10ac7002cea1e2b0"
    },
    {
      "id": "2336",
      "author": "Rini",
      "author_url": "",
      "date": "2010-09-18 16:12:35",
      "content": "Really??\nEven though I agree on not eating meat/animal products people like you make the rest of us seem judgy and intolerant! There is not much difference between you and hard core omnivores who try to \"convert\" me.. Both extremes are equally wrong. Free country. Free will.. end of discussion.",
      "parent": "0",
      "gravatar_hash": "ab23db92a3ec450d10ac7002cea1e2b0"
    },
    {
      "id": "2337",
      "author": "Jaymestephens84",
      "author_url": "http://profile.typepad.com/jaymestephens84",
      "date": "2010-09-26 07:35:59",
      "content": "There IS a such thing as 'nearly vegan'.  I'm a very strict vegetarian, but due to financial reasons I can't be as picky about if a veggie product has a smidge of egg or milk protein I have to deal with it b/c the other stuff that doesn't have it is out of my price range.  You are one of 'those vegans' that make the rest of us have to explain ourselves.  Seriously, stop it!  I AM mostly vegan in the fact I don't eat ANY meat, no dairy or eggs directly, and I don't use any animal products such as leather or fur.  It makes ME feel better. I'm not one of the judgmental vegans like you though, but b/c of the ones like you I'll spend my life defending the fact that I just plain don't LIKE meat.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2338",
      "author": "Jaymestephens84",
      "author_url": "http://profile.typepad.com/jaymestephens84",
      "date": "2010-09-26 07:43:26",
      "content": "I thoroughly HATE having to answer 'why are you vegetarian'...my answer is \"because I don't like meat\".  I have been a vegetarian for 6 years, since I was 20. I only learned of the factory farm stuff in recent years, so that wasn't even a deciding factor, it just keeps me from converting back. Leather and fur always freaked me out b/c it to me is no different than wearing a person's skin, and thats just nasty.\n\nI hate when someone I actually liked (notice the past tense...) decides to grill me about it, b/c then I wind up going off on them for trying to make me feel I had to defend it and don't talk to them again lol.  I've not really LOST friends b/c of it, but its certainly shown me who truly respects me and who is just nosy...lol.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "2339",
      "author": "heidi",
      "author_url": "",
      "date": "2010-09-27 08:58:10",
      "content": "What a great article!  It gives pause for thought but doesn't come across as preachy.  And I could so resonate with the reasons you gave for being a vegetarian.\nI'm almost there, Michael, though I do eat fish from time to time. I have a tendency to lean towards veganism on most days and I'm trying hard to make ethical food choices.  So many of your recipes look amazing...I can't wait to get into the kitchen and try a few!\nI'm so happy to have stumbled across your website and look forward to returning to this site often.",
      "parent": "0",
      "gravatar_hash": "9270a132a17e35a90d7e8b5728fff4fe"
    },
    {
      "id": "2340",
      "author": "Amber",
      "author_url": "",
      "date": "2010-10-03 14:00:25",
      "content": "I've been a vegetarian for 12+ years (I'm 22, so that's saying something!) Technically I'm lacto-ovo, although I dislike the idea of dairy entirely and won't eat milk or eggs in their base form, though I do eat products made from them (IE, I'll eat a baked good made with eggs, but I won't eat a fried egg or an omelet). I enjoy eating vegan and gluten-free on occasion, and I'd eventually like to go vegan entirely, but it's just not logical for my current situation (I have little access to vegan food and other resources). As to why--I just think eating meat is gross. I can't differentiate between eating a cow leg and eating a human leg. It's still flesh, skin, muscle, etc, and I find that utterly disgusting.\n\nWe're not all perfect. One person's 'ideal lifestyle' may be another's 'you're still being immoral'. Morals are relative. I do what works for me.",
      "parent": "0",
      "gravatar_hash": "08487e62cf095335b1d3083a4abd316a"
    },
    {
      "id": "2341",
      "author": "steve",
      "author_url": "",
      "date": "2010-12-11 17:00:31",
      "content": "Well written, no argument.\n\nAnimals eat animals, alive, no matter how cute they are. By the time the cut of meat has made it to the store, the animal was long gone and a choice not to eat it hasn't saved the animal, it's a personal choice but nothing more.  Nature is about as natural as one can get.  There is a food chain, and all living things are in it, somehow.  Not accepting that really suggests a discomfort with nature rather than harmony with it.\n\nThe industrial food machine is bad and it's about as big a human embarrassment as there is.  Animal raising done small-scale and as humanely as possible with respectful slaughter is as good as it can get given the industry in question, especially in comparison to what would happen in Nature.\n\nEveryone makes personal choices to make themselves feel better about something, the real question is, what can be done to make a difference for the animals?",
      "parent": "0",
      "gravatar_hash": "e6fb65d52f5ab34d2c5b029a3ee3557b"
    },
    {
      "id": "2342",
      "author": "Aliza",
      "author_url": "",
      "date": "2011-01-04 15:33:35",
      "content": "Thank you for this. I have been a vegetarian my entire life. My mom became a vegetarian a few years before I was born. My dad has always eaten meat, so I always had the option of trying some steak or something from his plate as a child, but I never wanted to. Now as an adult, my fiancee eats meat and says before he met me he didn't think vegetarians liked food.   People have always asked why I am a vegetarian and what I usually say is that, to me, eating meat seems like taking a bite out of my own arm. It just never appealed to me.",
      "parent": "0",
      "gravatar_hash": "9f5e983c5a39a8b12a0cf3c5c928644b"
    },
    {
      "id": "2343",
      "author": "Kirstin",
      "author_url": "",
      "date": "2011-01-05 15:29:03",
      "content": "I guess I have been completely ignorant for 25+ years too. I stopped eating meat when I was 18 because I couldn't stand the thought of eating flesh. I would still drink milk and cheese, (I love cheese!) because I thought \"organic\" meant they took care of their animals. After reading everyone's comments about the dairy and egg farms, I can't stand the thought that my actions cause animal suffering. Thank you for opening my eyes to what is really going on out there. It breaks my heart.\nI also live in Seattle with an abundance of lovely farmers markets. I will have conversations with them about their animals. Luckily, my friends and family have chickens on their property and give away fresh eggs. I know they love their animals and let them roam all over their gardens happily chasing bugs.\nI am fortunate to have many choices in my area and don't need to rely on dairy and egg farms.\nThank you all for sharing your stories.",
      "parent": "0",
      "gravatar_hash": "951953327a3a1bbf0288294f5409341a"
    },
    {
      "id": "2344",
      "author": "Sally Blake",
      "author_url": "",
      "date": "2011-02-11 02:56:33",
      "content": "I too am a vegetarian.  My thoughts on the subject are very similar to yours. I also look animals in the face and see feelings and desire to live.  Now, to me, eating a cow would be as bad as eating my dog or my cat. I was squirmish as a child when we watched my grandmother kill 2 chickens every time we went to visit her.   Don't you love the word squirmish?  In my family however, I would not have been allowed to be a vegetarian. I would have been made to sit at the table 'till my plate was cleaned.  When I became a vegetarian as an adult, many in my family were horrified.  They finally accepted it, simply because I am considered the weird one in the family. My brother who has had 5 heart attacks and more than one open heart surgery tells me that I would be healthier if I would eat meat.  I am a diabetic, and because of an accident, I have chronic pain, and am disabled. I became a vegetarian because my daughters did. I wanted us to be able to eat the same things.  Though they made the decision after becoming adults, we still lived together then.  We each had certain health problems, and I wanted to be sure that everyone got the right nutrition.  In public I am usually vegan, because I can't be sure if the eggs being served are cage free.  I can't be sure if the milk has Vit A palmitate and Vit D 3 that are derived from animal or vegetable sources.  I cant be sure if the rennet in the cheese is animal or vegetable based.  It is easier to choose foods that I am fairly certain are vegetarian. I guess my feelings are that I am tired of telling people why I am a vegetarian.  I wouldn't think of asking someone why they eat meat.  People don't want me, as a vegetarian, to judge them; and yet they judge me and ask me to justify my eating habits.  Thank for the chance to tell my story.  sjbmouse",
      "parent": "0",
      "gravatar_hash": "15efb22e4c2d9dbc97ebc03258f8102e"
    },
    {
      "id": "2345",
      "author": "Silky Sienna",
      "author_url": "http://www.salad-a-day.com",
      "date": "2011-04-21 07:00:48",
      "content": "Harsh much? The writer cannot eat most vegan due to the high amounts of soy products used as a protein replacement in vegan cooking. Simple enough. I too utilize a lot of vegan recipes, due to dairy intolerance, I find them convenient. And I love seafood. I invented a new category: Seagan. I eat vegan with seafood. So THERE! Deal with it!\n\nPPPPLLLLLLLLPPPLLll! (giant raspberry at you)",
      "parent": "0",
      "gravatar_hash": "57f2799d80a568b0503d5f2bd494a531"
    },
    {
      "id": "2346",
      "author": "Silky Sienna",
      "author_url": "http://www.salad-a-day.com",
      "date": "2011-04-21 07:12:54",
      "content": "Bison is a great meat. Those animals are too big to cage. Did you ever see one in person? And Ted Turner raises bison on his 2 million acres of land across the country. They roam and eat grass, so it is a good life for them. The meat is supposedly leaner than chicken or fish.\n\nI guess a vegetarian blog may not be the ideal place to start talking about the wonders of buffalo.",
      "parent": "0",
      "gravatar_hash": "57f2799d80a568b0503d5f2bd494a531"
    },
    {
      "id": "2347",
      "author": "Silky Sienna",
      "author_url": "http://www.salad-a-day.com",
      "date": "2011-04-21 07:18:51",
      "content": "There are a lot of videos on YouTube of chickens in horrible conditions for egg production, just awful. Milk cows get treated a little better because you want a healthy cow. Small organic farmers also commit to not using antibiotics and growth hormones. And the cows can pasture all day while making their milk for people. I loved cheese, but for an intolerance..when I feel weak, I go right for the pizza! Everytime.",
      "parent": "0",
      "gravatar_hash": "57f2799d80a568b0503d5f2bd494a531"
    },
    {
      "id": "2348",
      "author": "Kamini",
      "author_url": "http://www.saffronandsilk.blogspot.com",
      "date": "2011-05-19 01:15:17",
      "content": "Love your explanation of why you are a vegetarian! I was vegetarian for 49 years of my life. This March, a couple of weeks before my 50th, I turned vegan! One - because I have heard of why dairy is not good for one's health, and two - because I love animals and want to stay way from all animal products. I have never felt better, fitter or more energetic in my life than I have the last 2 1/2 months. That being said, I do love your blog. I lived in Seattle for 23 years before relocating back to India, my country. Being  a vegan here is tough as hell, but I am learning to cook vegan...thanks to blogs like yours! Oh - and I must have been to Cafe Flora a gazillion times while i lived there!",
      "parent": "0",
      "gravatar_hash": "1e7bb11388297714efbf49bb756e0a41"
    },
    {
      "id": "2349",
      "author": "Nathan Rosenbaum",
      "author_url": "",
      "date": "2011-05-25 11:35:38",
      "content": "Wow, Michael, I loved this blog.  While I'm an unapologetic carnivore, you raise some persuasive arguments, particularly around looking the animal in the eye and seeing a certain understanding in reply.  I once went to a poultry processing plant, and witnessed the de-beaking process of a chick only a few hours old.  Will never forget the bright orange glow of the chick's flattened beak.  And, I no longer eat veal, after watching a sickening film on how young cattle are raised and slaughtered.\n\nIt's certainly something to contemplate . . .",
      "parent": "0",
      "gravatar_hash": "eb2e1d1f90904a4cd97d638328722a15"
    },
    {
      "id": "2350",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-05-25 20:11:09",
      "content": "Thanks for the thoughtful comment, Nathan. How did you happen to be in a poultry processing plant? I&#39;ve heard that they generally don&#39;t exactly invite folks in for tours :).",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2351",
      "author": "Sobachatina",
      "author_url": "",
      "date": "2011-05-26 09:05:55",
      "content": "You undermine your position with your undisguised vitriol. It is possible to find well treated chickens and dairy animals. And milk and eggs don't require death.\n\nYour post is the sort that gives vegetarianism a bad name.",
      "parent": "0",
      "gravatar_hash": "ed9825d0e4d0f40998296bceab3656c2"
    },
    {
      "id": "2352",
      "author": "Sobachatina",
      "author_url": "",
      "date": "2011-05-26 09:19:15",
      "content": "Thank you for your well reasoned post. This was a delight to read and I find myself agreeing with every point you made.\n\nI came to a similar realization a few years ago. We eat meat sparingly but I realized that if I wasn't willing to butcher a chicken then I was being a hypocrite by eating them. I don't think this reasoning applies to everyone but it did to me.\n\nMy solution was the opposite of yours. I decided to raise chickens. They live better than they would in the wild. We keep them mostly for eggs but do have some for meat. They are treated humanely at every stage of their life- including their death.\n\nWe recently bought some land so we can continue this experiment by raising goats for milk and meat.\n\nI'm glad I finally clicked through to your blog from SeasonedAdvice- I look forward to trying some of your recipes.",
      "parent": "0",
      "gravatar_hash": "ed9825d0e4d0f40998296bceab3656c2"
    },
    {
      "id": "2353",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-05-26 10:44:47",
      "content": "Hey Sobachatina - great to see you over here from Seasoned Advice, and thanks for the thoughtful comment. I totally agree, it all comes down to individual choice and conscience. I&#39;m impressed with the degree of commitment you&#39;ve made to following through on your choice!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2354",
      "author": "Nancy",
      "author_url": "http://www.alittlelessmeat.com",
      "date": "2011-08-21 17:19:47",
      "content": "Wow! Your reasons for choosing vegetarianism are very similar to mine (I quit eating meat in 1983--age 5). I wish I could be vegan, but it is impractical in our society.\nThanks for your rhetoric--I put a link to it on the \"About Me\" page on my new vegetarian recipe blog www.alittlelessmeat.com",
      "parent": "0",
      "gravatar_hash": "72e7b0c7dd4581a13f91875532e84125"
    },
    {
      "id": "2355",
      "author": "Angela FRS",
      "author_url": "http://foodieroadshow.blogspot.com",
      "date": "2011-08-27 09:55:53",
      "content": "This really effectively mirrors my own take on this, though I have shifted from vegetarian to eating ethically-raised meats now and then.  Just found your blog and I look forward to reading more.",
      "parent": "0",
      "gravatar_hash": "99291d5f3518a2980d1670ad6b2761f2"
    },
    {
      "id": "2356",
      "author": "Eleanor",
      "author_url": "",
      "date": "2011-08-31 04:07:47",
      "content": "I've only recently discovered your blog and love it! Your explanation is very close to my own and so well put! One thing you mention, and that I struggle with, is the general feeling that consuming ethical meat, where animals live out better lives and suffer far less cruel deaths, is significantly better than consuming factory farmed meat. I know this to be true, but my own disdain for the two farmers is almost equal. Ultimately, the ethical farmer is still confining an animal, raising it for the purpose of killing it and realizing a profit from its death -- and gets to feel good about it.\n\nI sometimes think of things this way: if someone kidnapped me and confined me for several years but was SUPER nice and loving and awesome to me (maybe he gives me baths and brushes my hair -- thanks!) before finally killing and eating me, that is still pretty creepy stuff, right? How about just kill me right away? I think I would like that better. We would not accept this treatment for women or people with disabilities or minority groups, so why accept it for animals?\n\nUltimately, I think we should not dominate animals just because we can, but because it is right and good, and it is hard to think of dominating animals as being right and good in any instance. The problem for me is that I know my attitude towards this doesn't help the movement. It has the potential to alienate and guilt meat eaters, which is something I think is terribly wrong and not good for anyone. Ultimately I think vegetarians (in my case, vegan) need to be understanding of meat consumption -- it has a long history and is deeply engrained in our culture -- but it's not always easy.",
      "parent": "0",
      "gravatar_hash": "997992b3031cd6d4a2ea73d1cccdbf09"
    },
    {
      "id": "2357",
      "author": "sippitysup",
      "author_url": "http://www.sippitysup.com",
      "date": "2011-09-04 09:42:27",
      "content": "I eat vegetarian about 85% of my meals. If I were ever to choose to be a vegetarian it would be for many of the reasons you adopted. But there is something in my personality I can't get past. It's too hard for me to say. \"No I am not interested in this or that new experience because of the limitations my diet sets upon me\". So I guess I am a choice-atraian. I want all the choices in the world and then follow my heart on a meal by meal basis. GREG",
      "parent": "0",
      "gravatar_hash": "9cabcc3f2cd4831786098e56138aae69"
    },
    {
      "id": "2358",
      "author": "alexis",
      "author_url": "",
      "date": "2011-09-15 20:48:43",
      "content": "I just found your blog today when I was searching for pupusa recipes (which I subsequently made, topped with swiss chard, caramelized onions, and pueblo chiles that I sautees in a mild rojo sauce. They were amazing, to say the least! Anyway, I am so happy to see another vegetarian just like myself - I decided to stop eating animals when I realized that bacon came from pigs -  and now I've been at it for almost 20  years! It's good to know there are others out there making amazing vegetarian meals! Thanks for the recipes and the inspiration!",
      "parent": "0",
      "gravatar_hash": "ecc92054ad2f91cb6b06f9a4a89dc4ff"
    },
    {
      "id": "2359",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-17 17:56:10",
      "content": "Your toppings for the pupusas sound incredible! I&#39;m glad you were able to make them with the written directions. I&#39;m going to be adding a video with my friend Maria, who is a master pupusa maker showing her actual moves, which are subtle and amazing.\n\n\n\n\nMichael Natkin\n\n\nFind me:\n\nThe latest from my blog, Herbivoracious:  Wordless Wednesday One",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "2360",
      "author": "Rebecca",
      "author_url": "",
      "date": "2011-09-18 19:30:42",
      "content": "I'm late to commenting on this article and I haven't read the other comments but I loved it for encapsulating so well why I am a vegetarian and have been ever since I came home from after studying human anatomy in 6th grade and looking at the chicken drumstick I had just bitten into and saying, \"Whoa, this is the same as my own arm!\" I have come to believe vegetarians (of my sort) are born, not made. It took my another 5 years to give up fish, too, but eventually one arrived at my table with the face still on, and that was enough for me.  I cannot look a creature in the eye and then eat it--and I can't want to eat anything that can look back at me.  I have little (not no) judgment about meat eaters--and the judgement I do have has more to do with the mindlessness of it all and the total disconnect.  But I feel in my bones that being a vegetarian was something I was born to be. Other people may not at all feel the same way and I accept this with love, just as I accept that there is a lot that happens in nature that is horrible for me to witness but is also a part of life's truth. I don't expect the carnivores of the world (which no human being is, no matter what they say) to give up being carnivores, and I don't expect omnivores to be something different than who they are, but I fully relish being a vegetarian and wouldn't want to be any different--except, often, a vegan!  Thanks for a great article.",
      "parent": "0",
      "gravatar_hash": "b8be11ea719c44b38c6d74b3e282180f"
    },
    {
      "id": "2361",
      "author": "Michele",
      "author_url": "",
      "date": "2011-09-27 14:30:43",
      "content": "Lovely post and sentiment.\n\nI raise my own chickens, 4 of them, out in the yard doing what chickens do.  They live and play alongside my dogs and cats and kids.  We love them and their eggs.  We do not eat the egg if they go broody.  When the egg never hatches, they give up and we feed it to the dogs (or the cat or the chickens).  We used to get milk from a coop, but recently decided to stop doing that too.  We miss cheese like a mother...but we're feeling our hearts getting bigger from not contributing to the cows being kept pregnant year after year.  I just found a woman who owns lots of goats and we've been getting some freaking insane chevre from her.  She makes cheese when they have milk and doesn't when they don't.  I can live with that.\nKeep on working on it, brother.  Being vegetarian is HUGE, don't let the meanies get to you.  If and when you get to the next step, we'll be waiting for you - arms wide open with smiles on our faces and love in our hearts.\nPS Our son still likes to eat meat and although we don't cook it at home, we let him make his own food choices when dining out or at friends; same with cheese.  He doesn't like milk so we're good there.",
      "parent": "0",
      "gravatar_hash": "d9f584732469cee86d7fefb0c7af3643"
    },
    {
      "id": "2362",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-27 14:35:53",
      "content": "Thank you. It is delightful to hear from folks that are living these issues so directly instead of just theorizing about them!",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "9872",
      "author": "Dan",
      "author_url": "http://veggiereeltor.com",
      "date": "2011-12-08 09:29:50",
      "content": "\"I've also found the argument that vegetarians are responsible for deaths of millions of animals in plowed farm fields to be disturbing and a bit persuasive.\"\n\nHow are vegetarians responsible for the deaths of millions of animals? I don't understand.",
      "parent": "0",
      "gravatar_hash": "c2257ad8a4c6b74163d266523b48e184"
    },
    {
      "id": "9877",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2011-12-08 09:44:09",
      "content": "Sorry, I was a bit cryptic there. When fields are plowed with tractors or harvested with combines, huge numbers of rodents are crushed in the process. Apparently pretty unavoidable.",
      "parent": "9872",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "10447",
      "author": "Joelle",
      "author_url": "",
      "date": "2011-12-10 00:43:42",
      "content": "I really appreciate the way you phrased everything there, it was very non-confrontational while still expressing your reasoning honestly.\n\nI actually suffer from oral allergy syndrome (and I have every pollon allergy, therefore I'm allergic to most fruits and vegetables, and occasionally nuts), so it's not like I have a lot of choice in the matter in being omnivorous.  I do my best to eat fruits and vegetables though, because I really appreciate a wide variety of flavors, the more unusual the better - thus I often frequent vegan and vegetarian blogs for inspiration since those diets are often constricted and more creative as a result.  All the same, it's been difficult since my allergies are often inconsistent.  One day, I could be perfectly fine eating an apple, and the next it feels like someone poured acid in my mouth.  I can't count the number of times where I've had to radically change my diet because I've become spontaneously allergic to key elements of it, but I can't live on meat and cheese alone so sometimes I just have to put up with it.  Fortunately, my reactions have been on the less severe end of the spectrum, but there's always that risk that it could become worse.\n\nWhat makes this exceedingly difficult is how I explain this to people.  My own mother never believed me, and most allergists haven't even heard of it, so she would force foods I was tremendously allergic to down my throat and tell me how horrible and unhealthy I was when I avoided problem foods.  Many people have accused me of flat out lying, and would eat said foods in front of me while telling me how good they were and what a shame it was that I couldn't have any, in an attempt to make me own up to it.  To top it all off, judgmental vegans/vegetarians will force their morality upon whoever will listen everywhere they go (as many of them have already done here), and naturally some of this has wormed its way into my head, making me feel like a horrible person for the way I eat when I hardly have choice in the matter.  Needless to say, this had lead to me having a less than healthy relationship with food, and by proxy a host of eating disorders that I've mostly worked my way through.\n\nBut there you go, I thought I'd share my experience with you since it's fairly unique in its thread.  Now when I say that I really appreciate the way you phrased your reasoning here, I hope the background I just gave you helps you understand just how much.  I will be frequenting your blog quite often, I love your unique take on food.",
      "parent": "0",
      "gravatar_hash": "d3ac785ecd3ad68cf397c5a7055361d6"
    },
    {
      "id": "10560",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2011-12-10 09:34:49",
      "content": "Wow, Joelle, that just sounds like a nightmare to have to deal with. I don't know what else to say except best of luck in finding solutions that work for you. Thanks for taking the time to write.",
      "parent": "10447",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "11630",
      "author": "weirdcombos",
      "author_url": "http://weirdcombinations.com/",
      "date": "2011-12-13 21:31:50",
      "content": "Michael,\nVery cool article!\nI am mostly vegetarian, occasionally gorging myself on seafood. I think ever since I became vegetarian /pescetarian my cooking has become more interesting. I learned to use spices more liberally and have a more varied diet. Rice and beans are my favorite gourmet choice! I feel healthy and good about it :)\nI am ready now to check some of your recipes!\nCheers,\nHeguiberto",
      "parent": "0",
      "gravatar_hash": "91b0eccd61210997c6715fe29850bf8c"
    },
    {
      "id": "11968",
      "author": "Marie",
      "author_url": "http://www.aprettierplace.net",
      "date": "2011-12-14 20:08:22",
      "content": "I am not a vegetarian yet but I am getting there.  My reasons for changing the way I eat are the same as yours.  I was at the supermarket the other day and I had an epiphany.  It just dawned on me that I would never kill an animal if grocery stores didn't exist.  I would eat beans. The fact that someone else was killing it for me didn't make it right.  I think that everybody should take a step back and ask themselves if they would have killed the animal that they are about to buy.  We go to the grocery store, we are in a hurry and we don't think about what we are buying.  In our minds, chicken breasts are like apples.  I think the supermarkets act as a barrier between us and the death of the animal to give us peace of mind.\nThanks for wonderful recipes!\n- Marie",
      "parent": "0",
      "gravatar_hash": "9aefc2ff812a53376cf3aa2b0ee44720"
    },
    {
      "id": "11971",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2011-12-14 20:20:43",
      "content": "Thanks for sharing your thoughts, Marie. Your epiphany sounds very much like what happened to me. I went from being a daily Big Mac eater to a vegetarian I think more-or-less overnight.",
      "parent": "11968",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "15613",
      "author": "Robyn K",
      "author_url": "",
      "date": "2011-12-30 14:30:13",
      "content": "I was a veg for 12 years, then started eating small amounts of small-farm meat due to my \"Type-O\" isnhness... but I could actually argue both ways for the notion that it's \"natural' for humans to eat meat.  I highly recommend the Anastasia books by Vladimir Megre; I've just read a chapter in which she describes incredible human cultures which offer a very persuasive argument for our natural revulsion at killing living beings.  She describes how it was really the nomadic peoples of the Steppes, who didn't grow produce and didn't have access to wild food, who influenced the Russians to become meat-eaters a thousand years ago...  It's pretty fascinating.\n\n   The other thing you wrote: \"I've also found the argument that vegetarians are responsible for deaths of millions of animals in plowed farm fields to be disturbing and a bit persuasive\" Ok, that is something I've never heard of, so I don't quite know what you mean.  On the one hand, a field is going to be industrially plowed (killing mice, etc, I'm getting?) for hay and grains for animal feed, much more than vegetables.  It seems absurd to say that the minority of Americans who ascribe vegetarian are \"responsible\" for this.  Although, a point you didn't make-- the industrial growing of soybeans in this country is HUGELY depleting to the topsoil and the minerals of the land.  But the culprit here is industrial agriculture, not people who choose not to eat meat.  This is the reason grocery-store-food does not contain the quality of nutrients it once did (CDC studies show this clearly).  And why the magnesium and iodine deficiencies in our population are rampant (which eating meat partially helps reverse; but it's an inefficient solution!)\n\n  Slow food, small farms!  It's great to live in a place like Seattle with conscious growers and markets all around to patronize.  My thing is spreading the word about growing-your-own, even in little boxes in your apartment, if that's what you've got to work with.  Inspiring and educating people about the destructive results of industrial agriculture.  God how I would love to see the people of this country taking back their land.  \n\nHighly recommend the website Pinenut.com and wildcrops.com, for inspiring stories, information, and access to the amazing American pine nut!",
      "parent": "0",
      "gravatar_hash": "e58c97434bdc5b454252fe04cc588d91"
    },
    {
      "id": "15638",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2011-12-30 19:35:46",
      "content": "Thanks for the the thoughtful comment, Robyn. So how do you get pine nuts out of the shell when you buy them with the hull still on like that? I remember trying to eat them that way once on a drive between Bishop and Lone Pine, California and it was kind of a messy business but maybe I didn't have the right technique :)! Re the issue of animals plowed under in farm fields, I agree - clearly crops raised to be fed to animals are an even bigger source of that problem, and I agree with your point about depleted topsoil as well. My point is only that trying to eat in such a way that you cause no animals to be killed is pretty nearly hopeless. Even small farms, if they use any tractor at all, inevitably end up killing all manner of mice, rabbits, etc. So we have to get comfortable with thinking of matters of degree, not absolutes.",
      "parent": "15613",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "16419",
      "author": "Ice",
      "author_url": "http://articlelinksdirectory.com",
      "date": "2012-01-06 16:06:55",
      "content": "Awesome post, and a lot of nice comments. I agree with most of what's said here but one thing that is repeated frequently is that it's harder to make a vegetarian meal than it is to make a meat based meal. This in my opinion is not true. I do believe it can be hard for somebody that's raised with mainly meaty meals to come up with plenty of vegetarian meals but in general it doesn't take much to make meals without meat. Whether you're making a vegetarian lasagna or one with meat, stir-fry with or without meat, throw some salami on a pizza or choose for some other option, it's really not much difference. Cooking vegetarian meals is fun and easy, and with the thousands of vegetarian recipes one can find online it's not hard to make a vegetarian feast. I would not like people that consider becoming a vegetarian to think that becoming a vegetarian is a huge effort, because it's not, so my vegetarian friends please don't put it like this, ever. Thanks.",
      "parent": "0",
      "gravatar_hash": "928016f6203951a9ae2bb67070c3b09a"
    },
    {
      "id": "16826",
      "author": "Abigail P.O.",
      "author_url": "",
      "date": "2012-01-11 19:52:38",
      "content": "I think I'm on exactly the same page as you. Around 13 years old, I stopped eating meat because eating animals was such a cruel thought to me. My philosophy has largely stayed the same, now it's backed more by ethics, I can't justify killing a cow for a steak. This lifestyle has been so easy for me to live and yet, recently, very difficult to explain and justify. I started attending culinary school this september, and I find myself facing the issue of whether or not I'm comfortable or am being a hypocrite by cooking meat in my labs. There was period of a month or so where I chose to break my 6 year vegetarianism to try meat before I began culinary school. Hearing from people I admired like Anthony Bourdain that you must be willing to try anything to be a great chef, created a conflict within me. The thing was, every time I had a bite of a burger, some thai pork, or a grilled shrimp or two, I always wondered what all the hype was about. Nothing appealed to me, the textures made me feel sick and the tastes were... bland. When I also started to develop incredible guilt, that honestly kept me up at night, I decided I'd had enough. As an aspiring chef with a certain \"limitation\" I'm starting to learn that my lifestyle is not something to be ridiculed, but it's in fact provided a new challenge, to prove it's validity in the culinary world I so admire!\n\nThank you for sharing, I've really been looking to voice these thoughts that drive me crazy!",
      "parent": "0",
      "gravatar_hash": "1ac618be91f69c751c7dccbca441af6e"
    },
    {
      "id": "16834",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-01-11 21:27:44",
      "content": "Hey Abigail - it is darn brave of you to go to traditional culinary school as a vegetarian. It is a route I've considered myself, but since I'm not willing to cook meat, I've had to make my own way. The reality is that if you are going to be a vegetarian working as a cook in the world of high-end omnivorous restaurants, you are always going to take a certain amount of crap. You'll undoubtedly learn how to use humor and toughness to deflect that crap. And of course the best way to get respect in the kitchen is simply to develop your skills and speed to the point where your own choice of what to eat isn't an issue.",
      "parent": "16826",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "17807",
      "author": "kate",
      "author_url": "http://katendbrian.com",
      "date": "2012-01-24 11:16:28",
      "content": "Nice piece. My reasons are very similar, although I am technically pescetarian and environmental and political factors do influence my diet. I would like to go vegan but always seem to run into dilemmas filling the void. Examples:\n1. Soy milk often seems to have a lot of additives, including sweeteners. What can I put in my coffee? Tropical-based milk products? See below.\n2. I love avocado and could replace a good amount of cheese in my diet with it alone. But avocados and other foods I enjoy are often a) shipped long distances (fossil fuels, pollution), b) from unsustainable farms (water usage, pesticides), and c) come from areas that may not be well-regulated, both environmentally and/or labor-wise. Not to mention, farmland usually involves some measure of deforestation. A disturbed environment is more vulnerable to erosion and invasive species.\n\nSo I struggle with trying to be sustainable AND humane (while keeping a diet interesting enough to help me resist processed foods). Any tips are welcome on transitioning to veganism. \n\nI really appreciate the \"perfect being the enemy of the good\" adage, and I am proud to say that my husband is an omni who will occasionally order a veggie burger, sometimes with bacon. No matter what we eat, if we could all just be a little more thoughtful about our choices, and consume a little less, it would be a good thing.",
      "parent": "0",
      "gravatar_hash": "24d95654e0bb7954b70dc153b57159db"
    },
    {
      "id": "18467",
      "author": "Sheri C",
      "author_url": "",
      "date": "2012-02-03 08:45:15",
      "content": "I just found your website and love it, I plan to try quite a few of your recipes.  I become vegetarian about 3 years ago, the rest of my family is not.  It makes it very hard to make dinner, as I make a meat based dish for the rest of the family and then I usually eat whatever is left over, potatoes, rice and veggies for example.  I also have a very, very picky son and that adds to the mix of making boring food.  During the day the daughter and I eat vegetarian and she doesn't seem to mind.  I do eat the occassional seafood, but am starting to get away from dairy, very rarely.  I am not sure there is categories for people to put them selves into any more, vegetarian, flexitarian, etc.  I think people should just eat they way they like and we shouldn't judge them, if it's healthy and keeps them healthy, so be it.  I also get tired of being asked what do I eat for protein and have to explain to people there is protein in more food then just meat based products.  Anyhow, love your website and looking forward to the book.  Oh, and I live in Calgary, Alberta, home of the cattle ranch, so being a veggie here is super hard...everything in every restaurant is meat based.  Even my favourite Chinese veggie restaurant has added meat to their menu, very, very disappointed in that decision.",
      "parent": "0",
      "gravatar_hash": "3a6698f6e592a30ea4d800ad225ed38f"
    },
    {
      "id": "18488",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-02-03 17:25:18",
      "content": "Hey Sheri - I bet that is a difficult part of the world to be vegetarian in! I totally agree with you, everyone has to figure out what works for themselves, and being judgmental about it doesn't solve anything. Thanks for your note!",
      "parent": "18467",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "19003",
      "author": "Kayla",
      "author_url": "http://kaylainafrica.blogspot.com",
      "date": "2012-02-10 08:23:02",
      "content": "Hi Michael,\n\nI'd like to thank you for your blog post, and I hope you don't mind if I borrow your answers to 'Why are you a Vegetarian?'. You were very clear and concise, and came across as non-judgmental (Which is difficult for us to do, since I find it can often be assumed that we are judgmental.) Currently, I'm in Kenya--where the national dish is 'nyama choma', or 'roasted meat'. I find it much more difficult here to explain my vegetarian reasons, but am so thankful for your blog and for this post in particular!\n\nIn addition, I've found the commentary on the vegan/vegetarian debate to be very enlightening. I am a veggie who doesn't eat eggs directly (for reasons I have not exactly yet hammered out), and when I am financially able to, will buy ethically based dairy products as well.\n\nWhat a great, lively discussion!\n\n-Kayla\n\nPS: Even in a country with roasted meat forming a large part of national identity, I did find one delicious vegetarian dish, called 'Vegetables Swahili'. It includes vegetables cooked in a coconut/curry sauce, and is very reminiscent of the Arab/Indian influence. I highly encourage Michael/anyone interested to look it up and give it a try!",
      "parent": "0",
      "gravatar_hash": "539957815a57956e4ed1d04a4ca0d8b8"
    },
    {
      "id": "19009",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-02-10 10:34:24",
      "content": "Thanks, Kayla! I can imagine the nyama choma causes quite a challenge. I'll google around and see what I learn about \"vegetables Swahili\", it certainly sounds taste. What vegetables are typically used in it?",
      "parent": "19003",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "19047",
      "author": "Bea Elliott",
      "author_url": "http://beaelliott.blogspot.com/",
      "date": "2012-02-10 20:38:55",
      "content": "Hi! I totally understand your reasoning of not wanting to harm innocent life... But I must ask - Where and how have you been able to find the most \"ethical\" dairy?\n\nI understand that well kept, loved hens can be a humane source for obtaining eggs. Certain criteria would have to be met though... Since we know what happens to the unwanted male chicks at hatcheries - These hens would either have to be raised \"naturally\" or be \"rescued\" birds... Also these hens would have to be given the very best of care even after their egg laying years were over... By all these conditions I think it's possible to have \"ethical eggs\".\n\nBut how can nonhuman mammal milk ever be? Even in the best of circumstances - A profit oriented dairy must \"dispose\" of the male calves... I'm certain these dairy ranches don't \"share\" the milk with the babies... And do they keep the mothers after they are no longer \"productive\" or do these gentle giants go off to become burgers and pocket books?  \n\nYour post sounds authentic... Like you've done a lot of soul searching - Perhaps you haven't thought out what \"most ethical\" really is?  It would be awesome for you to write a vegan cookbook as your knowledge and talent is obvious... Just got to swing that \"compassion\" over a degree or two - And I'm certain your heart would be the better for it. ;)",
      "parent": "0",
      "gravatar_hash": "9a5affbfa734997c261ac88cd19d7e15"
    },
    {
      "id": "19111",
      "author": "Kayla",
      "author_url": "http://kaylainafrica.blogspot.com",
      "date": "2012-02-12 06:58:43",
      "content": "Hi Michael,\nThanks for the reply. \nTypically, the dish calls for baby corn, okra, carrots, cauliflower, eggplant, green beans, potatoes, red bell pepper, and tomato. You can of course substitute for the vegetables of your choice or for what is in season. I like to add peas as well.\nIf you'd like, feel free to shoot me an email and I can send you my spin on the recipe.\nAll the best!\n-Kayla",
      "parent": "0",
      "gravatar_hash": "539957815a57956e4ed1d04a4ca0d8b8"
    },
    {
      "id": "19126",
      "author": "Dawn",
      "author_url": "",
      "date": "2012-02-12 16:31:43",
      "content": "I enjoyed reading your post I just wonder how many of the avid animals rights people are as prolife when it comes to abortion...",
      "parent": "0",
      "gravatar_hash": "8644b44c5d5598fd611afaa856f17e22"
    },
    {
      "id": "19150",
      "author": "Natalia",
      "author_url": "http://gatosgatos.blogspot.com",
      "date": "2012-02-13 06:51:40",
      "content": "I often wonder why so many people automatically assume that because someone cares about animals they do not care about other human beings. \nIs it some way to disregard  the idea that we should care more about the cruelty we inflict upon animals? To consider those who do care animal nut jobs? \nIt is very frustrating. Most animal abusers end up being wife and child abusers. What does that tell you? \nPersonally I can't stand what we are doing to animals but I can't stand either any form of meanness or cruelty between ourselves.",
      "parent": "0",
      "gravatar_hash": "d665a0f3131f28b9d1a137acc77be53e"
    },
    {
      "id": "19156",
      "author": "Abigail P.O.",
      "author_url": "",
      "date": "2012-02-13 09:10:12",
      "content": "I guess it is brave, thank you, it's definitely been a learning experience and has instigated a lot of introspection. Also, I've recently become aware of the fact that you've interned at Dirt Candy. This february break, I'll be spending some time exploring some vegetarian restaurants in NY with the possibility of doing my mandatory internship at one of them in mind. I intend to check out Dirt Candy, is there anything you recommend I try there, or even any recommendations for other places in NY to check out? I pre-ordered your cookbook on amazon.com by the way! Very excited!",
      "parent": "16834",
      "gravatar_hash": "1ac618be91f69c751c7dccbca441af6e"
    },
    {
      "id": "19158",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-02-13 09:20:41",
      "content": "Re Dirt Candy, Amanda changes the menu frequently, so I don't think I can make recommendations of specific things to try, but everything I ate there was delicious! I know she does periodically take culinary school externs there, there was one working when I was there. Because it is so small, it is both a very challenging environment and one where you can earn a ton of responsibility quickly. As far as other places in NYC, unfortunately I didn't eat around a whole lot on that trip, but we did have a very impressive vegetarian dinner at Dovetail on the upper west side, although it is decidedly omnivorous. Certainly worth checking out.",
      "parent": "19156",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "19509",
      "author": "Lindsey",
      "author_url": "",
      "date": "2012-02-19 11:20:01",
      "content": "I grew up in the south in a farming family, so I have long been aware of \"where\" my meat comes from.  In college, I developed an intolerance to several of the hormones that are given commercially raised meat, so I decided to go vegetarian.  I was vegetarian for a couple of years, and developed an intolerance to soy.  Not being able to have soy made the vegetarian diet really challenging, so I added some meat back into my diet.  I have been fortunate to live in an area (as an adult) with a lovely farmers market where I can get locally collected milk and eggs, and locally raised meat.\n\nI totally appreciate the vegetarian and vegan lifestyles, but they just don't work for me.  The way I see it, if you know and understand where your food comes from, and do what you can to obtain that meat in a responsible and humane manner, eating meat is just fine.",
      "parent": "0",
      "gravatar_hash": "819ed984319e35f18f80a02f22f9b45f"
    },
    {
      "id": "21172",
      "author": "Alex Leigh",
      "author_url": "http://alexleigh.org",
      "date": "2012-03-09 07:15:40",
      "content": "You have conveyed here, what I always think and believe about this subject, even down to the detail of respecting and even applauding other people if they make a concious decision to go one way or another. \n\nIn fact I might use your URL as a reference if anyone asks me why I'm vegetarian! :-)",
      "parent": "0",
      "gravatar_hash": "ee40d033afad7c1fb958dd8ea6338ecb"
    },
    {
      "id": "21260",
      "author": "Alicia",
      "author_url": "",
      "date": "2012-03-10 13:27:38",
      "content": "Hi Abigail, I understand you so much! Fortunately, there are options to learn to cook vegetarian in a professional level.  I have attended a great Cookery School in UK.  It is called “Cordon Vert”. They are doing a great job teaching innovative vegetarian cuisine, it has such an international twist!  They are very professional and as a foundation, they help to improve vegetarian awareness.  Here is their website:  www.cordonvert.co.uk",
      "parent": "16826",
      "gravatar_hash": "a13dfbea5fdee3e9bef05e80a27f3672"
    },
    {
      "id": "21261",
      "author": "Alicia",
      "author_url": "",
      "date": "2012-03-10 13:31:58",
      "content": "....and Michael: Thanks a lot for writing this article!!  It is exactly the reason why I am vegetarian.",
      "parent": "21260",
      "gravatar_hash": "a13dfbea5fdee3e9bef05e80a27f3672"
    },
    {
      "id": "21262",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-10 13:33:45",
      "content": "Well that's good to know about!",
      "parent": "21260",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "21346",
      "author": "Abigail P.O.",
      "author_url": "",
      "date": "2012-03-12 07:05:16",
      "content": "Hi Alicia, thank you so much for sharing! Gotta love the interent because I would have never learned about the Cordon Vert without your response. I am working on a degree at a school in the US though. If I ever find myself by or in the UK with some time to spare I will definitely consider taking a class or two!",
      "parent": "21260",
      "gravatar_hash": "1ac618be91f69c751c7dccbca441af6e"
    },
    {
      "id": "21924",
      "author": "neha",
      "author_url": "http://mypunchingbag.wordpress.com",
      "date": "2012-03-23 11:35:24",
      "content": "Hi there!\nI have been a silent follower of your blog :).\nI have been a vegetarian since I was probably 5-6 years old. (I am 27 now). The reason for leaving \"meat\" was because I accompanied my dad to the butcher's shop back in india to get mutton. There they give you fresh meat by killing the animal in their backyard. And I saw the killing of the animal and later the whole butchering process. It was like an on-off switch in my head, that I just decided never to eat what I saw from then on. It was not as difficult to leave it because at that age, I was not particularly fond of meat. I mean, it was just food that was forced on me (like other foods)! I hated eating as a child :D\nThat being said, I never feel I miss out on anything by being a vegetarian. My husband eats non-veg, so do my parents. But then hubby cooks non-veg by himself and I do not have to endure stir-frying, roasting or searing even a dead piece of meat. To me, even that is kind of painful :(",
      "parent": "0",
      "gravatar_hash": "168e782134e76d98935b641c5d5b29bb"
    },
    {
      "id": "21927",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-03-23 12:07:36",
      "content": "I appreciate your thoughts, Neha! It is interesting that you came to that conclusion at such a young age.",
      "parent": "21924",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "22367",
      "author": "Nadia",
      "author_url": "",
      "date": "2012-04-02 12:43:32",
      "content": "Hi Michael ~ Great blog! I can’t believe I didn’t stumble upon it sooner!  I am the only vegetarian in my household (no meat, no seafood).  I first decided to be vegetarian back in 1994 at the age of 14.  What a strange and dramatic decision for a 14 year old.  I can honestly say it really wasn’t initiated with improving my health or saving the animals of the world. I can’t credit myself for anything so noble.  It was just as if a huge lightbulb when off as I saw a piece of chicken on my plate and suddenly connected the well-seasoned ‘disguised’ bite back to the actual chicken. I saw the chicken itself on my fork and had to just drop it…Immediately! What am I actually eating?!?! You know how they say mind over matter; well this was definitely a lot of mind trumping the delicious wafting smell of my hot meal.  I have never ever been able to separate the actual animal and my food since. It’s a personal decision, one that I don’t believe I have the right to impart on anyone but myself. I do love being vegetarian for the sake of eating vegetables. I love the flavor, array and taste of seasonal veggies.  I love herbs too! I don’t bother with meat alternatives. I figure if you need to feel like you’re eating meat, then just eat meat!  I love legumes as my protein and have discovered so many foods from around the world are indeed vegetarian.  I don’t think I can ever go back and am thrilled to discover your recipes. Can’t wait to host my first vegetarian dinner party and surprise my meat-eating guests with such a creative, tasty variety!  Thank you!",
      "parent": "0",
      "gravatar_hash": "e5e5c87bc6fe5db557f9d25e8ddef58d"
    },
    {
      "id": "22377",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-04-02 21:18:37",
      "content": "Thanks, Nadia! Sounds like we've got very similar approaches to being vegetarian. I hope that some of the recipes here are helpful to you, and by all means stop back by and let me know what you've made and how it works out. - Michael",
      "parent": "22367",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "24616",
      "author": "Hannah",
      "author_url": "",
      "date": "2012-05-24 13:02:42",
      "content": "Thank you, Michael, for writing such a wonderful piece and for taking the time to respond to readers comments years after the fact. \n\nThe vegetarians and vegans I have met who have been aggressive about the correctness of their choices often bring up how \"mindless\" it is to eat meat and/or state that omnivores \"lack compassion\". While it is true that many consumers of animal products might fall into these traps, it's not fair to categorize everyone that way. I'm from a family of avid hunters, and have known from a young age that eating meat involves death, sometimes gruesome, of another living thing. As a child, I only ate meat that was from outside the family (if you will) only once or twice a year. As an adult, I remain cognizant of the realities of eating meat. It most certainly is a choice for me. Most often, I choose to eat small quantities of meat, infrequently.\n\nEating meat keeps me humble; it reminds me that I am also an animal, and that I have to participate in the food chain, and that I will inflict - directly or indirectly - suffering upon other beings. That's part of being alive. In a strange way, being a meat eater enforces frequent reflection upon my place in the larger universe, and upon reconciling myself to being part of it. It is almost meditative, a contemplation of the sacredness of life and a reminder of my place. Part of why food is so amazing is that it can provoke these kinds of realizations and conversations. The self righteous vegetarians and vegans who cannot allow other choices to exist in their worldview and discard them as thoughtless or cruel  haven't heard the whole story.\n\nMaybe that's too New Age-y, but wanted to share my perspective. Again, thank you for writing and listening.\n\nAll the best,\nHannah",
      "parent": "0",
      "gravatar_hash": "d738cd17cf6c3fce6077fa7824f18e9b"
    },
    {
      "id": "24619",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-24 13:07:57",
      "content": "Hey Hannah - I really, deeply appreciate your contribution here. Although I don't choose to eat animals, I absolutely understand what you are saying. I think there are completely legitimate arguments on all sides of these issues. What matters to me is that people actually think about their choices, which you obviously have. That is exactly why I don't spend time on convincing anyone to be vegetarian. I just try to make sure that if you want to eat a meatless meal tonight, that it is a highly pleasurable experience!",
      "parent": "24616",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "25641",
      "author": "Lotte",
      "author_url": "http://www.abitastudio.com",
      "date": "2012-05-30 21:16:43",
      "content": "Hi Michael,\n\nI read your blog a few days ago and wanted to respond. \n\nI want to applaud you for sharing your empathy with other sentient beings and your horror of causing pain and mutilation, because I know this is the reason people have the hardest time dealing with in a non-defensive manner.   \n\nLike you, I look at an animal and see a feeling being with the same right to live as I have and I literally cannot kill a fly or a spider for that matter.  Yet I have been able to disassociate the meat on the plate being served to me (I would only buy meat if I had guests) to the living being it used to be for way too many years. I was not able to contend with the social disconnection you mention, (still am struggling with that), and I also did not know how to cook a satisfying vegetarian meal that I would be proud to serve to guests.\n\nIn the past few month I am transitioning into a plant based diet and the most amazing thing is happening. I am suddenly interested in cooking. I was always a reluctant and unimaginative cook but now I can’t stop reading and learning about the magical world of vegetables, legumes and grains and cooking beautiful and delicious food without animals.  I have a long way to go to become a good cook, but now I want to be and for the first time ever I read cookbooks and web sites, try recipes and this year I planted a respectable vegetable and herb garden. \n\nSo thank you for providing this wonderful resource to the community.  I will buy your book and when you open a restaurant in Seattle, I will come.  \n\nYou might be interested in this article which I read today by author and psychologist Melanie Joy Ph.D on Carnism. http://www.forksoverknives.com/dis-ease-of-the-heart-the-psychology-of-eating-animals/   It goes to the \"heart\" of the matter.",
      "parent": "0",
      "gravatar_hash": "c96142386811a26264cd0b7b3603e874"
    },
    {
      "id": "25732",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-05-31 08:27:41",
      "content": "Hey Lotte - thanks for your thoughtful note! I can easily imagine how transitioning to a way of eating that you enjoy has renewed your interest in cooking.",
      "parent": "25641",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "26918",
      "author": "Kristen",
      "author_url": "",
      "date": "2012-06-13 04:54:24",
      "content": "I recently found your website and it's interesting how similarly we think and feel about this subject. Your third paragraph from the end are thoughts that run through my brain often. I get excited when it's time for a meal. I found your site because I'm getting tired of eating the same vegetarian dishes and look forward to trying your recipes/cookbook. I too come from a computer science-y/software background and have finally found my passion. I love sharing this passion with friends and teaching kids about food. Thank you for listening to that inner voice that has allowed you to discover a new world and share it with us!",
      "parent": "0",
      "gravatar_hash": "b555afbd55a42ce5f49b1853ada0a486"
    },
    {
      "id": "33426",
      "author": "cindy",
      "author_url": "",
      "date": "2012-07-03 10:17:30",
      "content": "the book \"eating animals\" really clarified my thoughts on why it's better to be a vegetarian.",
      "parent": "0",
      "gravatar_hash": "c0d1a33b6b5cb559701017186201ae42"
    },
    {
      "id": "35041",
      "author": "Kelsey",
      "author_url": "",
      "date": "2012-07-07 09:19:30",
      "content": "I could not agree with your reasoning more. I have been an ovo-lacto vegetarian since 8th grade, and I have gotten a lot of grief over my choice from people who just don't understand how I could manage. It is so simple for me to not eat meat. Some people who are vegetarian for other reasons, I have found, end up going back to eating meat.  But I could never fathom it. The concept of eating flesh simply freaks me out. I am not converting others, or pushing my reasoning on them, and I would appreciate it if more meat-eaters could do the same.\n\nAdditionally, there is a book Eat Right For Your Type which breaks down the history of the type as well as how it makes a difference in diet.  I am type A and dadamo.com/bloodtype_A.htm synthesizes from the book \"Low levels of hydrochloric acid in the stomach and high intestinal disaccharide digestive enzyme levels permit the more efficient digestion of carbohydrates. According to Dr. D'Adamo, these are also the very factors, along with low levels of intestinal alkaline phosphatase, that make it difficult for Type As to digest and metabolize animal protein and fat.\"  Interesting thT there was a natural inclination to be vegetarian.",
      "parent": "0",
      "gravatar_hash": "5ee583a54050f89b867663bd07b711a9"
    },
    {
      "id": "38740",
      "author": "Anna K.",
      "author_url": "",
      "date": "2012-07-18 04:49:32",
      "content": "Great, great piece. I've been a lacto-ovo vegetarian since I was 18, or 10 years ago. I was a strict vegan for two years in the middle of that, but it wasn't good for my mental health or my social life. I'm really happy as a lacto-ovo veg and I think I'll stay this way forever.\n\nI also get this question a LOT and I'm so happy that I can refer people to this article, since I agree with every point you made, both the pros (health, environment, animal rights) and the cons (traveling, missing out on that slab of \"protein\") of vegetarianism. My problem is that people tend to ask me why I'm a vegetarian when we're sitting down to eat together, and often they are eating meat at the time. I try very hard to come across as a non-judgmental vegetarian (which I truly believe that I am) so I usually don't fully go into it because I feel awkward bashing meat eating as they are doing that very thing in front of me.",
      "parent": "0",
      "gravatar_hash": "32b0b1e026ece93bbd8fba0a8abf2799"
    },
    {
      "id": "38748",
      "author": "Nebet",
      "author_url": "",
      "date": "2012-07-18 05:23:53",
      "content": "Thank you for this thoughtful and insightful post. I am sorry you have had to deal with so many...difficult...commenters scattered among the civil ones, and I was disappointed to see that only one or two of those were from intolerant carnivores, with the rest being from vegans. \n\nI myself could not be vegan even if I wanted to, and would struggle with being even vegetarian, due to oral allergy syndrome plus a mild allergy to rice and legumes (including soy) and a tendency toward anemia. It is almost easier to list the fruits and vegetables I *can* eat without consequence than the ones I cannot, and while I am able to tolerate peas and beans up to a point, they must be well-cooked and not in too much quantity at once; I cannot handle soybeans in any quantity that might be called \"eating\" them -- much to my distress when I discovered how delicious edamame is and how I cannot have it, all within the space of a few bites!\n\nAs such, I appreciate your compassionate and respectful stance. As someone with empathic tendencies myself, I understand your \"anthropomorphizing\" and, though it is not something I feel myself, I find it commendable that you have weighed your own feelings and respect them enough to make decisions based on what is necessary for you to live authentically and ethically.",
      "parent": "0",
      "gravatar_hash": "1afa10ecdf2b9251a967034bd30f7a98"
    },
    {
      "id": "39761",
      "author": "Shirley Kiernan",
      "author_url": "http://VeganAutismMom",
      "date": "2012-07-21 09:01:29",
      "content": "I was a vegetarian (with occasional fish and seafood lapses) until I read The China Study.  I've been vegan since, and I have definitely noticed an improved state of wellness.  My husband and son eat vegan at home, cheat sometimes when they are eating out.  It's all good.  What troubles me is how defensive omnivores are about my food choices.  I don't preach; I just live my life in a way that makes me comfortable.",
      "parent": "0",
      "gravatar_hash": "f0f10db9de24204aee258db453ea3299"
    },
    {
      "id": "43255",
      "author": "Min Min",
      "author_url": "http://hiihavehives.blogspot.com",
      "date": "2012-08-02 03:43:43",
      "content": "Thanks for sharing your thoughts. I discovered your blog in someone else's, and I like your posts very much!\n\nI switched to a vegetarian diet mainly because of health. I have chronic urticaria (also referred to as hives) January 2012 and was on antihistamines. I got fed up with it and decided to find out the trigger of my urticaria. Through food elimation and reintroduction I discovered that I am allergic to chicken and beef. So I gave up all meat about 2 months ago. My hives have subsided substantially and I am not on antihistamines anymore!\n\nI was a lacto-ovo vegetarian for 5 years. However, I went back to a omnivorous diet because of my husband's job. He is a pastor and he got invited for meals frequently. It's inconvenient for me to be a vegetarian since I always went with him to visit his church members. I only ate meat when \"necessary\". \n\nNow because I am allergic to meat, I am very happy to become a vegetarian again. Even though it's quite inconvenient, I don't think I want to eat meat anymore, because the symptoms of hives are just too scary. I am very thankful that people around me, especially the church members, are quite understanding. :-)",
      "parent": "0",
      "gravatar_hash": "306e9efae17a14f36b4c67d8b0d4ab94"
    },
    {
      "id": "43905",
      "author": "Sandra",
      "author_url": "",
      "date": "2012-08-05 08:21:50",
      "content": "The China Study by Colin Campbell describes whole villages of people without\nany health problems and amazing life spans.  Their diet was/is vegetarian.\n\nAfter that discovery I found that the liver becomes lazy from not having to process\nprotein from vegetables and that it takes about a year or so for the\nliver to go back to work.  I used eggs and a little fish every few days during\nthat time until I felt it knew how to do its job again.\n\nI began to look at vegetarianism seriously when I discovered that one person\nin our military commits suicide EVERY DAY after long periods of killing\nothers.  The more I thought about this, the more my consciousness changed.\n\nNot killing is more important than the vegetarian health benefits, the longevity, the\nhealth of the planet, or the fate of animals. \n\nI BELIEVE THAT AS LONG AS WE BELIEVE IN KILLING  A N Y T H I N G\n                                WE WILL ALWAYS HAVE WAR.",
      "parent": "2195",
      "gravatar_hash": "6a2fddd3abf0783b84741171c82eae0c"
    },
    {
      "id": "47166",
      "author": "mmstp",
      "author_url": "",
      "date": "2012-08-26 07:03:55",
      "content": "Thoughtful essay.  I quit eating meat about 2-1/2 years ago.  I was moved that direction after reading Mark Bittman's book - Food Matters.  He has a different approach than you, but again, less purist, more incremental.  In that book, he discussed the environmental impact of large scale animal agriculture.  I thought it was important to try to do my part, so I quit eating meat.  Even for a lover of all food, it was not as difficult as I expected.  As my exploration for yummy non meat food continued, I became more aware of the animal welfare issues too.  That has made it easy to stay the course.  I don't like fake meat, but prefer beans, tofu etc  to round out a yummy, healthful veggie meal.  Like you, I have had some difficulty parting ways with dairy and eggs, although VegNews has an interesting focus on non dairy cheeses this issue.  I am hoping to move away from eggs and dairy soon too.   \n\nWith respect to animal cruelty, people also forget that their leather bag or belt used to be a cow.  That realization has struck me of late too.  Consequently, I have been seeking out alternatives for shoes and purses and remarkably have found some good alternatives, especially online.\n\nThanks for the thoughtful article.  I hope you are not just preaching to the choir, but that your incremental approach might influence others to at least think about their food choices.",
      "parent": "0",
      "gravatar_hash": "8714bbe23159d812de3687126d5e0fbc"
    },
    {
      "id": "47540",
      "author": "Chris C",
      "author_url": "",
      "date": "2012-08-29 12:45:13",
      "content": "Excellent post. I'm an omnivore, but I can respect your views, because you can offer reasons above and beyond 'petty' feelings that usually come from a third party. You know what you like, and who you are, and that's great.\n\nI do make various vegetarian dishes, but I enjoy meat as well. I found your blog while searching for couscous recipes. I will be bookmarking and sticking around. :-)",
      "parent": "0",
      "gravatar_hash": "8a3ade39763b3ce9fc10d063672d50cb"
    },
    {
      "id": "47563",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-08-29 19:03:57",
      "content": "Glad to have you aboard!",
      "parent": "47540",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "49843",
      "author": "Derek S",
      "author_url": "",
      "date": "2012-09-11 10:04:31",
      "content": "This article arrived in my inbox with great timing.  I'd been considering removing all meat from my diet for sometime, and today it's been about 2 weeks.  I saw the title of this article just before I drove into work this morning and took some time to think about it.\n\nFirst and foremost, I think the decision to remove (or keep/add) meat to ones diet is a mostly personal affair.  I have my reasons, which just so happen to coincide with yours.  \nI'm also guilty of anthropomorphizing animals; I look into the eyes of my dog and know that there is a soul in there.  He feels pain, knows joy and excitement.  From this experience, I surmise that other animals can as well, to varying degrees.  I don't think a fish has the same capacity for emotions as my dog, but I also believe that we should respect life.  The fact that I feel so much better not eating meat is a bonus.\n\nAs I said, this article appeared in my Inbox at the perfect time.  Knowing that others feel the same way regarding vegetarianism only serves to strengthen my resolve.",
      "parent": "0",
      "gravatar_hash": "0ab1dc3c84cb9cdf75287451efa92f0f"
    },
    {
      "id": "49888",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-11 13:22:03",
      "content": "Thanks, Derek, and best of luck with your transition! Stay in touch and let us all know how it goes.",
      "parent": "49843",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "49967",
      "author": "bazina!",
      "author_url": "",
      "date": "2012-09-11 21:12:42",
      "content": "Hey Michael, \nJust came across this tonight while searching for vegetarian blogs.\n\nAnyways, your post title caught my eye and I decided to see what your reasons are. I like the honesty and humor you put into it.  I myself have toyed with the idea of going vegetarian (or even vegan) simply because it grosses me to handle raw meat, especially chicken or eggs, and sometimes when I put thought into what I'm actually eating (a LEG. a RIB.  A BUTT.  whether it be a cow's, pig's or lamb's it's gross to think it's coming from an animal and going into my mouth). yuck.  \n\nBUT when I put that crisp slice of bacon wrapped shrimp into my mouth all of those thoughts just disappear.  hehe. (If God didn't want us to eat meat he wouldn't make it taste so good!)\n\nI do understand what you mean about how you are feeling for the animal though.  Growing up in Hawaii (I now live in Vacaville, CA) I had the experience of slaughtering a pig and gutting fish.  It was very gross and still disturbs me when I think of the pig dying or the fish.   (It's funny how you mentioned the worm on the hook, to me it was always the hook in the fishes mouth that bothered me!).\n\nI'm not educated enough to know what happens to the large amounts of animals that are farmed for us but I'm sure if I were I'd probably go vegetarian.  Not vegan since I believe it's too easy to raise your own egg laying hens (I've had some back in Hawaii) or to search out a dairy farm where they treat the cows better- and I love me some ice cream!\n\nI say kudos to you for your dietary choice and for sticking to it.  Although I don't plan on becoming Vegetarian any time soon, I do find many vegetarian meals to be pretty darn good (ever tried homemade banana lumpia with a caramel glaze?!  Malasadas?!  How about butter mochi?!  I know, I know all dessert.. okay, I know you've probably had this one: a margheritta panini- dang skippy!).  I also found that being broke means that my family is eating more vegetarian meals since it can be a lot cheaper. I figure if I can't eat meat as often simply because I can't afford it doesn't mean I have to eat plain and boring tasting meals- thus why I'm on your blog.  If you open a restaurant in the future then open one up in the bay area and I'll stop on by!  Just don't go the 'mini' chain restaurant route please, let the food sell itself.    \n\nGood Luck to you!\n\n\n\n(p.s. please excuse all the spelling errors)",
      "parent": "0",
      "gravatar_hash": "cc883a56eb752b233b88d1c9a27b3582"
    },
    {
      "id": "49971",
      "author": "bazina!",
      "author_url": "",
      "date": "2012-09-11 21:21:17",
      "content": "I have another one!!  Biscoff smore's with Nutella!! haha..   Forget opening a restaurant, just hit um where it hurts and open up a dessert diner! ;)",
      "parent": "0",
      "gravatar_hash": "cc883a56eb752b233b88d1c9a27b3582"
    },
    {
      "id": "49976",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-11 21:40:48",
      "content": "Malasadas, from Leonard's, that's what I'm talking 'bout!\nJust had to google butter mochi, never heard of that before but I'm all in.",
      "parent": "49967",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "50352",
      "author": "Venera@Veggykitchen.com",
      "author_url": "http://www.veggykitchen.com",
      "date": "2012-09-13 00:35:17",
      "content": "Thanks for such a nice article, Michael!\nAs for me, I started to be a vegetarian 4 years ago for health reasons. I just happened to meet a girl who was 30  some years and looked like she was 20 some years. She was a vegetarian. That struck me and I became a vegetarian too.\nIn about a year or so I found my religious path, which is The International Society for Krishna Consciousness. According to the ancient Vedic philosophy non-violence is one of the fundamental principles for the one who wants to advance spiritually. As I was a vegetarian already I didn't have to struggle with giving up meat.\nMy main reason for being a vegetarian now is because this is what God wants from me.",
      "parent": "0",
      "gravatar_hash": "fa24f1035ae22ade4cb815b45f6c4678"
    },
    {
      "id": "51915",
      "author": "Dina",
      "author_url": "http://www.oliveoilandlemons.com",
      "date": "2012-09-16 12:47:09",
      "content": "Michael, great post as usual. Look at the response it generated. Just to stir the pot a little further: I know you mentioned that health benefits are incidental to you, not the main reason for being a vegetarian. In my never to never to be humble opinion, (you know whose phrase this is), neither vegetarianism or veganism means anything in terms of health. Pepsi and greasy potato chips fit both categories and are clearly not healthy. How about the new way of looking at food: plant based, no or low free oils diet? It doesn't hurt other living being, sustainable for the planet and is good for our health.\nHave you had your lentils today?\nCiao,\nDina",
      "parent": "0",
      "gravatar_hash": "004ea6b9e5095dcfe4c72df400f02fd0"
    },
    {
      "id": "52265",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-09-17 18:45:57",
      "content": "Hey Dina - quite right, it is entirely possible to have a completely unhealthy vegetarian diet. I'd venture to guess that *most* people who go vegetarian are making somewhat of an improvement in their diet, but of course that is a highly multi-dimensional, individual thing.",
      "parent": "51915",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "58173",
      "author": "Sunshine Lim",
      "author_url": "",
      "date": "2012-10-02 15:45:57",
      "content": "Thanks for the post. It helps! I am vegetarian for 3 years plus and I have to answer that question for like 300++ times. There are countless reasons why one goes vegan but there is just none for why we shouldn't.",
      "parent": "0",
      "gravatar_hash": "c84c431f1ffaca47a27f073f118df873"
    },
    {
      "id": "60608",
      "author": "Britney",
      "author_url": "",
      "date": "2012-10-07 14:42:37",
      "content": "Great response! You have perfectly expressed my reason for becoming a vegetarian 10+ years ago. It is becoming more mainstream now, but especially when I first stopped eating meat, my friends and family were dumbfounded, as in *does not compute* dumbfounded. Occasionally, you still come across the jerk who has no interest in your diet whatsoever until you mention that you are a vegetarian, and then they get all nosey and argumentative. I'm not proselytizing, buddy, so lay off! What is it to you if I don't eat meat? Haha. Great blog. Will be following!",
      "parent": "0",
      "gravatar_hash": "8a96d5a5cb35abe19c167465b7718101"
    },
    {
      "id": "60863",
      "author": "Celeste",
      "author_url": "http://www.loserly.com",
      "date": "2012-10-08 04:45:55",
      "content": "I agree with and have felt everything you've expressed here.  This is exactly what I always want to say to people, but I never have it organized in my head well enough.  Thank you for giving me a URL for linking people, as well.\n\nI also want to say your recipes here have inspired me to purchase your book and try cooking vegetarian fare for myself.  I've never been much of anything but a mess-maker in the kitchen, but I'm looking forward to forcing myself to eat more vegetables.  I live in Seattle and hope to be able to visit your restaurant once you open it, so I wish you the best in that.",
      "parent": "0",
      "gravatar_hash": "817493e3bd124da119939178b2101eb7"
    },
    {
      "id": "60889",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-08 07:36:12",
      "content": "Thanks, Celeste! And as you get into the book, by all means let me know if you have any questions, I'm always happy to help.",
      "parent": "60863",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "61160",
      "author": "Kari",
      "author_url": "http://vegcookinggal.blogspot.com/",
      "date": "2012-10-09 09:32:50",
      "content": "I am a vegetarian as well (tiny bit lacto-ovo just for cheese:))) and I just wanted to add something you may be interested in.  You spoke of the difficulties of a vegetarian restaurant and all of the issues that come along, less draw, harder to prepare, etc. etc.  This is so completely true, but I do know of one restaurant that I think fits you, being that it is gourmet, beautiful, well thought out and all vegetarian.  It is called Millenium and it is in San Francisco.  If you haven't been there you should, and maybe do something similar in Seattle!! Just a thought!",
      "parent": "0",
      "gravatar_hash": "a641ad39545ee407b4a0b777f56d57b5"
    },
    {
      "id": "61197",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-09 12:14:53",
      "content": "I've been to Milennium exactly once, a very long time ago, but I do remember it being terrific!",
      "parent": "61160",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "70326",
      "author": "skepticrina",
      "author_url": "",
      "date": "2012-10-28 20:04:07",
      "content": "How are you mostly vegan when you eat some meat? LOL! that is hilarious.",
      "parent": "2196",
      "gravatar_hash": "de1beb9c742fda60699d27bfec0749fb"
    },
    {
      "id": "70364",
      "author": "Bea Elliott",
      "author_url": "http://beaelliott.blogspot.com/",
      "date": "2012-10-28 21:31:23",
      "content": "I guess one could be mostly vegan but still eat some meat if they were mostly delusional! It might be evident too that one can source \"better meat\"... Must mean the animals were really happy when their throats were slit.  Ah what a fantastical world it is for those who don't think words, ethics or deeds need to be anchored in reason or reality.",
      "parent": "70326",
      "gravatar_hash": "9a5affbfa734997c261ac88cd19d7e15"
    },
    {
      "id": "74037",
      "author": "diane",
      "author_url": "",
      "date": "2012-11-04 08:17:16",
      "content": "wow, that was very well-said.  great job.  i am a relatively new vegan (approx 8 months) due to reading 'the china study'.  cancer runs in my family and apparently is very strongly linked to high animal protein diets (most notably, casein, a milk protein).  so that really got me more motivated, even though i am a real animal lover and had given up eating mammals years ago.  i couldn't eat a fish, lobster, or chicken if i had to kill it, but had been putting blinders on about the animal cruelty there and was still eating those and eggs and dairy.  i've only recently realized how poorly dairy animals are treated and how sad it is for cow and calf to be separated at birth and that male animals are destroyed or sold for meat.  i'm glad i discovered your site.  i hope you do open a vegetarian or (better yet) vegan restaurant.  it is so hard to go out to eat and find something good that doesn't at least have cheese on it.  and it's a crying shame.  there are so many wonderful food options.  fortunately i love cooking and have a pretty good supply of organic ingredients from my garden to play with.",
      "parent": "2195",
      "gravatar_hash": "168a27c9040af3edf977f89aca28468e"
    },
    {
      "id": "75911",
      "author": "carrie",
      "author_url": "",
      "date": "2012-11-07 10:12:42",
      "content": "interesting you say that about worms. i had the same issue when I was a kid, but my grandpa showed me that when you put a worm on a hook, it doesnt die. you dont want it to die. you want it to live on the hook, so its alive underwater and the big fish will be attracted and come eat it. You sort of tie the worm on the hook :)  ive pulled up many live worms after hours of catching no fish... same it true for minnows. I can put a minnow on a hook without killing it. you put the hook thru the mouth and out the gill. it doesnt die. it dies when the big fish eats it. I've actually gotten back live worms and minnows from the big fish i catch and reused them. lol. i would eat the whole fish. not wasting any of it. i am mostly vegan now, for health, ethical and environmental reasons. i dont have an issue with being at the top of the food chain, i just have an issue with how unjust and inhumane everything has become. sadly milk isnt gathered the way I remember as a kid but I eat yogurt and cheese occasionally :(",
      "parent": "0",
      "gravatar_hash": "aa3c9148976f2743d465557ad6bd5f51"
    },
    {
      "id": "80634",
      "author": "Marylee",
      "author_url": "",
      "date": "2012-11-15 15:54:59",
      "content": "This is precisely why I don't eat meat. I was raised on a ranch and saw animals butchered  \"humanely\". The animals frequently demonstrated they knew what was going to happen. You can imagine how popular I am with my family. Thank you for putting your reasoning so succinctly, Michael",
      "parent": "0",
      "gravatar_hash": "e252ef814a70f18d71b0ce44e631ee99"
    },
    {
      "id": "81302",
      "author": "cerian",
      "author_url": "",
      "date": "2012-11-16 20:07:14",
      "content": "I admire you, because I am a vegetarian (lacto-ovo) for the same reasons as you, but I find it difficult not to judge others. \nI've been a vegetarian since the day I was born (and in the womb!) because my parents were when they had me. When anyone asks me why I'm a vegetarian I have a similar answer, 'because I couldn't bring myself to kill an animal myself', and that's the short answer. But then there are those who believe I wasn't given the choice because I was 'brought up that way'. The truth is, whether I decide to start eating meat or not, my parents would respect my decision either way. \nBut I really can't see that happening, because I feel it so strongly. Like you said, I look into their eyes, or hear them squealing and I can't bear to think of what they are going through. I would so love to have your attitude. It really brings me down sometimes to think of the way animals are treated in the world. I hope that I will learn to cope with it the way you do some day. I'm looking forward to following some of your recipes too! This post has inspired me, thank you.",
      "parent": "0",
      "gravatar_hash": "17b010da5f2a8b91992b1a8e220e3406"
    },
    {
      "id": "91447",
      "author": "Ellen H U",
      "author_url": "",
      "date": "2012-12-02 10:33:53",
      "content": "I've been vegan for approximately 1.5 yrs, and gluten free for closer to 3 years.  Initially it was for health reasons - never want to take a statin drug and my allergist suggested the only way to stay off statins was to go vegan.  I saw Forks Over Knives the next week, and became vegan the day after. 6 months later lab work results were beautiful and it had the impact I wanted on health.  Now it's about the compassion for animals.  I've become more aware of the conditions of factory farming -- am horrified.  I also see that there is so much delicious food, so many ethnic markets to explore with different produce, spices, seeds, nuts, chutneys.....that there is nothing to miss by not eating meat, and everything for me to gain by eliminating animals and animal products from my diet. Ask the proprietors how to prepare unfamiliar foods - there's a whole world to explore. It's harder to get gluten free food in restaurants.  I'm always happy with a salad if there's no entree for vegans - it's about being out with friends, more than eating out, and I love cooking at home.  Little by little I'm discovering more places locally with vegan entrees, or vegan side dishes, and am grateful for the community for providing such fare.  I also watch a lot of cooking shows, but lately feel more grossed out by seeing whole animals broken down, imagining how those animals once enjoyed life and are now fodder for a contest.",
      "parent": "0",
      "gravatar_hash": "b480f983688cadfdb2059bad4c4b2e55"
    },
    {
      "id": "93592",
      "author": "Tom the Observer",
      "author_url": "",
      "date": "2012-12-05 11:04:44",
      "content": "Good job people of the internet! This is the longest strand of civil discussion I have ever seen after a post about such a widely debated topic.",
      "parent": "0",
      "gravatar_hash": "d96ab8d01f32eca040de1ab45c4f15f8"
    },
    {
      "id": "93602",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-12-05 11:31:22",
      "content": "That's a very good point, Tom! I really appreciate that this has been a thoughtful and calm discussion, and that people keep adding to it years later. I've only had to delete a couple really offensive ones in all that time.",
      "parent": "93592",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "96064",
      "author": "debbie",
      "author_url": "",
      "date": "2012-12-08 20:18:59",
      "content": "ugh, i hate that dreaded question, its inevitable that someone is going to ask whenever we are out with a group of friends. I hate the attention it draws to me and always try to keep my eating choices quiet, never drawing attention to myself if i have to ask a waiter if something is made with vegetable broth or a meat based broth. And no matter when its asked or who asks or how loud the group is when the dreaded question is asked, the whole group goes quiet and looks at me just waiting for my answer .... ugh :(  Its a personal choice of mine and i hate the attention it draws as most of our friends are meat eaters. Even my sister-in-law said, \"I've never even MET a vegetarian before!\" \n I haven't eaten meat in about 21 years, i remember my last meat meal, it was a Burger King chicken sandwich thingy.  Yeah, i know, i could have at least chosen something scrumptious!!  But anyway, I too, have always loved animals my whole life and always thought that i knew what they were thinking and feeling, I too could never bait a hook or hunt with my brothers. As a teenager i happend to get a really cool job working with calves (i THOUGHT it was going to be cool!!). It was actually a veal farm where 240 newborn calves came in and were chained in a small stall and forced to drink from buckets a warm slurry of milk replacer and antibiotics. After weeks of working here and raising these babies it was time for them to be \"processed\" and i was offered a calf of my choosing for my freezer if i wanted it. What an eye opener that moment was for me, none of what i was doing had sunk in until that very moment in time. I hated myself for what i had done and hated the world for eating baby calves! I quit my job and got a job at a supermarket. I continued eating meat though because i didnt know i had a choice, I grew up in a family that ate meat at every meal. In my 20s I met a woman that changed my life, i met a vegetarian! A light bulb went off and it was then that i realized that i actually had a CHOICE in what I ate, I realized that I could make a difference in the lives of animals by chosing NOT to eat them! So when that dreaded question is asked of me and the whole room is staring at mea waiting for an answer, I just reply, \"I love animals so much that I choose not to eat them.\"  It never ends there though and i always end up having to defend myself and explain what i do eat if i dont eat meat! What do they think I eat, just how much of their plates are filled with meat only??  Like at Thanksgiving, they say, \"what do you eat if you dont eat turkey?\" I used to say, \"everything else!\", but now I say, \"what do YOU eat at thanksgiving?\" After they say turkey then they start rattling off all the other stuff and I nod and say, \"yup, me too, yup me too, yup me too : ) \"  \nThanks for the great conversation starter, it was good to hear your story and the comments! Great website, great support, thanks for being here with all your great recipes and conversation :)",
      "parent": "0",
      "gravatar_hash": "9eca4937492d39005e6d8c03124841db"
    },
    {
      "id": "97249",
      "author": "Helyn",
      "author_url": "http://helynshealthykitchen.blogspot.com/",
      "date": "2012-12-10 08:04:04",
      "content": "What a great article! Thanks for sharing. I just started a vegan cooking blog and I'm so enamored with the many other sites out there, like yours, with humble beginnings and heartfelt  perspectives regarding vegetarianism, veganism, et al. It's all so inspirational.\n\nI am a vegan for health reasons AND for all the things you mention above. When I first saw the video titled \"Meet Your Meat\" I had already adopted more of this way of eating but that ended it for me. No more meat on my plate. And now, when I do purchase any kind of animal product, even for my cats, I will only buy from reputable farms who treat their animals humanely.\n\nThanks for all you do, Michael. Your stats speak for themselves. Well done! Consider me another  follower :)\n\nHealthy Trails,\nHelyn",
      "parent": "0",
      "gravatar_hash": "8a4506fabdfc86330c041a3547c1c03c"
    },
    {
      "id": "100423",
      "author": "Ido Dubrawsky",
      "author_url": "http://idubrawsky.wordpress.com",
      "date": "2012-12-16 16:57:25",
      "content": "An excellent and cogent consideration to the reasons that helped you decide to be a vegetarian.  I'm a lacto-ovo vegetarian as well and have had similar thoughts and feelings regarding my decision.  It caused a fair amount of consternation in my family when I chose to be a vegetarian (I was a vegetarian for quite a while when I was in college and gave it up at some point for unknown reasons).  My wife and kids are non-vegetarians and I did it initially as a way to get a hold of my diet - I was 210 lbs (on a 5' 10\" frame) and wanted to lose weight (now, 11 months later I'm 172 lbs and hope to be down to 155 by sometime next year - there are, of course, other factors in this beyond the diet but I don't want to get into that at this time).  I originally became vegetarian from the \"health\" perspective but I have since evolved to where I don't want to be responsible for the death of another creature (or the mistreatment of another creature) to meet my dietary needs.  I have been contemplating putting together my own \"Why I am a vegetarian\" blog post on my website and have been reading what others have been saying in hopes of helping me hone my statement regarding my decision.  Thanks for your post!  It definitely helps me articulate my own thoughts on this issue.",
      "parent": "0",
      "gravatar_hash": "b596ee32ef479bfcff871a3c024171ba"
    },
    {
      "id": "100478",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-12-16 20:43:17",
      "content": "Thanks, Ido, and please send me a link to your post on the subject when you write it.",
      "parent": "100423",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "100606",
      "author": "Peggy",
      "author_url": "",
      "date": "2012-12-17 07:17:50",
      "content": "Nobody asks me why, probably because they don't want to hear a rant. My family is 7th day Adventist, so no one in my family asks, as Adventists are pro-veg. It's been a gradual move: Over the years I've eliminated items one at a time usually for ethical or environmental reasons, but also because of food allergies/intolerances.",
      "parent": "0",
      "gravatar_hash": "fd6674e30c98223af35ceb606c5c9a82"
    },
    {
      "id": "102827",
      "author": "Rita",
      "author_url": "",
      "date": "2012-12-27 22:14:42",
      "content": "Michael I really, really identify with why you are a lacto-ovo vegetarian. I have not been a  vegetarian myself for many years as you have, but I know I will be acto-ovo vegetarian the rest of my life. I love animals too and that IS the reason I am now a vegetarian.                                   I am so happy to have found your website. Thank you for your recipes &amp; writes.",
      "parent": "0",
      "gravatar_hash": "e0e3b3c2b1ec7d589decbc304cb1a230"
    },
    {
      "id": "105686",
      "author": "Johanna",
      "author_url": "",
      "date": "2013-01-10 06:52:54",
      "content": "A mostly vegan might eat meat when there are no other options -- or when they are out with their company and again, there are no other real options.  A mostly vegan might eat vegan all the time but once or twice a year eat non-vegan.  That's how I see a \"mostly vegan.\"  Surely you must see the difference between someone who eats non-vegan once or twice a year and someone who eats non-vegan daily.",
      "parent": "70326",
      "gravatar_hash": "1dab136c8524766f9a8210eb021bce29"
    },
    {
      "id": "105693",
      "author": "Natalia",
      "author_url": "",
      "date": "2013-01-10 07:11:04",
      "content": "What do you mean you can't eat most vegan foods because you can't eat  eggs, dairy and soy? Eggs and dairy are not vegan as for soy is easily avoided as is gluten, I know celiac vegans and it isn't a huge problem.\nI am not judging just wonder how not being able to eat soy makes you a vegan who can't eat most vegan foods :-/",
      "parent": "2196",
      "gravatar_hash": "d665a0f3131f28b9d1a137acc77be53e"
    },
    {
      "id": "105709",
      "author": "Cody",
      "author_url": "",
      "date": "2013-01-10 08:53:05",
      "content": "Your post sounds like myself a few years ago. I was vegetarian for a good many years, thinking the same way. The idea of injuring animals just because they taste good was pure insanity to me.\n\nOne day, I got up my courage to actually research those \"zaney\" vegans. They seemed so far fetched, even for me...who admittedly loves animals more than I do people in most cases. What I found regarding the dairy industry was absolutely horrifying. I discovered that eating beef was actually more humane than eating a slice of cheese. btw, I was one of those \"can't live without cheese\" sort of folks. I ate cheese on everything but cereal!\n\nAfter a couple hours of reading different online site's articles and blogshots, I was vegan. 'Never looked back. If you are vegetarian for ethical reasons, I can't stress enough the importance of doing your own research on the dairy industry. Eggs are even worse, unless you have your own yard chickens.\n\nI cannot tell you how angry I've become over the course of the last couple years, having to CONSTANTLY explain my diet to people who really aren't interested in the first place. It's like a game of \"poke the vegan with a stick\" rather than any genuine curiosity or interest. I was blissfully ignorant for years. I hate to admit that I was willingly ignorant, but I was. I just didn't want to give up cheese or eggs! I guess Karma is slapping me in the face by introducing hoards of folks who are doing exactly the same thing. Then, after being pushed into more detail in my explaination, they get offended because I've stated horrid facts that make them feel bad. So...I end up the bad guy?! And never mind me keeping my mouth shut about how nightmarish it is being surrounded by a huge ham, pork loin and whole chickens while making mashed potatoes in the kitchen at Christmas dinner. You might as well have had kitten parts on those platters.\n\nI am finding it more and more difficult to remain tollerant of others' food choices when it involves meat or dairy or seafood. Oh! That's another one I get, \"But you eat SEAFOOD, RIGHT?!\" I really do not want to alienate people, as that simply goes against my hope of opening them to the realities of their choices. But, when I see someone who professes to love animals go to Walmart and buy a basket full of meat and dairy...well. I feel like I'm watching atrocities that must be stopped. \n\nHow do I find my way back to being tollerant and welcoming to people when they are so set upon keeping their eyes wide shut, like I did for long?",
      "parent": "0",
      "gravatar_hash": "3fbae8959c26d46449b31c3b5a70aefe"
    },
    {
      "id": "107699",
      "author": "Becky",
      "author_url": "",
      "date": "2013-01-17 11:09:33",
      "content": "Decade long vegan here. Recently began eating wild caught salmon or brother caught fish on occasion, because for some strange reason, I felt like it. Still not sure how I feel about if, since, as you mentioned, an eating style really is multi-dimensional. Regardless, I think more of how I feel as a complete being in space and time at this moment when I nourish myself. If it makes me smile and feel vibrant, I resume. If it repulses me, I stop. I resonate with your article on many levels and it makes me wonder, are people trying to simply discover why we eat as we do or are they just trying to demystify something they cannot understand? I'm sure it's both and more. It made me realize, rather than be continuously annoyed with just becoming a way I always felt I was (I just, at one point, learned how to be that), I, too, can keep it simple with replying, \"I eat to feel alive!\" That's it for me. Honestly, all of the reasons, just like yours, really can be simplified into one feeling, alive! Thank you!!",
      "parent": "0",
      "gravatar_hash": "d80c7ec989b7a97d0d661a949b391e94"
    },
    {
      "id": "107721",
      "author": "Laura Plumb",
      "author_url": "http://food-alovestory.com",
      "date": "2013-01-17 13:14:42",
      "content": "Dearest Wonderful Michael, What a brilliant article. Clearly you touched a nerve. \n\nI, too, have been a Vegetarian for a very long time. The answer to the question is rather long and personal, and usually not one I want to get into over dinner with friends. So I am grateful now to be able to join you to \"rattle off this url\" when asked!\n\nThank you ~",
      "parent": "0",
      "gravatar_hash": "9d1fa6884d957d918deb8f3413f64784"
    },
    {
      "id": "113273",
      "author": "Terr",
      "author_url": "",
      "date": "2013-02-03 08:50:32",
      "content": "Michael, \n\nThanks for your thoughtful essay regarding your dietary lifestyle. My first thought when I read about people constantly question your food choice was that really, it's none of their business! \n\nI know it's not p.c. to go around telling people to mind their business if we hope to have a social life, but I'm puzzled why people are threatened by your dietary choices. Then again, it seems to me that people are threatened by anything that is different from what THEY think should be the norm. \n\nAs for me, I'm a meat eater. I always will be and there's no sense of me pretending that I won't be. I need burgers in my life. I need barbecue. However, I've started to adopt veggie meals into my diet for health reasons. I suffer from health issues that causes fatigue and inflammation. I feel that I need the vitamins, minerals and enzymes that only fruits and veggies can truly provide. Besides, I definitely need the fiber! \n\nI've grown in awe of all the tasty meals that can be made with veggies. This is why I've subscribed to your blog. I want to learn how to enjoy veggies in different ways. Growing up (In the 70s and 80s), I was always taught that eating veggies meant steaming them and eating them plain. Possibly, one could drizzle lemon juice on them and that's it. I'm sorry, there are very few veggies that taste good to me in this way. Also, I'm not the person who can chow down on veggie sticks as snacks. \n\nLately, I've learned that I can use all sorts of seasonings, spices and (Gasp!) even oils such as olive oils to create a delicious veggie meal. I will say that I use butter for my sauteed brussels sprouts, and for my carrots and butternut squash mixture. In order to eat any food, it has to taste good, right?  That's what I'm hoping to learn from you. \n\nBottom line, what does or doesn't go into someone's mouth is their personal choice. If I were any type of vegetarian, I'd simply tell people that I decided to eat in this way for personal reasons. If they didn't like it, they'd quickly be off my friendship/socializing menu, so to speak.",
      "parent": "0",
      "gravatar_hash": "5a3fdfa78a293a76948215fc8cc7af03"
    },
    {
      "id": "115033",
      "author": "PdxMom",
      "author_url": "",
      "date": "2013-02-06 13:36:44",
      "content": "Wow, how refreshingly honest and real. Thank you for writing this piece. I just may refer to it when folks ask me why I am vegetarian. I really identify with your views. It saddens me to read the vitriol from the vegan community toward your personal choice. Why must they demand you take the higher moral ground or be some preacher or crusader trying to convert others?",
      "parent": "0",
      "gravatar_hash": "dc3daaa03f92d5184b2c39b08d9a0030"
    },
    {
      "id": "115225",
      "author": "natalia",
      "author_url": "",
      "date": "2013-02-07 01:11:06",
      "content": "Whilst I understand each person has to make their choices I also understand the frustration of vegans who lose it, dairy industry is as brutal, if not more, as the meat industry, our choices cause endless suffering. Whilst I don't force my opinion on others, it is so hard to see it and be civil and say \"oh no worries it is your choice\". \nIt's not a moral high ground, I don't feel superior to anyone giving up dairy or eggs, I wasn't even a choice, and I only wish for  other people would give it up because I hope to one day see the end of that suffering. \nI am guessing the might sometimes come down harder on vegetarians because if you already are aware enough to go to that length it is less understandable that they stop there. Of course I am sure it is totally counter-productive.",
      "parent": "0",
      "gravatar_hash": "d665a0f3131f28b9d1a137acc77be53e"
    },
    {
      "id": "115343",
      "author": "PdxMom",
      "author_url": "",
      "date": "2013-02-07 09:30:54",
      "content": "Perhaps most vegetarians in western cultures have made the choice because they want to do their part in ending animal suffering, but that is not the ONLY reason. Vegetarians are not a homogenous group. Is there there anyone else out there who does not eat meat because they just don't want to eat dead animals? Maybe the gross factor is more a reason than the animal suffering factor? Maybe it is like bugs- I try not to kill them if I can just scoop them up and throw them out the door, but if they get killed I am not perseverating on bug suffering, or going around scolding all the bug killers in the neighborhood.\nI grew up 95% vegetarian because my family was lacto-vegetarian for religious reasons. So, not eating meat is part of my culture, and though I am an atheist now, it still feels normal to me. I became 100% vegetarian at 16 after seeing a cow slaughtered for scientific research in a rather humane manner. It really grossed me out. I decided that becoming 100% vegetarian was the easiest way to avoid having that slaughter become my recurring nightmare. \nSo there you go. This is more about me than the animals. Does anyone else out there feel this way?",
      "parent": "0",
      "gravatar_hash": "dc3daaa03f92d5184b2c39b08d9a0030"
    },
    {
      "id": "115382",
      "author": "Bea Elliott",
      "author_url": "http://beaelliott.blogspot.com/",
      "date": "2013-02-07 10:41:21",
      "content": "Hi PdxMom --- So how would you feel if your bug-killing neighbors were deliberately breeding these critters just to kill? How would you feel if you knew that in the process of raising the insects they were using food that could have fed (starving) humans instead? Certainly animal agriculture is showing itself to be not only unnecessary, not only cruel - But also very wasteful of limited resources we need to share with others on the planet. \n\nIf the world were not competing for grains to fatten animals with... We'd truly be a more generous species - And might solve the bulk of the problem with world hunger.",
      "parent": "0",
      "gravatar_hash": "9a5affbfa734997c261ac88cd19d7e15"
    },
    {
      "id": "118999",
      "author": "Josee Fontaine",
      "author_url": "http://littlefox.artistwebsites.com",
      "date": "2013-02-18 04:48:22",
      "content": "I am a vegan and my main reason for my lifestyle is to not contribute to animal suffering in any way.  I understand Michael when he says that he looks into their eyes and FEEL.  Most people are disconnected from life and live unconsciously.  I am an empath and I feel their pain and suffering therefore I understand them.  The animals are my friends and they have been there for me when no one else was.  I love nature and photography and like to capture the animals in the wild.  I am on my own journey and respect others on their own.  You can't teach or preach, people don't like it.  You can just be an example to others with your own life and they can make their own decisions when they are ready.  Everyone has free will!",
      "parent": "0",
      "gravatar_hash": "1815790ae85d02e7957b585bf1f25895"
    },
    {
      "id": "122523",
      "author": "Kristina",
      "author_url": "",
      "date": "2013-02-28 16:09:05",
      "content": "You and I are kindred spirits.  Like you, I knew almost from Day 1 that I couldn't eat animals.  I adored them.  Going fishing with my Dad while on camping trips was an experience for me very similar to yours.  BUT, I was raised in a family that did not understand my care of animals - they just saw me as odd and rebellious, which was not at all the case.\n\nNow, I am a long time complete veghead, with two grown sons who are also choosing similar lifestyles, because they see the good health that their mother enjoys.  Not only that, but they were raised by a woman who never stopped feeling toward animals as I did as a child.\n\nThe other day I was driving and spotted a chicken sitting in the road (no, this is NOT a joke).  I stopped my car, got out of my car and talked lovingly to her, scooping her up and depositing her on the seat next to me.  I believe with my whole heart that that chicken was not the least bit fearful of me because she KNEW instinctively that I meant her no harm.  \n\nThanks for this wonderful article.  I shall print it out and keep it in my file with others' reasons for choosing a vegetarian lifestyle.  The reasons are many and varied.  I suppose that I subscribe to them all - seeing my life as being interconnected to all that exists on planet Earth. Kristina",
      "parent": "0",
      "gravatar_hash": "47fd409becc2b5cd8c2728c4643121e4"
    },
    {
      "id": "123357",
      "author": "Fran",
      "author_url": "",
      "date": "2013-03-03 09:29:39",
      "content": "I am trying to become a vegetarian because I hope it will save me money.  This last week I didn't feel well and I fell of the wagon.  Also I will have meat with friends or relatives since this is not even a weekly occurence and I think being almost a vegetarian is better than nothing.  I'm really appalled at some of the health harzards to eating meat.",
      "parent": "2195",
      "gravatar_hash": "878278776f0013d5ea547979f0a13c80"
    },
    {
      "id": "124035",
      "author": "Revathy",
      "author_url": "http://toyexchange.vn/",
      "date": "2013-03-04 23:39:28",
      "content": "Love your site, enjoying your recipes, and totally relate to this article. I am Indian, so it has been relatively easy for me to be a vegetarian. But, I was born and raised in a family of rabidly carnivorous people(from the South Indian state of Kerala), who tried for 12 years to \"non-vegetarianize\" me since they didn't know any better. \n\nMy husband and daughter choose to be non-vegetarian, and I cook meat for them whenever they crave it, since I do not want to impose my personal choices on them. Nice to know that there are others out there who are \"born\" vegetarian, and have a live and let live credo.",
      "parent": "0",
      "gravatar_hash": "f80a49bd363fc03269c628a4d993cbbd"
    },
    {
      "id": "124753",
      "author": "Maggie",
      "author_url": "",
      "date": "2013-03-07 07:13:49",
      "content": "I wholeheartedly agree and have just recently become a lacto ovo vegetarian for the same reasons.  Thank you for writing this article.  I see it was from years ago, so thank you for reposting it.  I'm sharing it with my friends so they can understand to.",
      "parent": "0",
      "gravatar_hash": "99a30017991f9bbb541a56f731487d4e"
    },
    {
      "id": "131180",
      "author": "Eden",
      "author_url": "",
      "date": "2013-03-29 21:43:20",
      "content": "Sig, unless you only eat animal flesh and animal derivatives, you are not a carnivore to the core.  You are an omnivore.",
      "parent": "2195",
      "gravatar_hash": "e47a8e6f4007f2ff7ec555986d017bb3"
    },
    {
      "id": "131186",
      "author": "Eden",
      "author_url": "",
      "date": "2013-03-29 22:00:40",
      "content": "Why must a \"live and let live\" attitude exclude animals? Carnists want veg'ns to \"let (them) live\" and to \"respect their personal choices\" when they do not practice letting animals live and they do not respect the personal choices of animals toward life, liberty, and the pursuit of their happiness. Animals have rights, and humans do not have the right to deny them their rights--we only steal opportunity. When your lifestyle choices demonstrate respect outside of an anthropocentric world, I will respect them. Otherwise, you should not expect the respect you have not earned. \n\nNote: Do not conflate judgmentalism with anger. If someone killed your loved ones you would be angry, too. If you want compassion you should show at least a little. A flagrant \"carnivore to the core\" is not going to get compassion from veg'ns, just pity.",
      "parent": "0",
      "gravatar_hash": "e47a8e6f4007f2ff7ec555986d017bb3"
    },
    {
      "id": "150689",
      "author": "Malli",
      "author_url": "http://Www.chillilovesmalli.blogspot.com",
      "date": "2013-05-23 09:42:07",
      "content": "I just found ur blog and find it to be very interesting. Love this post. BTW, I am a Flexitarian-if you will-consuming fish and occasionally eggs. I am appalled to hear about the treatment of animals before they r slaughtered!!",
      "parent": "0",
      "gravatar_hash": "ac4bd173a0685630f450a651edf71c8b"
    },
    {
      "id": "152454",
      "author": "Humberto",
      "author_url": "http://www.biocutis.com/",
      "date": "2013-05-27 18:09:18",
      "content": "I've had several experiences in Chile where I live with gentle animals that provide valuables to us. Apart from bees the following three:\n\nThe angora rabbits from which we can 'harvest' every 90 to 100 days a long fiber that is soft and insulating to make a beautiful yarn and if hand spun and hand knitted yields a very fluffy knitwear that no machine mill spinning can possibly replicate. \n\nThe oysters that coat an irritant to their soft tissues with a secretion, and in the process, little by little, yield a beautiful Pearl. \n\nA terrestrial mollusk, the helix aspersa brown garden snail that very much like the oyster has an innate immune system that is more evolved than ours and secretes a serum packed with complex molecules made of soluble proteins, glyco (sugar) molecules, oligoelements such as copper, zinc, calcium and enzymes and co-enzymes to heal its skin and even its tentacles where its eyes are when bitten by birds. \n\nThis mollusk also has skin tissues and living cells and organs that are similar to human skin, and scientific research by the dermatology service of The Memorial Sloan-Kettering Cancer Center in New York postulates its use in regenerative therapy, while there are already natural skin care products made with it. \n\nIn those three experiences I have been directly involved as an entrepreneur and the experience has made me think that I choose to live with gentle people and gentle animals and eating my fellow partners from the animal kingdom just does not feel right or gentle to me. I like to remain in touch with the simple rewards of living our lives together. \n\nCongratulations for your stance and I love the sharing and comments it has brought forth. Can I post the essence of your thoughts together with mine at my website?",
      "parent": "0",
      "gravatar_hash": "a137b87332783bbb2ebcece18e22f833"
    },
    {
      "id": "152460",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-05-27 18:30:01",
      "content": "Thanks for sharing your very interesting experiences! Re your last question, you are very welcome to briefly summarize / excerpt my article on your site, but of course if you want more of the content, please just link to it instead of copying it.",
      "parent": "152454",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "156263",
      "author": "If it has a face it's not edible",
      "author_url": "",
      "date": "2013-06-07 12:06:07",
      "content": "Yes, there are so many reasons for being a vegetarian, it boggles the mind to think most people eat meat.\nI can't go all the way to veganism, but I rarely eat eggs, I replace animal milk with almond milk and/or soy milk whenever possible, and I always buy rennet-free cheese. \nAlas most cheese contains animal rennet, which comes from animal gut, including the gourmet cheeses; example: parmigiano reggiano. Yuccch, totally nauseating. \nWhole Foods and Trader Joe's carry a few cheese brands that are rennet-free.\n\nBTW, great website!",
      "parent": "0",
      "gravatar_hash": "322cd0739012084ee52b72db89455aa2"
    },
    {
      "id": "180086",
      "author": "Karen",
      "author_url": "",
      "date": "2013-07-28 02:04:40",
      "content": "Thank you.  I'm also going to just share you URL the next time someone asks.  As a child I did kill, skin, gut and eat animals on a farm (obviously with adult help and supervision).  I can remember every detail and it sickens me.  I'll never eat meat again (unless I am also in the woods with a gun etc etc).  I don't care if others eat meat - so please can the world stop caring that I do not.",
      "parent": "0",
      "gravatar_hash": "bb7fb5cb47335734f3d7f90bf355badf"
    },
    {
      "id": "181628",
      "author": "vitto",
      "author_url": "http://vse-o-zdorovye.ru/",
      "date": "2013-07-31 07:25:06",
      "content": "Your wonderful article attracted attention in Russia. Your beliefs are close to many of us. Thanks for the unconventional view on vegetarianism.",
      "parent": "0",
      "gravatar_hash": "1ed7bd8d30f4d31dfab3013d54c9d040"
    },
    {
      "id": "189416",
      "author": "Paola",
      "author_url": "",
      "date": "2013-08-18 19:47:08",
      "content": "I've also become a vegetarian... mainly for ethical reasons, I will not let my body be a tomb for other animals! Animals, too, have feelings and do not deserve to be killed in such horrible ways, just for that piece of protein to get to our plates. I've made this decision though most of my family are meat-eaters. They criticize me for doing so; my brother thinks I am anorexic or something. I do not get the support from my family which is sometimes hard but I've heard that the strongest people stand alone! I've been vegetarian for about two weeks now (I didn't eat much meat before so the transition was not that hard) and so far, I love it! :)",
      "parent": "0",
      "gravatar_hash": "03336f80f64c9537e050cfa62d0ed75b"
    },
    {
      "id": "189439",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-08-18 21:44:42",
      "content": "Good for you, Paola, and I'm sure your family will come to accept your choice over time. It can be a long journey, but as long as you are doing what is right for you, that is what matters.",
      "parent": "189416",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "194350",
      "author": "TJ",
      "author_url": "",
      "date": "2013-09-05 06:41:37",
      "content": "Hi, I would like to thank you for this wonderful article. This is one article that resonates deeply with me. I started my journey to become a permanent vegetarian 2 months ago. I have always wanted to become a vegetarian and had fast from meat from time to time for various reasons, mainly thanksgiving (ie: after each backpacking trip, i will be vegetarian for a month to give thanks that I had a safe journey). I have always felt that it's just not right to kill animals for their meat. I felt deeply so when I saw pigs being caged in bamboo cages in Vietnam and were being sent to the kitchen. Their eyes were filled with so much sorrow. Then, I had a thought that I would like to be a vegetarian. However, I did not have the courage to face the consequences of being a vegetarian. I had never go on a vegetarian diet for more than 1 month and no one in my social circle is a vegetarian. Last month, I went to India and I was eating as a vegetarian throughout my trip. When I came back, it just clicked. I decided to be a vegetarian for the rest of my life. There were no special incidences. I did not witness any ill-treatment towards animals there. It just happened and I felt that I was ready to give up meat for the rest of my life. This decision is not something I can comprehend, but it's something I knew I wanted to do. The first few weeks were tough as friends and family ask me the reason for going vegetarian. I sometimes felt ridiculous for not being able to give them ONE solid answer because I don't have that answer myself. I just felt that it's the right thing to do as I would not want to harm another living being just for my pleasure. I was challenged in similar manner saying that plants are living being too. I felt stressed when being challenged because I was not able to give an answer that truly represented how I felt. I borrowed answers from other vegetarians because they sounded legitimate. Yet, these reasons are not the main reason, they are just \"by the way\" like what you mentioned. Your words hit all the right notes in my heart. The longer I abstain from meat, the greater empathy I developed for animals. I will never want to see my friends or family being skinned or cooked to serve another living being thus I would not want to do the same to another living being. That being said, I respect everyone's choice in life. My closest people around me still love meat and I am grateful that they are starting to understand that I am serious in this venture and accept who I am. Your site is an inspiration as I am someone who enjoy cooking too. I was slightly frustrated with the limited knowledge I have in cooking vegetarian food and I ended up eating more carbs just because I lack variety in my choice of food. Thank you, for sharing your thoughts. Thank you, for sharing your knowledge and passion about cooking vegetarian food. I am from Malaysia and you have touched a life from the other end of the globe.",
      "parent": "0",
      "gravatar_hash": "34eea50b39cd41012c78133d2606d730"
    },
    {
      "id": "194353",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-09-05 06:56:49",
      "content": "TJ, thank you so much for your note. Isn't it great to travel in India, where being vegetarian isn't considered even a little bit unusual? Re the \"plants are living beings too\" thing, I hear people say that all the time. My answer is simple: \"they don't have brains, they don't have nervous systems - so they don't experience any pain.\" Congratulations on your decision to follow your own path, that is what matter!",
      "parent": "194350",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "194940",
      "author": "Carolyn",
      "author_url": "http://www.carolynis.com",
      "date": "2013-09-08 08:08:48",
      "content": "I think that people ask me about my choice to be vegetarian because \n\nOne) they just eat what they eat without thinking about it and it's weird to them that someone would, and \n\nTwo) once they have thought about it they are freaked out about the lazy cruelty and casual inhumanity of how what they eat got to their plates and they can't accept it.\n\nTheir defensive reflexes kick in. And while sometimes I want to scream at them for their deliberate blind eye and disregard for the living things that get turned into neat little plastic-wrapped portions of non-living creatures, I know that is not the way.\n\nThe way is through delicious food and openness.\n\nI have written my own piece about how to eat a meal with me even if you aren't vegetarian:\n\nhttp://www.carolynis.com/i-am-vegetarian-hear-me-roar/",
      "parent": "0",
      "gravatar_hash": "fb3cb704f312fbe440e77e1ac2c7f20d"
    },
    {
      "id": "195658",
      "author": "Helen",
      "author_url": "",
      "date": "2013-09-12 07:03:15",
      "content": "I read this post today and I don't understand why you are a vegetarian and not a vegan? If animal welfare issues is your motivation for being a vegetarian, how can you not go all the way for these animals? Please note that I am not trying to judge you, I just want to know what is your logic behind being a vegetarian vs. a vegan?  I went vegan overnight after learning about factory farming - I was an avid chicken eater one day and the next day, I am a vegan. I know not many people can turn vegan overnight, but as soon as I made the connection between the meat on my plate and the animal that it once was - I never look back. If you care about animals, how can you drink milk and use dairy in your recipes? (I know it sounds like I am attacking you, but trust me, I am not, I really just wonder what your logic is to use dairy if you care about animals). In order to make milk for humans, mother cows are repeatedly impregnated on what the beef industry called a \"rape rack\" - as soon as the calfs are borned, they are taken away from the mothers. Male calves are confined in a crate that is barely bigger than them for 6 months where they are fed milk replacers, including cattle blood - they never get to drink milk from their mother.  Once the calves get to a certain size, usually in 6 months, they are slaughtered for veal. Their mothers, on the hand, is milked day in and day out by machines until they are dry and then they are re-impregnated. Once they are spent, they are then slaughtered for beef. Female calves end up with the same fate as their mother to be used as dairy cows. I just don't understand how someone who cares about animals can ignore the fact that cows suffer a great deal, just so we can have milk and cheese. It's not okay to me as a vegan and it shouldn't be okay to a vegetarian who proclaims to be a vegetarian mainly for animals. I hope this didn't come across as angry - it's more frustration and I'd really like to hear from your side how you justify using dairy in your recipes - is it just taste? Is it just that you don't feel you are contributing directly to the death of animals (although, this is definitely not true when you think about calves killed for veal).",
      "parent": "0",
      "gravatar_hash": "50d20d18b7762fdd5730c307245d2670"
    },
    {
      "id": "195660",
      "author": "Bea Elliott",
      "author_url": "http://beaelliott.blogspot.com/",
      "date": "2013-09-12 08:40:49",
      "content": "Hi Helen! I don't think your question is out of line one bit! In fact... I sort of asked the same thing here on February 10, 2012. If one's motivation is compassion there is no such thing as \"humane\" cow's milk. Even the \"best\" of \"family farms\" break up families, steal babies and send the \"unproductive\" ones off to meet their brutal end. \"Humane\" dairy is an oxymoron. :/",
      "parent": "195658",
      "gravatar_hash": "9a5affbfa734997c261ac88cd19d7e15"
    },
    {
      "id": "195665",
      "author": "Helen",
      "author_url": "",
      "date": "2013-09-12 10:23:03",
      "content": "There really isn't humane eggs or milk. In order to do that, you would have to raise the cow and chicken yourself, take them to the vet if they get sick, and let them live out their lives naturally even when they are too old to produce milk or eggs. In essence, you have to treat them like your pet dog or cat. If you can do that, then sure you can call them humane eggs and milk. But to be honest, after going vegan and learning about eggs and milk - I find them pretty disgusting. Not to gross you out, but eggs are chicken's periods. We are the only species that drink a different species's milk beyond weaning - that seems very unnatural.",
      "parent": "195660",
      "gravatar_hash": "50d20d18b7762fdd5730c307245d2670"
    },
    {
      "id": "198275",
      "author": "Unadilla Barb",
      "author_url": "http://psalm13916.wordpress.com/",
      "date": "2013-09-29 16:25:26",
      "content": "Michael - just found your website and am enjoying the recipes and your blog.  I feel like a lone man out here, but I have become vegetarian or vegan for my life.  I was diagnosed in July of 2011 with colon cancer that had spread to my liver.  I have been on chemo every other Wednesday since August of 2011.  I am now one treatment away from only having clinical trials left as options.  I started doing a lot of research on cancer and the vegetarian diet and decided to stop the chemo treatments.  I also started treatment with an acupuncturist, who immediately put me on a vegetarian - no dairy, no eggs - diet with vitamin and mineral supplements, plus some Eastern medicine.  She has had success in curing cancer for many patients in my area.  I grew up on a farm with my family of 7 and we always had a big garden and I knew where my meat came from because it was grown on our small farm.  But my acupuncturist guessed right off that I came from a family of farmers and she was right - 4 generations.  And now with me, 4 generations of colon cancer from my father's side.\n\nAs I said, for me the choice is to save my life and battle cancer, so I guess my reasons for becoming vegetarian are for health.  Only been at it for three weeks, but my husband (who has also joined me) and I are enjoying the food and feeling better by eating whole plant food.  Thank you for sharing why you became vegetarian - so sorry that some of the comments are not very kind.  You certainly weren't attacking anyone by stating your opinion so I don't understand where some of these nasty comments are coming from.  Good luck with your restaurant and please keep blogging.    :)",
      "parent": "0",
      "gravatar_hash": "524d4318de64add82192b0904c50ae3e"
    },
    {
      "id": "198328",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-09-29 22:21:00",
      "content": "Hi Barb - thank you so much for your note, and I'm wishing you all of the success in the world in your battle with cancer! I really hope you beat it.",
      "parent": "198275",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "199264",
      "author": "Sherri",
      "author_url": "",
      "date": "2013-10-06 10:14:58",
      "content": "I am new to Herbivoracious.  Wow, I'm looking forward to what is in store!  To find someone who thinks exactly the same as me on the subject is totally amazing.  I loved the article.",
      "parent": "0",
      "gravatar_hash": "3dd918581284e7dc7d0dba7a4a9db883"
    },
    {
      "id": "243915",
      "author": "Wil",
      "author_url": "",
      "date": "2013-11-22 17:06:22",
      "content": "Hi, Michael.  I enjoyed your article, especially the nonjudgmental statements.  I recently began eating a plant-based diet strictly for health reasons.  However, the more information I gain about the benefits of eating this way, the more committed I have become and my consciousness has been raised about the environmental issues and animal cruelty that those who are vegetarian and vegan embrace.  Giving up meat and then eggs was surprisingly easy, but I have been hesitant to give up sour cream, cottage cheese, and cheeses until most recently - but still chiefly for health reasons.  Technically this makes my diet vegan, but I do not consider myself vegan and refuse to use that term to describe my diet or lifestyle.  Why?, because I do not hold the belief that eating animal or using animal products is wrong for everyone, and I will not judge nor want to be judged because I don't embrace the montra of veganism.  I have read attacks over and over from vegans on those who eat vegan or vegetarian but don't believe vegan.  I have scoured the internet for other nouns that quickly/easily sum up this lifestyle (thus how I found your website).  A new term that describes the plant-based lifestyle but does not encompass the total philosophy needs to be embraced.  Any suggestions?",
      "parent": "0",
      "gravatar_hash": "fc0d1c3c7b4f3b7f4c507432154d8bff"
    },
    {
      "id": "243930",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-11-22 17:27:15",
      "content": "Hmm, that's a great question. I've never heard of a different term, but I like the idea!",
      "parent": "243915",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "270900",
      "author": "Denise",
      "author_url": "",
      "date": "2013-12-05 08:36:24",
      "content": "Hello,\nThank you so much for raising this issue!  Yes, this is a personal choice for me and is very important to me.  Other people make other choices and I am fine with that and accept that. I have never tried to convince anyone to become vegetarian.  The hard part for me is that people seem to go dead brained when the issue of vegetarian comes up, and say things like....can't you just take out the meat and eat the vegetables?  Noooo....if it is cooked with meat or has meat in it, no.........I won't be eating it.  I live in the south and many vegetables are cooked with bacon, ham or the fat from these..........another no...no, for me!\nI am a great cook and so is my boyfriend and we love cooking vegetarian and finding new recipes to make.  I don't miss meat at all!  I have heard things like what do you eat, with the thought process, if there isn't any meat, it isn't a meal.\nRecently, I chose not to attend our club Christmas luncheon, because it was mostly meat and a friend of mine insisted on buying me a ticket, even after I told her I wasn't attending.  Would you believe that she did this as a gift for my birthday?  Sometimes, it is frustrating, but, because this is really a spiritual issue for me, I just have to let it go and know that I am doing what feels right for me.\nThanks for the opportunity to share.\nDenise",
      "parent": "0",
      "gravatar_hash": "cddd9193e9806da6e1af0b041ad17919"
    },
    {
      "id": "653290",
      "author": "Deeli",
      "author_url": "",
      "date": "2014-01-28 12:33:36",
      "content": "Barbara, condescending remarks such as yours here to Michael is why the majority of people cringe (no matter their choice of diet) and have a difficult time taking vegans seriously. You do know that birds naturally lay eggs and that hooved animals must be milked after they give birth if their baby isn't available don't you? And what gives you the right to judge others anyway? As long as Michael or anyone else is making sure their non-vegan foods are coming from cruelty free sources there is no problem.\n\nBy the way, I'll venture to bet that you own some type of possession that includes in whole or in part some sort of leather or feather(s).",
      "parent": "2205",
      "gravatar_hash": "79183ec7ae7fa8a329ac358d7e72012a"
    },
    {
      "id": "653621",
      "author": "Bea Elliott",
      "author_url": "http://beaelliott.blogspot.com/",
      "date": "2014-01-28 16:05:08",
      "content": "Hi Deeli - I'm certain no ethical vegan would purchase anything leather or made of (slaughterhouse) feathers... If one had these in their possession, it's very likely they were purchased before the knowledge of where such items came from. That said, the chickens used today for eggs were bred to make far more eggs than what nature ever intended. These white leghorn breeds lay about one egg every 28 hours - The original species that came from the jungle lay about one a month... Also please ask yourself what happens to the \"useless\" male chicks in hatcheries to get the answer as to whether industrial eggs are ever \"humane\".\n\nAnd yes, cows must be impregnated in order to start the lactating process. This is the milk that her calf would need to grow - But it's become the milk people \"desire\" to ingest instead. There's no necessity to drink cow's milk. In dairies the babies become \"unavailable\" so that humans may satisfy this want... Please ask yourself what happens to the \"unproductive\" male babies to get the answer as to whether dairy could ever be \"humane\".\n\nSorry, but there is no way to \"own\" and \"use\" another's life and still be ethical (humane) about it.",
      "parent": "653290",
      "gravatar_hash": "9a5affbfa734997c261ac88cd19d7e15"
    },
    {
      "id": "655162",
      "author": "Natalia",
      "author_url": "",
      "date": "2014-01-29 01:50:29",
      "content": "Wow...Seriously? You do know why the baby calves aren't \"available\", don't you? \nOr why they force cows to have one calf every year to right afterwards make them \"unavailable\" to them, or don't you? \nEver had a thought for male calves? \n\nAlso, do you know what happens to male baby chicks in the breeding of egg laying hens? \n\nIn both cases both industrial and organic is the same story. \n\nI don't judge anyone and don't  go into  threads like this to attack people, make your choices, that's fine, but do not tell yourself you are helping the animals and ridding them of things that they don't need. \nThere are no cruelty free sources, only slightly less cruel ones, please do some research.",
      "parent": "653290",
      "gravatar_hash": "d665a0f3131f28b9d1a137acc77be53e"
    },
    {
      "id": "875917",
      "author": "Donna",
      "author_url": "",
      "date": "2014-04-08 11:39:59",
      "content": "Hi Michael\nI came across your website while searching out how to cook couscous! Thanks for the tips - it worked perfectly &amp; my son, Niall &amp; his university friend, David were really complimentary about it :-) This brought me back for another look &amp; I have been so encouraged by what I've found ! Like yourself, I am vegetarian - and for similar reasons. I try not to preach or make others feel guilty - but for me it's the way that feels ' right' for me! My husband eats some meat, but not a lot , as I do most of the cooking ! \nI live in County Down,  Northern Ireland - &amp; love how the internet enables me to communicate with people like yourself ! \nI've liked your page on Facebook and look forward to exploring your site and trying out your recipes - thanks for sharing them! You seem like a lovely guy Michael - live long &amp; prosper  ! God bless xxx",
      "parent": "0",
      "gravatar_hash": "4d3ef22ade93ba3a839753636f770056"
    },
    {
      "id": "879557",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-04-11 19:04:48",
      "content": "So glad it has been a hit for you!",
      "parent": "875917",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "962349",
      "author": "Briana LaVine",
      "author_url": "",
      "date": "2014-07-11 15:38:49",
      "content": "Wonderfully written, I appreciate the honesty and respect, thank you.  When you do open a restaurant I'd love to dine there!",
      "parent": "0",
      "gravatar_hash": "7a22d030168147e985a26a06eee32369"
    },
    {
      "id": "967811",
      "author": "Kari Beaver",
      "author_url": "",
      "date": "2014-07-16 22:37:01",
      "content": "I am thirteen years old and have been a vegetarian for almost a year. I cannot tell you how many times my sister asks why I am and nor can I explain my answer. Mostly because I feel like we are equals to animals and it isn't humane to eat one another. I'm not very religios but I don't think that God meant for his own creation to consume another creation. I felt your words really mean something to me as I read them and I wanted to thank you. I am the only vegetarian in my family and I want to become a vegan. I told myself that I was going to wait until college because it would be too hard for my family to adjust to my new lifestyle but the more I think about it I want to change. Your website has really helped me so thanks :)",
      "parent": "0",
      "gravatar_hash": "f33f6a30e3870796a0c5265dc3e07936"
    },
    {
      "id": "969595",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2014-07-18 08:01:53",
      "content": "Hi Kari - thanks for your note! I remember so well when I was around your age and was starting to realize my feelings on the subject, and how once I went vegetarian I never really looked back. I think everyone is different, and you don't have to explain yourself to your friends or family, although they certainly will always have lots of questions. You just have to know what is right for you.",
      "parent": "967811",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1019777",
      "author": "Michelle",
      "author_url": "",
      "date": "2014-08-13 12:05:16",
      "content": "Whole foods plant based diet. But it's not a very helpful label. Most people's eyes glaze over before you get to plant. I've eaten this way for nine years now with a couple years of eggs and goat and sheep cheeses and yogurts. Cows milk makes my stomach ache. In the last few months, I've gone back to solely plant based, and I've been really trying to attend to the whole foods part of the equation and to create meals where more than half the meal is vegetable or fruit. \n\nThat was my original goal nine years ago, to eat more fruits and vegetables because I realized I didn't eat nearly the recommended amount based on any studies or recommendations. It's been hard for me to break the habit of planning meals around protein and to plan instead around available fresh produce though I've gotten infinitely more creative. I eat a much wider variety of foods now than before. It's always funny how people ask what can you eat because they think how I eat must be more restrictive. I can eat anything. I choose to eat a vast amount of different things that grow out of the ground.\n\nI love the non-judgmental, flexible attitude of your post and so many of the comments as well as the time you take to respond. I especially appreciate your focus on food as art and on ways of working with food to make our taste buds stand up and sing. \n\nI've found it difficult to use labels, especially vegan. I wear leather. I don't research my beauty care products. While I was motivated to eat more and a wider variety of fruits and vegetables for the health benefits, I became more aware of other benefits such as those to the environment and animal welfare, thankful that I wasn't ingesting those animals standing flank to flank in great mounds of their own feces you see along Interstate 5 in California. I thought about whether I could kill an animal, and if not, whether I am comfortable eating it. I can remember being horrified as a young girl catching a fish and thinking about the hook in the roof of its mouth and its suffocation. Could I shoot an animal? If it was looking at me? Would It die quickly?\n\nIt is so much about choice and what is right for each of us. I lived in Iceland for six months. It would be difficult and perhaps not environmentally responsible to eat a plant-based diet there. They grow so few things and almost everything in green houses. In California, it's easy for me to make this choice. Thanks for the blog. I'm looking forward to making the bibimbap without the egg for dinner tonight. I'm especially eager to try your tofu preparation.",
      "parent": "0",
      "gravatar_hash": "f296030c2b1476bf31ccce88aed1c32d"
    },
    {
      "id": "1196967",
      "author": "Mark",
      "author_url": "",
      "date": "2014-12-22 12:19:10",
      "content": "Not to judge, criticize, nor even to challenge. Just some information. That's all. All facts are friendly.\nAnimal milk, and all dairy products produced from animal milk, depend upon pregnancy. Whether cow, goat, or sheep, milk production starts with calving, kidding, or lambing. For a couple of reasons, most of these offspring are destined for meat production. \n\nFirst, one half of all of these offspring are males. They cannot be employed to either replace dairy animals in a stable dairy herd, nor can they be employed to expand dairy production. Second, while the female offspring can be raised to produce milk, most will not. For stable dairy herds, only the number of offspring needed to replenish the normal annual herd mortality rate are retained. This is typically a fairly small fraction of the total of female offspring. And in expanding dairy herds, only a small number of carefully selected female offspring will be raised to adulthood. Expansions are carefully managed both in terms of number and in terms of genetics. The later often means recruiting genetic material from outside the herd's gene pool to improve genetic diversity and also to improve production.\n\nThe bottom line is that most dairy offspring will not be raised to adulthood. Most dairy herds are made up of animals that are the result of decades, if not centuries of selective breeding. While their genetics may make them excellent milk producers, they are often not suitable to be raised into adulthood for meat production. In most cases they are sold off into meat production as either veal calves, spring lambs, kids or pet food production. In some comparatively rare cases, dairy offspring are destroyed on site and disposed of. But most responsible, professionally operated dairies are built with a plan in place for selling offspring into the meat production marketplace.\n\nIn short, it is impossible to make cow's milk without making veal. Whenever we buy cow's milk, we are paying for the production of veal, whether we eat it, or not.\n\nIt is important to understand this and take this into consideration whenever you are making a decision about consuming dairy products. Where the milk comes from can have implications beyond just the treatment and husbandry of the milk producing animals. Competent, professional dairy farmers are happy to explain to anyone who asks how their dairy manages dairy offspring.",
      "parent": "0",
      "gravatar_hash": "1ffcc277ff32fb428c03d7e013cae555"
    },
    {
      "id": "1314304",
      "author": "Amber",
      "author_url": "",
      "date": "2017-05-09 12:15:46",
      "content": "I really appreciated how articulately you wrote your reasons. I'm a lifelong lacto-ovo vegetarian (now 36) raised by hippie parents. I am so grateful for being raised this way as you don't crave what you have never had. I am now raising my 2 girls to be vegetarian also. My reasons are almost identical to yours. I'm a lover of animals and know that I don't need to eat them to live a healthy life.",
      "parent": "2195",
      "gravatar_hash": "52d1d9d6061b2be38c196985d783d644"
    }
  ]
}