{
  "comment_count": 16,
  "comments": [
    {
      "id": "62062",
      "author": "CJ at Food Stories",
      "author_url": "http://www.foodstoriesblog.com",
      "date": "2012-10-12 07:29:58",
      "content": "I have the thermapen and I love it :-)",
      "parent": "0",
      "gravatar_hash": "71303ff3b22af2cbeb0fbf3610b1906d"
    },
    {
      "id": "62073",
      "author": "Jesse Black",
      "author_url": "http://www.thermoworks.com",
      "date": "2012-10-12 08:32:07",
      "content": "You say you've never had the pleasure of using a Thermapen. Let's change that! Get in touch with me and I'll send you one to demo.\n\nCheers,\n\nJesse Black\njesse@thermoworks.com\n801.756.7705",
      "parent": "0",
      "gravatar_hash": "90cca7a661d87b5e42e903c3dcba5eba"
    },
    {
      "id": "62085",
      "author": "georgia ashby",
      "author_url": "",
      "date": "2012-10-12 09:47:35",
      "content": "I have a question about your \"waiting for the temp to stabilize\" comment.  I've never been sure whether the temp that appears at first is correct, or should I continue to watch as it keeps going higher (which is usually way higher than I actually intended!).  I've never seen anything about waiting to stabilize.  (My gadget is from Polar and 10 years old.)  Thanks.",
      "parent": "0",
      "gravatar_hash": "710cdc5db9a2675c8f42608d63e3af31"
    },
    {
      "id": "62086",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-12 09:50:01",
      "content": "I'll drop you a note; looking forward to trying it.",
      "parent": "62073",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "62087",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-12 09:51:19",
      "content": "The final temperature, when it stabilizes, is the accurate temperature. So if it is way higher than you intended, it is overcooked :). Also, if you've had it for ten years and never recalibrated it, you are way overdue - check the manual (which you can probably find online) for the proper steps.",
      "parent": "62085",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "62092",
      "author": "Laura @ hip pressure cooking",
      "author_url": "http://www.hippressurecooking.com",
      "date": "2012-10-12 10:16:00",
      "content": "I have the infrared  point and shoot thermometer.  But, as you mentioned, I only use it to take surface temperatures of pans (and pressure cookers) -not particularly good with reflective materials like stainless steel.But they are handy for taking temperature of something in the oven or refrigerator.\n\nThey infrared are tons of fun when you first get them - especially for zapping you kid's foreheads floor, door, animals running across the yard....  \n\nYou get the idea.  More a toy than a tool ; )\n\nCiao,\n\nL",
      "parent": "0",
      "gravatar_hash": "bee72207ae432771c32e8a07978d1ee3"
    },
    {
      "id": "62095",
      "author": "Anna K.",
      "author_url": "",
      "date": "2012-10-12 10:47:39",
      "content": "I hope you do demo the Thermapen and let us know how it goes compared to the cheaper one. I've been wondering if it would be worth the price. \n\nI started using a thermometer for bread baking and it makes a big difference because it takes the guesswork out of knowing when bread is done. Even that tapping on the bottom trick is pretty ambiguous, not to mention that it requires turning a hot and squishy loaf of bread upside down!",
      "parent": "0",
      "gravatar_hash": "32b0b1e026ece93bbd8fba0a8abf2799"
    },
    {
      "id": "62118",
      "author": "Razzy 7",
      "author_url": "",
      "date": "2012-10-12 12:01:57",
      "content": "Good move, Jesse. You’re going to love the Thermapen, Michael.  I recently purchased a Thermapen and am loving it. Over the years I’ve purchased various thermometers that just didn’t work very well. They were slow, difficult to use and often not very accurate.  I wish I'd have just spent the money for a Thermapen and have been done with it. I've easily spent what the Thermapen costs and gotten inferior products. Thermapens are not inexpensive, but in my opinion they’re worth every penny.\n\nThermapen’s instructions are excellent and explain why Georgia, that the temperature reading doesn’t really stabilize or to use Thermapen’s terminology, “it doesn’t lock in on a reading.” Initially when you penetrate the meat on a grill, for example, the display changes rapidly at it moves from ambient temperature to the temperature of the meat. Within 3 seconds the rate of change slows dramatically giving you an accurate reading, but it will not stop changing completely. Why? Because the meat on the grill continues to cook and the Thermapen continues to detect variations in the temperature of the meat. I recognize that you’re using a different brand – I think you meant Polder rather than Polar – but I suspect it functions similarly. To answer your question, the temperature you see first is probably not accurate as it takes any thermometer some period of time (3 seconds with a Thermapen, longer for other brands) to register the actual temperature of the food being measured.  Initially the reading changes rapidly and then slows down though technically it won’t “stabilize” though it should change slowly at that point. Jesse Black, feel free to jump in if I’ve said anything that is not accurate.\n\nThe Thermapen user guide also provides clear instructions for checking the accuracy of any thermometer. These same instructions appear online here: http://www.thermoworks.com/learning/thermapen101_creating_an_icebath.html",
      "parent": "0",
      "gravatar_hash": "1208f8137b244fb0b70078499336f898"
    },
    {
      "id": "62123",
      "author": "Matt M",
      "author_url": "http://meshlabs.net",
      "date": "2012-10-12 12:28:31",
      "content": "Another vote for using infrared thermometers on pans. Especially something like a cast-iron skillet where it takes some time to warm up, you can be sure the pan is hot enough before adding your ingredients. Especially when I just moved to an apartment with an electric range, I found myself using it constantly before I had an intuition for how quickly it heated things up.",
      "parent": "62092",
      "gravatar_hash": "3a2c25fec7e9598ddc2c698f4bf60d42"
    },
    {
      "id": "64350",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-18 12:11:07",
      "content": "Jesse, I received the Thermapen and already love it. I've added a big update above. Thanks for sending it!",
      "parent": "62073",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "65395",
      "author": "Vegetarian",
      "author_url": "http://sevenpoint2.com/blog/index.php/goal-setting-as-part-of-your-alkaline-diet-plan/",
      "date": "2012-10-20 04:52:23",
      "content": "A kitchen thermometer is definitely part of my kitchen wishlist this Christmas. For after use, do you just simple wipe it dry?",
      "parent": "0",
      "gravatar_hash": "bda7603876252c69c15f63b58a0bf6f0"
    },
    {
      "id": "65433",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2012-10-20 06:53:40",
      "content": "After use you'll want to wipe it with a soapy sponge and rinse the probe in hot water, then dry. Otherwise it could accumulate bacteria that you'd be transferring from food to food.",
      "parent": "65395",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "66085",
      "author": "Nell",
      "author_url": "",
      "date": "2012-10-21 10:23:57",
      "content": "@Vegetarian:  My most frequent use for a Thermapen is checking the internal temperature of roasting meats.  After those uses I wipe dry, then wipe with a paper towel dipped in rubbing alcohol, to sterilize.",
      "parent": "0",
      "gravatar_hash": "f1f95927894a8c69a57324136e79e2b0"
    },
    {
      "id": "124151",
      "author": "Maartje",
      "author_url": "",
      "date": "2013-03-05 05:47:11",
      "content": "I used to have a cheap, battery-operated kitchen thermometer, but it tilts if used on an induction stove. Does anyone know if a Thermopen works (for instance for measuring the temp of oil or caramel) on an induction stove?",
      "parent": "0",
      "gravatar_hash": "52ff19eb3b034548a202c2788c525dec"
    },
    {
      "id": "126520",
      "author": "Finy Agam",
      "author_url": "http://www.mgprojekt.com.pl",
      "date": "2013-03-13 05:28:53",
      "content": "Cool device pity that I can't test it first.",
      "parent": "0",
      "gravatar_hash": "ee35c52a3c4915188f1f8044692aba4f"
    },
    {
      "id": "176842",
      "author": "Kevin Smith",
      "author_url": "http://www.fairfieldcountyjobs.com",
      "date": "2013-07-22 10:38:29",
      "content": "Never thought of buying one until now but it seems like a good option!",
      "parent": "0",
      "gravatar_hash": "89fd5718c9acdf8fd83b4eb0284d6c61"
    }
  ]
}