{
  "comment_count": 6,
  "comments": [
    {
      "id": "149",
      "author": "Nicole Navratil",
      "author_url": "http://www.pepperoniisnotavegetable.com",
      "date": "2011-09-14 12:02:19",
      "content": "Michael, this is fantastic. One of the wonderful things about vegetarian cooking is the beauty of the ingredients. What a great post for Wordless Wednesday!",
      "parent": "0",
      "gravatar_hash": "2a2c279fe4318c754fdfd97d6026172b"
    },
    {
      "id": "150",
      "author": "Chris",
      "author_url": "",
      "date": "2011-09-14 13:05:45",
      "content": "Looks like a delicious copia tomato (my fav variety lately).  Wishing I had planted one this year, but the couple dozen pounds of little pea and cherry sized ones I got instead are a nice consolation prize.",
      "parent": "0",
      "gravatar_hash": "471243e2f99c010d7c5d5a2e8b4195b8"
    },
    {
      "id": "151",
      "author": "John",
      "author_url": "",
      "date": "2011-09-15 06:27:46",
      "content": "V. nice. A beautiful tomato to look at. Is the flavor equally good? We had our 'tomato taste-off' last night, where we evaluated several of the varieties we grew this year, plus a couple of others from a local farmstand, to try to decide what to plant NEXT year. The only clear winner was \"Sun Gold\" cherry tomatoes, which are relatively early, incredibly abundant, and delicious all the way from their yellow phase (SLIGHTLY tart) to their solidly-orange (rich and very sweet) phase.\n\nThis seems like as good a time as any to mention the great combination of (a) cooking your vegetarian recipes, and (b) getting many of the ingredients from my garden. There's something incredibly satisfying about saying \"Hey...the chard's looking good. Let's do the Chard and Polenta thing!\" or \"We've got both Okra AND a bunch of eggplants that aren't going to have time to get big before the weather gets cold...let's try the Okra and Eggpland in Lime/Tamarind sauce.\" Of course, it goes both ways -- your recipe for black beans is what caused me to start planting Epazote, which I'll never have to plant again, because it's an aggressive self-seeder.",
      "parent": "0",
      "gravatar_hash": "80f61b8a19222d2053c8acdaa18456c8"
    },
    {
      "id": "152",
      "author": "Niki of SI",
      "author_url": "http://www.spilledingredients.com",
      "date": "2011-09-15 09:48:35",
      "content": "I'm so excited to finally have beauties like this in the garden! Yes, no words required.",
      "parent": "0",
      "gravatar_hash": "29ee6e796c3ec51bb85b75ed33224f88"
    },
    {
      "id": "153",
      "author": "Smriti Isaac",
      "author_url": "http://profile.typepad.com/smritiisaac",
      "date": "2011-09-15 14:34:38",
      "content": "Absolutely gorgeous tomato photos! Bravo!\n\nAllow me to share my own bounty of tomatoes from last week:  <a href=\"http://showsdisaac.posterous.com/a-birthday-bonanza-from-my-veggie-garden\" rel=\"nofollow\">http://showsdisaac.posterous.com/a-birthday-bonanza-from-my-veggie-garden</a>",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "154",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2011-09-17 17:51:35",
      "content": "Yeah man, the end of summer is the best time of year to be a vegetarian! I think those tomatoes were &quot;Vintage Wine&quot;, and yes quite delicious. From my farmer&#39;s market. I wish I was a gardener like you, I just don&#39;t have the gene.",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    }
  ]
}