{
  "comment_count": 15,
  "comments": [
    {
      "id": "1004",
      "author": "Ada",
      "author_url": "http://www.landlordfireaware.org.uk/",
      "date": "2010-07-13 18:10:44",
      "content": "I actually had no idea that you could eat the blossoms. My zuchs are running everything else out of my garden so this will keep them under control as well.",
      "parent": "0",
      "gravatar_hash": "27af8825cb2523523d7a031e5b32db8b"
    },
    {
      "id": "1005",
      "author": "Emily",
      "author_url": "http://www.tofuhunter.com",
      "date": "2010-07-14 08:40:25",
      "content": "It's been a while since I've stopped by, just wanted to tell you what a fabulous blog you have! Good stuff! THanks!",
      "parent": "0",
      "gravatar_hash": "7de9ef8ce3836f30df2ce16ba0d3a827"
    },
    {
      "id": "1006",
      "author": "Natalie",
      "author_url": "http://www.cakedecorating-books.com/",
      "date": "2010-07-14 21:53:44",
      "content": "I have eaten zucchini flowers at restaurants but have never made them myself. I love the way they look. I am going to give these a try.  Thanks for the recipe.",
      "parent": "0",
      "gravatar_hash": "925e1e713bebd3c6ade172420df415d5"
    },
    {
      "id": "1007",
      "author": "Christine",
      "author_url": "http://colormepink.com",
      "date": "2010-07-15 06:19:11",
      "content": "Gorgeous!  I can't find them where I live - although I suppose if grew zucchini myself---- nah, that's not going to happen.  I'll just covet yours.",
      "parent": "0",
      "gravatar_hash": "4b7f675dd5f925182009acb57f182d08"
    },
    {
      "id": "1008",
      "author": "Annalisa",
      "author_url": "",
      "date": "2010-07-15 10:46:44",
      "content": "I've got to try this one... this will be a good appetizer for my anti-vegetarian friends.  The cheese and the light frying will make them forget they 'don't like vegetarian' dishes.  That, and the fact the I don't call nething I make 'vegetarian'!  Beautiful photo as usual.  Love your blog!!!",
      "parent": "0",
      "gravatar_hash": "f3ae3e086c1e94791f0251e3ba970aa4"
    },
    {
      "id": "1009",
      "author": "Diana @ frontyardfoodie",
      "author_url": "http://frontyardfoodie.com",
      "date": "2010-07-17 13:30:38",
      "content": "Mmm I have so many squash blossoms right now. It's really incredible how many blossoms those plants produce. I should make this!",
      "parent": "0",
      "gravatar_hash": "d637c04fa62080412fba51b62455918a"
    },
    {
      "id": "1010",
      "author": "Ben",
      "author_url": "http://profile.typepad.com/ben36",
      "date": "2010-07-18 14:18:51",
      "content": "What a great idea. Ours, too are out of control, so hopefully this will help. I did not discriminate between the male or female blossoms. Having it with a light lemon-basil quinoa salad.",
      "parent": "0",
      "gravatar_hash": ""
    },
    {
      "id": "1011",
      "author": "sara",
      "author_url": "http://www.momentsofelegance.com",
      "date": "2010-07-18 18:25:45",
      "content": "I am in rapture I adore Zucchini and the blossoms are so delicate to eat them would be a delight.\n\nSara\n<a href=\"http://www.momentsofelegance.com\" rel=\"nofollow\">http://www.momentsofelegance.com</a>",
      "parent": "0",
      "gravatar_hash": "6b7b19eda141d28af5b12951a44d28e2"
    },
    {
      "id": "1012",
      "author": "hintofsaffron",
      "author_url": "http://www.hintofsaffron.com",
      "date": "2010-08-12 16:37:52",
      "content": "Zucchini blossoms! Never heard of it until today. I have never seen these at Farmer's market in Seattle since I never knew about them. I am going to look for these at the University Farmer's market. If not found, where else do you think I can find them? The recipe looks tasty. A few weeks ago, I made zucchini fritters from zucchinis I got from the farmer's market. I like Chevre cheese. So I might try this recipe.\n\nI cook mostly vegetarian Indian food that is not available in Indian restaurants and post the recipes and am always looking to get new ideas. Your blog is interesting and has lot of info on vegetarian food.",
      "parent": "0",
      "gravatar_hash": "938f2d681d5ada1af88929ec8969b1ec"
    },
    {
      "id": "1013",
      "author": "Michael Natkin",
      "author_url": "",
      "date": "2010-08-12 19:52:03",
      "content": "@hint - The Alvarez Farm&#39;s booth will still have them, and maybe one or two others as well. I think it is just one of those things you don&#39;t notice because you aren&#39;t expecting them. Your blog look&#39;s great, I&#39;m jealous of your recent Vij&#39;s trip :)",
      "parent": "0",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "1014",
      "author": "Liz H",
      "author_url": "http://www.indiatree.com",
      "date": "2010-09-13 09:21:06",
      "content": "These were fabulous! Alvarez still has the blossoms, even in September, and while I was at the Market I heard Beecher's chevre calling my name from across the street. Match made in foodie heaven. It was much simpler than expected, too. The sauteed onion and zucchini caramelized beautifully and I just carefully stuffed it into the blossoms with a knife. I'd never made a tempura but the batter was quick and I came out of the deep frying process without injury. The results...delicious. The blossoms were so tender, the filling so creamy and savory.\n\nThank you for the perfect, elegant  appetizer for my veggie guests this weekend.",
      "parent": "0",
      "gravatar_hash": "be07ba9a8038225b909babaed3063bbe"
    },
    {
      "id": "126290",
      "author": "zerrin",
      "author_url": "http://www.giverecipe.com",
      "date": "2013-03-12 11:18:30",
      "content": "Michael, this sounds like a great appetizer! We generally stuff them with a rice mixture here in Turkey. Cheese mixture sounds so intriguing to me, will definitely give it a try when its season comes!",
      "parent": "0",
      "gravatar_hash": "eed46d95dbe550b06a386c72c3242ebc"
    },
    {
      "id": "126304",
      "author": "Michael Natkin",
      "author_url": "https://herbivoracious.com",
      "date": "2013-03-12 11:55:31",
      "content": "Oooh, what else goes in the rice mixture?",
      "parent": "126290",
      "gravatar_hash": "a52f8f9146768ce0dc36a285e4c4d38d"
    },
    {
      "id": "126313",
      "author": "zerrin",
      "author_url": "http://www.giverecipe.com",
      "date": "2013-03-12 12:46:53",
      "content": "We use almost the same rice mixture any vegetable we stuff. Do you remember my cabbage rolls, which you mentioned in one of your posts: https://herbivoracious.com/2012/01/kasha-pilaf-with-dates-pistachios-and-baharat-recipe.html ? \nThe rolls were stuffed with that mixture; rice, chopped onion, pepper paste, olive oil, chopped parsley, garlic, tomato, ground black pepper, dried mint, thyme. In some regions, tomato and pepper paste are left out.",
      "parent": "126304",
      "gravatar_hash": "eed46d95dbe550b06a386c72c3242ebc"
    },
    {
      "id": "479600",
      "author": "Persnickety",
      "author_url": "http://persnicketypanhandler.blogspot.com/",
      "date": "2014-01-04 13:54:38",
      "content": "A great recipe I can't wait to try out. I love Zucchini and those adventurous enough to use it! I wish more would.\n\nI came up with my own version of a Stuffed Zucchini with an Arab twist. While different from your own, I think its a unique take on the dish. I'm new to the Food Blog scene and would love some feedback from a pro like you. Check out my recipe if have time.\n\nhttp://persnicketypanhandler.blogspot.com/2012/09/kousa-sahel.html",
      "parent": "0",
      "gravatar_hash": "43edddf363a30b9779e37cdd0c515af1"
    }
  ]
}